J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
<?xml version="1.0" encoding="utf-8"?>
<device xmlns:xsi="http://www.w3.org/2001/XMLSchema" schemaVersion="0">
	<vendor>Infineon</vendor>
	<vendorID>IFX</vendorID>
	<name>TC37XPD</name>
	<series>ATVMC</series>
	<version>100</version>
	<description>Default</description>
	<licenseText>
			*****************************************************************************
			*
			* Copyright (C) 2024 Infineon Technologies AG. All rights reserved.
			*
			* Infineon Technologies AG (Infineon) is supplying this software for use with
			* Infineon's microcontrollers. This file can be freely distributed within
			* development tools that are supporting such microcontrollers.
			*
			* THIS SOFTWARE IS PROVIDED "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED
			* OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
			* MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
			* INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
			* OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
			*
			******************************************************************************
	</licenseText>
	<cpu>
		<name>other</name>
		<revision>r0p0</revision>
		<endian>little</endian>
		<mpuPresent>true</mpuPresent>
		<fpuPresent>true</fpuPresent>
		<!--NvicPrioBits does not matter for AURIX because we use a different controller.-->
		<nvicPrioBits>4</nvicPrioBits>
		<vendorSystickConfig>true</vendorSystickConfig>
	</cpu>
	<addressUnitBits>8</addressUnitBits>
	<width>8</width>
	<peripherals>
		<peripheral>
			<name>SBCU</name>
			<version>100</version>
			<description>FPI Bus Control Unit</description>
			<baseAddress>4026728448</baseAddress>
			<addressBlock>
				<offset>8</offset>
				<size>248</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>ID</name>
					<description>Module Identification Register
 resetvalue={Application Reset:0x6A00}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>27136</resetValue>
					<resetMask>4294967040</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision Number   MOD REV. This bit field defines the module revision number. The value of a module revision starts with 01H  first revision .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number Value   MOD NUMBER. This bit field defines a module identification number. The value for the LBCU module is 006AH.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CON</name>
					<description>BCU Control Register
 resetvalue={Application Reset:0x0FF09FFFF}</description>
					<addressOffset>16</addressOffset>
					<size>32</size>
					<resetValue>4278845439</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TOUT</name>
							<description>BCU Bus Time Out Value. The bit field determines the number of System Peripheral Bus time out        cycles. Default after reset is FFFF H    65536 bus cycles . TOUT value must be  gt   5.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DBG</name>
							<description>BCU Debug Trace Enable. The bit enables disables the error capture mechanism for the registers        BCU ECON  BCU EADD  BCU EDAT. The bit does not affect the SMU alarm or the BCU interrupt that are send        on detection case of an error condition.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SPC</name>
							<description>Starvation Period Control. Determines the sample period for the starvation counter. Must be larger        than the number of masters. The reset value is FF H .</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRIOH</name>
					<description>Arbiter Priority Register High
 resetvalue={Application Reset:0x0FEDCBA98,Application Reset:0x0FEDC8888,Application Reset:0x0FEDCBA98}</description>
					<addressOffset>20</addressOffset>
					<size>32</size>
					<resetValue>4275865736</resetValue>
					<resetMask>4294954479</resetMask>
					<fields>
						<field>
							<name>CPU2</name>
							<description>CPU2 Priority  Index 8 . This bit field defines the priority on the SPB for CPU2 access to the        SPB.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HSMRMI</name>
							<description>HSMRMI Priority  Index 12 . This bit field defines the priority on the SPB for HSMRMI access to the        SPB.</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HSMCMI</name>
							<description>HSMCMI Priority  Index 13 . This bit field defines the priority on the SPB for HSMCMI access to the        SPB.</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRIOL</name>
					<description>Arbiter Priority Register Low
 resetvalue={Application Reset:0x76543210,Application Reset:0x088543210,Application Reset:0x76588210}</description>
					<addressOffset>24</addressOffset>
					<size>32</size>
					<resetValue>5243408</resetValue>
					<resetMask>32722943</resetMask>
					<fields>
						<field>
							<name>DMA</name>
							<description>DMA   Cerberus Priority  Index 0 . This bit field defines the priority on the SPB for DMA and Cerberus        access to the SPB.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HSSL0</name>
							<description>HSSL0 Priority  Index 3 . This bit field defines the priority on the SPB for HSSL0 access to the        SPB.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU0</name>
							<description>CPU0 Priority  Index 6 . This bit field defines the priority on the SPB for CPU0 access to the        SPB. Position   180 6  180  of the Req Lock Grant BCU input vector set is used in the          EDC implementation for Req Lock error injection. Therefore this          position shall be used for a CPU.</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU1</name>
							<description>CPU1 Priority  Index 7 . This bit field defines the priority on the SPB for CPU1 access to the        SPB. This bit field contains the master priority for master connected to BCU        request input 7.</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ECON</name>
					<description>BCU Error Control Capture Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>32</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ERRCNT</name>
							<description>FPI Bus Error Counter. ERRCNT is incremented on every occurrence of an FPI  160 Bus error. ERRCNT is        reset to 0 after the ECON register is read. Aborted        accesses to a 0 wait state SPB slave may also increment ERRCNT when the        slave generates an error acknowledge.</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TOUT</name>
							<description>State of FPI Bus Time Out Signal. This bit indicates the state of the time out signal at an FBI  160 Bus error.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RDY</name>
							<description>State of FPI Bus Ready Signal. This bit indicates the state of the ready signal at an FBI  160 Bus error.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ABT</name>
							<description>State of FPI Bus Abort Signal. This bit indicates the state of the abort signal at an FBI  160 Bus error.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ACK</name>
							<description>State of FPI Bus Acknowledge Signals. This bit field indicates the acknowledge code that has been output by        the selected slave at an FPI  160 Bus error. Coding see CROSSREFERENCE .</description>
							<lsb>17</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SVM</name>
							<description>State of FPI Bus Supervisor Mode Signal. This bit indicates whether the FPI  160 Bus error occurred in Supervisor Mode        or in User Mode.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WRN</name>
							<description>State of FPI Bus Write Signal. This bit indicates whether the FPI  160 Bus error occurred at a write cycle         see CROSSREFERENCE  .</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RDN</name>
							<description>State of FPI Bus Read Signal. This bit indicates whether the FPI  160 Bus error occurred at a read cycle         see CROSSREFERENCE  .</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TAG</name>
							<description>FPI Bus Master Tag Number Signals. This bit field indicates the FPI  160 Bus master TAG number  definitions see CROSSREFERENCE  .</description>
							<lsb>22</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OPC</name>
							<description>FPI Bus Operation Code Signals. The FPI  160 Bus operation codes are defined in CROSSREFERENCE .</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EADD</name>
					<description>BCU Error Address Capture Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>36</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FPIADR</name>
							<description>Captured FPI Bus Address   FPIADR. This bit field holds the 32 bit FPI Bus address that has been captured at an FPI Bus error. Note that if multiple bus errors occurred  only the address of the first bus error is captured.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EDAT</name>
					<description>BCU Error Data Capture Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>40</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FPIDAT</name>
							<description>Captured FPI Bus Data   FPIDAT. This bit field holds the 32 bit FPI Bus data that has been captured at an FPI Bus error. Note that if multiple bus errors occurred  only the data of the first bus error is captured. No data are captured from transactions generated by the SHE module.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DBCNTL</name>
					<description>BCU Debug Control Register
 resetvalue={Debug Reset:0x7003}</description>
					<addressOffset>48</addressOffset>
					<size>32</size>
					<resetValue>28675</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EO</name>
							<description>Status of BCU Debug Support Enable. This bit is controlled by the Cerberus and enables the BCU debug support.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OA</name>
							<description>Status of BCU Breakpoint Logic. The OA bit is set by writing a 1 to bit RA. When OA is set  registers        DBGNTT  DBADRT and DBDAT are reset. Also DBBOST is reset with the        exception of the bit field FPIRST.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RA</name>
							<description>Rearm BCU Breakpoint Logic. Writing a 1 to this bit rearms BCU breakpoint logic and sets bit OA  160    160 1.        RA is always reads as 0.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>HSMTRTREN</name>
							<description>Status of HSM Transaction Trace Logic</description>
							<lsb>5</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSMDBGEN</name>
							<description>Status of HSM Debug Mode</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CONCOM0</name>
							<description>Grant and Address Trigger Relation</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CONCOM1</name>
							<description>Address 1 and Address 2 Trigger Relation</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CONCOM2</name>
							<description>Address and Signal Trigger Relation</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ONG</name>
							<description>Grant Trigger Enable</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ONA1</name>
							<description>Address 1 Trigger Control. See also CROSSREFERENCE .</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ONA2</name>
							<description>Address 2 Trigger Control. See also CROSSREFERENCE .</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ONBOS0</name>
							<description>Op code Signal Status Trigger Condition</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ONBOS1</name>
							<description>Supervisor Mode Signal Trigger Condition</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ONBOS2</name>
							<description>Write Signal Trigger Condition</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ONBOS3</name>
							<description>Read Signal Trigger Condition</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DBGRNT</name>
					<description>SBCU Debug Grant Mask Register
 resetvalue={Debug Reset:0x0FFFF}</description>
					<addressOffset>52</addressOffset>
					<size>32</size>
					<resetValue>65535</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DMA</name>
							<description>DMA   Cerberus Trigger Enable. TC39xA  DMAH</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HSSL0</name>
							<description>HSSL0 Trigger Enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU0</name>
							<description>CPU0 Grant Trigger Enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU1</name>
							<description>CPU1 Grant Trigger Enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU2</name>
							<description>CPU2 Grant Trigger Enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HSMRMI</name>
							<description>HSM Register Master Interface Grant Trigger Enable</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HSMCMI</name>
							<description>HSM Cache Master Interface Grant Trigger Enable</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DBADR1</name>
					<description>BCU Debug Address 1 Register
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>56</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADR1</name>
							<description>Debug Trigger Address 1. This register contains the address for the address 1 trigger event        generation.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DBADR2</name>
					<description>BCU Debug Address 2 Register
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>60</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADR2</name>
							<description>Debug Trigger Address 2. This register contains the address for the address 2 trigger event        generation.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DBBOS</name>
					<description>BCU Debug Bus Operation Signals Register
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>64</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>OPC</name>
							<description>Opcode for Signal Status Debug Trigger. This bit field determines the type  opcode  of an FPI  160 Bus transaction        for which a signal status debug trigger event is generated  if enabled        by DBCNTL.ONBOS0  160    160 1 . Other bit combinations are reserved.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SVM</name>
							<description>SVM Signal for Status Debug Trigger. This bit determines the mode of an FPI  160 Bus transaction for which a        signal status debug trigger event is generated  if enabled by        DBCNTL.ONBOS1  160    160 1 .</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WR</name>
							<description>Write Signal for Status Debug Trigger. This bit determines the state of the WR signal of an FPI  160 Bus transaction for which a signal status debug trigger        event is generated  if enabled by DBCNTL.ONBOS2  160    160 1 .</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RD</name>
							<description>Write Signal for Status Debug Trigger. This bit determines the state of the RD signal of an FPI  160 Bus transaction for which a signal status debug trigger        event is generated  if enabled by DBCNTL.ONBOS3  160    160 1 .</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DBGNTT</name>
					<description>SBCU Debug Trapped Master Register
 resetvalue={Debug Reset:0x0FFFF}</description>
					<addressOffset>68</addressOffset>
					<size>32</size>
					<resetValue>65535</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DMA</name>
							<description>DMA   Cerberus FPI Bus Master Status. This bit indicates whether the DMA or Cerberus was FPI  160 Bus master when        the break trigger event occurred.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSSL0</name>
							<description>HSSL 0 FPI Bus Master Status. This bit indicates whether the HSSL 0 was FPI  160 Bus master when the break        trigger event occurred.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU0</name>
							<description>CPU0 FPI Bus Master Status. This bit indicates whether the CPU0 was FPI  160 Bus master when the break        trigger event occurred. Position   180 6  180  of the Req Lock Grant BCU input vector set is used in the          EDC implementation for Req Lock error injection. Therefore this          position shall be used on the SPB for CPU  on BBB for the Bridge           SRI2BBB .</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1</name>
							<description>CPU1 FPI Bus Master Status. This bit indicates whether the CPU1 was FPI  160 Bus master when the break        trigger event occurred.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2</name>
							<description>CPU2 Grant Trigger Enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSMRMI</name>
							<description>HSM Register FPI Bus Master Interface Status. This bit indicates whether the HSM was FPI  160 Bus master when the break        trigger event occurred.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSMCMI</name>
							<description>HSM Cache FPI Bus Master Interface Status. This bit indicates whether the HSM was FPI  160 Bus master when the break        trigger event occurred.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DBADRT</name>
					<description>BCU Debug Trapped Address Register
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>72</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FPIADR</name>
							<description>FPI Bus Address Status. This register contains the FPI  160 Bus address that was captured when the        OCDS break trigger event occurred.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
