J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>DBBOST</name>
					<description>BCU Debug Trapped Bus Operation Signals Register
 resetvalue={Debug Reset:0x3180}</description>
					<addressOffset>76</addressOffset>
					<size>32</size>
					<resetValue>12672</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FPIOPC</name>
							<description>FPI Bus Opcode Status. This bit field indicates the type  opcode  of the FPI  160 Bus transaction        captured from the FPI  160 Bus signal lines when the BCU break trigger event        occurred. Other bit combinations are reserved.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FPISVM</name>
							<description>FPI Bus Supervisor Mode Status. This bit indicates the state of the Supervisor Mode signal captured from        the FPI  160 Bus signal lines when the BCU break trigger event occurred.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FPIACK</name>
							<description>FPI Bus Acknowledge Status. This bit field indicates the acknowledge signal status captured from the        FPI  160 Bus signal lines when the BCU break trigger event occurred. Coding        see CROSSREFERENCE .</description>
							<lsb>5</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FPIRDY</name>
							<description>FPI Bus Ready Status. This bit indicates the ready signal status captured from the FPI  160 Bus        signal lines when the BCU break trigger event occurred.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FPIWR</name>
							<description>FPI Bus Write Indication Status. This bit indicates the write signal status captured from the FPI  160 Bus        signal lines when the BCU break trigger event occurred.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FPIRST</name>
							<description>FPI Bus Reset Status. This bit field indicates the reset signal status captured from the        FPI  160 Bus signal lines when the BCU break trigger event occurred. Others  160   160   160   160   160 Reserved</description>
							<lsb>9</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FPIOPS</name>
							<description>FPI Bus OCDS Suspend Status. This bit indicates the OCDS suspend signal status captured from the        FPI  160 Bus signal lines when the BCU break trigger event occurred.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FPIRD</name>
							<description>FPI Bus Read Indication Status. This bit indicates the read signal status captured from the FPI  160 Bus        signal lines when the BCU break trigger event occurred.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FPIABORT</name>
							<description>FPI Bus Abort Status. This bit indicates the abort signal status captured from the FPI  160 Bus        signal lines when the BCU break trigger event occurred.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FPITOUT</name>
							<description>FPI Bus Time out Status. This bit indicates the time out signal status captured from the FPI  160 Bus        signal lines when the BCU break trigger event occurred.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ENDINIT</name>
							<description>FPI Bus Endinit Status. This bit indicates the ENDINIT signal status captured from the FPI  160 Bus        signal lines when the BCU break trigger event occurred.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FPITAG</name>
							<description>FPI Bus Master TAG Status. This bit field indicates the master TAG captured from the FPI  160 Bus signal        lines when the BCU break trigger event occurred  see CROSSREFERENCE  .        The master TAG identifies the master of the transfer which generated BCU        break trigger event.</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DBDAT</name>
					<description>BCU Debug Data Status Register
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>80</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FPIDATA</name>
							<description>FPI Bus Data Status. This register contains the FPI  160 Bus data that was captured when the OCDS        break trigger event occurred.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>4</dimIncrement>
					<name>ALSTATx[%s]</name>
					<description>BCU EDC Alarm Status Register 0
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>96</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>AL0</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL1</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL2</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL3</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL4</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL5</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL6</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL7</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL8</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL9</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL10</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL11</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL12</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL13</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL14</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL15</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL16</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL17</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL18</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL19</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL20</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL21</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL22</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL23</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL24</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL25</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL26</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL27</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL28</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL29</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL30</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL31</name>
							<description>Alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
