J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<dim>4</dim>
					<dimIncrement>4</dimIncrement>
					<name>ALCLRx[%s]</name>
					<description>BCU EDC Alarm Clear Register 0
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>112</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CLR00</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR01</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR02</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR03</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR04</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR05</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR06</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR07</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR08</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR09</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR10</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR11</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR12</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR13</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR14</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR15</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR16</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR17</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR18</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR19</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR20</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR21</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR22</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR23</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR24</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR25</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR26</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR27</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR28</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR29</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR30</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR31</name>
							<description>Clear alarm 31. The Alarm bit shows if an EDC error was detected in an active phase of        the related FPI Slave   Master interface.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ALCTRL</name>
					<description>BCU EDC Alarm Control Register
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>128</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ALOV</name>
							<description>Alarm Overflow. The ALOV bit is set if multiple FPI EDC alarms for the same FPI slave or        the same FPI master were detected while the related ALSTATx y  bit was        still set. Some errors result in a static fault situation  for example address          phase  data phase or data enable signal faults. Static faults do not          generate multiple alarms and will will not set the ALOV bit.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ALOVCLR</name>
							<description>Alarm Overflow Clear. The ALOVCLR bit is required to reset the ALOV bit.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FEGEN</name>
					<description>FPI Error Generation Control Register
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>132</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SEDM</name>
							<description>SEDM  Slave Encoder . The errors are injected in the FPI EDC encoders related to the BCU  SPB . Other bit combinations are reserved and do not inject errors.</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MEDM</name>
							<description>MEDM  Master Encoder  Type of Error. The errors are injected in the FPI EDC encoders related to CPU0  SPB . Other bit combinations are reserved and do not inject errors.</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN</name>
							<description>Enable Signal Type of Error. The enable signals errors are injected by inverting the signal. For each        group of enable signals that is checked   gt  1 signal active   error  the        enable signal related to BCU   CPU0 is inverted. Other bit combinations are reserved and do not inject errors.</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BCU</name>
							<description>BCU Type of Error. Other bit combinations are reserved and do not inject errors.</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ACCEN0</name>
					<description>Access Enable Register 0
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
					<addressOffset>252</addressOffset>
					<size>32</size>
					<resetValue>4294967295</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EN0</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN1</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN2</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN3</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN4</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN5</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN6</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN7</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN8</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN9</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN10</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN11</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN12</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN13</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN14</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN15</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN16</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN17</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN18</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN19</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN20</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN21</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN22</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN23</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN24</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN25</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN26</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN27</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN28</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN29</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN30</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN31</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
