J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>FCE</name>
			<version>100</version>
			<description>FCE</description>
			<baseAddress>4026531840</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>512</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<cluster>
					<dim>8</dim>
					<dimIncrement>32</dimIncrement>
					<name>IN[%s]</name>
					<description>IN</description>
					<addressOffset>256</addressOffset>
					<register>
						<name>IRi</name>
						<description>Input Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>IR</name>
								<description>Input Register   IR. This bit field holds the input data to be computed. In case the channel        is configured to use 16 bit or 8 bit CRC  only the LSB 16 or 8 bits will        be used as input.</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>RESi</name>
						<description>CRC Result Register 0
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>4294967295</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RES</name>
								<description>Result Register   RES. Returns the final CRC value including CRC reflection and final XOR according to the CFG register configuration. Writing to this register produces a bus error. If the channel is configured to use 16 bit or 8 bit CRC  the MSB 16 or 24 bits respectively shall be read as 0.</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CFGi</name>
						<description>CRC Configuration Register 0
 resetvalue={Application Reset:0x700}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>1792</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CMI</name>
								<description>CRC Mismatch Interrupt   CMI</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEI</name>
								<description>Configuration Error Interrupt   CEI. When enabled  a Configuration Error Interrupt is generated whenever a mismatch is detected in the CFG and CHECK redundant registers.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>LEI</name>
								<description>Length Error Interrupt   LEI. When enabled  a Length Error Interrupt is generated if software writes to IR register with LENGTH equal to 0 and CFG.CCE is set to 1.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BEI</name>
								<description>Bus Error Interrupt   BEI. When enabled  an interrupt  BEF  is generated if a bus write transaction        with an access width smaller than the kernel width is issued to the        input register. In this case  the corresponding value written to the IR        is discarded and no CRC computation takes place.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CCE</name>
								<description>CRC Check Comparison   CCE</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ALR</name>
								<description>Automatic Length Reload   ALR</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REFIN</name>
								<description>IR Byte Wise Reflection   REFIN</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REFOUT</name>
								<description>CRC Bit Wise Reflection   REFOUT. The alignment of the reflection is the same as the kernel polynomial        width. Eg. 32 bit kernel  Bitwise reflection by 32 bits.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>XSEL</name>
								<description>Selects the value to be xored with the final CRC   XSEL</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BYTESWAP</name>
								<description>Swaps the order of the bytes in the IR input register.   BYTESWAP</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>KERNEL</name>
								<description>Selects the CRC Kernel  Polynomial Engine  used by this channel.   KERNEL. Other possible values are reserved for additional kernels that may be added in the future. If these values are used  then KERNEL3 is used by default.</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>STSi</name>
						<description>CRC Status Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>12</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CMF</name>
								<description>CRC Mismatch Flag   CMF. This bit is set per hardware only. To clear this bit  software must write a 0 to this bit field location. Writing 1 to this bit has no effect.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEF</name>
								<description>Configuration Error Flag   CEF. This bit is set per hardware only. To clear this bit  software must write a 0 to this bit field location. Writing a 1 has no effect.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>LEF</name>
								<description>Length Error Flag   LEF. This bit is set per hardware only. To clear this bit  software must write a 0 to this bit field location. Writing 1 has no effect.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BEF</name>
								<description>Bus Error Flag   BEF. This bit is set per hardware only. To clear this bit  software must write a 0 to this bit field location. Writing 1 has no effect.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>LENGTHi</name>
						<description>CRC Length Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>16</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>LENGTH</name>
								<description>Message Length Register   LENGTH. Number of words  bit width of each word in terms of KERNEL polynomial width  building the message over which the CRC checksum is calculated. This bit field is modified by the hardware  every write to the IR register decrements the value of the LENGTH bit field. If the CFG.ALR field is set to 1  the LENGTH field shall be reloaded with its configuration value at the end of the cycle where LENGTH reaches 0.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CHECKi</name>
						<description>CRC Check Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>20</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CHECK</name>
								<description>CHECK Register   CHECK. Expected CRC value to be checked by the hardware upon detection of a 1 to 0 transition of the LENGTH register. The comparison is enabled by the CFG.CCE bit field</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CRCi</name>
						<description>CRC Regsister 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>24</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CRC</name>
								<description>CRC Register   CRC. This register enables to directly access the internal CRC register</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CTRi</name>
						<description>CRC Test Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>28</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>FCM</name>
								<description>Force CRC Mismatch   FCM. Forces the CRC compare logic to issue an error regardless of the CHECK and CRC values. The hardware detects a 0 to 1 transition of this bit field and triggers a CRC Mismatch interrupt</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FRM_CFG</name>
								<description>Force CFG Register Mismatch   FRM CFG. This field is used to control the error injection mechanism used to check the compare logic of the redundant CFG registers. This is a one shot operation. When the hardware detects a 0 to 1 transition of this bit field it triggers a Configuration Mismatch interrupt  if enabled by the corresponding CFGm register .</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FRM_CHECK</name>
								<description>Force Check Register Mismatch   FRM CHECK. This field is used to control the error injection mechanism used to check the compare logic of the redundant CHECK registers. This is a one shot operation. The hardware detects a 0 to 1 transition of this bit field and triggers a Check Register Mismatch interrupt  if enabled by the corresponding CFGm register .</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
				<register>
					<name>CLC</name>
					<description>Clock Control Register
 resetvalue={Application Reset:0x3}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>3</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit   DISR. Used for enable disable control of the module.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit   DISS. Bit indicates the current status of the module.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Module Identification Register
 resetvalue={Application Reset:0x0CAC003}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>13287427</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision Number   MOD REV. This bit field defines the module revision number. The value of a module revision starts with 01H  first revision . The current revision number is 03H.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type   MOD TYPE. The bit field is set to C0H which defines the module as a 32 bit module.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number Value   MOD NUMBER. This bit field defines a module identification number. The value for the FCE module is 00CA H .</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CHSTS</name>
					<description>Channels Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>32</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CH0</name>
							<description>Channel0 Status   CH0. This bit is the result of an OR operation of the various status bits of channel 0  see STS register .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH1</name>
							<description>Channel1 Status   CH1. This bit is the result of an OR operation of the various status bits of channel 1  see STS register .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH2</name>
							<description>Channel2 Status   CH2. This bit is the result of an OR operation of the various status bits of channel 2  see STS register .</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH3</name>
							<description>Channel3 Status   CH3. This bit is the result of an OR operation of the various status bits of channel 3  see STS register .</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH4</name>
							<description>Channel4 Status   CH4. This bit is the result of an OR operation of the various status bits of channel 4  see STS register .</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH5</name>
							<description>Channel5 Status   CH5. This bit is the result of an OR operation of the various status bits of channel 5  see STS register .</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH6</name>
							<description>Channel6 Status   CH6. This bit is the result of an OR operation of the various status bits of channel 6  see STS register .</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH7</name>
							<description>Channel7 Status   CH7. This bit is the result of an OR operation of the various status bits of channel 7  see STS register .</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRSTCLR</name>
					<description>Kernel Reset Status Clear Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>236</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CLR</name>
							<description>Kernel Reset Status Clear   CLR. Read always as 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRST1</name>
					<description>Kernel Reset Register 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>240</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>Kernel Reset   RST. This reset bit can be used to request for a kernel reset. The kernel reset will be executed if the reset bits of both kernel reset registers is set. The RST bit will be cleared  re set to  0   by the BPI FPI after the kernel reset was executed.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRST0</name>
					<description>Kernel Reset Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>244</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>Kernel Reset   RST. This reset bit can be used to request for a kernel reset. The kernel reset will be executed if the reset bits of both kernel registers are set. The RST bit will be cleared  re set to  0   by the BPI FPI after the kernel reset was executed.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RSTSTAT</name>
							<description>Kernel Reset Status   RSTSTAT. This bit indicates wether a kernel reset was executed or not. This bit is set by the BPI FPI after the execution of a kernel reset in the same clock cycle both reset bits. This bit can be cleared by writing with  1  to the CLR bit in the related KRSTCLR register.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
