J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>HSM</name>
			<version>100</version>
			<description>Hardware Security Module</description>
			<baseAddress>4026793984</baseAddress>
			<addressBlock>
				<offset>8</offset>
				<size>131064</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>ID</name>
					<description>HSM Identifier Register
 resetvalue={Application Reset:0x0BEC002}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>12500994</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision Number. This bit field defines the module revision number. The value of a module        revision starts with 01  first revision .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type. The bit field is set to C0 which defines        the module as a 32 bit module.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number Value. This bit field defines a module identification number. The value for the        HSM module is 00BE .</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DBGBASE</name>
					<description>Debug Window Base Address
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4112</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>BASE</name>
							<description>Base Address. Base address for debug memory window. The effective address of a debug        access is HSM DBGBASE 133DBGBASE . HSM DBGBASE.BASE 135BASE  offset of access address to base of the memory window.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HSMOTGB</name>
					<description>OCDS Suspend and Trigger Bus Control
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4128</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TGS</name>
							<description>Trigger Set for OTGB0 1. This module supports only one Trigger Set. The following values are        defined </description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOTS0</name>
									<description>No Trigger Set output.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TS11</name>
									<description>Trigger Set 1.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TS22</name>
									<description>No Trigger Set output.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TS33</name>
									<description>Trigger Set 1.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TGB</name>
							<description>OTGB0 1 Bus Select</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>BUS00</name>
									<description>Trigger Set is output on OTGB0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BUS11</name>
									<description>Trigger Set is output on OTGB1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TG_P</name>
							<description>TGS  TGB Write Protection. TGS and TGB are only overwritten when TG P is set at the same access         otherwise unchanged. Reads as 0.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NC0</name>
									<description>No change.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WE1</name>
									<description>Write enable for the current access.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HT2HSMF</name>
					<description>Host to HSM Flags
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>32</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>HT2HSMF</name>
							<description>Host to HSM Flags. Each flag can be individually set by the host to generate an HSM        interrupt request if the corresponding interrupt enable flag is set. The        HSM can clear the flags individually. If a simultaneous the host        performs a set and HSM a clear  the value of the flag is   8216 1  8217 .</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HSM2HTF</name>
					<description>HSM to Host Flags
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>40</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>HSM2HTF</name>
							<description>HSM to Host Flags. Each flag can be individually set by the HSM to generate an host        interrupt request if the corresponding interrupt enable flag is set. The        host can reset the flags individually by writing   8216 1  8217 . If a simultaneous        set and reset occurs  the value of the flag is   8216 1  8217 .</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HSM2HTIE</name>
					<description>HSM to Host Interrupt Enable
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>44</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>HSM2HTIE</name>
							<description>HSM to Host Interrupt Enable. Each set bit enables the interrupt for the corresponding flags in        register HSM HSM2HTF 104HSM2HTF .        If cleared bit disables the interrupt.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HSM2HTIS</name>
					<description>HSM to Host Interrupt Select
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>48</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>HSM2HTIS</name>
							<description>HSM to Host Interrupt Select. If a bit is set the corresponding interrupt controlled by registers HSM HSM2HTF 104HSM2HTF and HSM2HTIE is mapped to host interrupt 1  otherwise to host interrupt 0.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HSM2HTS</name>
					<description>HSM to Host Status
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>52</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>HSM2HTS</name>
							<description>HSM to Host Status. 32 bits of information to signal HSM internal status to the host.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HT2HSMS</name>
					<description>Host to HSM Status
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>56</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>HT2HSMS</name>
							<description>Host to HSM Status. 32 bits of status information to signal the host software status to the        HSM.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HSMCTRL</name>
					<description>HSM Control
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4096</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EOMBT</name>
							<description>End of Memory BIST test.. For security reasons this functionality is encoded redundantly.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MON0</name>
									<description>MBIST mode activated.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MOFF11</name>
									<description>MBIST mode deactivated. See below.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MOFF22</name>
									<description>MBIST mode deactivated. See below.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MOFF33</name>
									<description>MBIST mode deactivated. Start of HSM subsystem. Cannot be reset by software</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
