J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>ECMSELR</name>
					<description>IOM Event Combiner Module Global Event Selection Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>52</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CES0</name>
							<description>Eve15t Combiner Selection   CES15. The setting of individual bitfields determines the inclusion of the respective channel event in the generation of the global event.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CES1</name>
							<description>Eve15t Combiner Selection   CES15. The setting of individual bitfields determines the inclusion of the respective channel event in the generation of the global event.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CES2</name>
							<description>Eve15t Combiner Selection   CES15. The setting of individual bitfields determines the inclusion of the respective channel event in the generation of the global event.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CES3</name>
							<description>Eve15t Combiner Selection   CES15. The setting of individual bitfields determines the inclusion of the respective channel event in the generation of the global event.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CES4</name>
							<description>Eve15t Combiner Selection   CES15. The setting of individual bitfields determines the inclusion of the respective channel event in the generation of the global event.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CES5</name>
							<description>Eve15t Combiner Selection   CES15. The setting of individual bitfields determines the inclusion of the respective channel event in the generation of the global event.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CES6</name>
							<description>Eve15t Combiner Selection   CES15. The setting of individual bitfields determines the inclusion of the respective channel event in the generation of the global event.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CES7</name>
							<description>Eve15t Combiner Selection   CES15. The setting of individual bitfields determines the inclusion of the respective channel event in the generation of the global event.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CES8</name>
							<description>Eve15t Combiner Selection   CES15. The setting of individual bitfields determines the inclusion of the respective channel event in the generation of the global event.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CES9</name>
							<description>Eve15t Combiner Selection   CES15. The setting of individual bitfields determines the inclusion of the respective channel event in the generation of the global event.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CES10</name>
							<description>Eve15t Combiner Selection   CES15. The setting of individual bitfields determines the inclusion of the respective channel event in the generation of the global event.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CES11</name>
							<description>Eve15t Combiner Selection   CES15. The setting of individual bitfields determines the inclusion of the respective channel event in the generation of the global event.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CES12</name>
							<description>Eve15t Combiner Selection   CES15. The setting of individual bitfields determines the inclusion of the respective channel event in the generation of the global event.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CES13</name>
							<description>Eve15t Combiner Selection   CES15. The setting of individual bitfields determines the inclusion of the respective channel event in the generation of the global event.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CES14</name>
							<description>Eve15t Combiner Selection   CES15. The setting of individual bitfields determines the inclusion of the respective channel event in the generation of the global event.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CES15</name>
							<description>Eve15t Combiner Selection   CES15. The setting of individual bitfields determines the inclusion of the respective channel event in the generation of the global event.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTS0</name>
							<description>Accumulated  Cou3ted  Event Combiner Selection   CTS3. The setting of individual bitfields determines the inclusion of the respective channel event counter output  1 of 4  in the generation of the global event.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTS1</name>
							<description>Accumulated  Cou3ted  Event Combiner Selection   CTS3. The setting of individual bitfields determines the inclusion of the respective channel event counter output  1 of 4  in the generation of the global event.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTS2</name>
							<description>Accumulated  Cou3ted  Event Combiner Selection   CTS3. The setting of individual bitfields determines the inclusion of the respective channel event counter output  1 of 4  in the generation of the global event.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTS3</name>
							<description>Accumulated  Cou3ted  Event Combiner Selection   CTS3. The setting of individual bitfields determines the inclusion of the respective channel event counter output  1 of 4  in the generation of the global event.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ECMETH0</name>
					<description>IOM Event Combiner Module Event Trigger History Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>56</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ETA0</name>
							<description>LAM 0 15 Eve15t Trigger Activity  last    ETA15. Contains the status of the event trigger outputs for each of the LAM blocks for the last generated event s .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA1</name>
							<description>LAM 0 15 Eve15t Trigger Activity  last    ETA15. Contains the status of the event trigger outputs for each of the LAM blocks for the last generated event s .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA2</name>
							<description>LAM 0 15 Eve15t Trigger Activity  last    ETA15. Contains the status of the event trigger outputs for each of the LAM blocks for the last generated event s .</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA3</name>
							<description>LAM 0 15 Eve15t Trigger Activity  last    ETA15. Contains the status of the event trigger outputs for each of the LAM blocks for the last generated event s .</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA4</name>
							<description>LAM 0 15 Eve15t Trigger Activity  last    ETA15. Contains the status of the event trigger outputs for each of the LAM blocks for the last generated event s .</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA5</name>
							<description>LAM 0 15 Eve15t Trigger Activity  last    ETA15. Contains the status of the event trigger outputs for each of the LAM blocks for the last generated event s .</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA6</name>
							<description>LAM 0 15 Eve15t Trigger Activity  last    ETA15. Contains the status of the event trigger outputs for each of the LAM blocks for the last generated event s .</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA7</name>
							<description>LAM 0 15 Eve15t Trigger Activity  last    ETA15. Contains the status of the event trigger outputs for each of the LAM blocks for the last generated event s .</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA8</name>
							<description>LAM 0 15 Eve15t Trigger Activity  last    ETA15. Contains the status of the event trigger outputs for each of the LAM blocks for the last generated event s .</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA9</name>
							<description>LAM 0 15 Eve15t Trigger Activity  last    ETA15. Contains the status of the event trigger outputs for each of the LAM blocks for the last generated event s .</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA10</name>
							<description>LAM 0 15 Eve15t Trigger Activity  last    ETA15. Contains the status of the event trigger outputs for each of the LAM blocks for the last generated event s .</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA11</name>
							<description>LAM 0 15 Eve15t Trigger Activity  last    ETA15. Contains the status of the event trigger outputs for each of the LAM blocks for the last generated event s .</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA12</name>
							<description>LAM 0 15 Eve15t Trigger Activity  last    ETA15. Contains the status of the event trigger outputs for each of the LAM blocks for the last generated event s .</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA13</name>
							<description>LAM 0 15 Eve15t Trigger Activity  last    ETA15. Contains the status of the event trigger outputs for each of the LAM blocks for the last generated event s .</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA14</name>
							<description>LAM 0 15 Eve15t Trigger Activity  last    ETA15. Contains the status of the event trigger outputs for each of the LAM blocks for the last generated event s .</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA15</name>
							<description>LAM 0 15 Eve15t Trigger Activity  last    ETA15. Contains the status of the event trigger outputs for each of the LAM blocks for the last generated event s .</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB0</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETA0 15    ETB15. Contains the previous contents of ETA0 15 prior to being updated.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB1</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETA0 15    ETB15. Contains the previous contents of ETA0 15 prior to being updated.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB2</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETA0 15    ETB15. Contains the previous contents of ETA0 15 prior to being updated.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB3</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETA0 15    ETB15. Contains the previous contents of ETA0 15 prior to being updated.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB4</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETA0 15    ETB15. Contains the previous contents of ETA0 15 prior to being updated.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB5</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETA0 15    ETB15. Contains the previous contents of ETA0 15 prior to being updated.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB6</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETA0 15    ETB15. Contains the previous contents of ETA0 15 prior to being updated.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB7</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETA0 15    ETB15. Contains the previous contents of ETA0 15 prior to being updated.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB8</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETA0 15    ETB15. Contains the previous contents of ETA0 15 prior to being updated.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB9</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETA0 15    ETB15. Contains the previous contents of ETA0 15 prior to being updated.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB10</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETA0 15    ETB15. Contains the previous contents of ETA0 15 prior to being updated.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB11</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETA0 15    ETB15. Contains the previous contents of ETA0 15 prior to being updated.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB12</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETA0 15    ETB15. Contains the previous contents of ETA0 15 prior to being updated.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB13</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETA0 15    ETB15. Contains the previous contents of ETA0 15 prior to being updated.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB14</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETA0 15    ETB15. Contains the previous contents of ETA0 15 prior to being updated.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB15</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETA0 15    ETB15. Contains the previous contents of ETA0 15 prior to being updated.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
