J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>ECMETH1</name>
					<description>IOM Event Combiner Module Event Trigger History Register 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>60</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ETC0</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETB0 15    ETC15. Contains the previous contents of ETB0 15 prior to being updated.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC1</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETB0 15    ETC15. Contains the previous contents of ETB0 15 prior to being updated.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC2</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETB0 15    ETC15. Contains the previous contents of ETB0 15 prior to being updated.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC3</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETB0 15    ETC15. Contains the previous contents of ETB0 15 prior to being updated.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC4</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETB0 15    ETC15. Contains the previous contents of ETB0 15 prior to being updated.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC5</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETB0 15    ETC15. Contains the previous contents of ETB0 15 prior to being updated.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC6</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETB0 15    ETC15. Contains the previous contents of ETB0 15 prior to being updated.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC7</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETB0 15    ETC15. Contains the previous contents of ETB0 15 prior to being updated.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC8</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETB0 15    ETC15. Contains the previous contents of ETB0 15 prior to being updated.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC9</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETB0 15    ETC15. Contains the previous contents of ETB0 15 prior to being updated.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC10</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETB0 15    ETC15. Contains the previous contents of ETB0 15 prior to being updated.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC11</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETB0 15    ETC15. Contains the previous contents of ETB0 15 prior to being updated.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC12</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETB0 15    ETC15. Contains the previous contents of ETB0 15 prior to being updated.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC13</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETB0 15    ETC15. Contains the previous contents of ETB0 15 prior to being updated.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC14</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETB0 15    ETC15. Contains the previous contents of ETB0 15 prior to being updated.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC15</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous ETB0 15    ETC15. Contains the previous contents of ETB0 15 prior to being updated.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD0</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous contents of ETC0 15 OR ed with the previous value of ETD0 15    ETD15. Contains the previous content of ETC0 15 OR ed with the previous value of ETD0 15.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD1</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous contents of ETC0 15 OR ed with the previous value of ETD0 15    ETD15. Contains the previous content of ETC0 15 OR ed with the previous value of ETD0 15.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD2</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous contents of ETC0 15 OR ed with the previous value of ETD0 15    ETD15. Contains the previous content of ETC0 15 OR ed with the previous value of ETD0 15.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD3</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous contents of ETC0 15 OR ed with the previous value of ETD0 15    ETD15. Contains the previous content of ETC0 15 OR ed with the previous value of ETD0 15.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD4</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous contents of ETC0 15 OR ed with the previous value of ETD0 15    ETD15. Contains the previous content of ETC0 15 OR ed with the previous value of ETD0 15.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD5</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous contents of ETC0 15 OR ed with the previous value of ETD0 15    ETD15. Contains the previous content of ETC0 15 OR ed with the previous value of ETD0 15.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD6</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous contents of ETC0 15 OR ed with the previous value of ETD0 15    ETD15. Contains the previous content of ETC0 15 OR ed with the previous value of ETD0 15.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD7</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous contents of ETC0 15 OR ed with the previous value of ETD0 15    ETD15. Contains the previous content of ETC0 15 OR ed with the previous value of ETD0 15.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD8</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous contents of ETC0 15 OR ed with the previous value of ETD0 15    ETD15. Contains the previous content of ETC0 15 OR ed with the previous value of ETD0 15.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD9</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous contents of ETC0 15 OR ed with the previous value of ETD0 15    ETD15. Contains the previous content of ETC0 15 OR ed with the previous value of ETD0 15.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD10</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous contents of ETC0 15 OR ed with the previous value of ETD0 15    ETD15. Contains the previous content of ETC0 15 OR ed with the previous value of ETD0 15.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD11</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous contents of ETC0 15 OR ed with the previous value of ETD0 15    ETD15. Contains the previous content of ETC0 15 OR ed with the previous value of ETD0 15.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD12</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous contents of ETC0 15 OR ed with the previous value of ETD0 15    ETD15. Contains the previous content of ETC0 15 OR ed with the previous value of ETD0 15.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD13</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous contents of ETC0 15 OR ed with the previous value of ETD0 15    ETD15. Contains the previous content of ETC0 15 OR ed with the previous value of ETD0 15.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD14</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous contents of ETC0 15 OR ed with the previous value of ETD0 15    ETD15. Contains the previous content of ETC0 15 OR ed with the previous value of ETD0 15.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD15</name>
							<description>LAM 0 15 Eve15t Trigger Activity  previous contents of ETC0 15 OR ed with the previous value of ETD0 15    ETD15. Contains the previous content of ETC0 15 OR ed with the previous value of ETD0 15.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GTMEXR</name>
					<description>IOM GTM Input EXOR Combiner Selection Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>64</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EN0</name>
							<description>GTM input 0 selection for EXOR combiner   EN0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN1</name>
							<description>GTM input 1 selection for EXOR combiner   EN1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN2</name>
							<description>GTM input 2 selection for EXOR combiner   EN2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN3</name>
							<description>GTM input 3 selection for EXOR combiner   EN3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN4</name>
							<description>GTM input 4 selection for EXOR combiner   EN4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN5</name>
							<description>GTM input 5 selection for EXOR combiner   EN5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN6</name>
							<description>GTM input 6 selection for EXOR combiner   EN6</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN7</name>
							<description>GTM input 7 selection for EXOR combiner   EN7</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCESR</name>
					<description>IOM Filter and Prescaler Channels Rising   Falling Edge Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>120</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FEG0</name>
							<description>Falling Edge Glitch Flag for FPC15   FEG15</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG1</name>
							<description>Falling Edge Glitch Flag for FPC15   FEG15</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG2</name>
							<description>Falling Edge Glitch Flag for FPC15   FEG15</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG3</name>
							<description>Falling Edge Glitch Flag for FPC15   FEG15</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG4</name>
							<description>Falling Edge Glitch Flag for FPC15   FEG15</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG5</name>
							<description>Falling Edge Glitch Flag for FPC15   FEG15</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG6</name>
							<description>Falling Edge Glitch Flag for FPC15   FEG15</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG7</name>
							<description>Falling Edge Glitch Flag for FPC15   FEG15</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG8</name>
							<description>Falling Edge Glitch Flag for FPC15   FEG15</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG9</name>
							<description>Falling Edge Glitch Flag for FPC15   FEG15</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG10</name>
							<description>Falling Edge Glitch Flag for FPC15   FEG15</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG11</name>
							<description>Falling Edge Glitch Flag for FPC15   FEG15</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG12</name>
							<description>Falling Edge Glitch Flag for FPC15   FEG15</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG13</name>
							<description>Falling Edge Glitch Flag for FPC15   FEG15</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG14</name>
							<description>Falling Edge Glitch Flag for FPC15   FEG15</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG15</name>
							<description>Falling Edge Glitch Flag for FPC15   FEG15</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REG0</name>
							<description>Rising Edge Glitch Flag for FPC15   REG15</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REG1</name>
							<description>Rising Edge Glitch Flag for FPC15   REG15</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REG2</name>
							<description>Rising Edge Glitch Flag for FPC15   REG15</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REG3</name>
							<description>Rising Edge Glitch Flag for FPC15   REG15</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REG4</name>
							<description>Rising Edge Glitch Flag for FPC15   REG15</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REG5</name>
							<description>Rising Edge Glitch Flag for FPC15   REG15</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REG6</name>
							<description>Rising Edge Glitch Flag for FPC15   REG15</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REG7</name>
							<description>Rising Edge Glitch Flag for FPC15   REG15</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REG8</name>
							<description>Rising Edge Glitch Flag for FPC15   REG15</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REG9</name>
							<description>Rising Edge Glitch Flag for FPC15   REG15</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REG10</name>
							<description>Rising Edge Glitch Flag for FPC15   REG15</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REG11</name>
							<description>Rising Edge Glitch Flag for FPC15   REG15</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REG12</name>
							<description>Rising Edge Glitch Flag for FPC15   REG15</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REG13</name>
							<description>Rising Edge Glitch Flag for FPC15   REG15</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REG14</name>
							<description>Rising Edge Glitch Flag for FPC15   REG15</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REG15</name>
							<description>Rising Edge Glitch Flag for FPC15   REG15</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>16</dim>
					<dimIncrement>4</dimIncrement>
					<name>FPCCTRk[%s]</name>
					<description>IOM Filter and Prescaler Channel Control Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>128</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CMP</name>
							<description>Threshold Value of Filter   Prescaler Channel k   CMP. CMP is the 16 bit threshold value that is compared with the 16 bit timer value FPCTIMk.TIM.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MOD</name>
							<description>Operation Mode Selection for Filter   Prescaler Channel k   MOD</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ISM</name>
							<description>Monitor Input Signal Selection for Filter   Prescaler Channel k   ISM. ISM selects the monitor signal that goes to the monitor input  MON  of        the Logic Analyzer Module.</description>
							<lsb>19</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RTG</name>
							<description>Reset Timer behavior for Filter   Prescaler Channel k on Glitch   RTG. This bit is effective in Delayed Debounce Filter Mode only.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ISR</name>
							<description>Reference Input Signal Selection for Filter   Prescaler Channel k   ISR. ISR select the reference signal that goes to the reference input  REF         of the Logic Analyzer Module.</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>16</dim>
					<dimIncrement>4</dimIncrement>
					<name>FPCTIMk[%s]</name>
					<description>IOM Filter and Prescaler Channel Timer Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>192</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TIM</name>
							<description>Timer Value of Filter and Prescaler Channel k   TIM. This bit bitfield shows the values of the timer of the Filter and Prescaler Channel. Writing to TIM will result in its content being set to its reset value.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>16</dim>
					<dimIncrement>4</dimIncrement>
					<name>LAMEWCm[%s]</name>
					<description>IOM Logic Analyzer Module Event Window Count Status Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>256</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>Event Window Count Value LAM block m   CNT. The count value of the event window attained coincident with an event occurring.</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTO</name>
							<description>Count Overflow Flag LAM block m   CNTO. This bit field provides the information wether the count has reached its maximum value.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
