J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>IOCR0</name>
					<description>Port 00 Input Output Control Register 0
 resetvalue={:0x0,:0x0,:0x10101010,:0x10101010}</description>
					<addressOffset>16</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4025479151</resetMask>
					<fields>
						<field>
							<name>PC0</name>
							<description>Port Control for Pin 3. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>3</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC1</name>
							<description>Port Control for Pin 3. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>11</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC2</name>
							<description>Port Control for Pin 3. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>19</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC3</name>
							<description>Port Control for Pin 3. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>27</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IOCR4</name>
					<description>Port 00 Input Output Control Register 4
 resetvalue={:0x0,:0x0,:0x10101010,:0x10101010}</description>
					<addressOffset>20</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4025479151</resetMask>
					<fields>
						<field>
							<name>PC4</name>
							<description>Port Control for Port 00 Pin 7. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>3</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC5</name>
							<description>Port Control for Port 00 Pin 7. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>11</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC6</name>
							<description>Port Control for Port 00 Pin 7. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>19</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC7</name>
							<description>Port Control for Port 00 Pin 7. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>27</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IOCR8</name>
					<description>Port 00 Input Output Control Register 8
 resetvalue={:0x0,:0x0,:0x10101010,:0x10101010}</description>
					<addressOffset>24</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4025479151</resetMask>
					<fields>
						<field>
							<name>PC8</name>
							<description>Port Control for Port 00 Pin 11. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>3</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC9</name>
							<description>Port Control for Port 00 Pin 11. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>11</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC10</name>
							<description>Port Control for Port 00 Pin 11. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>19</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC11</name>
							<description>Port Control for Port 00 Pin 11. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>27</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IOCR12</name>
					<description>Port 00 Input Output Control Register 12
 resetvalue={:0x0,:0x0,:0x10101010,:0x10101010}</description>
					<addressOffset>28</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4025479151</resetMask>
					<fields>
						<field>
							<name>PC12</name>
							<description>Port Control for Port 00 Pin 15. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>3</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC13</name>
							<description>Port Control for Port 00 Pin 15. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>11</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC14</name>
							<description>Port Control for Port 00 Pin 15. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>19</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC15</name>
							<description>Port Control for Port 00 Pin 15. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>27</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IN</name>
					<description>Port 00 Input Register
 resetvalue={:0x0}</description>
					<addressOffset>36</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294901760</resetMask>
					<fields>
						<field>
							<name>P0</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P1</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P2</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P3</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P4</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P5</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P6</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P7</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P8</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P9</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P10</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P11</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P12</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P13</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P14</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P15</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PDR0</name>
					<description>Port 00 Pad Driver Mode Register 0
 resetvalue={:0x0,:0x0,After SSW execution:0x22222222,After SSW execution:0x22222222}</description>
					<addressOffset>64</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>PD0</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL0</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD1</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL1</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD2</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL2</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD3</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL3</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD4</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL4</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD5</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL5</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD6</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL6</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD7</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL7</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PDR1</name>
					<description>Port 00 Pad Driver Mode Register 1
 resetvalue={:0x0,:0x0,After SSW execution:0x22222222,After SSW execution:0x22222222}</description>
					<addressOffset>68</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>PD8</name>
							<description>Pad Driver Mode for Pin 15</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL8</name>
							<description>Pad Level Selection for Pin 15</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD9</name>
							<description>Pad Driver Mode for Pin 15</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL9</name>
							<description>Pad Level Selection for Pin 15</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD10</name>
							<description>Pad Driver Mode for Pin 15</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL10</name>
							<description>Pad Level Selection for Pin 15</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD11</name>
							<description>Pad Driver Mode for Pin 15</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL11</name>
							<description>Pad Level Selection for Pin 15</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD12</name>
							<description>Pad Driver Mode for Pin 15</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL12</name>
							<description>Pad Level Selection for Pin 15</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD13</name>
							<description>Pad Driver Mode for Pin 15</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL13</name>
							<description>Pad Level Selection for Pin 15</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD14</name>
							<description>Pad Driver Mode for Pin 15</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL14</name>
							<description>Pad Level Selection for Pin 15</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD15</name>
							<description>Pad Driver Mode for Pin 15</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL15</name>
							<description>Pad Level Selection for Pin 15</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
