J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>P01</name>
			<version>100</version>
			<description>General Purpose I O Ports and Peripheral I O Lines</description>
			<baseAddress>4026769664</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>256</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>OUT</name>
					<description>Port 01 Output Register
 resetvalue={:0x0}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>P0</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P1</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P2</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P3</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P4</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P5</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P6</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P7</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OMR</name>
					<description>Port 01 Output Modification Register
 resetvalue={:0x0}</description>
					<addressOffset>4</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PS0</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS1</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS2</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS3</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS4</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS5</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS6</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS7</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL0</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL1</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL2</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL3</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL4</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL5</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL6</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL7</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Port 01 Identification Register
 resetvalue={:0x0C8C000}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>13156352</resetValue>
					<resetMask>4294967040</resetMask>
					<fields>
						<field>
							<name>MODREV</name>
							<description>Module Revision Number. This bit field indicates the revision number of the TC39x module  01 H   160    160 first revision .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODTYPE</name>
							<description>Module Type. This bit field is C0 H . It defines a        32 bit module</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODNUMBER</name>
							<description>Module Number. This bit field defines the module identification number. The value for        the Ports module is 00C8</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IOCR0</name>
					<description>Port 01 Input Output Control Register 0
 resetvalue={:0x0,:0x0,:0x10101010,:0x10101010}</description>
					<addressOffset>16</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4025479151</resetMask>
					<fields>
						<field>
							<name>PC0</name>
							<description>Port Control for Pin 3. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>3</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC1</name>
							<description>Port Control for Pin 3. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>11</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC2</name>
							<description>Port Control for Pin 3. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>19</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC3</name>
							<description>Port Control for Pin 3. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>27</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IOCR4</name>
					<description>Port 01 Input Output Control Register 4
 resetvalue={:0x0,:0x0,:0x10101010,:0x10101010}</description>
					<addressOffset>20</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4025479151</resetMask>
					<fields>
						<field>
							<name>PC4</name>
							<description>Port Control for Port 01 Pin 7. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>3</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC5</name>
							<description>Port Control for Port 01 Pin 7. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>11</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC6</name>
							<description>Port Control for Port 01 Pin 7. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>19</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC7</name>
							<description>Port Control for Port 01 Pin 7. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>27</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IN</name>
					<description>Port 01 Input Register
 resetvalue={:0x0}</description>
					<addressOffset>36</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967040</resetMask>
					<fields>
						<field>
							<name>P0</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P1</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P2</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P3</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P4</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P5</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P6</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P7</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PDR0</name>
					<description>Port 01 Pad Driver Mode Register 0
 resetvalue={:0x0,:0x0,After SSW execution:0x22222222,After SSW execution:0x22222222}</description>
					<addressOffset>64</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>PD0</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL0</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD1</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL1</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD2</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL2</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD3</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL3</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD4</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL4</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD5</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL5</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD6</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL6</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD7</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL7</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ESR</name>
					<description>Port 01 Emergency Stop Register
 resetvalue={:0x0}</description>
					<addressOffset>80</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EN0</name>
							<description>Emergency Stop Enable for Pin 15. This bit enables the emergency stop function for all GPIO lines. If the        emergency stop condition is met and enabled  the output selection is        automatically switched from alternate output function to GPIO input        function.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN1</name>
							<description>Emergency Stop Enable for Pin 15. This bit enables the emergency stop function for all GPIO lines. If the        emergency stop condition is met and enabled  the output selection is        automatically switched from alternate output function to GPIO input        function.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN2</name>
							<description>Emergency Stop Enable for Pin 15. This bit enables the emergency stop function for all GPIO lines. If the        emergency stop condition is met and enabled  the output selection is        automatically switched from alternate output function to GPIO input        function.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN3</name>
							<description>Emergency Stop Enable for Pin 15. This bit enables the emergency stop function for all GPIO lines. If the        emergency stop condition is met and enabled  the output selection is        automatically switched from alternate output function to GPIO input        function.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN4</name>
							<description>Emergency Stop Enable for Pin 15. This bit enables the emergency stop function for all GPIO lines. If the        emergency stop condition is met and enabled  the output selection is        automatically switched from alternate output function to GPIO input        function.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN5</name>
							<description>Emergency Stop Enable for Pin 15. This bit enables the emergency stop function for all GPIO lines. If the        emergency stop condition is met and enabled  the output selection is        automatically switched from alternate output function to GPIO input        function.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN6</name>
							<description>Emergency Stop Enable for Pin 15. This bit enables the emergency stop function for all GPIO lines. If the        emergency stop condition is met and enabled  the output selection is        automatically switched from alternate output function to GPIO input        function.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN7</name>
							<description>Emergency Stop Enable for Pin 15. This bit enables the emergency stop function for all GPIO lines. If the        emergency stop condition is met and enabled  the output selection is        automatically switched from alternate output function to GPIO input        function.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
