J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>P13</name>
			<version>100</version>
			<description>General Purpose I O Ports and Peripheral I O Lines</description>
			<baseAddress>4026772736</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>256</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>OUT</name>
					<description>Port 13 Output Register
 resetvalue={:0x0}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>P0</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P1</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P2</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P3</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OMR</name>
					<description>Port 13 Output Modification Register
 resetvalue={:0x0}</description>
					<addressOffset>4</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PS0</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS1</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS2</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS3</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL0</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL1</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL2</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL3</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Port 13 Identification Register
 resetvalue={:0x0C8C000}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>13156352</resetValue>
					<resetMask>4294967040</resetMask>
					<fields>
						<field>
							<name>MODREV</name>
							<description>Module Revision Number. This bit field indicates the revision number of the TC39x module  01 H   160    160 first revision .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODTYPE</name>
							<description>Module Type. This bit field is C0 H . It defines a        32 bit module</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODNUMBER</name>
							<description>Module Number. This bit field defines the module identification number. The value for        the Ports module is 00C8</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IOCR0</name>
					<description>Port 13 Input Output Control Register 0
 resetvalue={:0x0,:0x0,:0x10101010,:0x10101010}</description>
					<addressOffset>16</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4025479151</resetMask>
					<fields>
						<field>
							<name>PC0</name>
							<description>Port Control for Pin 3. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>3</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC1</name>
							<description>Port Control for Pin 3. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>11</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC2</name>
							<description>Port Control for Pin 3. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>19</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC3</name>
							<description>Port Control for Pin 3. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>27</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IN</name>
					<description>Port 13 Input Register
 resetvalue={:0x0}</description>
					<addressOffset>36</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967280</resetMask>
					<fields>
						<field>
							<name>P0</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P1</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P2</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P3</name>
							<description>Input Bit 15. This bit indicates the level at the input pin Pn.x.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PDR0</name>
					<description>Port 13 Pad Driver Mode Register 0
 resetvalue={:0x0,:0x0,After SSW execution:0x2222,After SSW execution:0x2222}</description>
					<addressOffset>64</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294901760</resetMask>
					<fields>
						<field>
							<name>PD0</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL0</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD1</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL1</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD2</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL2</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD3</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL3</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ESR</name>
					<description>Port 13 Emergency Stop Register
 resetvalue={:0x0}</description>
					<addressOffset>80</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EN0</name>
							<description>Emergency Stop Enable for Pin 15. This bit enables the emergency stop function for all GPIO lines. If the        emergency stop condition is met and enabled  the output selection is        automatically switched from alternate output function to GPIO input        function.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN1</name>
							<description>Emergency Stop Enable for Pin 15. This bit enables the emergency stop function for all GPIO lines. If the        emergency stop condition is met and enabled  the output selection is        automatically switched from alternate output function to GPIO input        function.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN2</name>
							<description>Emergency Stop Enable for Pin 15. This bit enables the emergency stop function for all GPIO lines. If the        emergency stop condition is met and enabled  the output selection is        automatically switched from alternate output function to GPIO input        function.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN3</name>
							<description>Emergency Stop Enable for Pin 15. This bit enables the emergency stop function for all GPIO lines. If the        emergency stop condition is met and enabled  the output selection is        automatically switched from alternate output function to GPIO input        function.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PDISC</name>
					<description>Port 13 Pin Function Decision Control Register
 resetvalue={:0x0,:0x0,After SSW execution:0x0,After SSW execution:0x0}</description>
					<addressOffset>96</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967280</resetMask>
					<fields>
						<field>
							<name>PDIS0</name>
							<description>Pin Function Decision Control for Pin 15. This bit selects the function of the port pad.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDIS1</name>
							<description>Pin Function Decision Control for Pin 15. This bit selects the function of the port pad.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDIS2</name>
							<description>Pin Function Decision Control for Pin 15. This bit selects the function of the port pad.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDIS3</name>
							<description>Pin Function Decision Control for Pin 15. This bit selects the function of the port pad.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OMSR0</name>
					<description>Port 13 Output Modification Set Register 0
 resetvalue={:0x0}</description>
					<addressOffset>112</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PS0</name>
							<description>Set Bit 3. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS1</name>
							<description>Set Bit 3. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS2</name>
							<description>Set Bit 3. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS3</name>
							<description>Set Bit 3. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OMCR0</name>
					<description>Port 13 Output Modification Clear Register 0
 resetvalue={:0x0}</description>
					<addressOffset>128</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PCL0</name>
							<description>Clear Bit 3. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL1</name>
							<description>Clear Bit 3. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL2</name>
							<description>Clear Bit 3. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL3</name>
							<description>Clear Bit 3. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OMSR</name>
					<description>Port 13 Output Modification Set Register
 resetvalue={:0x0}</description>
					<addressOffset>144</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PS0</name>
							<description>Set Bit 15. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS1</name>
							<description>Set Bit 15. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS2</name>
							<description>Set Bit 15. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS3</name>
							<description>Set Bit 15. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OMCR</name>
					<description>Port 13 Output Modification Clear Register
 resetvalue={:0x0}</description>
					<addressOffset>148</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PCL0</name>
							<description>Clear Bit 15. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL1</name>
							<description>Clear Bit 15. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL2</name>
							<description>Clear Bit 15. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL3</name>
							<description>Clear Bit 15. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>4</dimIncrement>
					<name>LPCR[%s]</name>
					<description>Port 13 LVDS Pad Control Register 0
 resetvalue={:0x5480,:0x54C0,After SSW execution:0x54E0,After SSW execution:0x5480}</description>
					<addressOffset>160</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294901760</resetMask>
					<fields>
						<field>
							<name>PS</name>
							<description>Pad Supply Selection. Selects between 5V or 3.3V supply on V EXT for the pad pair. Used in RX and TX pads  Driven to LVDS pad control   8220 LVDS 5EN  8221 . Needs also be connected to the        related bias distributor.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TEN_CTRL</name>
							<description>LVDS TX EN controller. The LVDS TX EN control function can be selected from the Port  default         or HSCT module  where this is connected .</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TX_EN</name>
							<description>Enable Transmit LVDS. Enable the transmit LVDS   disable CMOS path. If this bit is set to 0          no transfer on LVDS data path can be initiated and the LVDS driver is        disabled  powered down . Driven to LVDS pad control   8220 LVDSEN  8221 .</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VDIFFADJ</name>
							<description>LVDS Output Amplitude Tuning. With these two configuration bits the LVDS output current amplitude can        be adjusted. The voltage swing depending on VDIFFADJ setting is        documented in the Data Sheet  see parameter V OD . Driven to LVDS pad controls LVDS VDIFF ADJ 1 0 .</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VOSDYN</name>
							<description>Tune Bit of VOS Control Loop Static Dynamic. Tune bit to change V OS control loop        between static and dynamic mode. Don  8217 t change reset value.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VOSEXT</name>
							<description>Tune Bit of VOS Control Loop Internal External. Tune bit to change V OS control loop. Tune bit to change the measurement point of the V OS control loop between the actual LVDS signal on PADP PADN or the internal        replica. Effective only if control loop is set to static mode with        VOSDYN   0. Don  8217 t change reset value.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TX_PD</name>
							<description>LVDS Power Down. Unused in this device. LVDS disabled by TX EN means power down. According to LVDS design spec in C40 power down means LVDSEN 0. So in        C40 this bit is obsolete.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TX_PWDPD</name>
							<description>Enable TX Power down pull down.. This function disables or enables the LVDS pull down resistor. The        application code must disable TX power down pull down resistor with a        power up. With a LVDS Power Down configuration the pull down function        must be enabled  if required. Driven to LVDS pad control   8220 LVDS PDN  8221 .</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
