J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>P20</name>
			<version>100</version>
			<description>General Purpose I O Ports and Peripheral I O Lines</description>
			<baseAddress>4026774528</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>256</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>OUT</name>
					<description>Port 20 Output Register
 resetvalue={:0x0}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>P0</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P1</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P2</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P3</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P4</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P5</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P6</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P7</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P8</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P9</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P10</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P11</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P12</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P13</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P14</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P15</name>
							<description>Output Bit 15. This bit determines the level at the output pin Pn.x if the output is        selected as GPIO output. Pn.x can also be set or cleared by control bits of the Pn OMSR  Pn OMCR        or Pn OMR registers.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OMR</name>
					<description>Port 20 Output Modification Register
 resetvalue={:0x0}</description>
					<addressOffset>4</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PS0</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS1</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS2</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS3</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS4</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS5</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS6</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS7</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS8</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS9</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS10</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS11</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS12</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS13</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS14</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS15</name>
							<description>Set Bit 15. Setting this bit will set or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL0</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL1</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL2</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL3</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL4</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL5</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL6</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL7</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL8</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL9</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL10</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL11</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL12</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL13</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL14</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL15</name>
							<description>Clear Bit 15. Setting this bit will clear or toggle the corresponding bit in the port        output register Pn OUT. Read as 0. The function of this bit is shown in Table .</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Port 20 Identification Register
 resetvalue={:0x0C8C000}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>13156352</resetValue>
					<resetMask>4294967040</resetMask>
					<fields>
						<field>
							<name>MODREV</name>
							<description>Module Revision Number. This bit field indicates the revision number of the TC39x module  01 H   160    160 first revision .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODTYPE</name>
							<description>Module Type. This bit field is C0 H . It defines a        32 bit module</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODNUMBER</name>
							<description>Module Number. This bit field defines the module identification number. The value for        the Ports module is 00C8</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IOCR0</name>
					<description>Port 20 Input Output Control Register 0
 resetvalue={:0x100000,:0x0,:0x10101010,:0x10101010}</description>
					<addressOffset>16</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4025479151</resetMask>
					<fields>
						<field>
							<name>PC0</name>
							<description>Port Control for Pin 3. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>3</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC1</name>
							<description>Port Control for Pin 3. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>11</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC2</name>
							<description>Port Control for Pin 3. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>19</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC3</name>
							<description>Port Control for Pin 3. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>27</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IOCR4</name>
					<description>Port 20 Input Output Control Register 4
 resetvalue={:0x0,:0x0,:0x10101010,:0x10101010}</description>
					<addressOffset>20</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4025479151</resetMask>
					<fields>
						<field>
							<name>PC4</name>
							<description>Port Control for Port 20 Pin 7. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>3</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC5</name>
							<description>Port Control for Port 20 Pin 7. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>11</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC6</name>
							<description>Port Control for Port 20 Pin 7. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>19</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC7</name>
							<description>Port Control for Port 20 Pin 7. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>27</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IOCR8</name>
					<description>Port 20 Input Output Control Register 8
 resetvalue={:0x0,:0x0,:0x10101010,:0x10101010}</description>
					<addressOffset>24</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4025479151</resetMask>
					<fields>
						<field>
							<name>PC8</name>
							<description>Port Control for Port 20 Pin 11. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>3</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC9</name>
							<description>Port Control for Port 20 Pin 11. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>11</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC10</name>
							<description>Port Control for Port 20 Pin 11. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>19</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC11</name>
							<description>Port Control for Port 20 Pin 11. This bit field defines the Port n line x functionality according to Table          only input selection apply.</description>
							<lsb>27</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
