J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>PDISC</name>
					<description>Port 21 Pin Function Decision Control Register
 resetvalue={:0x0,:0x0,After SSW execution:0x0,After SSW execution:0x0}</description>
					<addressOffset>96</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967040</resetMask>
					<fields>
						<field>
							<name>PDIS0</name>
							<description>Pin Function Decision Control for Pin 15. This bit selects the function of the port pad.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDIS1</name>
							<description>Pin Function Decision Control for Pin 15. This bit selects the function of the port pad.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDIS2</name>
							<description>Pin Function Decision Control for Pin 15. This bit selects the function of the port pad.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDIS3</name>
							<description>Pin Function Decision Control for Pin 15. This bit selects the function of the port pad.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDIS4</name>
							<description>Pin Function Decision Control for Pin 15. This bit selects the function of the port pad.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDIS5</name>
							<description>Pin Function Decision Control for Pin 15. This bit selects the function of the port pad.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDIS6</name>
							<description>Pin Function Decision Control for Pin 15. This bit selects the function of the port pad.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDIS7</name>
							<description>Pin Function Decision Control for Pin 15. This bit selects the function of the port pad.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OMSR0</name>
					<description>Port 21 Output Modification Set Register 0
 resetvalue={:0x0}</description>
					<addressOffset>112</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PS0</name>
							<description>Set Bit 3. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS1</name>
							<description>Set Bit 3. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS2</name>
							<description>Set Bit 3. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS3</name>
							<description>Set Bit 3. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OMSR4</name>
					<description>Port 21 Output Modification Set Register 4
 resetvalue={:0x0}</description>
					<addressOffset>116</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PS4</name>
							<description>Set Bit 7. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS5</name>
							<description>Set Bit 7. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS6</name>
							<description>Set Bit 7. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS7</name>
							<description>Set Bit 7. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OMCR0</name>
					<description>Port 21 Output Modification Clear Register 0
 resetvalue={:0x0}</description>
					<addressOffset>128</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PCL0</name>
							<description>Clear Bit 3. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL1</name>
							<description>Clear Bit 3. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL2</name>
							<description>Clear Bit 3. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL3</name>
							<description>Clear Bit 3. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OMCR4</name>
					<description>Port 21 Output Modification Clear Register 4
 resetvalue={:0x0}</description>
					<addressOffset>132</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PCL4</name>
							<description>Clear Bit 7. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL5</name>
							<description>Clear Bit 7. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL6</name>
							<description>Clear Bit 7. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL7</name>
							<description>Clear Bit 7. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OMSR</name>
					<description>Port 21 Output Modification Set Register
 resetvalue={:0x0}</description>
					<addressOffset>144</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PS0</name>
							<description>Set Bit 15. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS1</name>
							<description>Set Bit 15. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS2</name>
							<description>Set Bit 15. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS3</name>
							<description>Set Bit 15. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS4</name>
							<description>Set Bit 15. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS5</name>
							<description>Set Bit 15. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS6</name>
							<description>Set Bit 15. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS7</name>
							<description>Set Bit 15. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OMCR</name>
					<description>Port 21 Output Modification Clear Register
 resetvalue={:0x0}</description>
					<addressOffset>148</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PCL0</name>
							<description>Clear Bit 15. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL1</name>
							<description>Clear Bit 15. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL2</name>
							<description>Clear Bit 15. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL3</name>
							<description>Clear Bit 15. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL4</name>
							<description>Clear Bit 15. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL5</name>
							<description>Clear Bit 15. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL6</name>
							<description>Clear Bit 15. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL7</name>
							<description>Clear Bit 15. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>4</dimIncrement>
					<name>LPCR[%s]</name>
					<description>Port 21 LVDS Pad Control Register 0
 resetvalue={:0x0C0,:0x54C0,After SSW execution:0x54E0,After SSW execution:0x0E0}</description>
					<addressOffset>160</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294901760</resetMask>
					<fields>
						<field>
							<name>REN_CTRL</name>
							<description>LVDS RX EN controller. The LVDS RX EN control function can be selected from the Port  default         or HSCT module  where this is connected .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RX_EN</name>
							<description>Enable Receive LVDS. Enable the receive LVDS   disable CMOS path. If this bit is set to 0   8211         no transfer from the LVDS sender can be received and the receiver LVDS        is in low power state. Driven to LVDS pad control   8220 LVDSEN  8221 .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TERM</name>
							<description>Select Receiver Termination Mode. Selects a suitable internal load resistor between both pads. Driven to LVDS pad control   8220 RTERM EN  8221 .</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LRXTERM</name>
							<description>LVDS RX Poly resistor configuration value. Programming bits for the on die poly resistor termination. The value is        configured during production test. Each chip configuration on this bit        field is unique and configured during production testing. Please  check PHY design specification for detailed configuration          values. The value is configured by Startup SW during start up phase of          the chip Driven to LVDS pad control   8220 RTERM PROG 2 0   8221  The configuration value shall not be changed by user after start up          for a guaranteed behavior.</description>
							<lsb>3</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LVDSM</name>
							<description>LVDS M Mode. Selects reduced frequency mode   8220 LVDS M  8221  of the receiver. This mode        reduces the static current of the RX pad. The max data rate is reduced        to 160  160 Mbps  80  160 MHz . Driven to LVDS pad control   8220 LVDS MEN  8221 .</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PS</name>
							<description>Pad Supply Selection. Selects between 5V or 3.3V supply on V EXT for the pad pair. Used in RX and TX pads  Driven to LVDS pad control   8220 LVDS 5EN  8221 . Needs also be connected to the        related bias distributor.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
