J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>PDR0</name>
					<description>Port 22 Pad Driver Mode Register 0
 resetvalue={:0x0,:0x0,After SSW execution:0x22222222,After SSW execution:0x22222222}</description>
					<addressOffset>64</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>PD0</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL0</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD1</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL1</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD2</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL2</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD3</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL3</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD4</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL4</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD5</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL5</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD6</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL6</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD7</name>
							<description>Pad Driver Mode for Pin 7</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL7</name>
							<description>Pad Level Selection for Pin 7</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PDR1</name>
					<description>Port 22 Pad Driver Mode Register 1
 resetvalue={:0x0,:0x0,After SSW execution:0x2222,After SSW execution:0x2222}</description>
					<addressOffset>68</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294901760</resetMask>
					<fields>
						<field>
							<name>PD8</name>
							<description>Pad Driver Mode for Pin 15</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL8</name>
							<description>Pad Level Selection for Pin 15</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD9</name>
							<description>Pad Driver Mode for Pin 15</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL9</name>
							<description>Pad Level Selection for Pin 15</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD10</name>
							<description>Pad Driver Mode for Pin 15</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL10</name>
							<description>Pad Level Selection for Pin 15</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD11</name>
							<description>Pad Driver Mode for Pin 15</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL11</name>
							<description>Pad Level Selection for Pin 15</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ESR</name>
					<description>Port 22 Emergency Stop Register
 resetvalue={:0x0}</description>
					<addressOffset>80</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EN0</name>
							<description>Emergency Stop Enable for Pin 15. This bit enables the emergency stop function for all GPIO lines. If the        emergency stop condition is met and enabled  the output selection is        automatically switched from alternate output function to GPIO input        function.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN1</name>
							<description>Emergency Stop Enable for Pin 15. This bit enables the emergency stop function for all GPIO lines. If the        emergency stop condition is met and enabled  the output selection is        automatically switched from alternate output function to GPIO input        function.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN2</name>
							<description>Emergency Stop Enable for Pin 15. This bit enables the emergency stop function for all GPIO lines. If the        emergency stop condition is met and enabled  the output selection is        automatically switched from alternate output function to GPIO input        function.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN3</name>
							<description>Emergency Stop Enable for Pin 15. This bit enables the emergency stop function for all GPIO lines. If the        emergency stop condition is met and enabled  the output selection is        automatically switched from alternate output function to GPIO input        function.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN4</name>
							<description>Emergency Stop Enable for Pin 15. This bit enables the emergency stop function for all GPIO lines. If the        emergency stop condition is met and enabled  the output selection is        automatically switched from alternate output function to GPIO input        function.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN5</name>
							<description>Emergency Stop Enable for Pin 15. This bit enables the emergency stop function for all GPIO lines. If the        emergency stop condition is met and enabled  the output selection is        automatically switched from alternate output function to GPIO input        function.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN6</name>
							<description>Emergency Stop Enable for Pin 15. This bit enables the emergency stop function for all GPIO lines. If the        emergency stop condition is met and enabled  the output selection is        automatically switched from alternate output function to GPIO input        function.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN7</name>
							<description>Emergency Stop Enable for Pin 15. This bit enables the emergency stop function for all GPIO lines. If the        emergency stop condition is met and enabled  the output selection is        automatically switched from alternate output function to GPIO input        function.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN8</name>
							<description>Emergency Stop Enable for Pin 15. This bit enables the emergency stop function for all GPIO lines. If the        emergency stop condition is met and enabled  the output selection is        automatically switched from alternate output function to GPIO input        function.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN9</name>
							<description>Emergency Stop Enable for Pin 15. This bit enables the emergency stop function for all GPIO lines. If the        emergency stop condition is met and enabled  the output selection is        automatically switched from alternate output function to GPIO input        function.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN10</name>
							<description>Emergency Stop Enable for Pin 15. This bit enables the emergency stop function for all GPIO lines. If the        emergency stop condition is met and enabled  the output selection is        automatically switched from alternate output function to GPIO input        function.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN11</name>
							<description>Emergency Stop Enable for Pin 15. This bit enables the emergency stop function for all GPIO lines. If the        emergency stop condition is met and enabled  the output selection is        automatically switched from alternate output function to GPIO input        function.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PDISC</name>
					<description>Port 22 Pin Function Decision Control Register
 resetvalue={:0x0,:0x0,After SSW execution:0x0,After SSW execution:0x0}</description>
					<addressOffset>96</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294963200</resetMask>
					<fields>
						<field>
							<name>PDIS0</name>
							<description>Pin Function Decision Control for Pin 15. This bit selects the function of the port pad.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDIS1</name>
							<description>Pin Function Decision Control for Pin 15. This bit selects the function of the port pad.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDIS2</name>
							<description>Pin Function Decision Control for Pin 15. This bit selects the function of the port pad.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDIS3</name>
							<description>Pin Function Decision Control for Pin 15. This bit selects the function of the port pad.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDIS4</name>
							<description>Pin Function Decision Control for Pin 15. This bit selects the function of the port pad.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDIS5</name>
							<description>Pin Function Decision Control for Pin 15. This bit selects the function of the port pad.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDIS6</name>
							<description>Pin Function Decision Control for Pin 15. This bit selects the function of the port pad.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDIS7</name>
							<description>Pin Function Decision Control for Pin 15. This bit selects the function of the port pad.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDIS8</name>
							<description>Pin Function Decision Control for Pin 15. This bit selects the function of the port pad.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDIS9</name>
							<description>Pin Function Decision Control for Pin 15. This bit selects the function of the port pad.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDIS10</name>
							<description>Pin Function Decision Control for Pin 15. This bit selects the function of the port pad.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDIS11</name>
							<description>Pin Function Decision Control for Pin 15. This bit selects the function of the port pad.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OMSR0</name>
					<description>Port 22 Output Modification Set Register 0
 resetvalue={:0x0}</description>
					<addressOffset>112</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PS0</name>
							<description>Set Bit 3. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS1</name>
							<description>Set Bit 3. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS2</name>
							<description>Set Bit 3. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS3</name>
							<description>Set Bit 3. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OMSR4</name>
					<description>Port 22 Output Modification Set Register 4
 resetvalue={:0x0}</description>
					<addressOffset>116</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PS4</name>
							<description>Set Bit 7. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS5</name>
							<description>Set Bit 7. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS6</name>
							<description>Set Bit 7. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS7</name>
							<description>Set Bit 7. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OMSR8</name>
					<description>Port 22 Output Modification Set Register 8
 resetvalue={:0x0}</description>
					<addressOffset>120</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PS8</name>
							<description>Set Bit 11. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS9</name>
							<description>Set Bit 11. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS10</name>
							<description>Set Bit 11. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS11</name>
							<description>Set Bit 11. Setting this bit will set the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OMCR0</name>
					<description>Port 22 Output Modification Clear Register 0
 resetvalue={:0x0}</description>
					<addressOffset>128</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PCL0</name>
							<description>Clear Bit 3. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL1</name>
							<description>Clear Bit 3. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL2</name>
							<description>Clear Bit 3. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL3</name>
							<description>Clear Bit 3. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OMCR4</name>
					<description>Port 22 Output Modification Clear Register 4
 resetvalue={:0x0}</description>
					<addressOffset>132</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PCL4</name>
							<description>Clear Bit 7. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL5</name>
							<description>Clear Bit 7. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL6</name>
							<description>Clear Bit 7. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL7</name>
							<description>Clear Bit 7. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OMCR8</name>
					<description>Port 22 Output Modification Clear Register 8
 resetvalue={:0x0}</description>
					<addressOffset>136</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PCL8</name>
							<description>Clear Bit 11. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL9</name>
							<description>Clear Bit 11. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL10</name>
							<description>Clear Bit 11. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL11</name>
							<description>Clear Bit 11. Setting this bit will clear the corresponding bit in the port output        register Pn OUT. Read as 0.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
