J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>MTU</name>
			<version>100</version>
			<description>MTU</description>
			<baseAddress>4026925056</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>28672</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<cluster>
					<dim>96</dim>
					<dimIncrement>256</dimIncrement>
					<name>MC[%s]</name>
					<description>MC</description>
					<addressOffset>4096</addressOffset>
					<register>
						<name>CONFIG0</name>
						<description>Configuration Registers
 resetvalue={Application Reset:0x2002}</description>
						<addressOffset>0</addressOffset>
						<size>16</size>
						<resetValue>8194</resetValue>
						<resetMask>65535</resetMask>
						<fields>
							<field>
								<name>ACCSTYPE</name>
								<description>Access type   ACCSTYPE. This field specifies the type of access which is being performed to each single address in the current marching element. ACCSTYPE n  specifies the n th access of the marching element. 0 b write access 1 b read access</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>NUMACCS</name>
								<description>Number of accesses per address   NUMACCS. This field specifies the total number of accesses which are being        performed to each single address in the current marching element. Allowed values  0 8  Due to size limitation of CONFIG0.ACCSTYPE and        CONFIG1.ACCSPAT fields . If NUMACCS 0 will not access a memory. If NUMACCS  gt  8  8 accesses will be performed.</description>
								<lsb>12</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CONFIG1</name>
						<description>Configuration Register 1
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>2</addressOffset>
						<size>16</size>
						<resetValue>0</resetValue>
						<resetMask>65535</resetMask>
						<fields>
							<field>
								<name>ACCSPAT</name>
								<description>Access pattern   ACCSPAT. When AG MOD is selected for any test other than the Non Destructive test  this field specifies directly the bit pattern  i.e.  0  or  1   which is being used for an access to each single address in the current marching element. ACCSPAT n  specifies the n th access of the marching element. These patterns are toggled according to MCONTROL.BITTOG and MCONTROL.ROWTOG. When AG MOD selects the Non Destructive test  For corresponding ACCSTYPE as READ or WRITE access  Program 0 when the previous read access was with normal data  and 1 when the previous read was with inverted data. Note  When considering the previous read access  consider that the last access is a previous access to the first  as a  wrap around . Please refer to section on Non Destructive test for more details on how to program these bits.</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SELFASTB</name>
								<description>Select Fast Bit   SELFASTB. This field defines during a 2 i test the address bit position that has the Hamming distance of 1  i. e. changes fastest. Bit 0 of either column or row address is swapped with the indicated bit of either column or row according to MCONTROL.RCADR. MCONTROL.RCADR 0   gt  column MCONTROL.RCADR 1   gt  row</description>
								<lsb>8</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AG_MOD</name>
								<description>Address Generator Mode   AG MOD. These bits enable the special hardware for performing the more complex        addressing schemes. In case RANGE.RAEN  range enable  is set to 0  single access  linear        address mode has to be selected and NUMACCS set to 1.</description>
								<lsb>12</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MCONTROL</name>
						<description>MBIST Control Register
 resetvalue={Application Reset:0x4008}</description>
						<addressOffset>4</addressOffset>
						<size>16</size>
						<resetValue>16392</resetValue>
						<resetMask>65535</resetMask>
						<fields>
							<field>
								<name>START</name>
								<description>START   START. If this bit is written to  160   8217 1  8217  by software the memory test will start. If        it is reset by software  and the test has finished  MSTATUS.DONE will be        set to 1. If MCONTROL.FAILDMP is set  a fail will stop the current execution.        RESUME will continue a suspended test.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RESUME</name>
								<description>Resume failed test   RESUME. This bit allows a test with fail that got suspended to be resumed after        the dump of the fail bit map. A restart is possible only if MSTATUS.FDA        was reset by hardware. It will be reset by hardware once the test is        resumed.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ESTF</name>
								<description>Enable Sticky Fail Bit   ESTF. This bit enables the sticky fail bit MSTATUS.SFAIL. If set any fails        will be collected in MSTATUS.SFAIL. Resetting this bit to 0 will also        reset MSTATUS.SFAIL.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DIR</name>
								<description>Direction Select   DIR. This field specifies the direction of a memory test operation.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DINIT</name>
								<description>Data Initialization Enable   DINIT. This bit enables a write of the RDBFL data to all locations defined by        the range register. RDBFL can contain data that will produce an ECC        error. Execution is started with MCONTROL.START. For this predefined        action any information contained in CONFIG0 1 registers and the bits        BITTOG  ROWTOG and DIR are ignored.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RCADR</name>
								<description>Fast Row   Fast Column Addressing Scheme Select   RCADR. This bit selects between fast row and fast column addressing.   8220 Fast Row  8221         moves along the word lines first and then in bit line direction    8220 Fast        Column  8221  along the bit lines first.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ROWTOG</name>
								<description>Row toggling   ROWTOG. This field specifies whether to toggle the used bit pattern  non        inverted inverted  with each physical memory row. This is required when        writing a checkerboard pattern or a row stripe pattern. For GALPAT this bit has to be 0.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BITTOG</name>
								<description>Bit toggling   BITTOG. This field specifies whether to toggle the used bit pattern  non        inverted inverted  with each physical memory column. This is required        when writing a checkerboard pattern or a column stripe pattern. For GALPAT this bit has to be 0.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FAILDMP</name>
								<description>Fail bitmap dump   FAILDMP. This field enables a dump of the failing address and a fail bit map after a fault has been detected. The memory test is suspended afterwards and resumed by MCONTROL.RESUME. MSTATUS.FDA shows that a fail dump is available. This functionality can be used only if bit MCONTROL.LDRED    xa0 1. In case a fail dump is available  RDBFL will contain the fail bit map and ETRR the failing address.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN_DESCR</name>
								<description>Enable Descrambling. This bit has an effect only when the SSH itself is enabled. If this bit        is set  the internal address de scrambler in the SSH will be enabled. That        is  if this bit is set  the logical addresses generated from the SSH        state machine and given to the SRAM input are translated to physical        addresses. The reset value is 0  hence the de scrambler is not        enabled by default  i.e.         by default the logical addresses are not translated to physical  .</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SRAM_CLR</name>
								<description>Clear the SRAM   SRAM CLR. This bit initializes the complete SRAM with ECC correct  All 0  data. Execution is started with MCONTROL.START. For this predefined action any information contained in CONFIG0 1  RANGE registers and the bits BITTOG  ROWTOG and DIR are ignored. This bit shall not be set together with other initialization or test configurations. After the SRAM clearing is complete  the software has to reset this bit back to  0  before disabling the SSH. From a normal application  it is forbidden to set this bit together with other initialization features. However  in case it happens  then this bit has lower priority than auto data init or partial erase triggered via MTU socket signals  but higher priority than initialization triggered by MCONTROL.DINIT and the effect will be always that of executing the higher priority alone.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MSTATUS</name>
						<description>Status Register
 resetvalue={Application Reset:0x1}</description>
						<addressOffset>6</addressOffset>
						<size>16</size>
						<resetValue>1</resetValue>
						<resetMask>65535</resetMask>
						<fields>
							<field>
								<name>DONE</name>
								<description>DONE   DONE. This bit is reset at the start of a test and set when a test is        completed and MCONTROL.START was reset by software. It is not set when a        test is interrupted for fail dump.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>FAIL</name>
								<description>FAIL   FAIL. This bit will be reset when a test is being started. It will be set to          8216 1  8217  by hardware under the following conditions  a  when performing a test without redundancy  MCONTROL.LDRED   8217 0  8217  and        MCONTROL.USERED   8217 0  8217    FAIL    8217 1  8217  if the memory has at least one fault. Here fault includes any        error in the data  as well as an address error  when enabled via        ALMSRCS.ADDRE. In this case  an application reset has to be issued to        clear the FAIL bit. b  when performing a test with dynamic update of redundancy         MCONTROL.LDRED   8217 1  8217  and MCONTROL.USERED   8217 0  8217    FAIL    8217 1  8217  if the number of memory faults exceeds the number of redundant        cells. In this case  an application reset has to be performed to clear        the FAIL bit. c  when performing a test with pre configured redundancy         MCONTROL.USERED   8217 1  8217    FAIL    8217 1  8217  if the memory or redundancy has at least one fault</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>FDA</name>
								<description>Fail Dump Available   FDA. This bit shows that a fail has occurred if MCONTROL.FAILDMP is set. The        test is suspended and fail dump information is available. The fail bit        map is in RDBFL and the associated address is in ETRR 0 . As long as no        fail has occurred RDBFL contains the last read information and ETRR has        no valid data . This bit will be set by hardware. It will be reset when MSTATUS was read with MSTATUS.FDA   1 and the dump        information was read from ETRR and RDBFL. Only the last read from the        last word of RDBFL is checked by the hardware and taken as an indication        for a complete read. A suspended test will be resumed by MCONTROL.RESUME if FDA was reset.        This forms some sort of handshake to insure that a suspended test can        only be resumed  by a broadcasted  MCONTROL.RESUME if the last fail        information was actually collected.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SFAIL</name>
								<description>Sticky Fail Bit   SFAIL. This bit is set to 1 together with MSTATUS.FAIL provided MCONTROL.ESTF        is set. In contrast to FAIL it will not be reset when a new test is        started. Therefore it will collect fail information over more than one        MBIST run. It will be reset when MCONTROL.ESTF is reset  or MBIST mode        is switched off.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>RANGE</name>
						<description>Range Register  single address mode
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>16</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>ADDR</name>
								<description>Address   ADDR. When RAEN   0 This field specifies the address of a single memory        location. Reads and writes to this location are possible. When RAEN 1  this field is interpreted as 2 different fields. ADDR 13 7         is interpreted as Upper Range Limit. ADDR 6 0  is interpreted as Lower        Range Limit. For smaller SRAMs which require lesser number of address bits  the MSB        bits are reserved. Writes to these bits are ignored  and reads return          8216 0  8217 .</description>
								<lsb>0</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INJERR</name>
								<description>Inject Error   INJERR. Enables Error Injection during march tests. This is supported only        for linear march tests.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RAEN</name>
								<description>Range Enable   RAEN. 0 Disabled  single address mode. In this case a single word can be        addressed for read or write. Config registers have to be set as follows CONFIG.NUMACCS     8220 0001  8221   single access  CONFIG.AG MOD      8220 0000  8221   linear  MCONTROL.DIR   1  up  For read just the value in this location will be delivered. No check        against expected values is made  i.e. MSTATUS.FAIL will not be set. 1 Enabled. ADDR 13 7  is interpreted as Upper Range Limit. ADDR 6 0  is        interpreted as Lower Range Limit.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>REVID</name>
						<description>Revision ID Register
 resetvalue={Application Reset:0x610}</description>
						<addressOffset>12</addressOffset>
						<size>16</size>
						<resetValue>1552</resetValue>
						<resetMask>65535</resetMask>
						<fields>
							<field>
								<name>REV_ID</name>
								<description>Revision Identifier   REV ID. This field defines the currently implemented release  version and        functionality of the used MBIST ECC controller to track the MBIST ECC        version for easier handling at the tester.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ECCS</name>
						<description>ECC Safety Register
 resetvalue={Application Reset:0x1F}</description>
						<addressOffset>14</addressOffset>
						<size>16</size>
						<resetValue>31</resetValue>
						<resetMask>65535</resetMask>
						<fields>
							<field>
								<name>CENE</name>
								<description>ECC Correction Event Alarm Notification Enable   CENE. This bit enables the forwarding of the CE alarm from the SSH to the SMU.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>UCENE</name>
								<description>Uncorrectable Error Affecting SRAM   SSH Operation  Alarm Notification Enable   UENE. This bit enables the forwarding of the UCE alarm from the SSH to        the SMU. Please refer to the section on safety for more details.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MENE</name>
								<description>Miscellaneous Alarm Notification Enable  MENE. This bit enables the forwarding of the ME alarm from the SSH to the SMU.        Please refer to the section on safety for more details.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECE</name>
								<description>Error Correction Enable   ECE. This enables the single bit error correction by the ECC. If this bit is        1  single bit errors are flagged via the CE alarm. If this bit is 0         single bit errors are flagged via the UE alarm.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRE</name>
								<description>Tracking Enable   TRE. All errors will be tracked  if the associated notification enable bit is        set. This bit is enabled by default.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BFLE</name>
								<description>Bit Flip Enable   BFLE</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SFLE</name>
								<description>Signature Bit Flip Enables   SFLE. This bit injects an address error by flipping        the LSB address bit to the address error detection unit  but not to the SRAM. If address error detection is enabled  ALMSRCS.ADDRE   1  and If        this bit is set and the SRAM is read  an address error is notified  and tracked in the ETRR         amp  ERRINFO registers  as well as an alarm is generated  if enabled. Note that for        SRAMs with Address ECC  refer the Appendix chapter for the list   this bit is ignored  and no        error will be generated.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECCMAP</name>
								<description>ECC Bit Mapping Mode   ECCMAP. ECCMAP sets three different test modes to allow access to data or ECC        bits separately and independently. Also         memory bypass  11  mode enables a complete bypass of the whole memory.        The same mode is enabled independently from the bit setting by hardware        if sx ssh com lbist i input signal is set to high. All bypass        modes can only be used if the memory is accessible via some bus by a        processor. Otherwise these modes cannot be supported.</description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TC_TWR_SEL</name>
								<description>TriCore Tower Select   TC TWR SEL. For TriCore PMEM only. This bit selects a cache way to run the        non destructive inversion test on. This bit represents the Tower number.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SFFD</name>
								<description>Safety Flip Flop Diagnostics   SFFD. Safety Flip Flop Diagnostics bit. Setting this bit triggers a Safety        Flip Flop self test. The result of the test  i.e. any error status in        the safety FFs    can be obtained from the OPERR or MISCERR bits in the        FAULTSTS register.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
