J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>ECCD</name>
						<description>Memory ECC Detection Register
 resetvalue={PowerOn Reset:0x0,Application Reset:0x0}</description>
						<addressOffset>16</addressOffset>
						<size>16</size>
						<resetValue>0</resetValue>
						<resetMask>31</resetMask>
						<fields>
							<field>
								<name>SERR</name>
								<description>Error Detected   SERR. Write of   8217 0  8217  clears the sticky status. Write of   8217 1  8217  has no effect. In the case of a write of   8216 0  8217  simultaneously with an error detection         the setting of the bit by hardware will take priority. This bit is reset        with an Application Reset. Read as </description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CERR</name>
								<description>CE alarm occured   CERR. Write of   8217 0  8217  clears the bit  and enables further alarms to be forwarded        to SMU. Write of   8217 1  8217  has no effect. When the bit is set  software can perform additional diagnostics from        the information in the ETRR ERRINFO registers. Please refer to the        safety section for more details. This bit is reset with an Application        Reset. Read as </description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>UCERR</name>
								<description>Uncorrectable Error Alarm Occured   UCERR. Write of   8217 0  8217  clears the bit  and enables further alarms to be forwarded        to SMU. When the bit is set  software can perform additional diagnostics        from the information in the ETRR ERRINFO registers. Please refer to the        safety section for more details. Write of  1  has no effect. This bit is        cleared on an application reset. Read as </description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MERR</name>
								<description>Miscellaneous Error Alarm Occured   MERR. Write of   8217 0  8217  clears the bit  and enables further alarms to be forwarded        to SMU. When the bit is set  software can perform additional diagnostics        from the information in the ETRR ERRINFO and ALMSRCS registers. Please        refer to the safety section for more details. Write of  1  has no        effect. This bit is reset with an application reset. Read as </description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRC</name>
								<description>Tracking Clear   TRC. Writing this bit with  1  clears the EOV  VAL bits plus the ETRR        and ERRINFO registers  depending on the PERMERR settings. This bit will always read 0.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>VAL</name>
								<description>Valid Bits   VAL. Every tracking register  ETRRx  has a valid bit associated. Reset        by ECCD.TRC. 5 error tracking registers are        available and 5 valid bits. These bits are        preserved until a PORST.</description>
								<lsb>5</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>PERMERR</name>
								<description>Permanent Error in ETRR Entry   PERMERR. Denotes an ETRR entry that shall not be cleared by setting the TRC or        moved up when a new error occurs. With this bit set  the corresponding        ETRR ERRINFO entry remain as they are until a PORST.</description>
								<lsb>10</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EOV</name>
								<description>Error Overflow   EOV. The Error Tracking registers have an overflow condition. This bit is preserved until a warm PORST.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>5</dim>
						<dimIncrement>2</dimIncrement>
						<name>ETRR[%s]</name>
						<description>Error Tracking Register 0
 resetvalue={PowerOn Reset:0x0}</description>
						<addressOffset>18</addressOffset>
						<size>16</size>
						<resetValue>0</resetValue>
						<resetMask>65535</resetMask>
						<fields>
							<field>
								<name>ADDR</name>
								<description>Address of Error i    ADDR. Address of the error detected since last clear operation. If some MSB        bits are not required for addressing smaller memories  they are reserved        and read as   8216 0  8217 .</description>
								<lsb>0</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>MBI</name>
								<description>Memory Block Index of Error i    MBI. If more than one memory is implemented in parallel  these three bits        contain the index of the memory block in error to identify the memory in        error and the tracked address belongs to this memory. Otherwise these        bits always are set to 0.</description>
								<lsb>13</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>67</dim>
						<dimIncrement>2</dimIncrement>
						<name>RDBFL[%s]</name>
						<description>Read Data and Bit Flip Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>96</addressOffset>
						<size>16</size>
						<resetValue>0</resetValue>
						<resetMask>65535</resetMask>
						<fields>
							<field>
								<name>WDATA</name>
								<description>Word Data   WDATA. This field contains the data of the last memory read operation.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ALMSRCS</name>
						<description>Alarm Sources Configuration Register
 resetvalue={Application Reset:0x3F}</description>
						<addressOffset>238</addressOffset>
						<size>16</size>
						<resetValue>63</resetValue>
						<resetMask>65535</resetMask>
						<fields>
							<field>
								<name>SBE</name>
								<description>Single Bit Error Notification   Tracking Enable   SBE. This bit enables ECC Single Bit Detection Correction event to be tracked        forwarded to the CE or UCE alarm. If ECCS.ECE bit is  1   then SBE        errors are forwarded to CE alarm. Otherwise to UCE alarm. The error        status can be read from the ERRINFO registers  ERRINFO x .SBERR </description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DBE</name>
								<description>Double Bit Error Notification and Tracking Enable   DBE. This bit enables ECC Double Bit Errors in the SRAM to be tracked and        forwarded as an UCE alarm. The error status can be read from the ERRINFO        registers  ERRINFO.DBERR .</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ADDRE</name>
								<description>Address Error Notification Enable   ADDRE. This bit enables the detection and tracking of Address Faults in the        SRAM  and forward them as a source of UCE alarm. The error status can be        read from the ERRINFO registers  ERRINFO.ADDRERR .</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OVFE</name>
								<description>ETRR Overflow notification enable  OVFE. This bit enables the forwarding of the ETRR Overflow event as an alarm        source to the UCE alarm. The Error information can be obtained via the        ECCD.VALID bits and the EOV bit.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OPENE</name>
								<description>SSH Operational Error Notification Enable   OPENE. This bit enables the forwarding of many errors which are critical to the        operation of the SRAM or SSH. These errors are forwarded as one of the        sources of the UCE alarm. The error status can be read from        FAULTSTS.OPERR bits. This bit is enabled by default.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MISCE</name>
								<description>SSH Misc. Errors Notification Enable   MISCE. This bit enables the forwarding of many errors which may be        critical to the operation of the SRAM or SSH in the future. These errors are forwarded as one        of the sources of the ME alarm. The error status can be read from FAULSTS.MISCERR. This bit is enabled by default.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>FAULTSTS</name>
						<description>SSH Safety Faults Status Register
 resetvalue={PowerOn Reset:0x0}</description>
						<addressOffset>240</addressOffset>
						<size>16</size>
						<resetValue>0</resetValue>
						<resetMask>65535</resetMask>
						<fields>
							<field>
								<name>OPERR</name>
								<description>SSH Critical Operation Error Occured   OPERR. One bit status corresponding to each of the error sources contributing        to the Critical operational error sources to the Un Correctable Error        alarm  UCE . Enabled by ALMSRCS.OPENE. If multiple errors happened         multiple bits are set at the same time. To clear  write  0 . Write of         1  has no effect. Even if any bit is set  further errors are still        forwarded. Unspecified bits are reserved for future use and shall always        return 0.</description>
								<lsb>0</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MISCERR</name>
								<description>SSH Miscellaneous Error Status  MISCERR. One bit status corresponding to each of the error sources contributing        to the Miscellaneous Error  ME  alarm. Enabled by ALMSRCS.MISCE. If        multiple errors happened  multiple bits are set at the same time. To        clear  write  0 . Write of  1  has no effect. Even if any bit is set         further errors are still forwarded. Unspecified bits are reserved for        future use and shall always return 0.</description>
								<lsb>8</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>5</dim>
						<dimIncrement>2</dimIncrement>
						<name>ERRINFO[%s]</name>
						<description>Error Information Register 0
 resetvalue={PowerOn Reset:0x0}</description>
						<addressOffset>242</addressOffset>
						<size>16</size>
						<resetValue>0</resetValue>
						<resetMask>65535</resetMask>
						<fields>
							<field>
								<name>SBERR</name>
								<description>Single Bit Error Detected   SBERR. Read as </description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>DBERR</name>
								<description>Double Bit Error Detected   DBERR. Read as </description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ADDRERR</name>
								<description>Address Fault Detected   ADDRERR. Read as </description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
				</cluster>
				<register>
					<name>CLC</name>
					<description>Clock Control Register
 resetvalue={Application Reset:0x3}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>3</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit   DISR. Used for enable disable control of the module. While any bit of tcu mbist en i x  is asserted  CLC.DISR is ignored and        the MTU kernel clock runs  until all tcu mbist en i x  bits are        deasserted.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit   DISS. Bit indicates the current status of the module If the RMC field is implemented and if it is 0  DISS is set        automatically.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>Resvd</name>
							<description>Resvd   Resvd. Read as 0. Must be written with 0 H</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EDIS</name>
							<description>Sleep Mode Enable Control   EDIS. Used for module Sleep Mode control. While any bit of tcu mbist en i x  is asserted  sleep mode is ignored        and the MTU kernel clock runs  until all tcu mbist en i x  bits are        deasserted.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Identification Register
 resetvalue={Application Reset:0x0B2C003}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>11714563</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MODREV</name>
							<description>Module Revision Number   MODREV. This bit field indicates the revision number of the MTU module  provided        by design team .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODTYPE</name>
							<description>Module Type   MODTYPE. This bit field is C0 H . It defines a        32 bit module</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODNUMBER</name>
							<description>Module Number   MODNUMBER. This bit field defines the module identification number. The idenfication number for the AurixPlus Platform MTU module is 00B2 H</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>4</dimIncrement>
					<name>MEMTEST[%s]</name>
					<description>Memory MBIST Enable Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>16</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CPU0_DMEM_EN</name>
							<description>CPU0 DMEM SSH instance Enable   CPU0 DMEM EN</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU0_DTAG_EN</name>
							<description>CPU0 DTAG SSH instance Enable   CPU0 DTAG EN</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU0_PMEM_EN</name>
							<description>CPU0 PMEM SSH instance Enable   CPU0 PMEM EN</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU0_PTAG_EN</name>
							<description>CPU0 PTAG SSH instance Enable   CPU0 PTAG EN</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU0_DLMU_STBY_EN</name>
							<description>CPU0 STANDBY DLMU SSH instance Enable   CPU0 DLMU STBY EN</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU1_DMEM_EN</name>
							<description>CPU1 DMEM SSH instance Enable   CPU1 DMEM EN</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU1_DTAG_EN</name>
							<description>CPU1 DTAG SSH instance Enable   CPU1 DTAG EN</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU1_PMEM_EN</name>
							<description>CPU1 PMEM SSH instance Enable   CPU1 PMEM EN</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU1_PTAG_EN</name>
							<description>CPU1 PTAG SSH instance Enable   CPU1 PTAG EN</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU1_DLMU_STBY_EN</name>
							<description>CPU1 STANDBY DLMU SSH instance Enable   CPU1 DLMU STBY EN</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU2_DMEM_EN</name>
							<description>CPU2 DMEM SSH instance Enable   CPU2 DMEM EN</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU2_DTAG_EN</name>
							<description>CPU2 DTAG SSH instance Enable   CPU2 DTAG EN</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU2_PMEM_EN</name>
							<description>CPU2 PMEM SSH instance Enable   CPU2 PMEM EN</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU2_PTAG_EN</name>
							<description>CPU2 PTAG SSH instance Enable   CPU2 PTAG EN</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU2_DLMU_EN</name>
							<description>CPU2 DLMU memory SSH instance Enable   CPU2 DLMU EN</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
