J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MEMMAP</name>
					<description>Memory Mapping Enable Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>28</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CPU0_DCMAP</name>
							<description>CPU0 DCache Mapping   CPU0 DCMAP</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MEM15MAP</name>
							<description>MEM31 Mapping Enable   MEM31MAP. Reserved  Not used in this product. Shall be written with zero.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MEM16MAP</name>
							<description>MEM31 Mapping Enable   MEM31MAP. Reserved  Not used in this product. Shall be written with zero.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MEM17MAP</name>
							<description>MEM31 Mapping Enable   MEM31MAP. Reserved  Not used in this product. Shall be written with zero.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MEM18MAP</name>
							<description>MEM31 Mapping Enable   MEM31MAP. Reserved  Not used in this product. Shall be written with zero.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MEM20MAP</name>
							<description>MEM31 Mapping Enable   MEM31MAP. Reserved  Not used in this product. Shall be written with zero.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MEM21MAP</name>
							<description>MEM31 Mapping Enable   MEM31MAP. Reserved  Not used in this product. Shall be written with zero.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MEM22MAP</name>
							<description>MEM31 Mapping Enable   MEM31MAP. Reserved  Not used in this product. Shall be written with zero.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MEM23MAP</name>
							<description>MEM31 Mapping Enable   MEM31MAP. Reserved  Not used in this product. Shall be written with zero.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MEM25MAP</name>
							<description>MEM31 Mapping Enable   MEM31MAP. Reserved  Not used in this product. Shall be written with zero.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MEM26MAP</name>
							<description>MEM31 Mapping Enable   MEM31MAP. Reserved  Not used in this product. Shall be written with zero.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MEM27MAP</name>
							<description>MEM31 Mapping Enable   MEM31MAP. Reserved  Not used in this product. Shall be written with zero.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MEM28MAP</name>
							<description>MEM31 Mapping Enable   MEM31MAP. Reserved  Not used in this product. Shall be written with zero.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU0_DTMAP</name>
							<description>CPU0 DTAG Mapping   CPU0 DTMAP. Read only. Mirrors the state of CPU0 DCMAP. CPU D cache memories may only be mapped simultaneously.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU0_PCMAP</name>
							<description>CPU0 PCACHE Mapping   CPU0 PCMAP</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU0_PTMAP</name>
							<description>CPU0 PTAG Mapping   CPU0 PTMAP. Read only. Mirrors the state of CPU0 PCMAP. CPU P cache memories may only be mapped simultaneously.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_DCMAP</name>
							<description>CPU1 DCache Mapping   CPU1 DCMAP</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU1_DTMAP</name>
							<description>CPU1 DTAG Mapping   CPU1 DTMAP. Read only. Mirrors the state of CPU1 DCMAP. CPU D cache memories may only be mapped simultaneously.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_PCMAP</name>
							<description>CPU1 PCACHE Mapping   CPU1 PCMAP</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU1_PTMAP</name>
							<description>CPU1 PTAG Mapping   CPU1 PTMAP. Read only. Mirrors the state of CPU1 PCMAP. CPU P cache memories may only be mapped simultaneously.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_DCMAP</name>
							<description>CPU2 DCache Mapping   CPU2 DCMAP</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU2_DTMAP</name>
							<description>CPU2 DTAG Mapping   CPU2 DTMAP. Read only. Mirrors the state of CPU2 DCMAP. CPU D cache memories may only be mapped simultaneously.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_PCMAP</name>
							<description>CPU2 PCACHE Mapping   CPU2 PCMAP</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU2_PTMAP</name>
							<description>CPU2 PTAG Mapping   CPU2 PTMAP. Read only. Mirrors the state of CPU2 PCMAP. CPU P cache memories may only be mapped simultaneously.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>4</dimIncrement>
					<name>MEMSTAT[%s]</name>
					<description>Memory Status Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>56</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CPU0_DMEM_AIU</name>
							<description>CPU0 DMEM Partial AutoInitialize of Cache Partition Underway   CPU0 DMEM AIU. This bit indicates whether an automatic data initialization has been        triggered by a change of state of MEMTEST.MEMxEN or MEMxMAP but that the        intialization sequence has not yet completed.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU0_DTAG_AIU</name>
							<description>CPU0 DTAG MBIST AutoInitialize Underway   CPU0 DTAG AIU. This bit indicates whether an automatic data initialization has been        triggered by a change of state of MEMTEST.MEMxEN or MEMxMAP but that the        intialization sequence has not yet completed.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU0_PMEM_AIU</name>
							<description>CPU0 PMEM Partial AutoInitialize of Cache Partition Underway   CPU0 PMEM AIU. This bit indicates whether an automatic data initialization has been        triggered by a change of state of MEMTEST.MEMxEN or MEMxMAP but that the        intialization sequence has not yet completed.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU0_PTAG_AIU</name>
							<description>CPU0 PTAG MBIST AutoInitialize Underway   CPU0 PTAG AIU. This bit indicates whether an automatic data initialization has been        triggered by a change of state of MEMTEST.MEMxEN or MEMxMAP but that the        intialization sequence has not yet completed.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_DMEM_AIU</name>
							<description>CPU1 DMEM Partial AutoInitialize of Cache Partition Underway   CPU1 DMEM AIU. This bit indicates whether an automatic data initialization has been        triggered by a change of state of MEMTEST.MEMxEN or MEMxMAP but that the        intialization sequence has not yet completed.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_DTAG_AIU</name>
							<description>CPU1 DTAG MBIST AutoInitialize Underway   CPU1 DTAG AIU. This bit indicates whether an automatic data initialization has been        triggered by a change of state of MEMTEST.MEMxEN or MEMxMAP but that the        intialization sequence has not yet completed.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_PMEM_AIU</name>
							<description>CPU1 PMEM Partial AutoInitialize of Cache Partition Underway   CPU1 PMEM AIU. This bit indicates whether an automatic data initialization has been        triggered by a change of state of MEMTEST.MEMxEN or MEMxMAP but that the        intialization sequence has not yet completed.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_PTAG_AIU</name>
							<description>CPU1 PTAG MBIST AutoInitialize Underway   CPU1 PTAG AIU. This bit indicates whether an automatic data initialization has been        triggered by a change of state of MEMTEST.MEMxEN or MEMxMAP but that the        intialization sequence has not yet completed.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_DMEM_AIU</name>
							<description>CPU2 DMEM Partial AutoInitialize of Cache Partition Underway   CPU2 DMEM AIU. This bit indicates whether an automatic data initialization has been        triggered by a change of state of MEMTEST.MEMxEN or MEMxMAP but that the        intialization sequence has not yet completed.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_DTAG_AIU</name>
							<description>CPU2 DTAG MBIST AutoInitialize Underway   CPU2 DTAG AIU. This bit indicates whether an automatic data initialization has been        triggered by a change of state of MEMTEST.MEMxEN or MEMxMAP but that the        intialization sequence has not yet completed.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_PMEM_AIU</name>
							<description>CPU2 PMEM Partial AutoInitialize of Cache Partition Underway   CPU2 PMEM AIU. This bit indicates whether an automatic data initialization has been        triggered by a change of state of MEMTEST.MEMxEN or MEMxMAP but that the        intialization sequence has not yet completed.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_PTAG_AIU</name>
							<description>CPU2 PTAG MBIST AutoInitialize Underway   CPU2 PTAG AIU. This bit indicates whether an automatic data initialization has been        triggered by a change of state of MEMTEST.MEMxEN or MEMxMAP but that the        intialization sequence has not yet completed.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>4</dimIncrement>
					<name>MEMDONE[%s]</name>
					<description>Memory Test Done Status Register 0
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
					<addressOffset>80</addressOffset>
					<size>32</size>
					<resetValue>4294967295</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CPU0_DMEM_DONE</name>
							<description>CPU0 DMEM Test Done Status   CPU0 DMEM DONE</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU0_DTAG_DONE</name>
							<description>CPU0 DTAG Test Done Status   CPU0 DTAG DONE</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU0_PMEM_DONE</name>
							<description>CPU0 PMEM Test Done Status   CPU0 PMEM DONE</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU0_PTAG_DONE</name>
							<description>CPU0 PTAG Test Done Status   CPU0 PTAG DONE</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU0_DLMU_STBY_DONE</name>
							<description>CPU0 STANDBY DLMU Test Done Status   CPU0 DLMU STBY DONE</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_DMEM_DONE</name>
							<description>CPU1 DMEM Test Done Status   CPU1 DMEM DONE</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_DTAG_DONE</name>
							<description>CPU1 DTAG Test Done Status   CPU1 DTAG DONE</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_PMEM_DONE</name>
							<description>CPU1 PMEM Test Done Status   CPU1 PMEM DONE</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_PTAG_DONE</name>
							<description>CPU1 PTAG Test Done Status   CPU1 PTAG DONE</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_DLMU_STBY_DONE</name>
							<description>CPU1 STANDBY DLMU Test Done Status   CPU1 DLMU STBY DONE</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_DMEM_DONE</name>
							<description>CPU2 DMEM Test Done Status   CPU2 DMEM DONE</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_DTAG_DONE</name>
							<description>CPU2 DTAG Test Done Status   CPU2 DTAG DONE</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_PMEM_DONE</name>
							<description>CPU2 PMEM Test Done Status   CPU2 PMEM DONE</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_PTAG_DONE</name>
							<description>CPU2 PTAG Test Done Status   CPU2 PTAG DONE</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_DLMU_DONE</name>
							<description>CPU2 DLMU memory Test Done Status   CPU2 DLMU DONE</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>4</dimIncrement>
					<name>MEMFDA[%s]</name>
					<description>Memory Test FDA Status Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>96</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CPU0_DMEM_FDA</name>
							<description>CPU0 DMEM Test FDA Status   CPU0 DMEM FDA</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU0_DTAG_FDA</name>
							<description>CPU0 DTAG Test FDA Status   CPU0 DTAG FDA</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU0_PMEM_FDA</name>
							<description>CPU0 PMEM Test FDA Status   CPU0 PMEM FDA</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU0_PTAG_FDA</name>
							<description>CPU0 PTAG Test FDA Status   CPU0 PTAG FDA</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU0_DLMU_STBY_FDA</name>
							<description>CPU0 STANDBY DLMU Test FDA Status   CPU0 DLMU STBY FDA</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_DMEM_FDA</name>
							<description>CPU1 DMEM Test FDA Status   CPU1 DMEM FDA</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_DTAG_FDA</name>
							<description>CPU1 DTAG Test FDA Status   CPU1 DTAG FDA</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_PMEM_FDA</name>
							<description>CPU1 PMEM Test FDA Status   CPU1 PMEM FDA</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_PTAG_FDA</name>
							<description>CPU1 PTAG Test FDA Status   CPU1 PTAG FDA</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_DLMU_STBY_FDA</name>
							<description>CPU1 STANDBY DLMU Test FDA Status   CPU1 DLMU STBY FDA</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_DMEM_FDA</name>
							<description>CPU2 DMEM Test FDA Status   CPU2 DMEM FDA</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_DTAG_FDA</name>
							<description>CPU2 DTAG Test FDA Status   CPU2 DTAG FDA</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_PMEM_FDA</name>
							<description>CPU2 PMEM Test FDA Status   CPU2 PMEM FDA</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_PTAG_FDA</name>
							<description>CPU2 PTAG Test FDA Status   CPU2 PTAG FDA</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_DLMU_FDA</name>
							<description>CPU2 DLMU memory Test FDA Status   CPU2 DLMU FDA</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
