J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>SCU</name>
			<version>100</version>
			<description>System Control Unit</description>
			<baseAddress>4026753024</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>1024</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<cluster>
					<dim>3</dim>
					<dimIncrement>12</dimIncrement>
					<name>WDTCPU[%s]</name>
					<description>CPU watchdogs</description>
					<addressOffset>588</addressOffset>
					<register>
						<name>WDTCPUyCON0</name>
						<description>CPU0 WDT Control Register 0
 resetvalue={Application Reset:0x0FFFC000E,Application Reset:0x0FFFC000F}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>4294705166</resetValue>
						<resetMask>4294967294</resetMask>
						<fields>
							<field>
								<name>ENDINIT</name>
								<description>End of Initialization Control Bit   ENDINIT. This bit must be written with a   8216 1  8217  during a Password Access or Check        Access  although this write is only used for the password protection        mechanism and is not stored . This bit must be written with the required        ENDINIT update value during a Modify Access. This bit is intended for accessing registers with   8220 CEy  8221  protection  y         CPU number . It may also be used to access registers with   8220 E  8221         protection  but the alternate register EICON0.ENDINIT is recommended for        this purpose so that the Watchdog Timer is not affected.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>LCK</name>
								<description>Lock Bit to Control Access to WDTxCON0   LCK. The current value of LCK is controlled by hardware. It is cleared after        a valid Password Access to WDTxCON0 when WDTxSR.US is 0  or when        WDTxSR.US is 1 and the SMU is in RUN mode   and it is automatically set        again after a valid Modify Access to WDTxCON0. During a write to        WDTxCON0  the value written to this bit is only used for the        password protection mechanism and is not stored. This bit must be cleared during a Password Access to WDTxCON0  and set        during a Modify Access to WDTxCON0. A Check Access does not clear LCK.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PW</name>
								<description>User Definable Password Field for Access to WDTxCON0   PW. This bit field is written with an initial password value during a Modify        Access. A read from this bitfield returns this initial password  but bits  7 2         are inverted  toggled  to ensure that a simple read write is not        sufficient to service the WDTx.  This        also provides backward compatibility  If corresponding WDTxSR.PAS   0 then this bit field must be written with        its current contents during a Password Access or Check Access. If corresponding WDTxSR.PAS   1 then this bit field must be written with        the next password in the LFSR sequence during a Password Access or Check        Access The default password after Application Reset is 00000000111100 B</description>
								<lsb>2</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REL</name>
								<description>Reload Value for the WDT  also Time Check Value    REL. The reload value can be changed during a Modify Access to WDTxCON0         Default after Application Reset        is FFFC H  .If the Watchdog Timer is        enabled and in Normal Timer Mode  it will start counting from this value        after a correct Watchdog service. A read from this bitfield always returns the current reload value. During a Password Access or a Check Access this bitfield may be used for        additional checks. Writes during such checks have no effect upon the        reload value. If corresponding WDTxSR.TCS 0 then this bit field must be written with        its current contents during a Password Access or Check Access. If corresponding WDTxSR.TCS 1 then this bit field must be written with        an inverted estimate of the current WDTxSR.TIM value during a Password        Access or Check Access.</description>
								<lsb>16</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>WDTCPUyCON1</name>
						<description>CPU0 WDT Control Register 1
 resetvalue={Application Reset:0x0,Application Reset:0x08}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967287</resetMask>
						<fields>
							<field>
								<name>IR0</name>
								<description>Input Frequency Request Control   IR1 IR0. Bit IR0 and IR1 should be programmed together to determine the WDT timer        frequency. These bits can only be modified if the corresponding WDTxCON0.ENDINIT is        cleared. WDTxSR.IS0 and WDTxSR.IS1 are updated by these bit only when        ENDINIT is set again. As long as ENDINIT is cleared  WDTxSR.IS0 and        WDTxSR.IS1 controls the current input frequency of the Watchdog Timer.        When ENDINIT is set again  WDTxSR.IS0 andWDTxSR.IS1 are updated with the        values of IR0 and IR1.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DR</name>
								<description>Disable Request Control Bit   DR. This bit can only be modified if the corresponding WDTxCON0.ENDINIT is        cleared. WDTxSR.DS is updated when ENDINIT is set again. As long as the        ENDINIT is cleared  bit WDTxSR.DS controls the current enable disable        status of the WDTx. When the ENDINIT is set again with a Valid Modify        Access  WDTxSR.DS is updated with the state of DR.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IR1</name>
								<description>Input Frequency Request Control   IR1 IR0. Bit IR0 and IR1 should be programmed together to determine the WDTx        timer frequency These bits can only be modified if the corresponding WDTxCON0.ENDINIT is        cleared. WDTxSR.IS0 and WDTxSR.IS1 are updated by these bit only when        ENDINIT is set again. As long as ENDINIT is cleared  WDTxSR.IS0 and        WDTxSR.IS1 control the current input frequency of the Watchdog Timer.        When ENDINIT is set again  WDTxSR.IS0 and WDTxSR.IS1 are updated with        the values of IR0 and IR1.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>UR</name>
								<description>Unlock Restriction Request Control Bit   UR. This bit can only be modified if the corresponding WDTxCON0.ENDINIT is        cleared. WDTxSR.US is updated when ENDINIT is set again. As long as the        ENDINIT is cleared  bit WDTxSR.US controls whether unlocking is possible        at all times or only when the SMU is not in the FAULT state. When the        ENDINIT is set again with a Valid Modify Access  WDTxSR.US is updated        with the state of UR.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PAR</name>
								<description>Password Auto sequence Request Bit   PAR. This bit can only be modified if the corresponding WDTxCON0.ENDINIT is        cleared. WDTxSR.PAS is updated when ENDINIT is set again. As long as the        ENDINIT is cleared  bit WDTxSR.PAS controls password sequencing. When        the ENDINIT is set again with a Valid Modify Access  WDTxSR.PAS is        updated with the state of PAR.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TCR</name>
								<description>Counter Check Request Bit   TCR. This bit can only be modified if the corresponding WDTxCON0.ENDINIT is        cleared. WDTxSR.TCS is updated when ENDINIT is set again. As long as the        ENDINIT is cleared  bit WDTxSR.TCS controls whether counter check is        enabled. When the ENDINIT is set again with a Valid Modify Access         WDTxSR.TCS is updated with the state of TCR</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TCTR</name>
								<description>Timer Check Tolerance Request   TCTR. This bit can only be modified if the corresponding WDTxCON0.ENDINIT is        cleared. WDTxSR.TCT is updated when ENDINIT is set again. As long as the        ENDINIT is cleared  bit WDTxSR.TCT controls the tolerance of timer        checks. When the ENDINIT is set again with a Valid Modify Access         WDTxSR.TCT is updated with the state of TCTR</description>
								<lsb>9</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>WDTCPUySR</name>
						<description>CPU0 WDT Status Register
 resetvalue={Application Reset:0x0FFFC0010,Application Reset:0x0FFFC0008}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>4294705152</resetValue>
						<resetMask>4294967271</resetMask>
						<fields>
							<field>
								<name>AE</name>
								<description>Watchdog Access Error Status Flag   AE. This bit is set when an illegal Password Access or Modify Access to        register WDTxCON0 was attempted. This bit is only cleared when        WDTxCON0.ENDINIT is set during a valid Modify Access</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>OE</name>
								<description>Watchdog Overflow Error Status Flag   OE. This bit is set when the WDTx overflows from FFFF H to 0000 H . This bit is only cleared        when WDTxCON0.ENDINIT is set to 1 during a valid Modify Access.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>IS0</name>
								<description>Watchdog Input Clock Status   IS1 IS0. Bit IS0 and IS1 should be programmed together. These bits indicate the        current WDTx clock rate. These bits are updated with the state of bits        WDTxCON1.IR0 and WDTxCON1.IR1 after WDTxCON0.ENDINIT is written with 1        during a valid Modify Access to register WDTxCON0.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>DS</name>
								<description>Watchdog Enable Disable Status Flag   DS. This bit is updated with the state of bit WDTxCON1.DR  after        WDTxCON0.ENDINIT is set during a Valid Modify Access to register        WDTxCON0  and it is cleared when Time Out mode is entered.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TO</name>
								<description>Watchdog Time Out Mode Flag   TO. This bit is set when Time Out Mode is entered. It is automatically        cleared when Time Out Mode is left.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>IS1</name>
								<description>Watchdog Input Clock Status   IS1 IS0. Bit IS0 and IS1 should be programmed together. These bits indicate the        current WDTx clock rate. These bits are updated with the state of bits        WDTxCON1.IR0 and WDTxCON1.IR1 after WDTxCON0.ENDINIT is written with 1        during a valid Modify Access to register WDTxCON0.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>US</name>
								<description>SMU Unlock Restriction Status Flag   US. WDTxCON0.LCK will not be unlocked by a valid Password Access if this bit        is   8216 1  8217  and the SMU is not in the FAULT state</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>PAS</name>
								<description>Password Auto sequence Status Flag   PAS. This bit is updated with the state of bit WDTxCON1.PAR after        WDTxCON0.ENDINIT is written with 1 during a valid Modify Access to        register WDTxCON0.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TCS</name>
								<description>Timer Check Status Flag   TCS. This bit is updated with the state of bit WDTxCON1.TCR after        WDTxCON0.ENDINIT is written with 1 during a Valid Modify Access to        register WDTxCON0.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TCT</name>
								<description>Timer Check Tolerance   TCT. This field determines the tolerance of the timer check during Password        or Check Access  See TCS .This bit is updated with the state of bit        WDTxCON1.TCTR after WDTxCON0.ENDINIT is written with 1 during a Valid        Modify Access to register WDTxCON0.</description>
								<lsb>9</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TIM</name>
								<description>Timer Value   TIM. Reflects the current content of the WDTx.</description>
								<lsb>16</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<name>WDTS</name>
					<description>WDTS</description>
					<addressOffset>680</addressOffset>
					<register>
						<name>WDTSCON0</name>
						<description>Safety WDT Control Register 0
 resetvalue={Application Reset:0x0FFFC000E}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>4294705166</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ENDINIT</name>
								<description>End of Initialization Control Bit   ENDINIT. This bit must be written with a   8216 1  8217  during a Password Access or Check        Access  although this write is only used for the password protection        mechanism and is not stored . This bit must be written with the required        ENDINIT update value during a Modify Access. This bit may be used to access registers with   8220 SE  8221  protection  but the        alternate register SEICON0.ENDINIT is recommended for this purpose so        that the Watchdog Timer is not affected.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>LCK</name>
								<description>Lock Bit to Control Access to WDTxCON0   LCK. The current value of LCK is controlled by hardware. It is cleared after        a valid Password Access to WDTxCON0 when WDTxSR.US is 0  or when        WDTxSR.US is 1 and the SMU is in RUN mode   and it is automatically set        again after a valid Modify Access to WDTxCON0. During a write to        WDTxCON0  the value written to this bit is only used for the        password protection mechanism and is not stored. This bit must be cleared during a Password Access to WDTxCON0  and set        during a Modify Access to WDTxCON0. A Check Access does not clear LCK.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PW</name>
								<description>User Definable Password Field for Access to WDTxCON0   PW. This bit field is written with an initial password value during a Modify        Access. A read from this bitfield returns this initial password  but bits  7 2         are inverted  toggled  to ensure that a simple read write is not        sufficient to service the WDTx.  This        also provides backward compatibility  If corresponding WDTxSR.PAS   0 then this bit field must be written with        its current contents during a Password Access or Check Access. If corresponding WDTxSR.PAS   1 then this bit field must be written with        the next password in the LFSR sequence during a Password Access or Check        Access The default password after Application Reset is 00000000111100 B</description>
								<lsb>2</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REL</name>
								<description>Reload Value for the WDT  also Time Check Value    REL. The reload value can be changed during a Modify Access to WDTxCON0         Default after Application Reset        is FFFC H  .If the Watchdog Timer is        enabled and in Normal Timer Mode  it will start counting from this value        after a correct Watchdog service. A read from this bitfield always returns the current reload value. During a Password Access or a Check Access this bitfield may be used for        additional checks. Writes during such checks have no effect upon the        reload value. If corresponding WDTxSR.TCS 0 then this bit field must be written with        its current contents during a Password Access or Check Access. If corresponding WDTxSR.TCS 1 then this bit field must be written with        an inverted estimate of the current WDTxSR.TIM value during a Password        Access or Check Access.</description>
								<lsb>16</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>WDTSCON1</name>
						<description>Safety WDT Control Register 1
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CLRIRF</name>
								<description>Clear Internal Reset Flag   CLRIRF. This bit is used to request a clear of the internal flag which indicates        whether a previous SMU reset has already been requested After modification  the internal flag is only cleared when Safety        Endinit  SE  is re asserted. As long as Safety ENDINIT SE  is not        asserted  the internal flag is unchanged and continues to determine the        response to a further SMU reset request. When Safety ENDINIT is        reasserted  the internal flag is cleared together with this bit.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IR0</name>
								<description>Input Frequency Request Control   IR1 IR0. Bit IR0 and IR1 should be programmed together to determine the WDTx        timer frequency. WDTxSR.IS0 and WDTxSR.IS1 are updated by these bits only when Safety        ENDINIT  SE  is re asserted. As long as Safety ENDINIT is de asserted         WDTxSR.IS0 and WDTxSR.IS1 control the current input frequency of the        Safety Watchdog Timer. When Safety ENDINIT is reasserted  WDTxSR.IS0 and        WDTxSR.IS1 are updated with the values of IR0 and IR1.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DR</name>
								<description>Disable Request Control Bit   DR. This bit can only be modified when Safety ENDINIT  SE  is de asserted.        WDTxSR.DS is updated when Safety ENDINIT is re asserted. As long as        Safety ENDINIT is de asserted  bit WDTxSR.DS controls the current        enable disable status of the WDTx. When Safety ENDINIT is reasserted         WDTxSR.DS is updated with the state of DR.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IR1</name>
								<description>Input Frequency Request Control   IR1 IR0. Bit IR0 and IR1 should be programmed together to determine the WDTx        timer frequency WDTxSR.IS0 and WDTxSR.IS1 are updated by these bits only when Safety        ENDINIT  SE  is re asserted. As long as Safety ENDINIT is de asserted         WDTxSR.IS0 and WDTxSR.IS1 control the current input frequency of the        Safety Watchdog Timer. When Safety ENDINIT is reasserted  WDTxSR.IS0 and        WDTxSR.IS1 are updated with the values of IR0 and IR1.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>UR</name>
								<description>Unlock Restriction Request Control Bit   UR. This bit can only be modified when Safety ENDINIT  SE  is de asserted.        WDTxSR.US is updated when Safety ENDINIT is reasserted. As long as the        Safety ENDINIT is cleared  bit WDTxSR.US controls whether unlocking is        possible at all times or only when the SMU is not in the FAULT state.        When Safety ENDINIT is reasserted  WDTxSR.US is updated with the state        of UR.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PAR</name>
								<description>Password Auto sequence Request Bit   PAR. This bit can only be modified when Safety ENDINIT is de asserted.        WDTxSR.PAS is updated when Safety ENDINIT is reasserted. As long as        Safety ENDINIT is de asserted  bit WDTxSR.PAS controls password        sequencing. When Safety ENDINIT is reasserted  WDTxSR.PAS is updated        with the state of PAR.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TCR</name>
								<description>Counter Check Request Bit   TCR. This bit can only be modified when Safety ENDINIT  SE  is de asserted.        WDTxSR.TCS is updated when Safety ENDINIT is re asserted. As long as        Safety ENDINIT is de asserted  bit WDTxSR.TCS controls whether counter        check is enabled. When Safety ENDINIT is reasserted  WDTxSR.TCS is        updated with the state of TCR</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TCTR</name>
								<description>Timer Check Tolerance Request   TCTR. This bit can only be modified when Safety ENDINIT is de asserted.        WDTxSR.TCT is updated when Safety ENDINIT is reasserted. As long as        Safety ENDINIT is de asserted  bit WDTxSR.TCT controls the tolerance of        timer checks. When Safety ENDINIT is re asserted  WDTxSR.TCT is updated        with the state of TCTR.</description>
								<lsb>9</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
