J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>WDTSSR</name>
						<description>Safety WDT Status Register
 resetvalue={Application Reset:0x0FFFC0010}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>4294705168</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>AE</name>
								<description>Watchdog Access Error Status Flag   AE. This bit is set when an illegal Password Access or Modify Access to        register WDTxCON0 was attempted. This bit is only cleared when        WDTxCON0.ENDINIT is set during a valid Modify Access</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>OE</name>
								<description>Watchdog Overflow Error Status Flag   OE. This bit is set when the WDTx overflows from FFFF H to 0000 H . This bit is only cleared        when WDTxCON0.ENDINIT is set to 1 during a valid Modify Access.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>IS0</name>
								<description>Watchdog Input Clock Status   IS1 IS0. Bit IS0 and IS1 should be programmed together. These bits indicate the        current WDTx clock rate. These bits are updated with the state of bits        WDTxCON1.IR0 and WDTxCON1.IR1 after WDTxCON0.ENDINIT is written with 1        during a valid Modify Access to register WDTxCON0.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>DS</name>
								<description>Watchdog Enable Disable Status Flag   DS. This bit is updated with the state of bit WDTxCON1.DR  after        WDTxCON0.ENDINIT is set during a Valid Modify Access to register        WDTxCON0  and it is cleared when Time Out mode is entered.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TO</name>
								<description>Watchdog Time Out Mode Flag   TO. This bit is set when Time Out Mode is entered. It is automatically        cleared when Time Out Mode is left.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>IS1</name>
								<description>Watchdog Input Clock Status   IS1 IS0. Bit IS0 and IS1 should be programmed together. These bits indicate the        current WDTx clock rate. These bits are updated with the state of bits        WDTxCON1.IR0 and WDTxCON1.IR1 after WDTxCON0.ENDINIT is written with 1        during a valid Modify Access to register WDTxCON0.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>US</name>
								<description>SMU Unlock Restriction Status Flag   US. WDTxCON0.LCK will not be unlocked by a valid Password Access if this bit        is   8216 1  8217  and the SMU is not in the FAULT state</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>PAS</name>
								<description>Password Auto sequence Status Flag   PAS. This bit is updated with the state of bit WDTxCON1.PAR after        WDTxCON0.ENDINIT is written with 1 during a valid Modify Access to        register WDTxCON0.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TCS</name>
								<description>Timer Check Status Flag   TCS. This bit is updated with the state of bit WDTxCON1.TCR after        WDTxCON0.ENDINIT is written with 1 during a Valid Modify Access to        register WDTxCON0.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TCT</name>
								<description>Timer Check Tolerance   TCT. This field determines the tolerance of the timer check during Password        or Check Access  See TCS .This bit is updated with the state of bit        WDTxCON1.TCTR after WDTxCON0.ENDINIT is written with 1 during a Valid        Modify Access to register WDTxCON0.</description>
								<lsb>9</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TIM</name>
								<description>Timer Value   TIM. Reflects the current content of the WDTx.</description>
								<lsb>16</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>ESRCFGx[%s]</name>
					<description>ESRCFGx</description>
					<addressOffset>112</addressOffset>
					<register>
						<name>ESRCFGx</name>
						<description>ESR0 Input Configuration Register
 resetvalue={System Reset:0x100}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>256</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>EDCON</name>
								<description>Edge Detection Control   EDCON. This bit field defines the edges that lead to an ESRx trigger of the        synchronous path.</description>
								<lsb>7</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
				<register>
					<name>ID</name>
					<description>Identification Register
 resetvalue={System Reset:0x0C4C0C1}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>12894401</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MODREV</name>
							<description>Module Revision Number   MODREV. This bit field indicates the revision number of the SCU module  C1 H  . Bits  5 0  defines the SCU module IP revision number. Bits  7 6  defines        the family. This allows a continuous numbering of the revision AND a        deviation of the different SCU generations. The revision number starts        with 000001 and is incremented when a SCU change is detectable by        customer software. MODREV for other variants will be defined by Design Team</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODTYPE</name>
							<description>Module Type   MODTYPE. This bit field is C0 H . It defines a 32 bit module</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODNUMBER</name>
							<description>Module Number   MODNUMBER. This bit field defines the module identification number. The identification number for the SCU is 00C4 H</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSCON</name>
					<description>System Control Register
 resetvalue={System Reset:0x0}</description>
					<addressOffset>124</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CCTRIG0</name>
							<description>Capture Compare Trigger 0   CCTRIG0. This bit is used to trigger the Synchronous Start feature of the CCU6.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RAMINTM</name>
							<description>RAM Integrity Modify   RAMINTM</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SETLUDIS</name>
							<description>Set Latch Update Disable   SETLUDIS. Setting this bit sets bit STSTAT.LUDIS. Clearing this bit has no effect. This bit reads always as zero.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>DDC</name>
							<description>Disable DXCPL   DDC. Drives signal to TCU</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EMSR</name>
					<description>Emergency Stop Register
 resetvalue={Application Reset:0x1}</description>
					<addressOffset>252</addressOffset>
					<size>32</size>
					<resetValue>1</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>POL</name>
							<description>Input Polarity   POL. This bit determines the polarity of the configured Emergency Stop input.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE</name>
							<description>Mode Selection   MODE. This bit determines the operating mode of the emergency stop signal.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENON</name>
							<description>Enable ON   ENON. This bit enables the setting of flag EMSF by an inactive to active level transition of input signal.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PSEL</name>
							<description>PORT Select   PSEL. This bit selects which one of the two Emergency Stop port options is monitored.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EMSF</name>
							<description>Emergency Stop Flag   EMSF. This bit indicates that a synchronous mode port triggered emergency stop        condition has occurred.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SEMSF</name>
							<description>SMU Emergency Stop Flag   SEMSF. This bit indicates that an SMU Safety Alarm triggered emergency stop        condition has occurred.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EMSSW</name>
					<description>Emergency Stop Software set and clear register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>256</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EMSFM</name>
							<description>Emergency Stop Flag Modification   EMSFM. This bit field sets or clears flag EMSF via software. In case of a simultaneous hardware and software modification request         the hardware operation will be executed. EMSFM is always read as 00 B .</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SEMSFM</name>
							<description>SMU Emergency Stop Flag Modification   SEMSFM. This bit field sets or clears flag SEMSF via software. In case of a simultaneous hardware and software modification request         the hardware operation will be executed. SEMSFM is always read as 00 B .</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LCLCON0</name>
					<description>LCL CPU0 and CPU2 Control Register
 resetvalue={Cold PowerOn Reset:0x080018001,Cold PowerOn Reset:0x080010000,Cold PowerOn Reset:0x080018001}</description>
					<addressOffset>308</addressOffset>
					<size>32</size>
					<resetValue>2147549184</resetValue>
					<resetMask>4294934526</resetMask>
					<fields>
						<field>
							<name>LS0</name>
							<description>Lockstep Mode Status   LS0. This bit indicates whether CPU0 is currently running in lockstep monitor        mode</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LSEN0</name>
							<description>Lockstep Enable   LSEN0. This bit may only be written by SSW during boot. Enable lockstep CPU monitoring for the associated processor core  CPU0. After cold reset  lockstep is enabled by default. The LSEN bit may be        cleared during the boot to disable lockstep mode. SMU lockstep fault        reporting should be disabled when lockstep is disabled.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LCLCON1</name>
					<description>LCL CPU1 and CPU3 Control Register
 resetvalue={Cold PowerOn Reset:0x080018001,Cold PowerOn Reset:0x080010000,Cold PowerOn Reset:0x0,Cold PowerOn Reset:0x080018001}</description>
					<addressOffset>312</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>2147385342</resetMask>
					<fields>
						<field>
							<name>LS1</name>
							<description>Lockstep Mode Status   LS1. This bit indicates whether CPU1 is currently running in lockstep monitor        mode</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LSEN1</name>
							<description>Lockstep Enable   LSEN1. This bit may only be written by SSW during boot. Enable lockstep CPU monitoring for the associated processor core  CPU1.       If the product has no lockstep capability for CPU1  then this enables only the PFLASH access monitoring for CPU1. After cold reset  lockstep is enabled by default. The LSEN bit may be        cleared during the boot to disable lockstep mode. SMU lockstep fault        reporting should be disabled when lockstep is disabled.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LCLTEST</name>
					<description>LCL Test Register
 resetvalue={System Reset:0x0}</description>
					<addressOffset>316</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LCLT0</name>
							<description>LCL0 Lockstep Test   LCLT0. Fault injection for LCL0. Reads as zero.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LCLT1</name>
							<description>LCL1 Lockstep Test   LCLT1. Fault injection for LCL1. Reads as zero.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LCLT2</name>
							<description>LCL2 Lockstep Test   LCLT2. Fault injection for LCL2. Reads as zero.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PLCLT0</name>
							<description>PFI0 Lockstep Test. Fault injection for PFI0 lockstep. Reads as zero.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PLCLT1</name>
							<description>PFI1 Lockstep Test . Fault injection for PFI1 lockstep. Reads as zero.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PLCLT2</name>
							<description>PFI2 Lockstep Test . Fault injection for PFI2 lockstep. Reads as zero.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CHIPID</name>
					<description>Chip Identification Register
 resetvalue={System Reset:0x0,CFS Value:0x0}</description>
					<addressOffset>320</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>CHREV</name>
							<description>Chip Revision Number   CHREV. This bit field indicates the revision number of the AurixPlus        Platform device. The value of this bit field is defined in the        product Data Sheet. Bits  3 0  are connected to the layer prog inputs  3 0 . Bits         3 0  are used to indicate the steps. These updates can be done with any        metal fix or FW ROM change. Bits  5 4  are hard wired on top level. Bits  5 4  define the        major silicon design steps  A  B  C  D  ... . These bits can be changed        only with a major redesign.</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CHTEC</name>
							<description>Chip Family   CHTEC. These bits indicate the product family and are changed only with a redesign. Hard wired on top level.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CHPK</name>
							<description>Chip Package   CHPK. These bits indicate the package. For further details refer to the Product Datasheet Updated by SSW from config sector. Use future variant codes for downconfigured silicon</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CHID</name>
							<description>Chip Product   CHID. These bits indicate the base product. For further details refer to the Product Datasheet Updated by SSW from config sector.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EEA</name>
							<description>Emulation or ADAS Extension Available   EEA. Indicates if the emulation or ADAS extension hardware is available or not.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>UCODE</name>
							<description>µCode Version   UCODE. This bit field displays the Version X.Y of the flash µCode.</description>
							<lsb>17</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FSIZE</name>
							<description>Program Flash Size   FSIZE. This bit field indicates available program flash size for this device. For more details see Product Datasheet.</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VART</name>
							<description>Variant   VART. This bit field is used for variant identification. It is used to identify product variants with non standard temperature profile  max frequency  package pitch or customer feature sets. Note that variants do not include HSM availability  Flash Size or Emulation availability options which are handled by the SEC  FSIZE and EEA fields respectively. For coding details see Product Datasheet</description>
							<lsb>28</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEC</name>
							<description>Security Device Available   SEC. This bit field is updated by SSW from config sector. This bit field indicates whether the product has a Hardware Security Module</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MANID</name>
					<description>Manufacturer Identification Register
 resetvalue={System Reset:0x1820}</description>
					<addressOffset>324</addressOffset>
					<size>32</size>
					<resetValue>6176</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DEPT</name>
							<description>Department Identification Number   DEPT.   00 H   indicates the Automotive  amp  Industrial microcontroller department within Infineon Technologies.</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MANUF</name>
							<description>Manufacturer Identification Number   MANUF. This is a JEDEC normalized manufacturer code. MANUF   C1 H stands for Infineon Technologies.</description>
							<lsb>5</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWAPCTRL</name>
					<description>Address Map Control Register
 resetvalue={System Reset:0x1}</description>
					<addressOffset>332</addressOffset>
					<size>32</size>
					<resetValue>1</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRCFG</name>
							<description>Address Configuration. Configures the currently used address map  standard alternate selection </description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<writeConstraint>
								<range>
									<minimum>0</minimum>
									<maximum>3</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>Spare</name>
							<description>Spare address configuration registers. Spare read write bits</description>
							<lsb>2</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
