J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>LBISTCTRL0</name>
					<description>Logic BIST Control 0 Register
 resetvalue={System Reset:0x0,CFS Value:0x400}</description>
					<addressOffset>356</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4025483267</resetMask>
					<fields>
						<field>
							<name>LBISTREQ</name>
							<description>LBIST Request   LBISTREQ. If written high this bit requests the execution of an automatic        scan test procedure. The request will only be approved if LBISTCTRL0 .LBISTDONE        bit reflects a   8217 0  8217  value  i.e. no LBIST procedure was triggered since        the last power on reset or LBIST controller has been restarted through        the LBISTCTRL0 .LBISTRES bit .        If read this bit always returns a   8216 0  8217 . This bit shall be implemented in a safety relevant way to avoid        unintended activation of LBIST during application. LBIST execution time depends on the number of scan loads as defined in          the PATTERNS field.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LBISTRES</name>
							<description>LBIST Reset  LBISTRES. If written high this bit synchronously brings back the LBIST controller to its initial Reset Idle state and also clears the stored MISR signature to allow another execution from CPU side. As a consequence the LBISTCTRL0 .LBISTDONE  and SCU LBISTCTRL3.SIGNATURE bits will be set to   x2019 0  x2019 . If read this bit always returns a   x2018 0  x2019 . It is strongly recommended to not change the LBISTFREQU parameter in LBISTCTRL1 after this bit has been set to  1   because there is no guarantee that the new frequency parameter value will be transferred to the LBIST controller in time before the next LBIST run is started from user side  i.e. LBISTCTRL0.LBISTREQ is set to  1  .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PATTERNS</name>
							<description>LBIST Pattern Number   PATTERNS. This field defines the number of scan patterns  i.e. scan loads   which        will be executed during the LBIST procedure. Please note that the value        programmed to this field determines the number scan capture phases not        the number of scan chain load unload phases  i.e. a value of 0x00001        will result in two scan chain loads with on capture in between  a value        of 0x00002 will result in 3 scan chain loads with 2 captures  etc. .        Consequently a value of 0x00000 is not valid  because no capture would        be executed in this case.</description>
							<lsb>2</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LBISTDONE</name>
							<description>LBIST Execution Indicator   LBISTDONE. This bit indicates the actual LBIST controller execution status </description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LBISTERRINJ</name>
							<description>LBIST   Test Mode Alarm Error Injection. If written high this bit trigger both  the LBIST  and the        test mode alarm. This is required to allow self testing of all        LBIST  and test mode  related safety mechanisms in the TCU. The bit will        be reset automatically once the LBIST and test mode alarm indicator        signals from TCU are asserted. From these indicator signals SCU will        also generate corresponding alarm trigger signals for SMU.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LBISTREQRED</name>
							<description>LBIST Request Redundancy. This bit represents the safety double of LBISTCTRL0.LBISTREQ. In order        to generate a new LBIST request both  LBISTREQRED and LBISTREQ bits must        be set to high due to safety reasons. The request will only be approved        if LBISTCTRL0.LBISTDONE bit reflects a  0  value. If read this bit        always returns a  0 .</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LBISTCTRL1</name>
					<description>Logic BIST Control 1 Register
 resetvalue={System Reset:0x0,CFS Value:0x54000007}</description>
					<addressOffset>360</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>2885681144</resetMask>
					<fields>
						<field>
							<name>SEED</name>
							<description>LBIST Seed   SEED. This field determines  which pattern is applied to the EDT channel        inputs 1 19 during LBIST execution.</description>
							<lsb>0</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SPLITSH</name>
							<description>LBIST Split Shift Selection   SPLITSH. The value of this bit will allow to run LBIST with partitioned        scan shift operation in order to reduce the power consumption.</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BODY</name>
							<description>Body Application Indicator   BODY. The value of this bit will determine the static reset behavior of all GPIOs during LBIST execution. If set to low GPIOs will show a weak pull up behavior  if set to high GPIOs are constrained to tri state. A high value must be written to this bit in case LBIST shall be executed for body applications.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LBISTFREQU</name>
							<description>LBIST Frequency Selection   LBISTFREQU. Through this register field a pre scaler factor between 1..16 is selectable for LBIST operation clock  derived from EVR oscillator . This will allow to determine the LBIST scan shift frequency. Value of these bits will be mirrored inside of LBIST controller and become effective if a new LBIST procedure has been successfully initiated from system side  via LBISTCTRL0 .LBISTREQ . It is strongly recommended not to change the value of this field after LBISTCTRL0.LBISTRES has been set to high  because there is no guarantee that the new frequency parameter value will be transferred to the LBIST controller in time before the next LBIST run is started from user side  i.e. LBISTCTRL0.LBISTREQ is set to  1  </description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LBISTCTRL2</name>
					<description>Logic BIST Control 2 Register
 resetvalue={System Reset:0x0,CFS Value:0x3D}</description>
					<addressOffset>364</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967234</resetMask>
					<fields>
						<field>
							<name>LENGTH</name>
							<description>LBIST Maximum Scan Chain Length   LENGTH. This field defines the number of shift cycles for each LBIST scan load. It will be automatically loaded with the product specific value  stored in Flash config sector during startup software execution.</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LBISTCTRL3</name>
					<description>Logic BIST Control 3 Register
 resetvalue={System Reset:0x0,CFS Value:0x0}</description>
					<addressOffset>368</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SIGNATURE</name>
							<description>LBIST Signature   SIGNATURE. This field reflects the MISR signature from the last LBIST execution. It is mirrored from LBIST controller inside TCU and only valid if LBISTCTRL0 .LBISTDONE is read with a high value. In case of a restart of the LBIST controller  via LBISTCTRL0 .LBISTRES function   the signature value will be synchronously reset to all 0. Please address the specific device appendix document for a description on the SIGNATURE value  depending on the LBIST run configuration.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STMEM1</name>
					<description>Start up Memory Register 1
 resetvalue={PowerOn Reset:0x0}</description>
					<addressOffset>388</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MEM</name>
							<description>Memory   MEM. This register is used by the start up software as memory.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STMEM2</name>
					<description>Start up Memory Register 2
 resetvalue={System Reset:0x0}</description>
					<addressOffset>392</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MEM</name>
							<description>Memory   MEM. This register is used by the start up software as memory.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STMEM3</name>
					<description>Start up Memory Register 3
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>448</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MEM</name>
							<description>Memory   MEM. This register is used by the start up software as memory.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STMEM4</name>
					<description>Start up Memory Register 4
 resetvalue={Cold PowerOn Reset:0x0}</description>
					<addressOffset>452</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MEM</name>
							<description>Memory   MEM. This register is used by the start up software as memory.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STMEM5</name>
					<description>Start up Memory Register 5
 resetvalue={PowerOn Reset:0x0}</description>
					<addressOffset>456</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MEM</name>
							<description>Memory   MEM. This register is used by the start up software as memory.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STMEM6</name>
					<description>Start up Memory Register 6
 resetvalue={System Reset:0x0}</description>
					<addressOffset>460</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MEM</name>
							<description>Memory   MEM. This register is used by the start up software as memory.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OVCENABLE</name>
					<description>Overlay Enable Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>480</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>OVEN0</name>
							<description>Overlay Enable 0   OVEN0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OVEN1</name>
							<description>Overlay Enable 1  If product has CPU1    OVEN1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OVEN2</name>
							<description>Overlay Enable 2  If product has CPU2    OVEN2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OVCCON</name>
					<description>Overlay Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>484</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CSEL0</name>
							<description>CPU Select 0   CSEL0. Return 0 if read.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CSEL1</name>
							<description>CPU Select 1  If product has CPU1    CSEL1. Return 0 if read.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CSEL2</name>
							<description>CPU Select 2  If product has CPU2    CSEL2. Return 0 if read.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OVSTRT</name>
							<description>Overlay Start   OVSTRT. CPUs which are not selected are not affected. No action is taken if OVSTP is also set. Return 0 if read.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OVSTP</name>
							<description>Overlay Stop   OVSTP. CPUs which are not selected are not affected No action is taken if OVSTRT is also set. Return 0 if read.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>DCINVAL</name>
							<description>Data Cache Invalidate   DCINVAL. No function in devices without data cache in CPU. This bit  when set  generates a pulse on signal ... ovc dcinval. Data Cache is affected only in the CPUs selected with CSEL. Return 0 if read.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OVCONF</name>
							<description>Overlay Configured   OVCONF. Overlay configured status bit This bit may be used as handshake bit between a debug device  via JTAG        interface and Cerberus  and CPU s .</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>POVCONF</name>
							<description>Write Protection for OVCONF   POVCONF. This bit enables OVCONF write during OVCCON write. Return 0 if read.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EIFILT</name>
					<description>External Input Filter Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>524</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FILRQ0A</name>
							<description>Filter Enable for REQ0A   FILRQ0A</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ5A</name>
							<description>Filter Enable for REQ5A   FILRQ5A</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ2A</name>
							<description>Filter Enable for REQ2A   FILRQ2A</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ3A</name>
							<description>Filter Enable for REQ3A   FILRQ3A</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ0C</name>
							<description>Filter Enable for REQ0C   FILRQ0C</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ1C</name>
							<description>Filter Enable for REQ1C   FILRQ1C</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ3C</name>
							<description>Filter Enable for REQ3C   FILRQ3C</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ2C</name>
							<description>Filter Enable for REQ2C   FILRQ2C</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ4A</name>
							<description>Filter Enable for REQ4A   FILRQ4A</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ6A</name>
							<description>Filter Enable for REQ6A   FILRQ6A</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ1A</name>
							<description>Filter Enable for REQ1A   FILRQ1A</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ7A</name>
							<description>Filter Enable for REQ7A   FILRQ7A</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ6D</name>
							<description>Filter Enable for REQ6D   FILRQ6D</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ4D</name>
							<description>Filter Enable for REQ4D   FILRQ4D</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ2B</name>
							<description>Filter Enable for REQ2B   FILRQ2B</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ3B</name>
							<description>Filter Enable for REQ3B   FILRQ3B</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ7C</name>
							<description>Filter Enable for REQ7C   FILRQ7C</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FILTDIV</name>
							<description>Digital Glitch Filter Clock Predivider   FILTDIV. This field controls a predivider to generate the digital filter sample clock T filt   T spb   FILTDIV A value of zero in this register disables all glitch filtering.</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DEPTH</name>
							<description>Digital Glitch Filter Depth   DEPTH. DEPTH determines the number of port input samples considered in the calculation of the floating average digital filter output for all enabled FLRQ filters. A value of zero in this register disables all glitch filtering.</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>4</dimIncrement>
					<name>EICRi[%s]</name>
					<description>External Input Channel Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>528</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EXIS0</name>
							<description>External Input Selection 0   EXIS0. This bit field determines which input line is selected for Input Channel  2i .</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN0</name>
							<description>Falling Edge Enable 0   FEN0. This bit determines if the falling edge of Input Channel  2i  is used to set bit INTF 2i .</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REN0</name>
							<description>Rising Edge Enable 0   REN0. This bit determines if the rising edge of Input Channel  2 i  is used to set bit INTF 2i .</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LDEN0</name>
							<description>Level Detection Enable 0   LDEN0. This bit determines if bit INTF 2i  is cleared automatically if an edge of the input Input Channel  2i  is detected  which has not been selected  rising edge with REN0   0 or falling edge with FEN0   0 .</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EIEN0</name>
							<description>External Input Enable 0   EIEN0. This bit enables the generation of a trigger event for request channel  2i   e.g. for interrupt generation  when a selected edge is detected.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INP0</name>
							<description>Input Node Pointer   INP0. This bit field determines the destination  output channel  for trigger event  2i   if enabled by EIEN 2i  .</description>
							<lsb>12</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EXIS1</name>
							<description>External Input Selection 1   EXIS1. This bit field determines which input line is selected for Input Channel  2i 1 .</description>
							<lsb>20</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN1</name>
							<description>Falling Edge Enable 1   FEN1. This bit determines if the falling edge of Input Channel  2i 1  is used to set bit INTF 2i 1 .</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REN1</name>
							<description>Rising Edge Enable 1   REN1. This bit determines if the rising edge of Input Channel  2i 1  is used to set bit INTF 2i 1 .</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LDEN1</name>
							<description>Level Detection Enable 1   LDEN1. This bit determines if bit INTF 2i 1  is cleared automatically if an edge of the input Input Channel  2i 1  is detected  which has not been selected  rising edge with REN1   0 or falling edge with FEN1   0 .</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EIEN1</name>
							<description>External Input Enable 1   EIEN1. This bit enables the generation of a trigger event for request channel  2i 1   e.g. for interrupt generation  when a selected edge is detected.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INP1</name>
							<description>Input Node Pointer   INP1. This bit field determines the destination  output channel  for trigger event  2i 1   if enabled by EIEN 2i 1  .</description>
							<lsb>28</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
