J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>EIFR</name>
					<description>External Input Flag Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>544</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>INTF0</name>
							<description>External Event Flag of Channel 7   INTF7. This bit monitors the status flag of the event trigger condition for the input channel x. This bit is automatically cleared when the selected condition  see RENx  FENx  is no longer met  if LDENx   1  or remains set until it is cleared by software  if LDENx   0 .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>INTF1</name>
							<description>External Event Flag of Channel 7   INTF7. This bit monitors the status flag of the event trigger condition for the input channel x. This bit is automatically cleared when the selected condition  see RENx  FENx  is no longer met  if LDENx   1  or remains set until it is cleared by software  if LDENx   0 .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>INTF2</name>
							<description>External Event Flag of Channel 7   INTF7. This bit monitors the status flag of the event trigger condition for the input channel x. This bit is automatically cleared when the selected condition  see RENx  FENx  is no longer met  if LDENx   1  or remains set until it is cleared by software  if LDENx   0 .</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>INTF3</name>
							<description>External Event Flag of Channel 7   INTF7. This bit monitors the status flag of the event trigger condition for the input channel x. This bit is automatically cleared when the selected condition  see RENx  FENx  is no longer met  if LDENx   1  or remains set until it is cleared by software  if LDENx   0 .</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>INTF4</name>
							<description>External Event Flag of Channel 7   INTF7. This bit monitors the status flag of the event trigger condition for the input channel x. This bit is automatically cleared when the selected condition  see RENx  FENx  is no longer met  if LDENx   1  or remains set until it is cleared by software  if LDENx   0 .</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>INTF5</name>
							<description>External Event Flag of Channel 7   INTF7. This bit monitors the status flag of the event trigger condition for the input channel x. This bit is automatically cleared when the selected condition  see RENx  FENx  is no longer met  if LDENx   1  or remains set until it is cleared by software  if LDENx   0 .</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>INTF6</name>
							<description>External Event Flag of Channel 7   INTF7. This bit monitors the status flag of the event trigger condition for the input channel x. This bit is automatically cleared when the selected condition  see RENx  FENx  is no longer met  if LDENx   1  or remains set until it is cleared by software  if LDENx   0 .</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>INTF7</name>
							<description>External Event Flag of Channel 7   INTF7. This bit monitors the status flag of the event trigger condition for the input channel x. This bit is automatically cleared when the selected condition  see RENx  FENx  is no longer met  if LDENx   1  or remains set until it is cleared by software  if LDENx   0 .</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FMR</name>
					<description>Flag Modification Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>548</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FS0</name>
							<description>Set Flag INTFx for Channel 7   FS7. Setting this bit will set the corresponding bit INTFx in register EIFR. Reading this bit always delivers a 0. If both FSx and FCx are set in the same access then the bit x in register EIFR is not modified.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FS1</name>
							<description>Set Flag INTFx for Channel 7   FS7. Setting this bit will set the corresponding bit INTFx in register EIFR. Reading this bit always delivers a 0. If both FSx and FCx are set in the same access then the bit x in register EIFR is not modified.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FS2</name>
							<description>Set Flag INTFx for Channel 7   FS7. Setting this bit will set the corresponding bit INTFx in register EIFR. Reading this bit always delivers a 0. If both FSx and FCx are set in the same access then the bit x in register EIFR is not modified.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FS3</name>
							<description>Set Flag INTFx for Channel 7   FS7. Setting this bit will set the corresponding bit INTFx in register EIFR. Reading this bit always delivers a 0. If both FSx and FCx are set in the same access then the bit x in register EIFR is not modified.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FS4</name>
							<description>Set Flag INTFx for Channel 7   FS7. Setting this bit will set the corresponding bit INTFx in register EIFR. Reading this bit always delivers a 0. If both FSx and FCx are set in the same access then the bit x in register EIFR is not modified.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FS5</name>
							<description>Set Flag INTFx for Channel 7   FS7. Setting this bit will set the corresponding bit INTFx in register EIFR. Reading this bit always delivers a 0. If both FSx and FCx are set in the same access then the bit x in register EIFR is not modified.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FS6</name>
							<description>Set Flag INTFx for Channel 7   FS7. Setting this bit will set the corresponding bit INTFx in register EIFR. Reading this bit always delivers a 0. If both FSx and FCx are set in the same access then the bit x in register EIFR is not modified.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FS7</name>
							<description>Set Flag INTFx for Channel 7   FS7. Setting this bit will set the corresponding bit INTFx in register EIFR. Reading this bit always delivers a 0. If both FSx and FCx are set in the same access then the bit x in register EIFR is not modified.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FC0</name>
							<description>Clear Flag INTFx for Channel 7   FC7. Setting this bit will clear the corresponding bit INTFx in register EIFR. Reading this bit always delivers a 0. If both FSx and FCx are set in the same access then the bit x in register EIFR is not modified.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FC1</name>
							<description>Clear Flag INTFx for Channel 7   FC7. Setting this bit will clear the corresponding bit INTFx in register EIFR. Reading this bit always delivers a 0. If both FSx and FCx are set in the same access then the bit x in register EIFR is not modified.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FC2</name>
							<description>Clear Flag INTFx for Channel 7   FC7. Setting this bit will clear the corresponding bit INTFx in register EIFR. Reading this bit always delivers a 0. If both FSx and FCx are set in the same access then the bit x in register EIFR is not modified.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FC3</name>
							<description>Clear Flag INTFx for Channel 7   FC7. Setting this bit will clear the corresponding bit INTFx in register EIFR. Reading this bit always delivers a 0. If both FSx and FCx are set in the same access then the bit x in register EIFR is not modified.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FC4</name>
							<description>Clear Flag INTFx for Channel 7   FC7. Setting this bit will clear the corresponding bit INTFx in register EIFR. Reading this bit always delivers a 0. If both FSx and FCx are set in the same access then the bit x in register EIFR is not modified.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FC5</name>
							<description>Clear Flag INTFx for Channel 7   FC7. Setting this bit will clear the corresponding bit INTFx in register EIFR. Reading this bit always delivers a 0. If both FSx and FCx are set in the same access then the bit x in register EIFR is not modified.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FC6</name>
							<description>Clear Flag INTFx for Channel 7   FC7. Setting this bit will clear the corresponding bit INTFx in register EIFR. Reading this bit always delivers a 0. If both FSx and FCx are set in the same access then the bit x in register EIFR is not modified.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FC7</name>
							<description>Clear Flag INTFx for Channel 7   FC7. Setting this bit will clear the corresponding bit INTFx in register EIFR. Reading this bit always delivers a 0. If both FSx and FCx are set in the same access then the bit x in register EIFR is not modified.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PDRR</name>
					<description>Pattern Detection Result Register
 resetvalue={Application Reset:0x0FF}</description>
					<addressOffset>552</addressOffset>
					<size>32</size>
					<resetValue>255</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PDR0</name>
							<description>Pattern Detection Result of Channel 7   PDR7. This bit monitors the output status of the pattern detection for the output channel y.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PDR1</name>
							<description>Pattern Detection Result of Channel 7   PDR7. This bit monitors the output status of the pattern detection for the output channel y.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PDR2</name>
							<description>Pattern Detection Result of Channel 7   PDR7. This bit monitors the output status of the pattern detection for the output channel y.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PDR3</name>
							<description>Pattern Detection Result of Channel 7   PDR7. This bit monitors the output status of the pattern detection for the output channel y.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PDR4</name>
							<description>Pattern Detection Result of Channel 7   PDR7. This bit monitors the output status of the pattern detection for the output channel y.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PDR5</name>
							<description>Pattern Detection Result of Channel 7   PDR7. This bit monitors the output status of the pattern detection for the output channel y.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PDR6</name>
							<description>Pattern Detection Result of Channel 7   PDR7. This bit monitors the output status of the pattern detection for the output channel y.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PDR7</name>
							<description>Pattern Detection Result of Channel 7   PDR7. This bit monitors the output status of the pattern detection for the output channel y.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>4</dimIncrement>
					<name>IGCRj[%s]</name>
					<description>Flag Gating Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>556</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>IPEN00</name>
							<description>Flag Pattern Enable for Channel 0   IPEN07. Bit IPEN0x determines if the flag INTFx of channel x takes part in the pattern detection for the gating of the requests for the output signals GOUT 2 j  and IOUT 2 j .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN01</name>
							<description>Flag Pattern Enable for Channel 0   IPEN07. Bit IPEN0x determines if the flag INTFx of channel x takes part in the pattern detection for the gating of the requests for the output signals GOUT 2 j  and IOUT 2 j .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN02</name>
							<description>Flag Pattern Enable for Channel 0   IPEN07. Bit IPEN0x determines if the flag INTFx of channel x takes part in the pattern detection for the gating of the requests for the output signals GOUT 2 j  and IOUT 2 j .</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN03</name>
							<description>Flag Pattern Enable for Channel 0   IPEN07. Bit IPEN0x determines if the flag INTFx of channel x takes part in the pattern detection for the gating of the requests for the output signals GOUT 2 j  and IOUT 2 j .</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN04</name>
							<description>Flag Pattern Enable for Channel 0   IPEN07. Bit IPEN0x determines if the flag INTFx of channel x takes part in the pattern detection for the gating of the requests for the output signals GOUT 2 j  and IOUT 2 j .</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN05</name>
							<description>Flag Pattern Enable for Channel 0   IPEN07. Bit IPEN0x determines if the flag INTFx of channel x takes part in the pattern detection for the gating of the requests for the output signals GOUT 2 j  and IOUT 2 j .</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN06</name>
							<description>Flag Pattern Enable for Channel 0   IPEN07. Bit IPEN0x determines if the flag INTFx of channel x takes part in the pattern detection for the gating of the requests for the output signals GOUT 2 j  and IOUT 2 j .</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN07</name>
							<description>Flag Pattern Enable for Channel 0   IPEN07. Bit IPEN0x determines if the flag INTFx of channel x takes part in the pattern detection for the gating of the requests for the output signals GOUT 2 j  and IOUT 2 j .</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GEEN0</name>
							<description>Generate Event Enable 0   GEEN0. Bit GEEN0 enables the generation of a trigger event for output channel         2 j  when the result of the pattern detection changes. When using this        feature  a trigger  e.g. for an interrupt  is generated during the first        clock cycle when a pattern is detected or when it is no longer detected.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IGP0</name>
							<description>Interrupt Gating Pattern 0   IGP0. In each register IGCRj  bit field IGP0 determines how the pattern        detection influences the output lines GOUT 2j  and IOUT 2j .</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN10</name>
							<description>Interrupt Pattern Enable for Channel 1   IPEN17. Bit IPEN 2j 1 x determines if the flag INTFx of channel  2j 1  takes part in the pattern detection for the gating of the requests for the output signals GOUT 2j 1  and IOUT 2j 1 .</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN11</name>
							<description>Interrupt Pattern Enable for Channel 1   IPEN17. Bit IPEN 2j 1 x determines if the flag INTFx of channel  2j 1  takes part in the pattern detection for the gating of the requests for the output signals GOUT 2j 1  and IOUT 2j 1 .</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN12</name>
							<description>Interrupt Pattern Enable for Channel 1   IPEN17. Bit IPEN 2j 1 x determines if the flag INTFx of channel  2j 1  takes part in the pattern detection for the gating of the requests for the output signals GOUT 2j 1  and IOUT 2j 1 .</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN13</name>
							<description>Interrupt Pattern Enable for Channel 1   IPEN17. Bit IPEN 2j 1 x determines if the flag INTFx of channel  2j 1  takes part in the pattern detection for the gating of the requests for the output signals GOUT 2j 1  and IOUT 2j 1 .</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN14</name>
							<description>Interrupt Pattern Enable for Channel 1   IPEN17. Bit IPEN 2j 1 x determines if the flag INTFx of channel  2j 1  takes part in the pattern detection for the gating of the requests for the output signals GOUT 2j 1  and IOUT 2j 1 .</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN15</name>
							<description>Interrupt Pattern Enable for Channel 1   IPEN17. Bit IPEN 2j 1 x determines if the flag INTFx of channel  2j 1  takes part in the pattern detection for the gating of the requests for the output signals GOUT 2j 1  and IOUT 2j 1 .</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN16</name>
							<description>Interrupt Pattern Enable for Channel 1   IPEN17. Bit IPEN 2j 1 x determines if the flag INTFx of channel  2j 1  takes part in the pattern detection for the gating of the requests for the output signals GOUT 2j 1  and IOUT 2j 1 .</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN17</name>
							<description>Interrupt Pattern Enable for Channel 1   IPEN17. Bit IPEN 2j 1 x determines if the flag INTFx of channel  2j 1  takes part in the pattern detection for the gating of the requests for the output signals GOUT 2j 1  and IOUT 2j 1 .</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GEEN1</name>
							<description>Generate Event Enable 1   GEEN1. Bit GEEN1 enables the generation of a trigger event for output channel         2j 1  when the result of the pattern detection changes. When using this        feature  a trigger  e.g. for an interrupt  is generated during the first        clock cycle when a pattern is detected  or when it is no longer detected.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IGP1</name>
							<description>Interrupt Gating Pattern 1   IGP1. In each register IGCRj  bit field IGP1 determines how the pattern detection influences the output lines GOUT 2j 1  and IOUT 2j 1 .</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
