J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>EICON0</name>
					<description>ENDINIT Global Control Register 0
 resetvalue={Application Reset:0x0FFFC000E}</description>
					<addressOffset>668</addressOffset>
					<size>32</size>
					<resetValue>4294705166</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ENDINIT</name>
							<description>End of Initialization Control Bit   ENDINIT. The current value of ENDINIT is controlled by hardware. It is cleared        after a valid EndInit Password Access to EICON0  and it is automatically        set again after a valid EndInit Modify Access to EICON0. During a write        to EICON0  the value written to this bit is only used for the        password protection mechanism and is not stored. This bit must be cleared during a Password Access to EICON0  and set        during a Modify Access to EICON0.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EPW</name>
							<description>User Definable ENDINIT Password Field   EPW. This bit field is written with an ENDINIT password value during a Modify        Access. This password is independent from the CPU WDT passwords. A read from this bitfield returns this password  but bits  7 2  are        inverted  toggled  to ensure that a simple read write is not sufficient        to service the WDT. This bit field must be written with its current contents during a        Password Access. The default ENDINIT password after Application Reset is 00000000111100 B</description>
							<lsb>2</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REL</name>
							<description>Reload Value for the ENDINIT Timeout Counter   REL. The reload value for the ENDINIT Timeout Counter is fixed. This bitfield        always reads as FFFCh and cannot be changed. This bit field must be written with its current contents during a        Password Access. During a Modify Access this bitfield may contain any        value and is ignored.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EICON1</name>
					<description>ENDINIT Global Control Register 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>672</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>IR0</name>
							<description>Input Frequency Request Control   IR1 IR0. Bit IR0 and IR1 should be programmed together to determine the ENDINIT        Timeout Counter frequency. These bits can only be modified if system ENDINIT  E  is de asserted.        EISR.IS0 and EISR.IS1 are updated by these bits only when system ENDINIT         E  is re asserted. As long as system ENDINIT  E  is de asserted         EISR.IS0 and EISR.IS1 control the current input frequency of the ENDINIT        Timeout Timer. When System ENDINIT  E  is re asserted  EISR.IS0 and        EISR.IS1 are updated with the new values of IR0 and IR1.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DR</name>
							<description>Disable Request Control Bit   DR. This bit can only be modified if the system ENDINIT  E  is de asserted.        EISR.DS is updated when system ENDINIT  E  is re asserted. As long as        system ENDINIT E  is cleared  bit EISR.DS controls the current        enable disable status of the ENDINIT Timeout Counter. When system        ENDINIT  E  is re asserted  EISR.DS is updated with the state of DR.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IR1</name>
							<description>Input Frequency Request Control   IR1 IR0. Bit IR0 and IR1 should be programmed together to determine the ENDINIT        Timeout Counter frequency. These bits can only be modified if system ENDINIT  E  is de asserted.        EISR.IS0 and EISR.IS1 are updated by these bits only when system ENDINIT         E  is re asserted. As long as system ENDINIT  E  is de asserted         EISR.IS0 and EISR.IS1 control the current input frequency of the ENDINIT        Timeout Timer. When System ENDINIT  E  is re asserted  EISR.IS0 and        EISR.IS1 are updated with the new values of IR0 and IR1.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EISR</name>
					<description>ENDINIT Timeout Counter Status Register
 resetvalue={Application Reset:0x0FFFC0000}</description>
					<addressOffset>676</addressOffset>
					<size>32</size>
					<resetValue>4294705152</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>AE</name>
							<description>EICON0 Access Error Status Flag   AE. This bit is set when an illegal Password Access or Modify Access to        register EICON0 was attempted. This bit is only cleared on a valid        EICON0.ENDINIT Modify Access</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OE</name>
							<description>EI Timeout Overflow Error Status Flag   OE. This bit is set when EISR.TIM overflows from FFFF H to FFFC H . This bit is only cleared on        a valid EICON0 Modify Access.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IS0</name>
							<description>EI Timeout Input Clock Status   IS1 IS0. Bit IS0 and IS1 should be programmed together. These bits indicate the        current ENDINIT Timeout Counter frequency.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DS</name>
							<description>EI Timeout Enable Disable Status Flag   DS</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TO</name>
							<description>EI Time Out Mode Flag   TO</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IS1</name>
							<description>EI Timeout Input Clock Status   IS1 IS0. Bit IS0 and IS1 should be programmed together. These bits indicate the        current ENDINIT Timeout Counter frequency.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TIM</name>
							<description>Timer Value   TIM. Reflects the current content of the ENDINIT Timeout Counter.  Only        bits 17 and 16 are implemented in EISR. Others return   8216 1  8217  </description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SEICON0</name>
					<description>Safety ENDINIT Control Register 0
 resetvalue={Application Reset:0x0FFFC000E}</description>
					<addressOffset>692</addressOffset>
					<size>32</size>
					<resetValue>4294705166</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ENDINIT</name>
							<description>End of Initialization Control Bit   ENDINIT. The current value of ENDINIT is controlled by hardware. It is cleared        after a valid EndInit Password Access to SEICON0  and it is        automatically set again after a valid EndInit Modify Access to SEICON0.        During a write to SEICON0  the value written to this bit is only used        for the password protection mechanism and is not stored. This bit must be cleared during a Password Access to SEICON0  and set        during a Modify Access to SEICON0.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EPW</name>
							<description>User Definable Safety ENDINIT Password Field   EPW. This bit field is written with an ENDINIT password value during a Modify        Access. This password is independent from the CPU WDT or WDTS passwords. A read from this bitfield returns this password  but bits  7 2  are        inverted  toggled  to ensure that a simple read write is not sufficient        to service the Safety ENDINIT Timeout Counter. This bit field must be written with its current contents during a        Password Access. The default ENDINIT password after Application Reset is 00000000111100 B</description>
							<lsb>2</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REL</name>
							<description>Reload Value for the Safety  ENDINIT Timeout Counter   REL. The reload value for the Safety ENDINIT Timeout Counter is fixed. This        bitfield always reads as FFFCh and cannot be changed. This bit field must be written with its current contents during a        Password Access. During a Modify Access this bitfield may contain any        value and is ignored.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SEICON1</name>
					<description>Safety ENDINIT Control Register 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>696</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>IR0</name>
							<description>Input Frequency Request Control   IR1 IR0. Bit IR0 and IR1 should be programmed together to determine the Safety        ENDINIT Timeout Counter frequency. These bits can only be modified when Safety ENDINIT  SE  is de asserted.        SEISR.IS0 and SEISR.IS1 are updated by these bits only when Safety        ENDINIT  SE  is re asserted. As long as an Safety ENDINIT is cleared         SEISR.IS0 and SEISR.IS1 control the current input frequency of the        Safety ENDINIT Timeout Timer. When Safety ENDINIT SE  is re asserted         SEISR.IS0 and SEISR.IS1 are updated with the new values of IR0 and IR1.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DR</name>
							<description>Disable Request Control Bit   DR. This bit can only be modified when Safety ENDINIT  SE  is de asserted.        SEISR.DS is updated when Safety ENDINIT is re asserted. As long as        Safety ENDINIT is deasserted  bit SEISR.DS controls the current        enable disable status of the WDT. When Safety ENDINIT is re asserted         SEISR.DS is updated with the state of DR.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IR1</name>
							<description>Input Frequency Request Control   IR1 IR0. Bit IR0 and IR1 should be programmed together to determine the Safety        ENDINIT Timeout Counter frequency. These bits can only be modified when Safety ENDINIT  SE  is de asserted.        SEISR.IS0 and SEISR.IS1 are updated by these bit only when Safety        ENDINIT  SE  is re asserted. As long as an ENDINIT is cleared  SEISR.IS0        and SEISR.IS1 control the current input frequency of the ENDINIT Timeout        Counter. When Safety ENDINIT SE  is re asserted  SEISR.IS0 and SEISR.IS1        is updated with the new values of IR0 and IR1.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SEISR</name>
					<description>Safety ENDINIT Timeout Status Register
 resetvalue={Application Reset:0x0FFFC0000}</description>
					<addressOffset>700</addressOffset>
					<size>32</size>
					<resetValue>4294705152</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>AE</name>
							<description>SEICON0 Access Error Status Flag   AE. This bit is set when an illegal Password Access or Modify Access to        register SEICON0 was attempted. This bit is only cleared on a valid        SEICON0.ENDINIT Modify Access</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OE</name>
							<description>SEI Timeout Overflow Error Status Flag   OE. This bit is set when SEISR.TIM overflows from FFFF H to FFFC H . This bit is only cleared on        a valid SEICON0 Modify Access.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IS0</name>
							<description>SEI Timeout Input Clock Status   IS0  IS1. Bit IS0 and IS1 should be programmed together. These bits inidicate the        current Safety ENDINIT Timeout Counter clock period. They are updated        with the state of bits SEICON1.IR0 and SEICON1.IR1 after a valid SEICON0        Modify Access.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DS</name>
							<description>SEI Enable Disable Status Flag   DS</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TO</name>
							<description>SEI Time Out Mode Flag   TO</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IS1</name>
							<description>SEI Timeout Input Clock Status   IS0  IS1. Bit IS0 and IS1 should be programmed together. These bits inidicate the        current Safety ENDINIT Timeout Counter clock period . They are updated        with the state of bits SEICON1.IR0 and SEICON1.IR1 after a valid SEICON0        Modify Access.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TIM</name>
							<description>Timer Value   TIM. Reflects the current content of the Safety EINDINIT Timeout Counter.  Only        bits 17 and 16 are implemented in SEISR. Others return   8216 1  8217  </description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
