J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>RSTSTAT</name>
					<description>Reset Status Register
 resetvalue={Cold PowerOn Reset:0x3810000,Cold PowerOn Reset:0x13810000,Cold PowerOn Reset:0x10010000}</description>
					<addressOffset>80</addressOffset>
					<size>32</size>
					<resetValue>65536</resetValue>
					<resetMask>3759144959</resetMask>
					<fields>
						<field>
							<name>ESR0</name>
							<description>Reset Request Trigger Reset Status for ESR0   ESR0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ESR1</name>
							<description>Reset Request Trigger Reset Status for ESR1   ESR1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SMU</name>
							<description>Reset Request Trigger Reset Status for SMU   SMU.  See SMU section for SMU trigger sources  including Watchdog Timers </description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SW</name>
							<description>Reset Request Trigger Reset Status for SW   SW</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>STM0</name>
							<description>Reset Request Trigger Reset Status for STM0 Compare Match   STM0</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>STM1</name>
							<description>Reset Request Trigger Reset Status for STM1 Compare Match  If Product has STM1    STM1</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>STM2</name>
							<description>Reset Request Trigger Reset Status for STM2 Compare Match  If Product has STM2    STM2</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PORST</name>
							<description>Reset Request Trigger Reset Status for PORST   PORST. This bit is also set if the bits CB0  CB1  and CB3 are set in parallel.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CB0</name>
							<description>Reset Request Trigger Reset Status for Cerberus System Reset   CB0</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CB1</name>
							<description>Reset Request Trigger Reset Status for Cerberus Debug Reset   CB1</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CB3</name>
							<description>Reset Request Trigger Reset Status for Cerberus Application Reset   CB3</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EVRC</name>
							<description>Reset Request Trigger Reset Status for EVRC   EVRC</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EVR33</name>
							<description>Reset Request Trigger Reset Status for EVR33   EVR33</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SWD</name>
							<description>Reset Request Trigger Reset Status for Supply Watchdog  SWD    SWD. The Supply Watchdog trigger is described in Power Management Controller          8220 Supply Monitoring  8221  chapter</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSMS</name>
							<description>Reset Request Trigger Reset Status for HSM System Reset  HSM S    HSMS</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSMA</name>
							<description>Reset Request Trigger Reset Status for HSM Application Reset  HSM A    HSMA</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>STBYR</name>
							<description>Reset Request Trigger Reset Status for Standby Regulator Watchdog  STBYR    STBYR</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LBPORST</name>
							<description>LBIST termination due to PORST. This bitfield indicates if the LBIST was early terminated due to the occurrence of a Power On Reset. If the status of this bitfield is 0  the application must still check the LBTERM to check if the LBIST was terminated properly. This bitfield is cleared when the RSTCON2.CLRC is set.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LBTERM</name>
							<description>LBIST was properly terminated. This bitfield indicates if the LBIST was terminated properly. This bitfield is cleared when the RSTCON2.CLRC is set.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RSTCON</name>
					<description>Reset Configuration Register
 resetvalue={PowerOn Reset:0x282,PowerOn Reset:0x282}</description>
					<addressOffset>88</addressOffset>
					<size>32</size>
					<resetValue>642</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ESR0</name>
							<description>ESR0 Reset Request Trigger Reset Configuration   ESR0. This bit field defines which reset is generated by a reset request        trigger from ESR0 reset.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ESR1</name>
							<description>ESR1 Reset Request Trigger Reset Configuration   ESR1. This bit field defines which reset is generated by a reset request        trigger from ESR1 reset.</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SMU</name>
							<description>SMU Reset Request Trigger Reset Configuration   SMU. This bit field defines which reset is generated by a reset request        trigger from SMU reset.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SW</name>
							<description>SW Reset Request Trigger Reset Configuration   SW. This bit field defines which reset is generated by a reset request        trigger from software reset.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STM0</name>
							<description>STM0 Reset Request Trigger Reset Configuration   STM0. This bit field defines which reset is generated by a reset request        trigger from STM0 compare match reset.</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STM1</name>
							<description>STM1 Reset Request Trigger Reset Configuration  If Product has STM1    STM1. This bit field defines which reset is generated by a reset request        trigger from STM1 compare match reset.</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STM2</name>
							<description>STM2 Reset Request Trigger Reset Configuration  If Product has STM2    STM2. This bit field defines which reset is generated by a reset request        trigger from STM2 compare match reset.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ARSTDIS</name>
					<description>Application Reset Disable Register
 resetvalue={PowerOn Reset:0x0}</description>
					<addressOffset>92</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>STM0DIS</name>
							<description>STM0 Disable Reset   STM0DIS. This bit field defines if an Application Reset leads to an reset for the        STM0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STM1DIS</name>
							<description>STM1 Disable Reset   STM1DIS. This bit field defines if an Application Reset leads to an reset for the        STM1.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STM2DIS</name>
							<description>STM2 Disable Reset   STM2DIS. This bit field defines if an Application Reset leads to an reset for the        STM2.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWRSTCON</name>
					<description>Software Reset Configuration Register
 resetvalue={PowerOn Reset:0x0,PowerOn Reset:0x0}</description>
					<addressOffset>96</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SWRSTREQ</name>
							<description>Software Reset Request   SWRSTREQ. This bit is automatically cleared and read always as zero.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RSTCON2</name>
					<description>Additional Reset Control Register
 resetvalue={Cold PowerOn Reset:0x0,Cold PowerOn Reset:0x0}</description>
					<addressOffset>100</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FRTO</name>
							<description>Force Reset Timeout   FRTO</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLRC</name>
							<description>Clear Cold Reset Status   CLRC. This bit simultaneously clears the sticky status bits which may indicate any previous cold reset  i.e. RSTSTAT.STBYR  RSTSTAT.SWD  RSTSTAT.EVR33  RSTSTAT.EVRC  RSTSTAT.PORST  RSTSTAT.LBPORST and RSTSTAT.LBTERM .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CSSx</name>
							<description>CPU x Shutdown State Reached   CSSx. The state of CPU x before the last warm reset. If any bit is zero after an Application Reset  or higher  then it is possible that SRAM content could have been corrupted by the reset. For products with fewer CPUs  only the LSBs are active and unused upper bits will always read   x2018 1  x2019 . For products with no MCDS miniMCDS MCDSlight  the bit will always read  1 .</description>
							<lsb>7</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>USRINFO</name>
							<description>User Information   USRINFO. User data register  Cleared only on Cold Power on reset . This may be used by an application to store information which must        survive all warm resets</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ESROCFG</name>
					<description>ESR Output Configuration Register
 resetvalue={System Reset:0x0}</description>
					<addressOffset>120</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967280</resetMask>
					<fields>
						<field>
							<name>ARI</name>
							<description>Application Reset Indicator   ARI. This bit is set when an Application Reset request trigger occurs and        cleared by writing to ARC. When the ARI bit is set and an ESR pin is configured as a reset output         the corresponding ESR input will not re trigger a reset. This prevents        feedback of the reset indication causing a new reset request. Extension of the reset by an external ESR source is handled by SSW. Observed reset value after boot will depend upon ARI mode.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ARC</name>
							<description>Application Reset Indicator Clear   ARC. Read as 0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PDR</name>
					<description>ESR Pad Driver Mode Register
 resetvalue={System Reset:0x0}</description>
					<addressOffset>156</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PD0</name>
							<description>Pad Driver Mode for ESR Pins 0   PD0.  See PDR register description in PORTs chapter </description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL0</name>
							<description>Pad Level Selection for ESR Pins 0   PL0.  See PDR register description in PORTs chapter </description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD1</name>
							<description>Pad Driver Mode for ESR Pins 1   PD1.  See PDR register description in PORTs chapter </description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL1</name>
							<description>Pad Level Selection for ESR Pins 1   PL1.  See PDR register description in PORTs chapter </description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IOCR</name>
					<description>Input Output Control Register
 resetvalue={System Reset:0x0E0}</description>
					<addressOffset>160</addressOffset>
					<size>32</size>
					<resetValue>224</resetValue>
					<resetMask>4294905855</resetMask>
					<fields>
						<field>
							<name>PC0</name>
							<description>Control for ESR0 Pin   PC0. This bit field defines the ESR0 functionality according to the coding        tables.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PC1</name>
							<description>Control for ESR1 Pin   PC1. This bit field defines the ESR1 functionality according to the coding tables. The reset value of SCU IOCR.PC1 is influenced by HWCFG6 and PMSWCR5.TRISTREQ. When a cold reset is activated and HWCFG6 1 then PC1 is reset to 2H and ESR1 will have input pull up mode. If HWCFG6 0 then PC1 is reset to 0H and ESR1 will have tri state mode. PC1 and the ESR1 reset state can also be configured by software with the PMSWCR5.TRISTREQ bit. PMSWCR5.TRISTREQ is not affected by warm reset or wake up from standby so the IOCR.PC1 reset value is configured as per the state of the TRISTREQ bit prior to the warm reset</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OUT</name>
					<description>ESR Output Register
 resetvalue={System Reset:0x0}</description>
					<addressOffset>164</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>P0</name>
							<description>Output Bit 1   P1. This bit determines the level at the output pin ESR x if the output is selected as GPIO output. Px can also be set cleared by control bits of the OMR register.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>P1</name>
							<description>Output Bit 1   P1. This bit determines the level at the output pin ESR x if the output is selected as GPIO output. Px can also be set cleared by control bits of the OMR register.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OMR</name>
					<description>ESR Output Modification Register
 resetvalue={System Reset:0x0}</description>
					<addressOffset>168</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PS0</name>
							<description>ESRx Pin Set Bit 1   PS1. Setting this bit will set or toggle the corresponding bit in the output        register OUT. Reading this bit returns 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS1</name>
							<description>ESRx Pin Set Bit 1   PS1. Setting this bit will set or toggle the corresponding bit in the output        register OUT. Reading this bit returns 0.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL0</name>
							<description>ESRx Pin Clear Bit 1   PCL1. Setting this bit will clear or toggle the corresponding bit in the port        output register OUT. Reading this bit returns 0.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL1</name>
							<description>ESRx Pin Clear Bit 1   PCL1. Setting this bit will clear or toggle the corresponding bit in the port        output register OUT. Reading this bit returns 0.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IN</name>
					<description>ESR Input Register
 resetvalue={System Reset:0x0}</description>
					<addressOffset>172</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967280</resetMask>
					<fields>
						<field>
							<name>P0</name>
							<description>Input Bit 1   P1. This bit indicates the level at the input pin ESR x.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P1</name>
							<description>Input Bit 1   P1. This bit indicates the level at the input pin ESR x.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STSTAT</name>
					<description>Start up Status Register
 resetvalue={PowerOn Reset:0x08000}</description>
					<addressOffset>192</addressOffset>
					<size>32</size>
					<resetValue>32768</resetValue>
					<resetMask>4293984000</resetMask>
					<fields>
						<field>
							<name>HWCFG</name>
							<description>Hardware Configuration Setting   HWCFG. This bit field contains the value that is used by the boot software. This bit field is updated in case of an Application Reset with the content by register SWRSTCON.SWCFG if bit SWRSTCON.SWBOOT AND RSTSTAT.SW are set. This bit field is updated in case of an Application Reset with the content of the latches of pins P14.2 P14.5  P10.5  P10.6 if bit SWRSTCON.SWBOOT OR RSTSTAT.SW are cleared and bit STSTAT.LUDIS is cleared. This bit field is left unchanged in case of an Application Reset and is not updated with the content of the latches of pins P14.2 P14.5  P10.5  P10.6 if bit SWRSTCON.SWBOOT OR RSTSTAT.SW are cleared and bit STSTAT.LUDIS is set. The observed reset value after boot depends upon the state of the HWCFG pins</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FTM</name>
							<description>Firmware Test Setting   FTM. This bit field contains the value that is used by the boot software in        Test Mode. This Bit field is updated in Test Mode by the TCU. In        Normal Mode this bit field is updated with 0000000 B and should be ignored by the boot software.</description>
							<lsb>8</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODE</name>
							<description>MODE   MODE. This bit indicates if the Test Mode is entered or not.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FCBAE</name>
							<description>Flash Config. Sector Access Enable   FCBAE. This bit can be cleared by setting bit STCON.CFCBAE. This bit can be set by setting bit STCON.SFCBAE. Reset value of this bit is 0</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LUDIS</name>
							<description>Latch Update Disable   LUDIS. This bit can be set by setting bit SYSCON.SETLUDIS. Reset value of this bit is 0</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRSTL</name>
							<description>TRSTL Status   TRSTL. This bit simply displays the value of TRST .</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SPDEN</name>
							<description>Single Pin DAP Mode Enable   SPDEN</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RAMINT</name>
							<description>RAM Content Security Integrity   RAMINT. In normal operation this bit can be set or cleared by the application         via SYSCON.RAMINTM . If a test boot mode is entered  the bit is        automatically cleared  and cannot be set again in test mode  because the        content may have been altered This bit is reset only by a cold power on reset.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STCON</name>
					<description>Start up Configuration Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>196</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SFCBAE</name>
							<description>Set Flash Config. Sector Access Enable   SFCBAE. Setting this bit sets bit STSTAT.FCBAE. Reading this bit returns always        a zero. If bits SFCBAE and CFCBAE are both set during the same access then bit          STSTAT.FCBAE is set.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CFCBAE</name>
							<description>Clear Flash Config. Sector Access Enable   CFCBAE. Setting this bit clears bit STSTAT.FCBAE. Reading this bit returns        always a zero.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>STP</name>
							<description>Start up Protection Setting   STP. This bit will be always set by FW and can t be reset. This bit is also cleared by an Application Reset. STP is automatically set when a shutdown trap occurs. The start up protection for the system generated out of this bit can be overruled  deactivated  if bit RTID.RT14 is set AND signal tcu nostp request from the TCU is asserted.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
