J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>TRAPSTAT</name>
					<description>Trap Status Register
 resetvalue={System Reset:0x0}</description>
					<addressOffset>292</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967280</resetMask>
					<fields>
						<field>
							<name>ESR0T</name>
							<description>ESR0 Trap Request Flag   ESR0T. This bit is set if an ESR0 event is triggered. This bit can be cleared by setting bit TRAPCLR.ESR0T. This bit can be set by setting bit TRAPSET.ESR0T. Observed reset value after boot will depend upon ARI mode because of          ESR pin transition.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ESR1T</name>
							<description>ESR1 Trap Request Flag   ESR1T. This bit is set if an ESR1 event is triggered. This bit can be cleared by setting bit TRAPCLR.ESR1T. This bit can be set by setting bit TRAPSET.ESR1T. Reset value of this bit is 0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRAP2</name>
							<description>Trap Bit 2 Request Flag   TRAP2. This bit can be cleared by setting bit TRAPCLR.TRAP2. This bit can be set by setting bit TRAPSET.TRAP2. Reset value of this bit is 0</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SMUT</name>
							<description>SMU Alarm Trap Request Flag   SMUT. This bit is set if an SMU Alarm is indicated. This bit can be cleared by setting bit TRAPCLR.SMUT. This bit can be set by setting bit TRAPSET.SMUT. Reset value of this bit is 0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRAPSET</name>
					<description>Trap Set Register
 resetvalue={System Reset:0x0}</description>
					<addressOffset>296</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ESR0T</name>
							<description>Set Trap Request Flag ESR0T   ESR0T. Setting this bit sets bit TRAPSTAT.ESR0T. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ESR1T</name>
							<description>Set Trap Request Flag ESR1T   ESR1T. Setting this bit sets bit TRAPSTAT.ESR1T. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TRAP2</name>
							<description>Set Trap Request Flag TRAP2   TRAP2. Setting this bit sets bit TRAPSTAT.TRAP2. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SMUT</name>
							<description>Set Trap Request Flag SMUT   SMUT. Setting this bit sets bit TRAPSTAT.SMUT. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRAPCLR</name>
					<description>Trap Clear Register
 resetvalue={System Reset:0x0}</description>
					<addressOffset>300</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ESR0T</name>
							<description>Clear Trap Request Flag ESR0T   ESR0T. Setting this bit clears bit TRAPSTAT.ESR0T. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ESR1T</name>
							<description>Clear Trap Request Flag ESR1T   ESR1T. Setting this bit clears bit TRAPSTAT.ESR1T. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TRAP2</name>
							<description>Clear Trap Request Flag TRAP2   TRAP2. Setting this bit clears bit TRAPSTAT.TRAP2. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SMUT</name>
							<description>Clear Trap Request Flag SMUT   SMUT. Setting this bit clears bit TRAPSTAT.SMUT. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRAPDIS0</name>
					<description>Trap Disable Register 0
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
					<addressOffset>304</addressOffset>
					<size>32</size>
					<resetValue>4294967295</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CPU0ESR0T</name>
							<description>Disable Trap Request ESR0T on CPU0   CPU0ESR0T</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU0ESR1T</name>
							<description>Disable Trap Request ESR1T on CPU0   CPU0ESR1T</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU0TRAP2T</name>
							<description>Disable Trap Request TRAP2T on CPU0   CPU0TRAP2T</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU0SMUT</name>
							<description>Disable Trap Request SMUT on CPU0   CPU0SMUT</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU1ESR0T</name>
							<description>Disable Trap Request ESR0T on CPU1  If product has CPU1    CPU1ESR0T</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU1ESR1T</name>
							<description>Disable Trap Request ESR1T on CPU1  If product has CPU1    CPU1ESR1T</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU1TRAP2T</name>
							<description>Disable Trap Request TRAP2T on CPU1  If product has CPU1    CPU1TRAP2T</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU1SMUT</name>
							<description>Disable Trap Request SMUT on CPU1  If product has CPU1    CPU1SMUT</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU2ESR0T</name>
							<description>Disable Trap Request ESR0T on CPU2  If product has CPU2    CPU2ESR0T</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU2ESR1T</name>
							<description>Disable Trap Request ESR1T on CPU2  If product has CPU2    CPU2ESR1T</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU2TRAP2T</name>
							<description>Disable Trap Request TRAP2T on CPU2  If product has CPU2    CPU2TRAP2T</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU2SMUT</name>
							<description>Disable Trap Request SMUT on CPU2  If product has CPU2    CPU2SMUT</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PDISC</name>
					<description>Pad Disable Control Register
 resetvalue={System Reset:0x0}</description>
					<addressOffset>396</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PDIS0</name>
							<description>Pad Disable for ESR Pin 1   PDIS1. This bit disables the pad.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDIS1</name>
							<description>Pad Disable for ESR Pin 1   PDIS1. This bit disables the pad.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OSCCON</name>
					<description>OSC Control Register
 resetvalue={System Reset:0x10,System Reset:0x258}</description>
					<addressOffset>16</addressOffset>
					<size>32</size>
					<resetValue>16</resetValue>
					<resetMask>4294963376</resetMask>
					<fields>
						<field>
							<name>PLLLV</name>
							<description>Oscillator for PLL Valid Low Status Bit   PLLLV. This bit indicates if the frequency output f osc of the oscillator is above the lower threshold frequency f LV   i.e. usable for the DCO part of the PLL. This is checked by the Oscillator Watchdog of the PLL using the backup clock f BACK . By using the crystal s nominal frequency   f oscnom    the lower threshold calculates as follows  f LV   f oscnom   0 96   0 31</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OSCRES</name>
							<description>Oscillator Watchdog Reset   OSCRES. Always read as zero.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>GAINSEL</name>
							<description>Oscillator Gain Selection   GAINSEL. In Normal Mode this value should not be changed from the reset value 11 B . When using Vext 3.3V  the LVDS bias distributor has to be adjusted to 3.3V supply via P21 LPCR2.PS   0 otherwise the oscillator gain can be too low for a reliable oscillator startup at cold temperature. In case of using Vext 5V  the LVDS bias distributor setting stays at the reset value P21 LPCR2.PS   1.</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE</name>
							<description>Oscillator Mode   MODE. This bit field defines which mode can be used and if the oscillator entered the Power Saving Mode or not. In Test Mode the shaper can be bypassed even if the oscillator is in the Oscillator Power Saving Mode. This is controlled by the TCU.</description>
							<lsb>5</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SHBY</name>
							<description>Shaper Bypass   SHBY</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PLLHV</name>
							<description>Oscillator for PLL Valid High Status Bit   PLLHV. This bit indicates if the frequency output f osc of the oscillator is below the upper threshold frequency f HV   i.e. usable for the DCO part of the PLL. This is checked by the Oscillator Watchdog of the PLL using the backup clock f BACK . By using the crystal s nominal frequency   f oscnom    the upper threshold calculates as follows  f HV   f oscnom   1 04   0 29</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HYSEN</name>
							<description>Hysteresis Enable</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HYSCTL</name>
							<description>Hysteresis Control</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AMPCTL</name>
							<description>Amplitude Control</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OSCVAL</name>
							<description>OSC Frequency Value   OSCVAL. This bit field defines the divider value that generates the reference        clock that is supervised by the oscillator watchdog. f OSC   160    160 OSCCON.OSCVAL  160    160 1  160    160 16  160 MHz.</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>APREN</name>
							<description>Amplitude Regulation Enable   APREN. This bit field enables and disables Amplitude Regulation mode. When enabled  the bit field GAINSEL limits the maximum gain.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CAP0EN</name>
							<description>Capacitance 0 Enable   CAP0EN. Total capacitance for each XTAL1 and XTAL2 is the sum of the enabled capacitance 0 to 3.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CAP1EN</name>
							<description>Capacitance 1 Enable   CAP1EN. Total capacitance for each XTAL1 and XTAL2 is the sum of the enabled capacitance 0 to 3.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CAP2EN</name>
							<description>Capacitance 2 Enable   CAP2EN. Total capacitance for each XTAL1 and XTAL2 is the sum of the enabled capacitance 0 to 3.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CAP3EN</name>
							<description>Capacitance 3 Enable   CAP3EN. Total capacitance for each XTAL1 and XTAL2 is the sum of the enabled capacitance 0 to 3.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLSTAT</name>
					<description>System PLL Status Register
 resetvalue={System Reset:0x2,System Reset:0x2}</description>
					<addressOffset>20</addressOffset>
					<size>32</size>
					<resetValue>2</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PWDSTAT</name>
							<description>System PLL Power saving Mode Status   PWDSTAT</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LOCK</name>
							<description>System PLL Lock Status   LOCK. In case of a loss of lock  the f DCO is kept on the previous constant frequency.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>K2RDY</name>
							<description>K2 Divider Ready Status   K2RDY. This bit indicates whether the K2 divider operates on the configured value. This is of interest when the SYSPLLCON1.K2DIV value is changed. The PLL must be enabled and clocked to set the K2RDY field.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODRUN</name>
							<description>Modulation Run   MODRUN. This bit indicates if the frequency modulation of the System PLL is activated or not.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLCON0</name>
					<description>System PLL Configuration 0 Register
 resetvalue={System Reset:0x40003A00}</description>
					<addressOffset>24</addressOffset>
					<size>32</size>
					<resetValue>1073756672</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MODEN</name>
							<description>Modulation Enable   MODEN. This bit controls the activation of the frequency modulation of the        System PLL.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIV</name>
							<description>N Divider Value   NDIV. The value the N Divider operates with is NDIV 1.</description>
							<lsb>9</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PLLPWD</name>
							<description>System PLL Power Saving Mode   PLLPWD. If the PLL has been powered down and is getting re enabled via PLLPWD   1  a wait period of 1 ms has to be applied until it is stable without jitter.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RESLD</name>
							<description>Restart DCO Lock Detection   RESLD. Setting this bit will clear bit SYSPLLSTAT.LOCK and restart the DCO lock detection. Reading this bit returns always a zero.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PDIV</name>
							<description>P Divider Value   PDIV. The value the P Divider operates with is PDIV 1.</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INSEL</name>
							<description>Input Selection   INSEL. This bit field defines as clock source for the two PLLs  System       PLL and Peripheral PLL .</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLCON1</name>
					<description>System PLL Configuration 1 Register
 resetvalue={System Reset:0x5}</description>
					<addressOffset>28</addressOffset>
					<size>32</size>
					<resetValue>5</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>K2DIV</name>
							<description>K2 Divider Value   K2DIV. The value the K2 Divider operates with is K2DIV 1. While SYSPLLSTAT.K2RDY   0  K2DIV is locked.</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLCON2</name>
					<description>System PLL Configuration 2 Register
 resetvalue={System Reset:0x6000}</description>
					<addressOffset>32</addressOffset>
					<size>32</size>
					<resetValue>24576</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MODCFG</name>
							<description>Modulation Configuration   MODCFG. This bit field defines the modulation. MODCFG 9 0  defines the modulation amplitude. Bits MODCFG 9 5  are treated as integer part and bits MODCFG 4 0  as fractional part. Bits MODCFG 15 10  have to be configured with the following setting  0x111101 B .</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PERPLLSTAT</name>
					<description>Peripheral PLL Status Register
 resetvalue={System Reset:0x2}</description>
					<addressOffset>36</addressOffset>
					<size>32</size>
					<resetValue>2</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PWDSTAT</name>
							<description>Peripheral PLL Power saving Mode Status   PWDSTAT</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LOCK</name>
							<description>Peripheral PLL Lock Status   LOCK. In case of a loss of lock  the f DCO is kept on the previous constant frequency.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>K3RDY</name>
							<description>K3 Divider Ready Status   K3RDY. This bit indicates whether the K3 divider operates on the configured value. This is of interest when the PERPLLCON1.K3DIV value is changed. The PLL must be enabled and clocked to set the K3RDY field.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>K2RDY</name>
							<description>K2 Divider Ready Status   K2RDY. This bit indicates whether the K2 divider operates on the configured value. This is of interest when the PERPLLCON1.K2DIV value is changed. The PLL must be enabled and clocked to set the K2RDY field.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PERPLLCON0</name>
					<description>Peripheral PLL Configuration 0 Register
 resetvalue={System Reset:0x3E00}</description>
					<addressOffset>40</addressOffset>
					<size>32</size>
					<resetValue>15872</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DIVBY</name>
							<description>Divider Bypass   DIVBY</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIV</name>
							<description>N Divider Value   NDIV. The value the N Divider operates with is NDIV 1.</description>
							<lsb>9</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PLLPWD</name>
							<description>Peripheral PLL Power Saving Mode   PLLPWD. If the PLL has been powered down and is getting re enabled via PLLPWD   1  a wait period of 1 ms has to be applied until it is stable without jitter.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RESLD</name>
							<description>Restart DCO Lock Detection   RESLD. Setting this bit will clear bit SYSPLLSTAT.LOCK and restart the DCO lock detection. Reading this bit returns always a zero.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PDIV</name>
							<description>P Divider Value   PDIV. The value the P Divider operates with is PDIV 1.</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PERPLLCON1</name>
					<description>Peripheral PLL Configuration 1 Register
 resetvalue={System Reset:0x1}</description>
					<addressOffset>44</addressOffset>
					<size>32</size>
					<resetValue>1</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>K2DIV</name>
							<description>K2 Divider Value   K2DIV. The value the K2 Divider operates with is K2DIV 1. While PERPLLSTAT.K2RDY   0  K2DIV is locked.</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>K3DIV</name>
							<description>K3 Divider Value   K3DIV. The value the K3 Divider operates with is K3DIV 1. While PERPLLSTAT.K3RDY   0  K3DIV is locked.</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
