J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>CCUCON0</name>
					<description>CCU Clock Control Register 0
 resetvalue={After SSW execution:0x5120112,System Reset:0x3130113}</description>
					<addressOffset>48</addressOffset>
					<size>32</size>
					<resetValue>17957138</resetValue>
					<resetMask>4194238462</resetMask>
					<fields>
						<field>
							<name>STMDIV</name>
							<description>STM Divider Reload Value   STMDIV. The resulting STM frequency is configured to f STM   xa0    xa0  f source0   xa0    xa0 STMDIV for the allowed configurations. For STMDIV  xa0    xa0 0000 B the clock is shut off. f source0 can be configured either to f PLL0  CLKSEL  xa0    xa0 01 B   or f BACK  CLKSEL  xa0    xa0 00 B  </description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GTMDIV</name>
							<description>GTM Divider Reload Value   GTMDIV. The resulting GTM frequency is configured to f GTM   f SOURCEGTM   GTMDIV for the allowed configurations. For GTMDIV   0000 B the clock is shut off.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SRIDIV</name>
							<description>SRI Divider Reload Value   SRIDIV. The resulting SRI frequency is configured to f SRI   f source0   SRIDIV for the allowed configurations. f source0 could be configured either to f PLL0  CLKSEL   01 B   or f BACK  CLKSEL   00 B  </description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LPDIV</name>
							<description>Low Power Divider Reload Value   LPDIV. The selected divider is valid for all clocks derived from f XXX with XXX   SPB  SRI  BBB  FSI  GETH  GTM  ADAS.</description>
							<lsb>12</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SPBDIV</name>
							<description>SPB Divider Reload Value   SPBDIV. f source0 could be configured either to f PLL  CLKSEL   01 B   or f BACK  CLKSEL   00 B  </description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BBBDIV</name>
							<description>BBB Divider Reload Value   BBBDIV. The resulting BBB frequency is configured to f BBB   160    160  f source0   160    160 BBBDIV        for all allowed configurations. For BBBDIV  160    160 0000 B the clock is shut off. f source0 could be        configured either to f PLL0  CLKSEL  160    160 01 B   or f BACK  CLKSEL  160    160 00 B  </description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FSIDIV</name>
							<description>FSI Divider Reload Value   FSIDIV</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FSI2DIV</name>
							<description>FSI2 Divider Reload Value   FSI2DIV</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKSEL</name>
							<description>Clock Selection for Source   CLKSEL. This bit field defines the clock source that is used for the clock        generation of f sourcex .</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UP</name>
							<description>Update Request   UP. Setting this bit will request an update for CCUCON0 and CCUCON5. Only one UP bit must be set for either CCUCON0 or CCUCON5. This bit always reads as zero.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status   LCK. This bit indicates if the register can be updated with a new value or if the register is locked and a write action from the bus side has no effect. The lock bit is set when an update of CCUCON0 5 has been requested  and released when the update is complete.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCUCON1</name>
					<description>CCU Clock Control Register 1
 resetvalue={System Reset:0x10100302}</description>
					<addressOffset>52</addressOffset>
					<size>32</size>
					<resetValue>269484802</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MCANDIV</name>
							<description>MCAN Divider Reload Value   MCANDIV. The resulting MCAN frequency is configured to f MCANI   160    160  f source1   160    160 MCANDIV        for the allowed configurations. For MCANDIV  160    160 0000 B the clock is shut off.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKSELMCAN</name>
							<description>Clock Selection for MCAN   CLKSELMCAN. This bit field defines the clock source that is used for the clock generation of f SOURCEMCAN . For switching between two non zero configurations the following sequence has to be applied  First step is to switch to 00 B . Second step is to switch to the new target configuration.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PLL1DIVDIS</name>
							<description>Divider Disable for fPLL1   PLL1DIVDIS. Depending on CCUCON0.CLKSEL  this bit selects whether f source1 is half f pll1 .</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>I2CDIV</name>
							<description>I2C Divider Reload Value   I2CDIV. The resulting I2C frequency is configured to f I2C   xa0    xa0  f SOURCE2   xa0    xa0 I2CDIV for the allowed configurations. For I2CDIV  xa0    xa0 0000 B the clock is shut off.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSCDIV</name>
							<description>MSC Divider Reload Value   MSCDIV. The resulting MSC frequency is configured to f MSC   160    160  f SOURCEMSC   160    160 MSCDIV        for the allowed configurations. For MSCDIV  160    160 0000 B the clock is shut off.</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKSELMSC</name>
							<description>Clock Selection for MSC   CLKSELMSC. This bit field defines the clock source that is used for the clock generation of f SOURCEMSC . For switching between two non zero configurations the following sequence has to be applied  First step is to switch to 00 B . Second step is to switch to the new target configuration.</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>QSPIDIV</name>
							<description>QSPI Divider Reload Value   QSPIDIV. The resulting QSPI frequency is configured to f QSPI   160    160  f SOURCEQSPI   160    160 QSPIDIV        for the allowed configurations. For QSPIDIV  160    160 0000 B the clock is shut off.</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKSELQSPI</name>
							<description>Clock Selection for QSPI   CLKSELQSPI. This bit field defines the clock source that is used for the clock generation of f SOURCEQSPI . For switching between two non zero configurations the following sequence has to be applied  First step is to switch to 00 B . Second step is to switch to the new target configuration.</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status   LCK. This bit indicates if the register can be updated with a new value or if the register is locked and a write action from the bus side has no effect. The lock bit is set when at least one bit field is changed  and released when this change is executed.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FDR</name>
					<description>Fractional Divider Register
 resetvalue={System Reset:0x0}</description>
					<addressOffset>56</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>STEP</name>
							<description>Step Value   STEP. In Normal Divider Mode  STEP contains the reload value for RESULT. In Fractional Divider Mode  this bit field determines the 10 bit value that is added to RESULT with each input clock cycle.</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DM</name>
							<description>Divider Mode   DM. These bit fields determine the functionality of the fractional divider block.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RESULT</name>
							<description>Result Value   RESULT. In Normal Divider Mode  RESULT acts as reload counter  addition  1 . In Fractional Divider Mode  this bit field contains the result of the addition RESULT   STEP. If DM is written with 01 B or 10 B   RESULT is loaded with 3FF H .</description>
							<lsb>16</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DISCLK</name>
							<description>Disable Clock   DISCLK</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EXTCON</name>
					<description>External Clock Control Register
 resetvalue={System Reset:0x0}</description>
					<addressOffset>60</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EN0</name>
							<description>External Clock Enable for EXTCLK0   EN0. If the generation of the external clock signal is disabled  the signal is tied to zero. This bit field can be overruled in Test Mode via the TCU.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL0</name>
							<description>External Clock Select for EXTCLK0   SEL0. This bit field defines the clock source that is selected as output for        pin EXTCLK0. This bit field can be overruled in Test Mode via the TCU.</description>
							<lsb>2</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN1</name>
							<description>External Clock Enable for EXTCLK1   EN1. If the generation of the external clock signal is disabled  the signal is tied to zero. This bit can be overruled in Test Mode via the TCU.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NSEL</name>
							<description>Negation Selection   NSEL. This bit can be overruled in Test Mode via the TCU.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL1</name>
							<description>External Clock Select for EXTCLK1   SEL1. This bit field defines the clock source that is selected as the output for pin EXTCLK1. This bit field can be overruled in Test Mode via the TCU.</description>
							<lsb>18</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIV1</name>
							<description>External Clock Divider for EXTCLK1   DIV1. This value defines the reload value of the divider that generates f OUT out of f SPB   f OUT   f SPB   DIV1 1  . The divider itself is cleared each time bit EN1 is cleared.</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCUCON2</name>
					<description>CCU Clock Control Register 2
 resetvalue={System Reset:0x7000101}</description>
					<addressOffset>64</addressOffset>
					<size>32</size>
					<resetValue>117440769</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ASCLINFDIV</name>
							<description>ASCLIN Fast Divider Reload Value   ASCLINFDIV. The resulting ASCLIN frequency is configured to f ASCLINF   f source2   ASCLINFDIV for the allowed configurations. For ASCLINFDIV   0000 B the clock is shut off. f source2 could be configured either to f PLL2  CLKSEL   01 B   or f BACK  CLKSEL   00 B  </description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ASCLINSDIV</name>
							<description>ASCLIN Slow Divider Reload Value   ASCLINSDIV. The resulting ASCLIN frequency is configured to f ASCLINSI   f source1   ASCLINSDIV for the allowed configurations. For ASCLINSDIV   0000 B the clock is shut off. f source1 could be configured either to f PLL1  CLKSEL   01 B   or f BACK  CLKSEL   00 B  </description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKSELASCLINS</name>
							<description>Clock Selection for ASCLINS   CLKSELASCLINS. This bit field defines the clock source that is used for the clock generation of f ASCLINS . For switching between two non zero configurations the following sequence has to be applied  First step is to switch to 00 B . Second step is to switch to the new target configuration.</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ERAYPERON</name>
							<description>Power Safe SwitchOff for ERAY Clock   ERAYPERON. This bit is used to control the ERAY peripheral clock f ERAY for power saving purposes if the logic is not used by the application.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status   LCK. This bit indicates if the register can be updated with a new value or if the register is locked and a write action from the bus side has no effect. The lock bit is set when at least one bit field is changed  and released when this change is executed.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCUCON3</name>
					<description>CCU Clock Control Register 3
 resetvalue={System Reset:0x0}</description>
					<addressOffset>68</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PLL0MONEN</name>
							<description>PLL0 Clock Monitor Enable   PLL0MONEN</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PLL1MONEN</name>
							<description>PLL1 Clock Monitor Enable   PLL1MONEN</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PLL2MONEN</name>
							<description>PLL2 Clock Monitor Enable   PLL2MONEN</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SPBMONEN</name>
							<description>SPB Clock Monitor Enable   SPBMONEN</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BACKMONEN</name>
							<description>Backup Clock Monitor Enable   BACKMONEN</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PLL0MONTST</name>
							<description>PLL0 Clock Monitor Test   PLL0MONTST. The test enable bit is not a direct trigger for the alarm  but an inhibit for the clock to be monitored. This is to test the monitoring logic itself as well.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PLL1MONTST</name>
							<description>PLL1 Clock Monitor Test   PLL1MONTST. The test enable bit is not a direct trigger for the alarm  but an inhibit for the clock to be monitored. This is to test the monitoring logic itself as well.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PLL2MONTST</name>
							<description>PLL2 Clock Monitor Test   PLL2MONTST. The test enable bit is not a direct trigger for the alarm  but an inhibit for the clock to be monitored. This is to test the monitoring logic itself as well.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SPBMONTST</name>
							<description>SPB Clock Monitor Test   SPBMONTST. The test enable bit is not a direct trigger for the alarm  but an inhibit for the clock to be monitored. This is to test the monitoring logic itself as well.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BACKMONTST</name>
							<description>Backup Clock Monitor Test   BACKMONTST. The test enable bit is not a direct trigger for the alarm  but an inhibit for the clock to be monitored. This is to test the monitoring logic itself as well.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UP</name>
							<description>Update Request   UP. Setting this bit will request an update for CCUCON3 and CCUCON4. Only one UP bit must be set for either CCUCON3 or CCUCON4. This bit always reads as zero.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status   LCK. This bit indicates if the register can be updated with a new value or if the register is locked and a write action from the bus side has no effect. The lock bit is set when an update of CCUCON3 4 has been requested  and released when the update is complete.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCUCON4</name>
					<description>CCU Clock Control Register 4
 resetvalue={System Reset:0x0}</description>
					<addressOffset>72</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LOTHR</name>
							<description>Backup Clock Monitor Lower Threshold   LOTHR. lower threshold   512  f PLL0   0.9   100 MHz For proper operation and to avoid false alarms  the monitor needs to be disabled via MONEN 0 before changing setting the threshold values.</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UPTHR</name>
							<description>Backup Clock Monitor Upper Threshold   UPTHR. upper threshold   512  f PLL0   1.1   100 MHz For proper operation and to avoid false alarms  the monitor needs to be disabled via MONEN 0 before changing setting the threshold values.</description>
							<lsb>12</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MONEN</name>
							<description>Backup Clock Monitor Enable   MONEN</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MONTST</name>
							<description>Backup Clock Monitor Test   MONTST. Set this bit to 1 to test alarm generation. The test enable bit is a direct trigger for the alarm.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UP</name>
							<description>Update Request   UP. Setting this bit will request an update for CCUCON3 and CCUCON4. Only one UP bit must be set for either CCUCON3 or CCUCON4. This bit always reads as zero.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status   LCK. This bit indicates if the register can be updated with a new value or if the register is locked and a write action from the bus side has no effect. The lock bit is set when an update of CCUCON3 4 has been requested  and released when the update is complete.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCUCON5</name>
					<description>CCU Clock Control Register 5
 resetvalue={System Reset:0x30}</description>
					<addressOffset>76</addressOffset>
					<size>32</size>
					<resetValue>48</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>GETHDIV</name>
							<description>GETH Divider Reload Value   GETHDIV. The resulting GETH frequency is configured to f GETH   xa0    xa0  f source0   xa0    xa0 GETHDIV for the allowed configurations. For GETHDIV  xa0    xa0 0000 B the clock is shut off. f source0 could be configured either to f PLL0  CLKSEL  xa0    xa0 01 B   or f BACK  CLKSEL  xa0    xa0 00 B   GETHDIV must be enabled    0  during an application reset to allow firmware related installation tasks.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MCANHDIV</name>
							<description>MCANH Divider Reload Value   MCANHDIV. The resulting MCANH frequency is configured to f MCANH   f SOURCE0   MCANHDIV for the allowed configurations. For MCANHDIV   0000 B the clock is shut off.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UP</name>
							<description>Update Request   UP. Setting this bit will request an update for CCUCON0 and CCUCON5. Only one UP bit must be set either CCUCON0 or CCUCON5. This bit always reads as zero.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status   LCK. This bit indicates if the register can be updated with a new value or if the register is locked and a write action from the bus side has no effect. The lock bit is set when an update of CCUCON0 5 has been requested  and released when the update is complete.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCUCON6</name>
					<description>CCU Clock Control Register 6
 resetvalue={System Reset:0x0}</description>
					<addressOffset>128</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CPU0DIV</name>
							<description>CPU0 Divider Reload Value   CPU0DIV. The resulting CPU0 frequency  performance  is configured to f CPU0   xa0    xa0  f SRI   xa0    xa0  64  xa0    xa0 CPU0DIV   xa0    xa0 64. For CPU0DIV  xa0    xa0 000000 B   f CPU0   xa0    xa0  f SRI .</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
