J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>CCUCON7</name>
					<description>CCU Clock Control Register 7
 resetvalue={System Reset:0x0}</description>
					<addressOffset>132</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CPU1DIV</name>
							<description>CPU1 Divider Reload Value   CPU1DIV. The resulting CPU1 frequency  performance  is configured to f CPU1   xa0    xa0  f SRI   xa0    xa0  64  xa0    xa0 CPU1DIV   xa0    xa0 64. For CPU1DIV  xa0    xa0 000000 B   f CPU1   xa0    xa0  f SRI .</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCUCON8</name>
					<description>CCU Clock Control Register 8
 resetvalue={System Reset:0x0}</description>
					<addressOffset>136</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CPU2DIV</name>
							<description>CPU2 Divider Reload Value   CPU2DIV. The resulting CPU2 frequency  performance  is configured to f CPU2   xa0    xa0  f SRI   xa0    xa0  64  xa0    xa0 CPU2DIV   xa0    xa0 64. For CPU2DIV  xa0    xa0 000000 B   f CPU2   xa0    xa0  f SRI .</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMCSR0</name>
					<description>Power Management Control and Status Register
 resetvalue={Application Reset:0x100}</description>
					<addressOffset>200</addressOffset>
					<size>32</size>
					<resetValue>256</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>REQSLP</name>
							<description>Idle Mode and Sleep Mode Request   REQSLP. In Idle Mode or Sleep Mode  these bits are cleared in response to an        interrupt for the CPU  or when bit 15 of the corresponding CPU Watchdog        Timer register  bit WDTCPUxSR.TIM 15   changes from 0 to 1. In Standby        Mode  these bits are cleared on wake up. REQSLP maybe written only when        either CPU or Safety ENDINIT bits are set to 0. CPU ENDINIT bit has to        be set back after REQSLP is written for the mode transition to take        place. In case of Safety ENDINIT  the mode transition will be issued        immediately and does not wait till Safety ENDINIT is set back to 1 again. No explicit acknowledge to SCU on System Standby request. System Standby        entry in a few cycles.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PMST</name>
							<description>Power management Status   PMST. This bit field reflects the current status of the CPU.</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMCSR1</name>
					<description>Power Management Control and Status Register
 resetvalue={Application Reset:0x100}</description>
					<addressOffset>204</addressOffset>
					<size>32</size>
					<resetValue>256</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>REQSLP</name>
							<description>Idle Mode and Sleep Mode Request   REQSLP. In Idle Mode or Sleep Mode  these bits are cleared in response to an interrupt for the CPU  or when bit 15 of the corresponding CPU Watchdog Timer register  bit WDTCPUxSR.TIM 15   changes from 0 to 1. In Standby Mode  these bits are cleared on wake up. REQSLP maybe written only when either CPU or Safety ENDINIT bits are set to 0. CPU ENDINIT bit has to be set back after REQSLP is written for the mode transition to take place. In case of Safety ENDINIT  the mode transition will be issued immediately and does not wait till Safety ENDINIT is set back to 1 again. No explicit acknowledge to SCU on System Standby request. System Standby entry in a few cycles.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PMST</name>
							<description>Power management Status   PMST. This bit field reflects the current status of the CPU.</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMCSR2</name>
					<description>Power Management Control and Status Register
 resetvalue={Application Reset:0x100}</description>
					<addressOffset>208</addressOffset>
					<size>32</size>
					<resetValue>256</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>REQSLP</name>
							<description>Idle Mode and Sleep Mode Request   REQSLP. In Idle Mode or Sleep Mode  these bits are cleared in response to an interrupt for the CPU  or when bit 15 of the corresponding CPU Watchdog Timer register  bit WDTCPUxSR.TIM 15   changes from 0 to 1. In Standby Mode  these bits are cleared on wake up. REQSLP maybe written only when either CPU or Safety ENDINIT bits are set to 0. CPU ENDINIT bit has to be set back after REQSLP is written for the mode transition to take place. In case of Safety ENDINIT  the mode transition will be issued immediately and does not wait till Safety ENDINIT is set back to 1 again. No explicit acknowledge to SCU on System Standby request. System Standby entry in a few cycles.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PMST</name>
							<description>Power management Status   PMST. This bit field reflects the current status of the CPU.</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMCSR3</name>
					<description>Power Management Control and Status Register
 resetvalue={Application Reset:0x100}</description>
					<addressOffset>212</addressOffset>
					<size>32</size>
					<resetValue>256</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>REQSLP</name>
							<description>Idle Mode and Sleep Mode Request   REQSLP. In Idle Mode or Sleep Mode  these bits are cleared in response to an interrupt for the CPU  or when bit 15 of the corresponding CPU Watchdog Timer register  bit WDTCPUxSR.TIM 15   changes from 0 to 1. In Standby Mode  these bits are cleared on wake up. REQSLP maybe written only when either CPU or Safety ENDINIT bits are set to 0. CPU ENDINIT bit has to be set back after REQSLP is written for the mode transition to take place. In case of Safety ENDINIT  the mode transition will be issued immediately and does not wait till Safety ENDINIT is set back to 1 again. No explicit acknowledge to SCU on System Standby request. System Standby entry in a few cycles.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PMST</name>
							<description>Power management Status   PMST. This bit field reflects the current status of the CPU.</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMCSR4</name>
					<description>Power Management Control and Status Register
 resetvalue={Application Reset:0x100}</description>
					<addressOffset>216</addressOffset>
					<size>32</size>
					<resetValue>256</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>REQSLP</name>
							<description>Idle Mode and Sleep Mode Request   REQSLP. In Idle Mode or Sleep Mode  these bits are cleared in response to an interrupt for the CPU  or when bit 15 of the corresponding CPU Watchdog Timer register  bit WDTCPUxSR.TIM 15   changes from 0 to 1. In Standby Mode  these bits are cleared on wake up. REQSLP maybe written only when either CPU or Safety ENDINIT bits are set to 0. CPU ENDINIT bit has to be set back after REQSLP is written for the mode transition to take place. In case of Safety ENDINIT  the mode transition will be issued immediately and does not wait till Safety ENDINIT is set back to 1 again. No explicit acknowledge to SCU on System Standby request. System Standby entry in a few cycles.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PMST</name>
							<description>Power management Status   PMST. This bit field reflects the current status of the CPU.</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMCSR5</name>
					<description>Power Management Control and Status Register
 resetvalue={Application Reset:0x100}</description>
					<addressOffset>220</addressOffset>
					<size>32</size>
					<resetValue>256</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>REQSLP</name>
							<description>Idle Mode and Sleep Mode Request   REQSLP. In Idle Mode or Sleep Mode  these bits are cleared in response to an interrupt for the CPU  or when bit 15 of the corresponding CPU Watchdog Timer register  bit WDTCPUxSR.TIM 15   changes from 0 to 1. In Standby Mode  these bits are cleared on wake up. REQSLP maybe written only when either CPU or Safety ENDINIT bits are set to 0. CPU ENDINIT bit has to be set back after REQSLP is written for the mode transition to take place. In case of Safety ENDINIT  the mode transition will be issued immediately and does not wait till Safety ENDINIT is set back to 1 again. No explicit acknowledge to SCU on System Standby request. System Standby entry in a few cycles.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PMST</name>
							<description>Power management Status   PMST. This bit field reflects the current status of the CPU.</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMSTAT0</name>
					<description>Power Management Status Register 0
 resetvalue={Application Reset:0x1}</description>
					<addressOffset>228</addressOffset>
					<size>32</size>
					<resetValue>1</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CPU0</name>
							<description>CPU0 Status   CPU0. This bit field reflects the current status of CPU0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1</name>
							<description>CPU1 Status   CPU1. This bit field reflects the current status of CPU1.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2</name>
							<description>CPU2 Status   CPU2. This bit field reflects the current status of CPU2.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU3</name>
							<description>CPU3 Status   CPU3. This bit field reflects the current status of CPU3.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU4</name>
							<description>CPU4 Status   CPU4. This bit field reflects the current status of CPU4.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU5</name>
							<description>CPU5 Status   CPU5. This bit field reflects the current status of CPU5.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU0LS</name>
							<description>CPU0LS Status   CPU0LS. This bit field reflects the current status of CPU0 Lockstep Checker        Core.The activation of the Lockstep is configured in UCB BMI        configuration and determines the default reset value. The default reset        value 0 is for the case where CPU0LS is disabled in UCB BMI        configuration.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1LS</name>
							<description>CPU1LS Status   CPU1LS. This bit field reflects the current status of CPU1 Lockstep Checker Core.The activation of the Lockstep is configured in UCB BMI configuration and determines the default status. The default reset value 0 is for the case where CPU0LS is disabled in UCB BMI configuration.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2LS</name>
							<description>CPU2LS Status   CPU2LS. This bit field reflects the current status of CPU2 Lockstep Checker Core.The activation of the Lockstep is configured in UCB BMI configuration and determines the default status. The default reset value 0 is for the case where CPU0LS is disabled in UCB BMI configuration.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU3LS</name>
							<description>CPU3LS Status   CPU3LS. This bit field reflects the current status of CPU3 Lockstep Checker Core.The activation of the Lockstep is configured in UCB BMI configuration and determines the default status. The default reset value 0 is for the case where CPU0LS is disabled in UCB BMI configuration.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMSWCR1</name>
					<description>Standby and Wake up Control Register 1
 resetvalue={Cold PowerOn Reset:0x1000000}</description>
					<addressOffset>232</addressOffset>
					<size>32</size>
					<resetValue>16777216</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CPUIDLSEL</name>
							<description>CPU selection for Idle mode   CPUIDLSEL. This bit field allows a CPUx to issue Idle request to other CPUs in addition to itself. A request for Idle via PMCSRx.REQSLP 01 by CPUx will also trigger Idle requests to all other CPUs. All other CPUIDLSEL bit combinations are reserved.</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IRADIS</name>
							<description>Idle Request Acknowledge Sequence Disable   IRADIS. This bit enables SCU Idle Request Acknowledge sequence to all modules on Standby entry. IRADIS bit has no effect incase of Standby entry triggered via PWRWKEN register bit. This bit shall be set before Standby entry to disable Idle request acknowledge sequence so that standby request is not blocked by a pending reset idle request acknowledge sequence.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPUSEL</name>
							<description>CPU selection for Sleep and Standby mode   CPUSEL. All other CPUSEL bit combinations are reserved.</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STBYEVEN</name>
							<description>Standby Entry Event configuration enable   STBYEVEN</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>STBYEV</name>
							<description>Standby Entry Event Configuration   STBYEV. All other bit combinations are reserved.</description>
							<lsb>28</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DTSCSTAT</name>
					<description>Core Die Temperature Sensor Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>260</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Result of the DTSC Measurement   RESULT. This bit field shows the result of the DTSC measurement. The value given        is directly related to the die temperature and can be evaluated using        the following formula. T    176 C     RESULT   Gnom    273.15 T   176 K   RESULT  G nom RESULT  G nom    T    176 C    273.15    G nom   T    176 K  G nom   7.505</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DTSCLIM</name>
					<description>Core Die Temperature Sensor Limit Register
 resetvalue={Application Reset:0x0CD806D6}</description>
					<addressOffset>264</addressOffset>
					<size>32</size>
					<resetValue>215484118</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LOWER</name>
							<description>DTSC Lower Limit   LOWER. This bit field defines the lower limit of the DTSC temperature check.        The DTSC measurement result is compared against this value and if the        measurement result is less than or equal to the configured LOWER        bitfield value  flag LLU is set.</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BGPOK</name>
							<description>DTSC Bandgap OK. This bitfield indicates that the bandgap reference for the Core Die        Temperature Sensor  DTSC  is available and ok.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EN</name>
							<description>DTSC Enable. This bitfield enables the Core Die Temperature Sensor  DTSC . The        bitfield is reset on an application reset.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LLU</name>
							<description>DTSC Lower Limit Underflow   LLU. When this bit is set the related SMU DTSC alarm trigger is generated.        This bit has to be written with zero in order to clear it. Writing a one        has no effect. This bit is set when a DTSC measurement is finished and        the result is below the lower limit  i.e. DTSCLIM.LOWER .</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UPPER</name>
							<description>DTSC Upper Limit   UPPER. This bit field defines the upper limit of the DTSC temperature check.        The DTSC measurement result is compared against this value and if the        measurement result is greater than or equal to the configured UPPER        bitfield value  flag UOF is set.</description>
							<lsb>16</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INTEN</name>
							<description>DTSC Interrupt Enable. This bitfield enables the Core Die Temperature Sensor  DTSC  interrupt.        The bitfield is reset on an application reset.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INT</name>
							<description>DTSC Interrupt status flag. This bit is set when SMU DTSC interrupt is generated when a DTSC        measurement is finished. This bit is cleared by writing a zero. Writing        a one has no effect.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UOF</name>
							<description>DTSC Upper Limit Overflow   UOF. When this bit is set  the related SMU DTSC alarm trigger is generated.        This bit has to be written with zero in order to clear it. Writing a one        has no effect. This bit is set when a DTSC measurement is finished and        the result is exceeding the upper limit  i.e. DTSCLIM.UPPER .</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
