J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>PMTRCSR0</name>
					<description>Power Management Transition Control and Status Register 0
 resetvalue={Cold PowerOn Reset:0x0}</description>
					<addressOffset>408</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LJTEN</name>
							<description>Load Jump Timer Enable   LJTEN. This bit field enables the usage of load jump timer.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LJTOVEN</name>
							<description>Load Jump Timer Overflow Enable   LJTOVEN. This bit field enables the update of LJTOV status bit on timer overflow        or time out.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LJTOVIEN</name>
							<description>Load Jump Timer Overflow Interrupt Enable   LJTOVIEN. This bit field enables the activation of interrupt on timer overflow or        time out.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LJTSTRT</name>
							<description>Load Jump Timer Start   LJTSTRT. This bit field starts Load jump timer. This is intended for test        purposes. The LJTSTRT remains set on a write and is cleared when LJTOV        bit is set if LJTOVEN bit is enabled.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LJTSTP</name>
							<description>Load Jump Timer Stop   LJTSTP. This bit field stops Load jump timer. This is intended for test        purposes. The LJTSTP remains set on a write and is to be explicitly        cleared by software. The LJTSTP stops the counter at the current value        and timer re starts from that value when LJTSTP is cleared and LJTSTRT        is set.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LJTCLR</name>
							<description>Load Jump Timer Clear   LJTCLR. This bit field clear Load jump timer count. This is intended for test        purposes. This bit resets LJT and clears LJTRUN if LJTEN bit is set.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SDSTEP</name>
							<description>Droop Voltage Step vdroop step i    SDSTEP. This bit field defines the voltage offset for droop compensation on a        load jump to the EVRC setpoint value. The request is made via SCU PMTRCSR3 .VDROOPREQ  sd droop cntr i   on        an anticipated load jump with a voltage offset equal to the SDSTEP x        5  160 mV. The droop step is a positive offset if VDROOPREQ  160    160 01b and is a        negative offset if VDROOPREQ  160    160 10b and no offset is applied if        VDROOPREQ  160    160 00b. Maximum Droop   80  160 mV.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VDTEN</name>
							<description>Voltage Droop Timer Enable   VDTEN. This bit field enables the usage of Voltage Droop timer.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VDTOVEN</name>
							<description>Voltage Droop Timer Overflow Enable   VDTOVEN. This bit field enables the update of VDTOV status bit on timer overflow        or time out.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VDTOVIEN</name>
							<description>Voltage Droop Timer Overflow Interrupt Enable   VDTOVIEN. This bit field enables the activation of interrupt on timer overflow or        time out.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VDTSTRT</name>
							<description>Voltage Droop Timer Start   VDTSTRT. This bit field starts Voltage Droop timer. This is intended for test        purposes. The VDTSTRT remains set on a write and is cleared when VDTOV        bit is set if VDTOVEN bit is enabled.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VDTSTP</name>
							<description>Voltage Droop Timer Stop   VDTSTP. This bit field stops Voltage Droop timer. SCU cancels the droop request        via signal sd droop cntr i  160    160 00. This is intended for test purposes. The        VDTSTP remains set on a write and is to be explicitly cleared by        software. The VDTSTP stops the counter at the current value and timer        re starts from that value when VDTSTP is cleared and VDTSTRT is set.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VDTCLR</name>
							<description>Voltage Droop Timer Clear   VDTCLR. This bit field clear Voltage Droop timer count. This is intended for        test purposes. This bit resets VDT and clears VDTRUN if VDTEN bit is set.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LPSLPEN</name>
							<description>EVRC Low Power Mode activation on a Sleep Request   LPSLPEN. PMS  This bit field enables the activation of LPM EVRC mode on a sleep request. If this bit is set   SCU sends lp enable signal on Sleep request to PMS which is OR ed with EVRSDCTRL2.EVRCMOD value and is provided to EVRC regulator. PMSLE  Reserved  no function  no LPM for SC DCDC EVRC .</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMTRCSR1</name>
					<description>Power Management Transition Control and Status Register 1
 resetvalue={Cold PowerOn Reset:0x0}</description>
					<addressOffset>412</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LJTCV</name>
							<description>Load Jump Timer Compare Setpoint Value   LJTCV. This bit field defines the compare setpoint value of Load Jump timer.        The compare event would lead to LJTOV bit being set and LJT interrupt        being raised. The LJTRUN status bit  LDJMPREQ bit and LJTCNT value is        reset to 0 on a compare event.   160   160 X  160 us is the compare value. LSB  160  1  160 us. Total range  160    160 65.5  160 ms</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VDTCV</name>
							<description>Voltage Droop Timer Compare Setpoint Value   VDTCV. This bit field defines the compare setpoint value of Voltage Droop        timer. The compare event would lead to VDTOV bit being set and VDT        interrupt being raised. The VDTRUN status bit  VDROOPREQ bit and VDTCNT        value is reset to 0 on a compare event.   160   160 X  160 us is the compare value. LSB  160  1  160 us. Total range  160    160 1023  160 us</description>
							<lsb>16</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMTRCSR2</name>
					<description>Power Management Transition Control and Status Register 2
 resetvalue={Cold PowerOn Reset:0x0}</description>
					<addressOffset>416</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LDJMPREQ</name>
							<description>Load Jump Request   LDJMPREQ. This bit requests a Load Jump consequently leading to Load Jump Timer        start and LJTRUN bit being set if        LJTEN 1. The request is not taken if LJTRUN bit is already in set state        and LJT is currently running. The request is not taken if VDTRUN bit is        already in set state and VDT is currently running. The request is also        not taken if  LJTOV bit is set AND LJTOVEN bit is enabled . The request        is also not taken if  VDTOV bit is set AND VDTOVEN bit is enabled . The        LDJMPREQ bit is cleared on a compare overflow. All other bit combinations are reserved.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LJTRUN</name>
							<description>Load Jump Timer Run Status   LJTRUN. This status bit indicates that the Load Jump timer is currently running        and a Load Jump is currently taking place. The LJTRUN bit is cleared on        a compare overflow. All other bit combinations are reserved.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LJTOV</name>
							<description>Load Jump Timer Overflow Status   LJTOV. This status bit indicates that the Load Jump timer compare match has        happened. if LJTOVEN bit is enabled  then LJTOV can only be cleared        explicitly via LJTOVCLR bit. if LJTOVEN bit is disabled  LJTOV is cleared on a taken Load Jump        Request  A new Load Jump request is        taken only if both LJT  amp  VDT are not currently running and no active        Load Jump request is being processed  . LJTOV being set will lead        to an interrupt if LJTOVIEN is enabled.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LJTOVCLR</name>
							<description>Load Jump Timer Overflow Status Clear   LJTOVCLR. This bit clears LJTOV status bit and sets VDROOPREQ and LDJMPREQ to 0 if        LJTOVEN bit is enabled. This bit always reads as 0.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LJTCNT</name>
							<description>Load Jump Timer Value   LJTCNT. This bit field reflects the current Load Jump timer value. LJTCNT value is cleared on timer overflow and on a taken Load Jump Request X us is the compare value. LSB  1 us. Total range   65.5 ms</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMTRCSR3</name>
					<description>Power Management Transition Control and Status Register 3
 resetvalue={Cold PowerOn Reset:0x0}</description>
					<addressOffset>420</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>VDROOPREQ</name>
							<description>Voltage Droop Request   VDROOPREQ. This bit requests a Voltage Droop consequently leading to Voltage Droop        Timer start and VDTRUN bit being set if        VDTEN 1 . The request is not taken if VDTRUN bit is already in        set state and VDT is currently running. The request is also not taken if         VDTOV bit is set AND VDTOVEN bit is enabled . The droop step is a        positive offset if sd droop cntr i  160    160 01 and is a negative offset if        sd droop cntr i  160    160 10 and no offset is applied if sd droop cntr i  160    160 00        and is applied immediately.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VDTRUN</name>
							<description>Voltage Droop Timer Run Status   VDTRUN. This status bit indicates that the Voltage Droop timer is currently running and a Voltage Droop is currently taking place. The VDTRUN bit is cleared on a compare overflow. All other bit combinations are reserved.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>VDTOV</name>
							<description>Voltage Droop Timer Overflow Status   VDTOV. This status bit indicates that the Voltage Droop timer compare match has happened. if VDTOVEN bit is enabled  then VDTOV can only be cleared by explicitly via VDTOVCLR bit. if VDTOVEN bit is disabled  VDTOV is cleared on a taken Voltage Droop Request  A new Voltage Droop request is taken only if both LJT  amp  VDT are not currently running and no active Voltage Droop request is being processed  . VDTOV being set will lead to an interrupt if VDTOVIEN is enabled. Incase SDVOK is set by EVRC before VDT compare match  VDTOV bit is not set.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>VDTOVCLR</name>
							<description>Voltage Droop Timer Overflow Status Clear   VDTOVCLR. This bit clears VDTOV status bit if VDTOVEN bit is enabled. If VDTOVEN bit is disabled  this bit has no effect. This bit always reads as 0.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>VDTCNT</name>
							<description>Voltage Droop Timer Value   VDTCNT. This bit field reflects the current Voltage Droop timer value. VDTCNT value is cleared on timer overflow and on a taken Voltage Droop Request.   X us is the compare value. LSB  1 us. Total range   65.5 ms</description>
							<lsb>16</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
