J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>SMU</name>
			<version>100</version>
			<description>SMU</description>
			<baseAddress>4026755072</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>2048</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<cluster>
					<dim>12</dim>
					<dimIncrement>4</dimIncrement>
					<name>AGiCFj[%s]</name>
					<description> AGRP</description>
					<addressOffset>256</addressOffset>
					<register>
						<dim>3</dim>
						<dimIncrement>4</dimIncrement>
						<name>AGiCFj_[%s]</name>
						<description>Alarm Configuration Register
 resetvalue={Application Reset:0x0,Application Reset:0x1FC00,Application Reset:0x30000}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294706175</resetMask>
						<fields>
							<field>
								<name>CF0</name>
								<description>Configuration flag x  x 0 2  for alarm 31 belonging to alarm group i.   CF31. The configuration flags 0  1 and 2 must be used together to define the        behavior of the SMU core when a fault state is reported by the alarm n        belonging to this group.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CF1</name>
								<description>Configuration flag x  x 0 2  for alarm 31 belonging to alarm group i.   CF31. The configuration flags 0  1 and 2 must be used together to define the        behavior of the SMU core when a fault state is reported by the alarm n        belonging to this group.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CF2</name>
								<description>Configuration flag x  x 0 2  for alarm 31 belonging to alarm group i.   CF31. The configuration flags 0  1 and 2 must be used together to define the        behavior of the SMU core when a fault state is reported by the alarm n        belonging to this group.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CF4</name>
								<description>Configuration flag x  x 0 2  for alarm 31 belonging to alarm group i.   CF31. The configuration flags 0  1 and 2 must be used together to define the        behavior of the SMU core when a fault state is reported by the alarm n        belonging to this group.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CF5</name>
								<description>Configuration flag x  x 0 2  for alarm 31 belonging to alarm group i.   CF31. The configuration flags 0  1 and 2 must be used together to define the        behavior of the SMU core when a fault state is reported by the alarm n        belonging to this group.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CF6</name>
								<description>Configuration flag x  x 0 2  for alarm 31 belonging to alarm group i.   CF31. The configuration flags 0  1 and 2 must be used together to define the        behavior of the SMU core when a fault state is reported by the alarm n        belonging to this group.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CF7</name>
								<description>Configuration flag x  x 0 2  for alarm 31 belonging to alarm group i.   CF31. The configuration flags 0  1 and 2 must be used together to define the        behavior of the SMU core when a fault state is reported by the alarm n        belonging to this group.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CF8</name>
								<description>Configuration flag x  x 0 2  for alarm 31 belonging to alarm group i.   CF31. The configuration flags 0  1 and 2 must be used together to define the        behavior of the SMU core when a fault state is reported by the alarm n        belonging to this group.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CF9</name>
								<description>Configuration flag x  x 0 2  for alarm 31 belonging to alarm group i.   CF31. The configuration flags 0  1 and 2 must be used together to define the        behavior of the SMU core when a fault state is reported by the alarm n        belonging to this group.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CF10</name>
								<description>Configuration flag x  x 0 2  for alarm 31 belonging to alarm group i.   CF31. The configuration flags 0  1 and 2 must be used together to define the        behavior of the SMU core when a fault state is reported by the alarm n        belonging to this group.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CF11</name>
								<description>Configuration flag x  x 0 2  for alarm 31 belonging to alarm group i.   CF31. The configuration flags 0  1 and 2 must be used together to define the        behavior of the SMU core when a fault state is reported by the alarm n        belonging to this group.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CF12</name>
								<description>Configuration flag x  x 0 2  for alarm 31 belonging to alarm group i.   CF31. The configuration flags 0  1 and 2 must be used together to define the        behavior of the SMU core when a fault state is reported by the alarm n        belonging to this group.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CF13</name>
								<description>Configuration flag x  x 0 2  for alarm 31 belonging to alarm group i.   CF31. The configuration flags 0  1 and 2 must be used together to define the        behavior of the SMU core when a fault state is reported by the alarm n        belonging to this group.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CF14</name>
								<description>Configuration flag x  x 0 2  for alarm 31 belonging to alarm group i.   CF31. The configuration flags 0  1 and 2 must be used together to define the        behavior of the SMU core when a fault state is reported by the alarm n        belonging to this group.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CF22</name>
								<description>Configuration flag x  x 0 2  for alarm 31 belonging to alarm group i.   CF31. The configuration flags 0  1 and 2 must be used together to define the        behavior of the SMU core when a fault state is reported by the alarm n        belonging to this group.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CF23</name>
								<description>Configuration flag x  x 0 2  for alarm 31 belonging to alarm group i.   CF31. The configuration flags 0  1 and 2 must be used together to define the        behavior of the SMU core when a fault state is reported by the alarm n        belonging to this group.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CF24</name>
								<description>Configuration flag x  x 0 2  for alarm 31 belonging to alarm group i.   CF31. The configuration flags 0  1 and 2 must be used together to define the        behavior of the SMU core when a fault state is reported by the alarm n        belonging to this group.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
				<register>
					<name>CLC</name>
					<description>Clock Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit   DISR. Used for enable disable control of the module.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit   DISS. Bit indicates the current status of the module.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EDIS</name>
							<description>Sleep Mode Enable Control   EDIS. Used to control module  8217 s sleep mode. Sleep Mode is not supported by the safety applications. During the        process of entering and resuming from sleep mode  the intended        processing of alarm events is not guaranteed.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Module Identification Register
 resetvalue={Application Reset:0x089C001}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>9027585</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision Number   MOD REV. This bit field defines the module revision number. The value of a module        revision starts with 01H  first revision .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type   MOD TYPE. The bit field is set to C0H which defines the module as a 32 bit module.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number Value   MOD NUMBER. This bit field defines a module identification number. The value for the SMU module is 0089H.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMD</name>
					<description>Command Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>32</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CMD</name>
							<description>Implements the SMU core Command Interface.   CMD. See CROSSREFERENCE for the command encoding. Read as 0.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ARG</name>
							<description>Implements the SMU core Command Interface.   ARG. Argument to be used with the command. See CROSSREFERENCE for the argument encoding. Read as 0.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STS</name>
					<description>Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>36</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294964223</resetMask>
					<fields>
						<field>
							<name>CMD</name>
							<description>Last command received   CMD. Same encoding as CMD field of SMU CMD register</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ARG</name>
							<description>Last command argument received   ARG. Same encoding as ARG field of SMU CMD register</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RES</name>
							<description>Result of last received command   RES</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ASCE</name>
							<description>Alarm Status Clear Enable   ASCE. This bit controls if a status flag set in an AG lt x gt  register upon        detection of an alarm event can be cleared by software or not. When ASCE is enabled software shall write a 1 to the bit position in        AG lt x gt  to clear the bit  W1C . When a W1C action takes place the ASCE bit        is automatically cleared to 0 by hardware and software shall set the        ASCE bit again by using the SMU ASCE   command.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FSP</name>
							<description>Fault Signaling Protocol status   FSP. FSP 0    FSP STS 0  input signal FSP 1    FSP STS 1  input signal This field is updated by hardware every clock cycle  therefore a software clear on write is not meaningful for this field. Note  When the FSP 0  and or FSP 1  is set in fault state by the SMU stdby this bitfield does not reflect the actual state of the ErrorPins. Indeed  the SMU stdby sets the ErrorPins in high impedence state to indicate the presence of a fault.</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FSTS</name>
							<description>Fault State Timing Status   FSTS. This bit indicates if the minimum timing duration of the FSP fault state        has been reached or not. The bit is cleared by hardware when the fault        state is entered.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RTS0</name>
							<description>Recovery Timer 0 Status   RTS0. See CROSSREFERENCE for the usage of this field.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RTME0</name>
							<description>Recovery Timer 0 Missed Event   RTME0. See CROSSREFERENCE for the usage of this field.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RTS1</name>
							<description>Recovery Timer 1 Status   RTS1. See CROSSREFERENCE for the usage of this field.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RTME1</name>
							<description>Recovery Timer 1 Missed Event   RTME1. See CROSSREFERENCE for the usage of this field.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FSP</name>
					<description>Fault Signaling Protocol
 resetvalue={PowerOn Reset:0x3FFF00}</description>
					<addressOffset>40</addressOffset>
					<size>32</size>
					<resetValue>4194048</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PRE1</name>
							<description>Prescaler1   PRE1. Dividing factor to apply to the reference clock fBACK. It is assumed that the maximal value for fBACK is 100 MHz with a precision of 5 . The divided clock is used as reference to generate the timing of the fault signaling protocol fault state. It is only allowed to write PRE1 when the SMU is not in the Fault State and FSP is in Bi stable protocol mode. Also  it is not allowed to write to the PRE1 when at least one recovery timer is running. The frequency of the divided clock  called FSMU FS  is defined as follows </description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRE2</name>
							<description>Prescaler2   PRE2. Dividing factor to apply to the reference clock fBACK in order to generate the timing of the fault free state for the dynamic dual rail and time switching modes of the fault signaling protocol. It is only allowed to write PPRE2 when the SMU is not in the Fault State and FSP is in Bi stable protocol mode. The frequency of the divided clock  called FSMU FFS  is defined as follows </description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE</name>
							<description>Fault Signaling Protocol configuration   MODE</description>
							<lsb>5</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PES</name>
							<description>Port Emergency Stop  PES    PES. When this bit is set a Port Emergency Stop is automatically requested        when an alarm event configured to start the Fault Signaling Protocol is        detected.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TFSP_LOW</name>
							<description>Specifies the FSP fault state duration   TFSP LOW. TFSP FS TSMU FS    concatenate TFSP HIGH TFSP LOW    1 . TFSP LOW shall be specified as a number of FSMU FS ticks. TFSP LOW is defined so that the minimum duration is greater than 250 us. It can not be changed by software.</description>
							<lsb>8</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TFSP_HIGH</name>
							<description>Specifies the FSP fault state duration   TFSP HIGH. TFSP FS  TSMU FS    concatenate TFSP HIGH TFSP LOW    1 . TFSP HIGH shall be specified as a number of FSMU FS ticks. TFSP HIGH and PRE1 shall enable to configure a fault state duration of 500 ms. It is only allowed to write TFSP HIGH when the SMU is not in the Fault State and FSP is in Bi stable protocol mode.</description>
							<lsb>22</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AGC</name>
					<description>Alarm Global Configuration
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>44</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>IGCS0</name>
							<description>Interrupt Generation Configuration Set 0   IGCS0. Defines the output value of the interrupt request vector when the alarm        configuration flag selects the interrupt configuration set 0. Enables to        issue an interrupt request to several CPUs  see CROSSREFERENCE .</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IGCS1</name>
							<description>Interrupt Generation Configuration Set 1   IGCS1. Defines the output value of the interrupt request vector when the alarm        configuration flag selects the interrupt configuration set 1. Enables to        issue an interrupt request to several CPUs  see CROSSREFERENCE .</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IGCS2</name>
							<description>Interrupt Generation Configuration Set 2   IGCS2. Defines the output value of the interrupt request vector when the alarm        configuration flag selects the interrupt configuration set 2. Enables to        issue an interrupt request to several CPUs  see CROSSREFERENCE .</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RCS</name>
							<description>CPU Reset Configuration Set   RCS. Defines the output value of the CPU reset request vector when the alarm configuration flag selects the CPU Reset Configuration Set. Enables to issue an reset request to several CPUs if required. More complex reset scenarios can be handled by using software interrupts. Setting the bit n to 1 enables issuing a reset request to CPUn.</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PES</name>
							<description>Port Emergency Stop   PES. This field enables control of the Port Emergency Stop  PES  feature        independently for each internal action. When an action is triggered and        if the corresponding bit  as defined below  is set  the hardware        triggers automatically a port emergency stop request. Each bit of PES is        allocated to an action as follows </description>
							<lsb>24</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EFRST</name>
							<description>Enable FAULT to RUN State Transition   EFRST. See CROSSREFERENCE chapter for the usage of this field.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RTC</name>
					<description>Recovery Timer Configuration
 resetvalue={Application Reset:0x3FFF03}</description>
					<addressOffset>48</addressOffset>
					<size>32</size>
					<resetValue>4194051</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RT0E</name>
							<description>RT0 Enable Bit   RT0E</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RT1E</name>
							<description>RT1 Enable Bit   RT1E</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RTD</name>
							<description>Recovery Timer Duration   RTD. This field specifies the maximum duration of the recovery timer. When the timer counter reaches the programmed value  the internal alarm rt timeout is issued. The timer is stopped by a SMU RTStop   command before the recovery timer. RTD shall be specified as a number of the FSMU FS clock ticks. It is not allowed to write to the RTD when at least one recovery timer is running.</description>
							<lsb>8</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KEYS</name>
					<description>Key Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>52</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CFGLCK</name>
							<description>Configuration Lock   CFGLCK. The SMU core configuration is only possible if this field is set to        0xBC. Refer to CROSSREFERENCE for the list of registers controlled by this field.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PERLCK</name>
							<description>Permanent Lock   PERLCK. If this field is set to 0xFF  no further configuration of the SMU core        is possible. Refer to CROSSREFERENCE for the list of registers controlled by this field.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DBG</name>
					<description>Debug Register
 resetvalue={PowerOn Reset:0x0}</description>
					<addressOffset>56</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SSM</name>
							<description>Running state of the SMU core State Machine   SSM</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
