J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>PCTL</name>
					<description>Port Control
 resetvalue={PowerOn Reset:0x08000}</description>
					<addressOffset>60</addressOffset>
					<size>32</size>
					<resetValue>32768</resetValue>
					<resetMask>4286644223</resetMask>
					<fields>
						<field>
							<name>HWDIR</name>
							<description>Port Direction.   HWDIR. This bitfield directly controls the value of the FSP DIR output signal. Also        refer to the General Purpose I O Ports chapter for the HW DIR signal        specification.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HWEN</name>
							<description>Port Enable   HWEN. This bitfied directly controls the value of the FSP EN output signal. When        set to 11b the port output is directly driven by SMU core  FSP 1 0  . Also        refer to the General Purpose I O Ports chapter for the HW EN signal        specification.</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GFSCU_EN</name>
							<description>Glitch Filter for ErrorPin SMU FSP0 to SCU enable   GFSCU EN</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GFSTS_EN</name>
							<description>Glitch Filter for ErrorPin SMU FSP0 to register SMU STS enable   GFSTS EN</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PCS</name>
							<description>PAD Configuration Select   PCS. This bit controls the latching of the SMU core FSP  Error Pin  PAD        configuration signals to ensure that upon an application reset or system        reset the SMU core FSP  Error Pin  PAD configuration is not affected.        This field is only reset by power on reset. Only with the first transition from 0 to 1 of          this field the SMU core FSP is operational. Any further configuration          change in this bit field has no effect to the hardware . The fields HWDIR  HWEN and PCS shall be          configured with a single software write command. Configuring each          bit field separately may lead to configuration inconsistencies. Refer          to CROSSREFERENCE for the overview of the SMU core FSP  Error Pin  connectivity. The Error Pin Pad shall be configured to the          targeted function in the Port control logic before the SMU core takes          over the control.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AFCNT</name>
					<description>Alarm and Fault Counter
 resetvalue={PowerOn Reset:0x0}</description>
					<addressOffset>64</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FCNT</name>
							<description>Fault Counter.   FCNT. This field is incremented by hardware when the SMU core state machine        goes from the RUN state to the FAULT state  see CROSSREFERENCE  .        The counter value holds if the maximum value is reached.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ACNT</name>
							<description>Alarm Counter.   ACNT. This field is incremented by hardware when the SMU core processes an        internal action related to an alarm event  see CROSSREFERENCE  .        The counter value holds if the maximum value is reached.</description>
							<lsb>4</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FCO</name>
							<description>Fault Counter Overflow.   FCO. This bit is set by hardware if the FCNT counter reached the maximum        value and an increment condition is present.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ACO</name>
							<description>Alarm Counter Overflow.   ACO. This bit is set by hardware if the ACNT counter reached the maximum        value and an increment condition is present.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RTAC00</name>
					<description>Recovery Timer 0 Alarm Configuration 0
 resetvalue={Application Reset:0x0A80108}</description>
					<addressOffset>96</addressOffset>
					<size>32</size>
					<resetValue>11010312</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>GID0</name>
							<description>Group Index 0.   GID0. This field enables to specify if an alarm from this alarm group can use        the recovery timer 0. The functionality of this field is described in CROSSREFERENCE .</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ALID0</name>
							<description>Alarm Identifier 0.   ALID0. This field specifies the alarm index related to the group index        specified in GID0.</description>
							<lsb>4</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GID1</name>
							<description>Group Index 1.   GID1. This field enables to specify if an alarm from this alarm group can use        the recovery timer 0. The functionality of this field is described in CROSSREFERENCE .</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ALID1</name>
							<description>Alarm Identifier 1.   ALID1. This field specifies the alarm index related to the group index        specified in GID1.</description>
							<lsb>20</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RTAC01</name>
					<description>Recovery Timer 0 Alarm Configuration 1
 resetvalue={Application Reset:0x0C800B8}</description>
					<addressOffset>100</addressOffset>
					<size>32</size>
					<resetValue>13107384</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>GID2</name>
							<description>Group Index 2.   GID2. This field enables to specify if an alarm from this alarm group can use        the recovery timer 0. The functionality of this field is described in CROSSREFERENCE .</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ALID2</name>
							<description>Alarm Identifier 0.   ALID2. This field specifies the alarm index related to the group index        specified in GID2.</description>
							<lsb>4</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GID3</name>
							<description>Group Index 3.   GID3. This field enables to specify if an alarm from this alarm group can use        the recovery timer 3. The functionality of this field is described in CROSSREFERENCE .</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ALID3</name>
							<description>Alarm Identifier 1.   ALID3. This field specifies the alarm index related to the group index        specified in GID3.</description>
							<lsb>20</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RTAC10</name>
					<description>Recovery Timer 1 Alarm Configuration 0
 resetvalue={Application Reset:0x0E800D8}</description>
					<addressOffset>104</addressOffset>
					<size>32</size>
					<resetValue>15204568</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>GID0</name>
							<description>Group Index 0.   GID0. This field enables to specify if an alarm from this alarm group can use the recovery timer 1. The functionality of this field is described in CROSSREFERENCE .</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ALID0</name>
							<description>Alarm Identifier 0.   ALID0. This field specifies the alarm index related to the group index specified in GID0.</description>
							<lsb>4</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GID1</name>
							<description>Group Index 1.   GID1. This field enables to specify if an alarm from this alarm group can use the recovery timer 1. The functionality of this field is described in CROSSREFERENCE .</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ALID1</name>
							<description>Alarm Identifier 1.   ALID1. This field specifies the alarm index related to the group index specified in GID1.</description>
							<lsb>20</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RTAC11</name>
					<description>Recovery Timer 1 Alarm Configuration 1
 resetvalue={Application Reset:0x0F800F8}</description>
					<addressOffset>108</addressOffset>
					<size>32</size>
					<resetValue>16253176</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>GID2</name>
							<description>Group Index 2.   GID2. This field enables to specify if an alarm from this alarm group can use the recovery timer 1. The functionality of this field is described in CROSSREFERENCE .</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ALID2</name>
							<description>Alarm Identifier 2.   ALID2. This field specifies the alarm index related to the group index specified in GID2.</description>
							<lsb>4</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GID3</name>
							<description>Group Index 3.   GID3. This field enables to specify if an alarm from this alarm group can use the recovery timer 1. The functionality of this field is described in CROSSREFERENCE .</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ALID3</name>
							<description>Alarm Identifier 3.   ALID3. This field specifies the alarm index related to the group index specified in GID3.</description>
							<lsb>20</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AEX</name>
					<description>Alarm Executed Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>112</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>IRQ0STS</name>
							<description>IRQ0 Request Status   IRQ0STS. This bit indicates whether a IRQ0 request was serviced or not. This bit        is set by the SMU core after a alarm configured for IRQ0 is detected. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related AEXCLR register.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IRQ1STS</name>
							<description>IRQ1 Request Status   IRQ1STS. This bit indicates whether a IRQ1 request was serviced or not. This bit        is set by the SMU core after a alarm configured for IRQ1 is detected. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related AEXCLR register.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IRQ2STS</name>
							<description>IRQ2 Request Status   IRQ2STS. This bit indicates whether a IRQ2 request was serviced or not. This bit        is set by the SMU core after a alarm configured for IRQ2 is detected. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related AEXCLR register.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RST0STS</name>
							<description>RST0 Request Status   RST0STS. This bit indicates whether a RST0 request was serviced or not. This bit        is set by the SMU core after a alarm configured for RST0 is detected. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related AEXCLR register.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RST1STS</name>
							<description>RST1 Request Status   RST1STS. This bit indicates whether a RST1 request was serviced or not. This bit        is set by the SMU core after a alarm configured for RST1 is detected. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related AEXCLR register.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RST2STS</name>
							<description>RST2 Request Status   RST2STS. This bit indicates whether a RST2 request was serviced or not. This bit        is set by the SMU core after a alarm configured for RST2 is detected. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related AEXCLR register.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RST3STS</name>
							<description>RST3 Request Status   RST3STS. This bit indicates whether a RST3 request was serviced or not. This bit        is set by the SMU core after a alarm configured for RST3 is detected. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related AEXCLR register.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RST4STS</name>
							<description>RST4 Request Status   RST4STS. This bit indicates whether a RST4 request was serviced or not. This bit        is set by the SMU core after a alarm configured for RST4 is detected. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related AEXCLR register.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RST5STS</name>
							<description>RST5 Request Status   RST5STS. This bit indicates whether a RST5 request was serviced or not. This bit        is set by the SMU core after a alarm configured for RST5 is detected. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related AEXCLR register.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>NMISTS</name>
							<description>NMI Request Status   NMISTS. This bit indicates whether a NMI request was serviced or not. This bit        is set by the SMU core after a alarm configured for NMI is detected. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related AEXCLR register.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EMSSTS</name>
							<description>EMS Request Status   EMSSTS. This bit indicates whether a EMS request  triggered by an alarm  not        SMU ActivatePES   was serviced or not. This bit is set by the SMU core        after a alarm configured for EMS is detected. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related AEXCLR register.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IRQ0AEM</name>
							<description>IRQ0 AEM   IRQ0AEM. This bit indicates that an alarm event is missed. That means that an        alarm has occurred with configuration for IRQ0 Request where this alarm        handler was blocked because of AEX.IRQ0STS. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related AEXCLR register.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IRQ1AEM</name>
							<description>IRQ1 AEM   IRQ1AEM. This bit indicates that an alarm event is missed. That means that an        alarm has occurred with configuration for IRQ1 Request where this alarm        handler was blocked because of AEX.IRQ1STS. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related AEXCLR register.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IRQ2AEM</name>
							<description>IRQ2 AEM   IRQ2AEM. This bit indicates that an alarm event is missed. That means that an        alarm has occurred with configuration for IRQ2 Request where this alarm        handler was blocked because of AEX.IRQ2STS. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related AEXCLR register.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RST0AEM</name>
							<description>RST0 AEM   RST0AEM. This bit indicates that an alarm event is missed. That means that an        alarm has occurred with configuration for CPU RST0 Request where this        alarm handler was blocked because of AEX.RST0STS. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related AEXCLR register.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RST1AEM</name>
							<description>RST1 AEM   RST1AEM. This bit indicates that an alarm event is missed. That means that an        alarm has occurred with configuration for CPU RST1 Request where this        alarm handler was blocked because of AEX.RST1STS. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related AEXCLR register.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RST2AEM</name>
							<description>RST2 AEM   RST2AEM. This bit indicates that an alarm event is missed. That means that an        alarm has occurred with configuration for CPU RST2 Request where this        alarm handler was blocked because of AEX.RST2STS. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related AEXCLR register.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RST3AEM</name>
							<description>RST3 AEM   RST3AEM. This bit indicates that an alarm event is missed. That means that an        alarm has occurred with configuration for CPU RST3 Request where this        alarm handler was blocked because of AEX.RST3STS. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related AEXCLR register.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RST4AEM</name>
							<description>RST4 AEM   RST4AEM. This bit indicates that an alarm event is missed. That means that an        alarm has occurred with configuration for CPU RST4 Request where this        alarm handler was blocked because of AEX.RST4STS. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related AEXCLR register.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RST5AEM</name>
							<description>RST5 AEM   RST5AEM. This bit indicates that an alarm event is missed. That means that an        alarm has occurred with configuration for CPU RST5 Request where this        alarm handler was blocked because of AEX.RST5STS. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related AEXCLR register.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>NMIAEM</name>
							<description>NMI AEM   NMIAEM. This bit indicates that an alarm event is missed. That means that an        alarm has occurred with configuration for NMI Request where this alarm        handler was blocked because of AEX.NMISTS. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related AEXCLR register.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EMSAEM</name>
							<description>EMS AEM   EMSAEM. This bit indicates that an alarm event is missed. That means that an        alarm has occurred with configuration for EMS Request where this alarm        handler was blocked because of AEX.EMSSTS. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related AEXCLR register.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
