J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>AEXCLR</name>
					<description>Alarm Executed Status Clear Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>116</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>IRQ0CLR</name>
							<description>IRQ0 Request Status Clear   IRQ0CLR. Read always as 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>IRQ1CLR</name>
							<description>IRQ1 Request Status Clear   IRQ1CLR. Read always as 0.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>IRQ2CLR</name>
							<description>IRQ2 Request Status Clear   IRQ2CLR. Read always as 0.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RST0CLR</name>
							<description>RST0 Request Status Clear   RST0CLR. Read always as 0.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RST1CLR</name>
							<description>RST1 Request Status Clear   RST1CLR. Read always as 0.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RST2CLR</name>
							<description>RST2 Request Status Clear   RST2CLR. Read always as 0.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RST3CLR</name>
							<description>RST3 Request Status Clear   RST3CLR. Read always as 0.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RST4CLR</name>
							<description>RST4 Request Status Clear   RST4CLR. Read always as 0.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RST5CLR</name>
							<description>RST5 Request Status Clear   RST5CLR. Read always as 0.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NMICLR</name>
							<description>NMI Request Status Clear   NMICLR. Read always as 0.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>EMSCLR</name>
							<description>EMS Request Status Clear   EMSCLR. Read always as 0.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>IRQ0AEMCLR</name>
							<description>IRQ0 AEM Status Clear   IRQ0AEMCLR. Read always as 0.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>IRQ1AEMCLR</name>
							<description>IRQ1 AEM Status Clear   IRQ1AEMCLR. Read always as 0.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>IRQ2AEMCLR</name>
							<description>IRQ2 AEM Status Clear   IRQ2AEMCLR. Read always as 0.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RST0AEMCLR</name>
							<description>RST0 AEM Status Clear   RST0AEMCLR. Read always as 0.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RST1AEMCLR</name>
							<description>RST1 AEM Status Clear   RST1AEMCLR. Read always as 0.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RST2AEMCLR</name>
							<description>RST2 AEM Status Clear   RST2AEMCLR. Read always as 0.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RST3AEMCLR</name>
							<description>RST3 AEM Status Clear   RST3AEMCLR. Read always as 0.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RST4AEMCLR</name>
							<description>RST4 AEM Status Clear   RST4AEMCLR. Read always as 0.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RST5AEMCLR</name>
							<description>RST5 AEM Status Clear   RST5AEMCLR. Read always as 0.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NMIAEMCLR</name>
							<description>NMI AEM Status Clear   NMIAEMCLR. Read always as 0.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>EMSAEMCLR</name>
							<description>EMS AEM Status Clear   EMSAEMCLR. Read always as 0.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>12</dim>
					<dimIncrement>4</dimIncrement>
					<name>AGiFSP[%s]</name>
					<description>SMU core FSP Configuration Register
 resetvalue={Application Reset:0x0,Application Reset:0x30000}</description>
					<addressOffset>400</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294770687</resetMask>
					<fields>
						<field>
							<name>FE0</name>
							<description>Fault signaling configuration flag for alarm 31 belonging to alarm group i.   FE31</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE1</name>
							<description>Fault signaling configuration flag for alarm 31 belonging to alarm group i.   FE31</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE2</name>
							<description>Fault signaling configuration flag for alarm 31 belonging to alarm group i.   FE31</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE4</name>
							<description>Fault signaling configuration flag for alarm 31 belonging to alarm group i.   FE31</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE5</name>
							<description>Fault signaling configuration flag for alarm 31 belonging to alarm group i.   FE31</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE6</name>
							<description>Fault signaling configuration flag for alarm 31 belonging to alarm group i.   FE31</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE7</name>
							<description>Fault signaling configuration flag for alarm 31 belonging to alarm group i.   FE31</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE8</name>
							<description>Fault signaling configuration flag for alarm 31 belonging to alarm group i.   FE31</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE9</name>
							<description>Fault signaling configuration flag for alarm 31 belonging to alarm group i.   FE31</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE10</name>
							<description>Fault signaling configuration flag for alarm 31 belonging to alarm group i.   FE31</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE11</name>
							<description>Fault signaling configuration flag for alarm 31 belonging to alarm group i.   FE31</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE12</name>
							<description>Fault signaling configuration flag for alarm 31 belonging to alarm group i.   FE31</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE13</name>
							<description>Fault signaling configuration flag for alarm 31 belonging to alarm group i.   FE31</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE14</name>
							<description>Fault signaling configuration flag for alarm 31 belonging to alarm group i.   FE31</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE22</name>
							<description>Fault signaling configuration flag for alarm 31 belonging to alarm group i.   FE31</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE23</name>
							<description>Fault signaling configuration flag for alarm 31 belonging to alarm group i.   FE31</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE24</name>
							<description>Fault signaling configuration flag for alarm 31 belonging to alarm group i.   FE31</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>12</dim>
					<dimIncrement>4</dimIncrement>
					<name>AGi[%s]</name>
					<description>Alarm Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>448</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SF0</name>
							<description>Status flag for alarm 31 belonging to alarm group i.   SF31</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF1</name>
							<description>Status flag for alarm 31 belonging to alarm group i.   SF31</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF2</name>
							<description>Status flag for alarm 31 belonging to alarm group i.   SF31</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF4</name>
							<description>Status flag for alarm 31 belonging to alarm group i.   SF31</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF5</name>
							<description>Status flag for alarm 31 belonging to alarm group i.   SF31</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF6</name>
							<description>Status flag for alarm 31 belonging to alarm group i.   SF31</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF7</name>
							<description>Status flag for alarm 31 belonging to alarm group i.   SF31</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF8</name>
							<description>Status flag for alarm 31 belonging to alarm group i.   SF31</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF9</name>
							<description>Status flag for alarm 31 belonging to alarm group i.   SF31</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF10</name>
							<description>Status flag for alarm 31 belonging to alarm group i.   SF31</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF11</name>
							<description>Status flag for alarm 31 belonging to alarm group i.   SF31</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF12</name>
							<description>Status flag for alarm 31 belonging to alarm group i.   SF31</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF13</name>
							<description>Status flag for alarm 31 belonging to alarm group i.   SF31</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF14</name>
							<description>Status flag for alarm 31 belonging to alarm group i.   SF31</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF22</name>
							<description>Status flag for alarm 31 belonging to alarm group i.   SF31</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF23</name>
							<description>Status flag for alarm 31 belonging to alarm group i.   SF31</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF24</name>
							<description>Status flag for alarm 31 belonging to alarm group i.   SF31</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>12</dim>
					<dimIncrement>4</dimIncrement>
					<name>ADi[%s]</name>
					<description>Alarm Debug Register
 resetvalue={PowerOn Reset:0x0}</description>
					<addressOffset>512</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DF0</name>
							<description>Diagnosis flag for alarm 31 belonging to alarm group i.   DF31. The diagnosis registers make a snapshot of the alarm group status        registers when either the executed alarm action is a reset or a state        machine transition to FAULT state takes place.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DF1</name>
							<description>Diagnosis flag for alarm 31 belonging to alarm group i.   DF31. The diagnosis registers make a snapshot of the alarm group status        registers when either the executed alarm action is a reset or a state        machine transition to FAULT state takes place.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DF2</name>
							<description>Diagnosis flag for alarm 31 belonging to alarm group i.   DF31. The diagnosis registers make a snapshot of the alarm group status        registers when either the executed alarm action is a reset or a state        machine transition to FAULT state takes place.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DF4</name>
							<description>Diagnosis flag for alarm 31 belonging to alarm group i.   DF31. The diagnosis registers make a snapshot of the alarm group status        registers when either the executed alarm action is a reset or a state        machine transition to FAULT state takes place.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DF5</name>
							<description>Diagnosis flag for alarm 31 belonging to alarm group i.   DF31. The diagnosis registers make a snapshot of the alarm group status        registers when either the executed alarm action is a reset or a state        machine transition to FAULT state takes place.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DF6</name>
							<description>Diagnosis flag for alarm 31 belonging to alarm group i.   DF31. The diagnosis registers make a snapshot of the alarm group status        registers when either the executed alarm action is a reset or a state        machine transition to FAULT state takes place.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DF7</name>
							<description>Diagnosis flag for alarm 31 belonging to alarm group i.   DF31. The diagnosis registers make a snapshot of the alarm group status        registers when either the executed alarm action is a reset or a state        machine transition to FAULT state takes place.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DF8</name>
							<description>Diagnosis flag for alarm 31 belonging to alarm group i.   DF31. The diagnosis registers make a snapshot of the alarm group status        registers when either the executed alarm action is a reset or a state        machine transition to FAULT state takes place.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DF9</name>
							<description>Diagnosis flag for alarm 31 belonging to alarm group i.   DF31. The diagnosis registers make a snapshot of the alarm group status        registers when either the executed alarm action is a reset or a state        machine transition to FAULT state takes place.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DF10</name>
							<description>Diagnosis flag for alarm 31 belonging to alarm group i.   DF31. The diagnosis registers make a snapshot of the alarm group status        registers when either the executed alarm action is a reset or a state        machine transition to FAULT state takes place.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DF11</name>
							<description>Diagnosis flag for alarm 31 belonging to alarm group i.   DF31. The diagnosis registers make a snapshot of the alarm group status        registers when either the executed alarm action is a reset or a state        machine transition to FAULT state takes place.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DF12</name>
							<description>Diagnosis flag for alarm 31 belonging to alarm group i.   DF31. The diagnosis registers make a snapshot of the alarm group status        registers when either the executed alarm action is a reset or a state        machine transition to FAULT state takes place.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DF13</name>
							<description>Diagnosis flag for alarm 31 belonging to alarm group i.   DF31. The diagnosis registers make a snapshot of the alarm group status        registers when either the executed alarm action is a reset or a state        machine transition to FAULT state takes place.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DF14</name>
							<description>Diagnosis flag for alarm 31 belonging to alarm group i.   DF31. The diagnosis registers make a snapshot of the alarm group status        registers when either the executed alarm action is a reset or a state        machine transition to FAULT state takes place.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DF22</name>
							<description>Diagnosis flag for alarm 31 belonging to alarm group i.   DF31. The diagnosis registers make a snapshot of the alarm group status        registers when either the executed alarm action is a reset or a state        machine transition to FAULT state takes place.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DF23</name>
							<description>Diagnosis flag for alarm 31 belonging to alarm group i.   DF31. The diagnosis registers make a snapshot of the alarm group status        registers when either the executed alarm action is a reset or a state        machine transition to FAULT state takes place.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DF24</name>
							<description>Diagnosis flag for alarm 31 belonging to alarm group i.   DF31. The diagnosis registers make a snapshot of the alarm group status        registers when either the executed alarm action is a reset or a state        machine transition to FAULT state takes place.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
