J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>RMCTL</name>
					<description>Register Monitor Control
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>768</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TE0</name>
							<description>Test Enable.   TE31. This bit controls the test of the of the register monitor safety mechanism. Setting this bit starts the selft test of the safety flip flops in the corresponding module.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TE1</name>
							<description>Test Enable.   TE31. This bit controls the test of the of the register monitor safety mechanism. Setting this bit starts the selft test of the safety flip flops in the corresponding module.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TE2</name>
							<description>Test Enable.   TE31. This bit controls the test of the of the register monitor safety mechanism. Setting this bit starts the selft test of the safety flip flops in the corresponding module.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TE3</name>
							<description>Test Enable.   TE31. This bit controls the test of the of the register monitor safety mechanism. Setting this bit starts the selft test of the safety flip flops in the corresponding module.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TE4</name>
							<description>Test Enable.   TE31. This bit controls the test of the of the register monitor safety mechanism. Setting this bit starts the selft test of the safety flip flops in the corresponding module.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TE5</name>
							<description>Test Enable.   TE31. This bit controls the test of the of the register monitor safety mechanism. Setting this bit starts the selft test of the safety flip flops in the corresponding module.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TE6</name>
							<description>Test Enable.   TE31. This bit controls the test of the of the register monitor safety mechanism. Setting this bit starts the selft test of the safety flip flops in the corresponding module.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TE7</name>
							<description>Test Enable.   TE31. This bit controls the test of the of the register monitor safety mechanism. Setting this bit starts the selft test of the safety flip flops in the corresponding module.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TE8</name>
							<description>Test Enable.   TE31. This bit controls the test of the of the register monitor safety mechanism. Setting this bit starts the selft test of the safety flip flops in the corresponding module.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TE9</name>
							<description>Test Enable.   TE31. This bit controls the test of the of the register monitor safety mechanism. Setting this bit starts the selft test of the safety flip flops in the corresponding module.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TE10</name>
							<description>Test Enable.   TE31. This bit controls the test of the of the register monitor safety mechanism. Setting this bit starts the selft test of the safety flip flops in the corresponding module.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RMEF</name>
					<description>Register Monitor Error Flags
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>772</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EF0</name>
							<description>Status flag related to the different instances of the register monitor safety mechanism.   EF31. It reports a real flip flop failure in non test mode as well as an        unexpected behavior in test mode. This flag can only be cleared by software  a set by software has no        effect</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EF1</name>
							<description>Status flag related to the different instances of the register monitor safety mechanism.   EF31. It reports a real flip flop failure in non test mode as well as an        unexpected behavior in test mode. This flag can only be cleared by software  a set by software has no        effect</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EF2</name>
							<description>Status flag related to the different instances of the register monitor safety mechanism.   EF31. It reports a real flip flop failure in non test mode as well as an        unexpected behavior in test mode. This flag can only be cleared by software  a set by software has no        effect</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EF3</name>
							<description>Status flag related to the different instances of the register monitor safety mechanism.   EF31. It reports a real flip flop failure in non test mode as well as an        unexpected behavior in test mode. This flag can only be cleared by software  a set by software has no        effect</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EF4</name>
							<description>Status flag related to the different instances of the register monitor safety mechanism.   EF31. It reports a real flip flop failure in non test mode as well as an        unexpected behavior in test mode. This flag can only be cleared by software  a set by software has no        effect</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EF5</name>
							<description>Status flag related to the different instances of the register monitor safety mechanism.   EF31. It reports a real flip flop failure in non test mode as well as an        unexpected behavior in test mode. This flag can only be cleared by software  a set by software has no        effect</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EF6</name>
							<description>Status flag related to the different instances of the register monitor safety mechanism.   EF31. It reports a real flip flop failure in non test mode as well as an        unexpected behavior in test mode. This flag can only be cleared by software  a set by software has no        effect</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EF7</name>
							<description>Status flag related to the different instances of the register monitor safety mechanism.   EF31. It reports a real flip flop failure in non test mode as well as an        unexpected behavior in test mode. This flag can only be cleared by software  a set by software has no        effect</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EF8</name>
							<description>Status flag related to the different instances of the register monitor safety mechanism.   EF31. It reports a real flip flop failure in non test mode as well as an        unexpected behavior in test mode. This flag can only be cleared by software  a set by software has no        effect</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EF9</name>
							<description>Status flag related to the different instances of the register monitor safety mechanism.   EF31. It reports a real flip flop failure in non test mode as well as an        unexpected behavior in test mode. This flag can only be cleared by software  a set by software has no        effect</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EF10</name>
							<description>Status flag related to the different instances of the register monitor safety mechanism.   EF31. It reports a real flip flop failure in non test mode as well as an        unexpected behavior in test mode. This flag can only be cleared by software  a set by software has no        effect</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RMSTS</name>
					<description>Register Monitor Self Test Status
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>776</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>STS0</name>
							<description>Ready flag related to the different instances of the register monitor safety mechanism.   STS31. A logical   8216 1  8217  of this bit indicates that the register monitor test has        been executed. This bit can only be cleared by software  a set by        software has no effect.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STS1</name>
							<description>Ready flag related to the different instances of the register monitor safety mechanism.   STS31. A logical   8216 1  8217  of this bit indicates that the register monitor test has        been executed. This bit can only be cleared by software  a set by        software has no effect.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STS2</name>
							<description>Ready flag related to the different instances of the register monitor safety mechanism.   STS31. A logical   8216 1  8217  of this bit indicates that the register monitor test has        been executed. This bit can only be cleared by software  a set by        software has no effect.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STS3</name>
							<description>Ready flag related to the different instances of the register monitor safety mechanism.   STS31. A logical   8216 1  8217  of this bit indicates that the register monitor test has        been executed. This bit can only be cleared by software  a set by        software has no effect.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STS4</name>
							<description>Ready flag related to the different instances of the register monitor safety mechanism.   STS31. A logical   8216 1  8217  of this bit indicates that the register monitor test has        been executed. This bit can only be cleared by software  a set by        software has no effect.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STS5</name>
							<description>Ready flag related to the different instances of the register monitor safety mechanism.   STS31. A logical   8216 1  8217  of this bit indicates that the register monitor test has        been executed. This bit can only be cleared by software  a set by        software has no effect.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STS6</name>
							<description>Ready flag related to the different instances of the register monitor safety mechanism.   STS31. A logical   8216 1  8217  of this bit indicates that the register monitor test has        been executed. This bit can only be cleared by software  a set by        software has no effect.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STS7</name>
							<description>Ready flag related to the different instances of the register monitor safety mechanism.   STS31. A logical   8216 1  8217  of this bit indicates that the register monitor test has        been executed. This bit can only be cleared by software  a set by        software has no effect.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STS8</name>
							<description>Ready flag related to the different instances of the register monitor safety mechanism.   STS31. A logical   8216 1  8217  of this bit indicates that the register monitor test has        been executed. This bit can only be cleared by software  a set by        software has no effect.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STS9</name>
							<description>Ready flag related to the different instances of the register monitor safety mechanism.   STS31. A logical   8216 1  8217  of this bit indicates that the register monitor test has        been executed. This bit can only be cleared by software  a set by        software has no effect.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STS10</name>
							<description>Ready flag related to the different instances of the register monitor safety mechanism.   STS31. A logical   8216 1  8217  of this bit indicates that the register monitor test has        been executed. This bit can only be cleared by software  a set by        software has no effect.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OCS</name>
					<description>OCDS Control and Status
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>2024</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TGS</name>
							<description>Trigger Set for OTGB0 1   TGS</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TGB</name>
							<description>OTGB0 1 Bus Select   TGB</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TG_P</name>
							<description>TGS  TGB Write Protection   TG P. TGS and TGB are only written when TG P is 1  otherwise unchanged. Read        as 0.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SUS</name>
							<description>OCDS Suspend Control   SUS. Controls the sensitivity to the suspend signal coming from the OCDS        Trigger Switch  OTGS </description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SUS_P</name>
							<description>SUS Write Protection   SUS P. SUS is only written when SUS P is 1  otherwise unchanged. Read as 0.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SUSSTA</name>
							<description>Suspend State   SUSSTA. Read as 0  must be written with 0.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
