J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>HSSL0</name>
			<version>100</version>
			<description>HSSL</description>
			<baseAddress>4027056128</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>256</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<cluster>
					<dim>4</dim>
					<dimIncrement>16</dimIncrement>
					<name>I[%s]</name>
					<description>I</description>
					<addressOffset>48</addressOffset>
					<register>
						<name>IWDx</name>
						<description>Initiator Write Data Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DATA</name>
								<description>Data Part of the Payload of a Write Frame   DATA. For 8 bit and16 bit write command frames  the whole frame payload width of 32 bit is automatically filled with copies of the lower 8 bits or 16 bits of the register.</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ICONx</name>
						<description>Initiator Control Data Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>IDQ</name>
								<description>Read ID Request   IDQ. This bit provides the only way to request a read ID frame. Reads always 0. Write of 1 commences a request. In case of parallel write of 1 to TQ and IDQ  the IDQ request has higher priority.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>TQ</name>
								<description>Trigger Request   TQ. This bit provides an alternative way to request a trigger frame  without having to write to the channel address register. Reads always 0. Write of 1 commences a request. In case of parallel write of 1 to TQ and IDQ  the IDQ request has higher priority.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>LETT</name>
								<description>Last Error Transaction Tag   LETT</description>
								<lsb>2</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CETT</name>
								<description>Currently Expected Transaction Tag   CETT</description>
								<lsb>5</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TOCV</name>
								<description>Time Out Current Value   TOCV</description>
								<lsb>8</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>DATLEN</name>
								<description>Data Length   DATLEN. Defines the length of the data in bits of the write and read command.</description>
								<lsb>16</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RWT</name>
								<description>Read Write Trigger Command Type   RWT. Defines if the write to the IRWA register will trigger read  write or trigger request.</description>
								<lsb>18</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BSY</name>
								<description>Channel Busy   BSY</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ITTAG</name>
								<description>Initiator Transaction Tag   ITTAG. This bit displays the current value of the three bit counter generating the new transaction tag value.</description>
								<lsb>21</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TOREL</name>
								<description>Time Out Reload Value   TOREL. Defines the duration of the timeout in units of prescaled clock periods. This parameter is valid both in command and stream mode of the channel 2.</description>
								<lsb>24</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>IRWAx</name>
						<description>Initiator Read Write Address Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ADDRESS</name>
								<description>Address Part of the Payload of a Write Frame   ADDRESS. Writing to this registers triggers transmission of a Write Frame. The        address must be aligned according to the data width  byte addresses for        8 bit data  half word addresses for 16 bit data  word addresses for        32 bit data.</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>IRDx</name>
						<description>Initiator Read Data Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>12</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DATA</name>
								<description>Data Delivered by a Read Response Frame   DATA</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<dim>4</dim>
					<dimIncrement>8</dimIncrement>
					<name>T[%s]</name>
					<description>T</description>
					<addressOffset>112</addressOffset>
					<register>
						<name>TCDi</name>
						<description>Target Current Data Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>D</name>
								<description>Data Part of the Payload of a Write Command Frame or Read Data of a Read Command Frame   D</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TCAi</name>
						<description>Target Current Address Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>A</name>
								<description>Address Part of the Payload of a Write Command Frame or a Read Command Frame or ID Frame   A</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<name>IS</name>
					<description>IS</description>
					<addressOffset>160</addressOffset>
					<register>
						<dim>2</dim>
						<dimIncrement>4</dimIncrement>
						<name>ISSAx[%s]</name>
						<description>Initiator Stream Start Address Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>START</name>
								<description>Start Address for the Memory Range   START. Aligned on 256 bit limit  stream frame payload size .</description>
								<lsb>5</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ISCA</name>
						<description>Initiator Stream Current Address Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CURR</name>
								<description>Address of the Memory Location for the Current Transfer   CURR. Aligned on 256 bit limit  stream frame payload size .</description>
								<lsb>5</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ISFC</name>
						<description>Initiator Stream Frame Count Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>12</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RELCOUNT</name>
								<description>Reload Count Number   RELCOUNT. Contains the number of frames to transfer per memory block. Bit field        length depends on application requirements.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CURCOUNT</name>
								<description>Current Count Number   CURCOUNT. Displays the current count number  which is generated by down counting from the RELCOUNT value. Bit field length depends on application requirements.</description>
								<lsb>16</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<name>TS</name>
					<description>TS</description>
					<addressOffset>176</addressOffset>
					<register>
						<dim>2</dim>
						<dimIncrement>4</dimIncrement>
						<name>TSSAx[%s]</name>
						<description>Target Stream Start Address Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ADDR</name>
								<description>Start Address for the Memory Range   ADDR. Aligned on 256 bit  or 32 byte  limit  stream frame payload size .</description>
								<lsb>5</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TSCA</name>
						<description>Target Stream Current Address Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CURR</name>
								<description>Address of the Memory Location for the Current Transfer   CURR. Aligned on 256 bit  or 32 byte  limit  stream frame payload size .</description>
								<lsb>5</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TSFC</name>
						<description>Target Stream Frame Count Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>12</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RELCOUNT</name>
								<description>Reload Count Number   RELCOUNT. Contains the number of frames to transfer per memory block. Bit field        length depends on application requirements.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CURCOUNT</name>
								<description>Current Count Number   CURCOUNT. Displays the current count number  which is generated by down counting        from the RELCOUNT value. Bit field length depends on application        requirements.</description>
								<lsb>16</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<dim>4</dim>
					<dimIncrement>8</dimIncrement>
					<name>AW[%s]</name>
					<description>AW</description>
					<addressOffset>192</addressOffset>
					<register>
						<name>AWSTARTi</name>
						<description>Access Window Start Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>AWS</name>
								<description>Access Window Start Address   AWS. This bit field defines the upper 24 bits of the start address of the        corresponding access window. This results in a granularity of 256 bytes        for the start address.</description>
								<lsb>8</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>AWENDi</name>
						<description>Access Window End Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>AWE</name>
								<description>Access Window End Address   AWE. This bit field defines the upper 24 bits of the end address of the        corresponding access window. This results in a granularity of 256 bytes        for the end address.</description>
								<lsb>8</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
				<register>
					<name>CLC</name>
					<description>Clock Control Register
 resetvalue={Application Reset:0x3}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>3</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit   DISR. Used for enable disable control of the module.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit   DISS. Bit indicates the current status of the module.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EDIS</name>
							<description>Sleep Mode Enable Control   EDIS. Used to control module  8217 s sleep mode.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Module Identification Register
 resetvalue={Application Reset:0x0CBC000}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>13352960</resetValue>
					<resetMask>4294967040</resetMask>
					<fields>
						<field>
							<name>MODREV</name>
							<description>Module Revision Number   MODREV. MODREV defines the module revision number. The value of a module        revision starts with 01 H  first        revision .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODTYPE</name>
							<description>Module Type   MODTYPE. This bit field is C0 H . It defines a        32 bit module.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODNUMBER</name>
							<description>Module Number Value   MODNUMBER. This bit field together with MODTYPE uniquely identifies a module.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CRC</name>
					<description>CRC Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>12</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>XORMASK</name>
							<description>Value to be XORed with the Calculated CRC   XORMASK. Used for error injection  160    160 test purposes.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>XEN</name>
							<description>Enable the Error Injection via XORMASK   XEN</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CFG</name>
					<description>Configuration Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>16</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PREDIV</name>
							<description>Global Predivider   PREDIV. Defines the down scaled module clock to be used by all channel timeout        timers.</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SMT</name>
							<description>Streaming Mode Transmitter   SMT</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SMR</name>
							<description>Streaming Mode Receiver   SMR</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SCM</name>
							<description>Streaming Channel Mode   SCM. Defines if the channel 2 is used in a streaming or command mode.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CCC</name>
							<description>Channel Code Control   CCC. Defines the coding of the channel number in the HSSL header.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>QFLAGS</name>
					<description>Request Flags Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>20</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>I</name>
							<description>Request Flags for Initiated Commands   I. These flags are set by the corresponding channel when a WRTS command is        initiated. The WRT commands are initiated via the SPB bus. The S tream         commands are initiated by the module internally  by the TXFIFO  except        for the first stream frame start  which is done via the SPB bus. See        MFLAGS.ISB and ISF flags.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>T</name>
							<description>Request Flags for Commands Arrived at Target   T. These flags are set by the hardware according to the header information        of a frame arrived at the target without a CRC error. They are used by        the arbiter of the SRI  SPB        master and cleared when the appropriate command is executed.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>R</name>
							<description>Request Flags for Response Frames at the Target   R. After a command has been executed by the SRI  SPB        master  an appropriate flag is being set which indicates that an        ACK NACK DATA is pending.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>E0</name>
							<description>Expect Flags for Activated Timeout Timer 0   E0. An appropriate two bit flag is set by the hardware when a timeout timer        for a channel is started. The hardware clears the appropriate flag when        any response frame arrives at the initiator. In case of an unexpected response the flag UNEXPECTED is additionally        set.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>E1</name>
							<description>Expect Flags for Activated Timeout Timer 1   E1</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>E2</name>
							<description>Expect Flags for Activated Timeout Timer 2   E2</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>E3</name>
							<description>Expect Flags for Activated Timeout Timer 3   E3</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IS</name>
							<description>I Flag for Stream Frames   IS. See the   8220 I  8221  flag description above.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RS</name>
							<description>R Flag for Stream Frames   RS. See the   8220 R  8221  flag description above.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TS</name>
							<description>T Flag for Stream Frames   TS. See the   8220 T  8221  flag description above.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ES</name>
							<description>E Flag for Stream Frames   ES. See the   8220 E  8221  flag description above.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
