J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MFLAGS</name>
					<description>Miscellaneous Flags Register
 resetvalue={Application Reset:0x080000000}</description>
					<addressOffset>24</addressOffset>
					<size>32</size>
					<resetValue>2147483648</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>NACK</name>
							<description>Not Acknowledge Error   Target Error   NACK. Indicates for each channel that a target error frame has been received.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TTE</name>
							<description>Transaction Tag Error   TTE. Indicates for each channel if a CRC correct acknowledge frame with an        unexpected transaction tag number has been received.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TIMEOUT</name>
							<description>Timeout Error   TIMEOUT. Indicates for each channel if an timeout event has occurred.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>UNEXPECTED</name>
							<description>Unexpected Type of Frame Error   UNEXPECTED. Indicates for each channel if an unexpected or inappropriate response is        received. For example a NACK for a Trigger frame or DATA for WRITE frame.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TMB</name>
							<description>Target Memory Block   TMB. Selects the currently active memory block used by the target as a target        for the streaming data  with its start address and frame counter.        Switching the active block in the middle of a block transfer is not        allowed.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IMB</name>
							<description>Initiator Memory Block   IMB. Selects the currently active memory block used by the initiator as a        source for the streaming data  with its start address and frame counter.        Switching the active block in the middle of a block transfer is not        allowed.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ISB</name>
							<description>Initiator Stream Block Request   ISB. Indicates if stream block request is pending. Set by the software to        start a stream block transfer by using the MFLAGSSET.ISBS bit  clear by        the software possible  if needed  by using the MFLAGSCL.ISBC bit         cleared by hardware at the end of the current block transfer in single        mode  but not in continuous mode.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MAV</name>
							<description>Memory Access Violation   MAV. Indicates a memory access violation.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SRIE</name>
							<description>SRI SPB Bus Access Error   SRIE. Indicates an error on the SRI bus   transaction ID  ECC error or error        acknowledge. Indicates an error on the SPB bus  error acknowledge or timeout.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PIE1</name>
							<description>PHY Inconsistency Error 1 Channel Number Code Error    PIE1. Indicates if HSCT to HSSL channel number code comparator has detected an        inconsistency error.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PIE2</name>
							<description>PHY Inconsistency Error 2 Data Length Error    PIE2. Indicates if HSCT to HSSL data length comparator has detected an        inconsistency error.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CRCE</name>
							<description>CRC Error   CRCE. Indicates if CRC checker has detected a CRC error.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSE</name>
							<description>Target Stream Enable   TSE. Used by the hardware to handle the single and continuous streaming. In        single mode  cleared by hardware after the current block transfer ends.        The module ignores afterwards the incoming steam frames.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TEI</name>
							<description>Transmit Enable Input   TEI. Indicates the state of the TEI input signal of the HSSL module  which is        driven by the CTS output signal of the HSCT module. Any edge on this        signal triggers an EXI interrupt. This low level signal stops the transmission of both command and        response frames.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TEO</name>
							<description>Transmit Enable Output   TEO. Indicates the state of the TEO output signal of the HSSL module  which        drives thee CTS input signal of the HSCT module. This bit is cleared by        hardware at entering the INIT and Soft Suspend state.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>INI</name>
							<description>Initialize Mode   INI. Indicates if the module is in the Initialize or Run mode.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MFLAGSSET</name>
					<description>Miscellaneous Flags Set Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>28</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>NACKS</name>
							<description>NACK Flags Set   NACKS. Writing 1 sets the corresponding bit in the MFLAGS register and triggers        the ERR interrupt for the corresponding channel  if enabled in the        MFLAGSEN register. Writing 0 has no effect.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TTES</name>
							<description>Transaction Tag Error Flags Set   TTES. Writing 1 sets the corresponding bit in the MFLAGS register and triggers        the ERR interrupt for the corresponding channel  if enabled in the        MFLAGSEN register. Writing 0 has no effect.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TIMEOUTS</name>
							<description>Timeout Error Flags Set   TIMEOUTS. Writing 1 sets the corresponding bit in the MFLAGS register and triggers        the ERR interrupt for the corresponding channel  if enabled in the        MFLAGSEN register. Writing 0 has no effect.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>UNEXPECTEDS</name>
							<description>Unexpected Error Flags Set   UNEXPECTEDS. Writing 1 sets the corresponding bit in the MFLAGS register and triggers        the ERR interrupt for the corresponding channel  if enabled in the        MFLAGSEN register. Writing 0 has no effect.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TMBS</name>
							<description>Target Memory Block Flag Set   TMBS. Writing 1 sets the corresponding bit in the MFLAGS register. Writing 0        has no effect.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>IMBS</name>
							<description>Initiator Memory Block Flag Set   IMBS. Writing 1 sets the corresponding bit in the MFLAGS register. Writing 0        has no effect.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ISBS</name>
							<description>Initiator Stream Block Request Set   ISBS. Writing 1 sets the corresponding bit in the MFLAGS register. Writing 0        has no effect.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MAVS</name>
							<description>MAV Flag Set   MAVS. Writing 1 sets the corresponding bit in the MFLAGS register  and        generates an EXI interrupt if enabled in the corresponding bit of the        MFLAGSEN register. Writing 0 has no effect</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SRIES</name>
							<description>SRI SPB Bus Access Error Flag Set   SRIES. Writing 1 sets the corresponding bit in the MFLAGS register  and        generates an EXI interrupt if enabled in the corresponding bit of the        MFLAGSEN register. Writing 0 has no effect</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PIE1S</name>
							<description>PIE1 Error Flag Set   PIE1S. Writing 1 sets the corresponding bit in the MFLAGS register  and        generates an EXI interrupt if enabled in the corresponding bit of the        MFLAGSEN register. Writing 0 has no effect</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PIE2S</name>
							<description>PIE2 Error Flag Set   PIE2S. Writing 1 sets the corresponding bit in the MFLAGS register  and        generates an EXI interrupt if enabled in the corresponding bit of the        MFLAGSEN register. Writing 0 has no effect.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCES</name>
							<description>CRC Error Flag Set   CRCES. Writing 1 sets the corresponding bit in the MFLAGS register  and        generates an EXI interrupt if enabled in the corresponding bit of the        MFLAGSEN register. Writing 0 has no effect.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TSES</name>
							<description>Target Stream Enable Flag Set   TSES. Writing 1 sets the corresponding bit in the MFLAGS register. Writing 0        has no effect.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEOS</name>
							<description>Transmit Enable Flag Set   TEOS. Writing 1 sets the corresponding bit in the MFLAGS register. Writing 0        has no effect.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>INIS</name>
							<description>Initialize Mode Flag Set   INIS. Writing 1 sets the corresponding bit in the MFLAGS register. Writing 0        has no effect.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MFLAGSCL</name>
					<description>Miscellaneous Flags Clear Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>32</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>NACKC</name>
							<description>NACK Flags Clear   NACKC. Writing 1 clears the corresponding bit in the MFLAGS register. Writing 0        has no effect.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TTEC</name>
							<description>Transaction Tag Error Flags Clear   TTEC. Writing 1 clears the corresponding bit in the MFLAGS register. Writing 0        has no effect.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TIMEOUTC</name>
							<description>Timeout Error Flags Clear   TIMEOUTC. Writing 1 clears the corresponding bit in the MFLAGS register. Writing 0        has no effect.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>UNEXPECTEDC</name>
							<description>Unexpected Error Flags Clear   UNEXPECTEDC. Writing 1 clears the corresponding bit in the MFLAGS register. Writing 0        has no effect.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TMBC</name>
							<description>Target Memory Block Flag Clear   TMBC. Writing 1 clears the corresponding bit in the MFLAGS register. Writing 0        has no effect.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>IMBC</name>
							<description>Initiator Memory Block Flag Clear   IMBC. Writing 1 clears the corresponding bit in the MFLAGS register. Writing 0        has no effect.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ISBC</name>
							<description>Initiator Stream Block Request Clear   ISBC. Writing 1 clears the corresponding bit in the MFLAGS register. Writing 0        has no effect.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MAVC</name>
							<description>MAV Flag Clear   MAVC. Writing 1 clears the corresponding bit in the MFLAGS register. Writing 0        has no effect</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SRIEC</name>
							<description>SRI SPB Bus Access Error Flag Clear   SRIEC. Writing 1 clears the corresponding bit in the MFLAGS register. Writing 0        has no effect</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PIE1C</name>
							<description>PIE1 Error Flag Clear   PIE1C. Writing 1 clears the corresponding bit in the MFLAGS register. Writing 0        has no effect</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PIE2C</name>
							<description>PIE2 Error Flag Clear   PIE2C. Writing 1 clears the corresponding bit in the MFLAGS register. Writing 0        has no effect.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCEC</name>
							<description>CRC Error Flag Clear   CRCEC. Writing 1 clears the corresponding bit in the MFLAGS register. Writing 0        has no effect.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TSEC</name>
							<description>Target Stream Enable Flag Clear   TSEC. Writing 1 sets the corresponding bit in the MFLAGS register. Writing 0        has no effect.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEOC</name>
							<description>Transmit Enable Flag Clear   TEOC. Writing 1 clears the corresponding bit in the MFLAGS register. Writing 0        has no effect.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>INIC</name>
							<description>Initialize Mode Flag Clear   INIC. Writing 1 clears the corresponding bit in the MFLAGS register. Writing 0        has no effect.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MFLAGSEN</name>
					<description>Flags Enable Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>36</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>NACKEN</name>
							<description>Not Acknowledge Error Enable Bits   NACKEN. Used to enable the error interrupt associated to the corresponding bit        in the MFLAGS register.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TTEEN</name>
							<description>Transaction Tag Error Enable Bits   TTEEN. Used to enable the error interrupt associated to the corresponding bit        in the MFLAGS register.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIMEOUTEN</name>
							<description>Timeout Error Enable Bits   TIMEOUTEN. Used to enable the error interrupt associated to the corresponding bit        in the MFLAGS register.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UNEXPECTEDEN</name>
							<description>Unexpected Error Enable Bits   UNEXPECTEDEN. Used to enable the error interrupt associated to the corresponding bit        in the MFLAGS register.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MAVEN</name>
							<description>MAV Enable Bit   MAVEN. Used to enable the interrupt associated to the corresponding bit in the        MFLAGS register.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SRIEEN</name>
							<description>SRI SPB Bus Access Error Enable Bit   SRIEEN. Used to enable the error interrupt associated to the corresponding bit        in the MFLAGS register.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PIE1EN</name>
							<description>PIE1 Error Enable Bit   PIE1EN. Used to enable the error interrupt associated to the corresponding bit        in the MFLAGS register.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PIE2EN</name>
							<description>PIE2 Error Enable Bit   PIE2EN. Used to enable the error interrupt associated to the corresponding bit        in the MFLAGS register.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CRCEEN</name>
							<description>CRC Error Enable Bit   CRCEEN. Used to enable the error interrupt associated to the corresponding bit        in the MFLAGS register.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TEIEN</name>
							<description>TEI Enable Bit   TEIEN. Used to enable the interrupt associated to the corresponding bit in the        MFLAGS register.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SFSFLAGS</name>
					<description>Stream FIFOs Status Flags Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>40</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXFL</name>
							<description>Stream RxFIFO Filling Level   RXFL. Indicates the filling level of the FIFO with granularity of 32 bytes         one stream frame payload size .</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXFL</name>
							<description>Stream TxFIFO Filling Level   TXFL. Indicates the filling level of the FIFO with granularity of 32 bytes         one stream frame payload size .</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EXFL</name>
							<description>Stream Expect FIFO Filling Level   EXFL. Indicates the filling level of the FIFO with granularity of 32 bytes         one stream frame payload size .</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ISF</name>
							<description>Initiator Stream Frame Request   ISF. Indicates if stream TXFIFO request is pending. Set and cleared by the        TXFIFO.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSTAT</name>
					<description>Target Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>144</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LASTCC0</name>
							<description>Last Command Code   LASTCC3. Indicates the latest command code from the header for the corresponding        channel.</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LASTTT0</name>
							<description>Last Transaction Tag   LASTTT3. Indicates the transaction tag of the latest command or stream frame for        the corresponding channel.</description>
							<lsb>5</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LASTCC1</name>
							<description>Last Command Code   LASTCC3. Indicates the latest command code from the header for the corresponding        channel.</description>
							<lsb>8</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LASTTT1</name>
							<description>Last Transaction Tag   LASTTT3. Indicates the transaction tag of the latest command or stream frame for        the corresponding channel.</description>
							<lsb>13</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LASTCC2</name>
							<description>Last Command Code   LASTCC3. Indicates the latest command code from the header for the corresponding        channel.</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LASTTT2</name>
							<description>Last Transaction Tag   LASTTT3. Indicates the transaction tag of the latest command or stream frame for        the corresponding channel.</description>
							<lsb>21</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LASTCC3</name>
							<description>Last Command Code   LASTCC3. Indicates the latest command code from the header for the corresponding        channel.</description>
							<lsb>24</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LASTTT3</name>
							<description>Last Transaction Tag   LASTTT3. Indicates the transaction tag of the latest command or stream frame for        the corresponding channel.</description>
							<lsb>29</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
