J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>HSCT0</name>
			<version>100</version>
			<description>HSCT</description>
			<baseAddress>4027121664</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>65536</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CLC</name>
					<description>Clock Control Register
 resetvalue={Application Reset:0x3}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>3</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit   DISR. Used for enable disable control  clock and local access  of the module. This bit switches the clock off immediately  therefore the software has to take care that the HSSL and HSCT communication has been terminated properly before setting this bit. The disable is performed after an acknowledge signal from the core logic is received. The acknowledge signal is directly looped back from the request signal.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit   DISS. Bit indicates the current status of the module and is set after the requested disable is active.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EDIS</name>
							<description>Chip System Sleep Mode Control   EDIS. The EDIS bit in the CLC register controls whether or not a module is stopped during Chip System initiated Sleep Mode. If EDIS is 0  a Sleep Mode request can be recognized by the module and  when received  its clock is immediately shut off. Therefore the software has to take care that the HSSL and HSCT communication has been terminated properly before activating the sleep mode request. If EDIS is set to 1  a Sleep Mode request is disregarded by the module and the module continues its operation. Note  This chip system sleep mode has nothing to do with the HSCT protocol sleep mode.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Module Identification Register
 resetvalue={Application Reset:0x0B4C002}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>11845634</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision Number   MOD REV</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Number Type   MOD TYPE</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUM</name>
							<description>Module Number for module identification   MOD NUM</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>INIT</name>
					<description>Initialization Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>16</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SYS_CLK_EN</name>
							<description>Enable HSCT SysClk in Master interface   SYS CLK EN. SysClk enable activates the SysClk. This feature is only available in the Master interface. In Slave interface mode the register setting does not have an effect.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IFM</name>
							<description>Select Interface Mode   IFM. Select the Interface Mode  Master IF or Slave IF .</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SRCF</name>
							<description>Select Reference Clock Frequency Divider   SRCF. Defines physical layer reference frequency  PHY CLK  and respective        input frequency divider. The configuration is valid for Low speed and        Medium Speed mode.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SSCF</name>
							<description>Select SysClk Frequency Divider   SSCF. For master interface defines SysClk pad output frequency. The allowed        SysClk frequency is 10MHz or 20MHz.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXHD</name>
							<description>Transmit High Speed Divider.   TXHD. The Transmit High Speed data rate can be reduced by dividing factors.        The Transmit High Speed data rate is separated from the Receive High        Speed data rate.</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXHD</name>
							<description>Receive High Speed Divider.   RXHD. The Receive High Speed data rate can be reduced by dividing factors. The Receive High Speed data rate is separated from the Transmit High Speed data rate. For future use configuration leads to no output clock  pll phase o lt 4 0 gt   delivered to the correlator.</description>
							<lsb>19</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFCTRL</name>
					<description>Interface Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>20</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>IFCVS</name>
							<description>Master Mode   Trigger for Interface Control Value to be send to Slave interface   IFCVS. See the table  quot Interface Control Payload Values quot . Master IF Mode  The value is taken as control frame value send as        payload to the Slave IF. Slave IF Mode  The value is a new configuration of the Slave IF  not        recommended flow    .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SIFCV</name>
							<description>Master Mode   Slave IF control frame trigger   SIFCV. Changing the interface configuration  software must guarantee not having        transfers active on the interface. This register bit always reads back zero.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MRXSPEED</name>
							<description>Master Mode RX speed   MRXSPEED. Register setting only valid in interface Master mode.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MTXSPEED</name>
							<description>Master Mode TX speed   MTXSPEED. Register setting only valid in interface Master mode.</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IFTESTMD</name>
							<description>Interface TX Test Mode   IFTESTMD</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SLEEPCTRL</name>
					<description>Sleep Control Register
 resetvalue={Application Reset:0x200000}</description>
					<addressOffset>24</addressOffset>
					<size>32</size>
					<resetValue>2097152</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SLPEN</name>
							<description>Sleep mode enabled   SLPEN. Sleep mode is enabled and performed after receiving a 1 at the end of a        received frame or in transmission direction  if no more data to be send.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SLPCLKG</name>
							<description>Clock Gating in Sleep Mode   SLPCLKG. In sleep mode the clock for HSCT  framer  deframer  can be gated in        order to minimize power consumption. Clock gating  Receiving path and transmitting path is separated.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WKUPCNT</name>
							<description>Counter Value for Determining the Wake up Time of the LVDS Line Driver   WKUPCNT. This counter value corresponds to wake up time the LVDS requires from        sleep to wake up. Counter is clocked by SRI clock.</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CTSCTRL</name>
					<description>Clear To Send Control Register
 resetvalue={Application Reset:0x1}</description>
					<addressOffset>28</addressOffset>
					<size>32</size>
					<resetValue>1</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CTS_FRAME</name>
							<description>Transmit CTS Frame Generation   CTS FRAME. Dedicated CTS frames are generated after the receive data path is not        able to accept more data. The situation is indicated by the CTS header        bit in case there is currently no data to be transferred.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTS_TXD</name>
							<description>Disable TX CTS signaling   CTS TXD. If this bit is set to 1  CTS signaling is not performed at the interface        and the status remains at the clear to send for every frame send.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTS_RXD</name>
							<description>Disable RX CTS detection   CTS RXD. If this bit is set to 1  CTS detection is not performed at the receiver        and the status remains internally at clear to send for every frame        received.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HSSL_CTS_FBD</name>
							<description>Disable HSSL interface CTS Frame Blocking   HSSL CTS FBD. If this bit is set to 1  CTS signaling is not performed at the interface        and the status remains at the clear to send for every frame send.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DISABLE</name>
					<description>Transmission Disable Register
 resetvalue={Application Reset:0x3}</description>
					<addressOffset>32</addressOffset>
					<size>32</size>
					<resetValue>3</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TX_DIS</name>
							<description>Disable HSCT Transmit path in Master interface   TX DIS. Disable the transmit path of the HSCT interface. If this bit is set to 1          no transfer can be initiated and the LVDS driver is disabled.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RX_DIS</name>
							<description>Disable HSCT Receive path in Master interface   RX DIS. Disable the receive line path of the HSCT interface. If this bit is set        to 1   no transfer from the other side can be received and the Master RX        path is in a low power state. This feature is only available in the Master interface. Slave interface        RX path can not be disabled and a write to the register has no effect.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RX_HEPD</name>
							<description>Disable RX Header Error Discard Payload data.   RX HEPD. Instead of discarding the Payload data at a header error the payload        data is passed to the higher layer  HSSL . Only channel data to HSSL is        affected. This function is available in Master and in Slave mode.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STAT</name>
					<description>Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>36</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RX_PSIZE</name>
							<description>RX  Receiving  Payload Size   RX PSIZE. Contains the payload size of the last received frame.</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RX_CHANNEL</name>
							<description>RX  Receiving  Logical Channel Type   RX CHANNEL. Contains the logical channel type of the last received frame. See Table         quot Logical Channel Type Coding quot .</description>
							<lsb>3</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RX_SLEEP</name>
							<description>RX  Receiving  Sleep Mode Status   RX SLEEP</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TX_SLEEP</name>
							<description>TX  Transmission  Sleep Mode Status   TX SLEEP</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TX_PSIZE</name>
							<description>Transmission Payload Size   TX PSIZE. Coding of the logical channel type is according to the Table  Payload        Size Coding. This value was used in the logical channel type field in        the header for the actual transfer in transmit direction.</description>
							<lsb>12</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TX_CHANNEL_TYPE</name>
							<description>Transmission Logical Channel Type   TX CHANNEL TYPE. Coding of the logical channel type is according to the Table  Logical        Channel Type Coding. This value was used in the logical channel type        field in the header for the actual transfer in transmit direction.</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LIFCCMDR</name>
							<description>Last Interface Control Command Received   LIFCCMDR. The bit value reflects the last control command received. The bit is        active in Slave interface mode only. In Master mode it reflects logic 0        always.  See CROSSREFERENCE  </description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFSTAT</name>
					<description>Interface Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>40</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RX_STAT</name>
							<description>HSCT Slave interface Status for RX link   RX STAT. Slave interface transmitter only</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TX_STAT</name>
							<description>HSCT Slave interface Status for TX link   TX STAT. Slave interface receiver only</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TX_EN</name>
							<description>HSCT LVDS Slave interface TX enable   TX EN. Slave interface only</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CONFIGPHY</name>
					<description>Configuration Physical Layer Register
 resetvalue={Application Reset:0x1F0000}</description>
					<addressOffset>48</addressOffset>
					<size>32</size>
					<resetValue>2031616</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PON</name>
							<description>Physical Layer Power On.   PON</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CORCEN</name>
							<description>Correlator phase enable   allows to enable disable each of the 5 Phase outputs separately.   CORCEN</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATPHY</name>
					<description>STATPHY
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>52</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PLOCK</name>
							<description>PLL locked   PLOCK</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXSA</name>
							<description>Transmitter speed   TXSA</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXSA</name>
							<description>Receiver speed   RXSA</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IRQ</name>
					<description>Interrupt register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>64</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>HER</name>
							<description>Header error detected   HER. Not supported size  Received command at Slave interface 8 bit size only   other command          sizes generate an error. Received command ping answer at Master interface 32 bit size only            other command sizes generate an error Unsolicited data 32 bit only Logical data channel size 8 bit Not supported logical channel type  0b1xxx 0010  Slave interface control and Slave interface read </description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PYER</name>
							<description>Payload error detected   PYER. Payload does not fit the header size</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CER</name>
							<description>HSCT command error   CER. Control command not valid or control payload size bigger than 8 bit.        Single Slave specific commands received in Multi Slave Mode do not        trigger CER error  but only MSCE error.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IFCFS</name>
							<description>HSCT interface control frame send   IFCFS. The scheduled interface control command is send.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SMER</name>
							<description>Speed Mode Switch Error  Master Mode only    SMER. Speed mode change did not work. Received PING payload not valid.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>USMSF</name>
							<description>Unsolicited message frame send finished   USMSF. Interrupt is indicated after the unsolicited message send is finished.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PLER</name>
							<description>PLL lost lock error   PLER. After the PLL locked  the PLL may loose lock  which is reflected by the        error</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>USM</name>
							<description>Unsolicited Message Received   USM. Unsolicited message received indication. Unsolicited message indicates a        system event to the other interface side.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PAR</name>
							<description>PING Answer Received   PAR. The received message was identified as PING.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXTE</name>
							<description>TX transfer error occurred on a disabled TX channel.   TXTE. A disabled TX triggers an error interrupt  if  TX disabled on a pending or active data transfer. TX CTS configuration change on a active CTS frame.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SFO</name>
							<description>Synchronization FIFO overflow  in RX direction    SFO. Physical layer to Controller data synchronization FIFO in RX transfer        direction hit an overflow situation. This interrupt is an indication about a to slow SRI clock compared to          Physical layer clock  which results in a overflow situation.  Minimum          SRI frequency 40 MHz. </description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SFU</name>
							<description>Synchronization FIFO underflow  in TX direction    SFU. Controller to Physical layer data synchronization FIFO in TX transfer        direction hit an underflow situation. This interrupt is an indication about a to slow SRI clock compared to          Physical layer clock  which results in a underflow situation.  Minimum          SRI frequency 40 MHz. </description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MSCE</name>
							<description>Multi Slave scenario Command Error   MSCE. This interrupt indicates a control command which is not allowed in multi        Slave scenario. In Master and Slave mode a not allowed command results        to an error.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
