J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>IRQEN</name>
					<description>Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>68</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>HEREN</name>
							<description>Header error detected interrupt enable   HEREN</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PYEREN</name>
							<description>Payload error detected interrupt enable   PYEREN</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CEREN</name>
							<description>HSCT command error interrupt enable   CEREN</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IFCFSEN</name>
							<description>HSCT interface control command send enable   IFCFSEN</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SMEREN</name>
							<description>Speed Mode Switch Error interrupt enable   SMEREN</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>USMSFEN</name>
							<description>Unsolicited message frame send finished   USMSFEN</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PLEREN</name>
							<description>PLL lost lock error interrupt enable   PLEREN</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>USMEN</name>
							<description>Unsolicited Message received enable   USMEN</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PAREN</name>
							<description>PING Answer Received enable   PAREN</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXTEEN</name>
							<description>TX disable error interrupt enable   TXTEEN</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SFOEN</name>
							<description>Synchronization FIFO overflow  in RX direction  interrupt enable   SFOEN</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SFUEN</name>
							<description>Synchronization FIFO underflow  in TX direction  interrupt enable   SFUEN</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSCEEN</name>
							<description>Multi Slave scenario Command Error interrupt enable   MSCEEN</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IRQCLR</name>
					<description>Interrupt Clear Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>72</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>HERCLR</name>
							<description>Header error detected interrupt clear   HERCLR</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PYERCLR</name>
							<description>Payload error detected interrupt clear   PYERCLR</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CERCLR</name>
							<description>HSCT command error interrupt clear   CERCLR</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>IFCFSCLR</name>
							<description>HSCT interface control command send interrupt clear   IFCFSCLR</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SMERCLR</name>
							<description>Speed Mode Switch Error interrupt clear   SMERCLR</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>USMSFCLR</name>
							<description>Unsolicited message frame send finished interrupt clear   USMSFCLR</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PLERCLR</name>
							<description>PLL lost lock error interrupt clear   PLERCLR</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>USMCLR</name>
							<description>Unsolicited Message received clear   USMCLR</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PARCLR</name>
							<description>PING Answer received clear   PARCLR</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TXTECLR</name>
							<description>TX disable error interrupt clear   TXTECLR</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SFOCLR</name>
							<description>Synchronization FIFO overflow  in RX direction  interrupt clear   SFOCLR</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SFUCLR</name>
							<description>Synchronization FIFO underflow  in TX direction  interrupt clear   SFUCLR</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MSCELR</name>
							<description>Multi Slave scenario Command Error interrupt clear   MSCELR</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>USMR</name>
					<description>Unsolicited Status Message Received
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>80</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>USMR</name>
							<description>Unsolicited status message received   USMR. The register contains the last received unsolicited status message.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>USMS</name>
					<description>Unsolicited Status Message Send
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>84</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>USMS</name>
							<description>Unsolicited status message send   USMS. Writing to the register triggers an unsolicited status message to be        send to the other interface side.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TESTCTRL</name>
					<description>Test Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>96</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXENS</name>
							<description>Enable Slave TX path  Slave interface mode only    TXENS. This function should be only used during interface testing the mode          and SW development. In functional mode the Slave interface should only          be controlled via transfer commands received from Master interface.           This trigger register reads back 0 always.  If TXENS and TXDISS are          written one  TXDISS has higher priority. The status is visible in          IFSTAT.TX EN.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TXDISS</name>
							<description>Disable Slave TX path  Slave Interface mode only    TXDISS. This function should be only used during interface testing the mode          and SW development. In functional mode the Slave interface should only          be controlled via transfer commands received from Master interface.           This trigger register reads back 0 always.  If TXENS and TXDISS are          written one  TXDISS has higher priority. The status is visible in          IFSTAT.TX EN.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LLOPTXRX</name>
							<description>LVDS loop back TX to RX enable   LLOPTXRX. Transmit data at LVDS is directly looped back to the LVDS RX. Data        transfer speed is defined by the TX speed configuration.  The data path        in the SoC is using the complete Transmit path through all functional        layers and is looped back at LVDS from TX to RX. Also at RX data path        all SoC data layers are active.  Requires same speed configuration for RX  and TX link before enabled.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRBSEN</name>
							<description>PRBS Pattern enable   PRBSEN. Enable of the PRBSEN bit allows a continuos PRBS stream with the        configured transfer speed Baud rate. This feature is available to        measure ISI during the time other SoC functions are running in an        applicative mode. This feature is for measurement purpose only.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OCS</name>
					<description>OCDS Control and Status
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>65512</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TGS</name>
							<description>Trigger Set for OTGB0 1   TGS. Others  160   160 reserved  no Trigger Set selected </description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TGB</name>
							<description>OTGB0 1 Bus Select   TGB</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TG_P</name>
							<description>TGS  TGB Write Protection   TG P. TGS and TGB are only written when TG P is 1  otherwise unchanged. Read        as 0.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SUS</name>
							<description>OCDS Suspend Control   SUS. Controls the sensitivity to the suspend signal coming from the OCDS        Trigger Switch  OTGS  Others  160   160 reserved After a Hard suspend the HSCT and higher layer protocol module must be          reset. A a new initialization sequence is required afterwards</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SUS_P</name>
							<description>SUS Write Protection   SUS P. SUS is only written when SUS P is 1  otherwise unchanged. Read as 0.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SUSSTA</name>
							<description>Suspend State   SUSSTA</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRSTCLR</name>
					<description>Reset Status Clear Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>65516</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CLR</name>
							<description>Kernel Reset Status Clear   CLR. Read always as 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRST1</name>
					<description>Reset Register 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>65520</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>Kernel Reset   RST. This reset bit can be used to request for a kernel reset. The kernel        reset will be executed if the reset bits of both kernel reset registers        is set. The RST bit will be cleared  re set to   180 0  180   by the BPI FPI after the        kernel reset was executed. It is strongly recommended to reset the HSCT and HSSL in sequence to avoid communication issues.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRST0</name>
					<description>Reset Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>65524</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>Kernel Reset   RST. This reset bit can be used to request for a kernel reset. The kernel        reset will be executed if the reset bits of both kernel registers are        set. The RST bit will be cleared  re set to   180 0  180   by the BPI FPI after the        kernel reset was executed. It is strongly recommended to reset the HSCT and HSSL in sequence to avoid communication issues.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RSTSTAT</name>
							<description>Kernel Reset Status   RSTSTAT. This bit indicates wether a kernel reset was executed or not. This bit        is set by the BPI FPI after the execution of a kernel reset in the same        clock cycle both reset bits. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related KRSTCLR register.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
