J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MODCTR</name>
					<description>Modulation Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>128</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>T12MODEN</name>
							<description>T12 Modulation Enable   T12MODEN. These bits enable the modulation of the corresponding output signal by a PWM pattern generated by timer T12. T12MODEN0   MODCTR.0 for output CC60 T12MODEN1   MODCTR.1 for output COUT60 T12MODEN2   MODCTR.2 for output CC61 T12MODEN3   MODCTR.3 for output COUT61 T12MODEN4   MODCTR.4 for output CC62 T12MODEN5   MODCTR.5 for output COUT62</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MCMEN</name>
							<description>Multi Channel Mode Enable   MCMEN</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T13MODEN</name>
							<description>T13 Modulation Enable   T13MODEN. These bits enable the modulation of the corresponding output signal by the PWM pattern CC63 O generated by timer T13. T13MODEN0   MODCTR.8 for output CC60 T13MODEN1   MODCTR.9 for output COUT60 T13MODEN2   MODCTR.10 for output CC61 T13MODEN3   MODCTR.11 for output COUT61 T13MODEN4   MODCTR.12 for output CC62 T13MODEN5   MODCTR.13 for output COUT62</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ECT13O</name>
							<description>Enable Compare Timer T13 Output   ECT13O</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRPCTR</name>
					<description>Trap Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>132</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TRPM0</name>
							<description>Trap Mode Control Bit 0   TRPM0. Together with bit TRPM1  these two bits define the behavior of the        selected outputs when leaving the trap state after the trap condition        has become inactive again. A synchronization to the timer driving the        PWM pattern avoids unintended pulses when leaving the trap state. The        behavior resulting from the combination  TRPM1  TRPM0  is described in CROSSREFERENCE .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TRPM1</name>
							<description>Trap Mode Control Bit 1   TRPM1. Together with bit TRPM0  these two bits define the behavior of the        selected outputs when leaving the trap state after the trap condition        has become inactive again. A synchronization to the timer driving the        PWM pattern avoids unintended pulses when leaving the trap state. The        behavior resulting from the combination  TRPM1  TRPM0  is described in CROSSREFERENCE .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TRPM2</name>
							<description>Trap Mode Control Bit 2   TRPM2. This bit defines how the trap flag TRPF can be cleared after the trap        input condition   CTRAP   160    160 0        and TRPPEN  160    160 1  is no longer valid  either by CTRAP   160    160 1        or by TRPPEN  160    160 0 .</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TRPEN</name>
							<description>Trap Enable Control   TRPEN. Setting a bit enables the trap functionality for the following corresponding output signals  TRPEN0   TRPCTR.8 for output CC60 TRPEN1   TRPCTR.9 for output COUT60 TRPEN2   TRPCTR.10 for output CC61 TRPEN3   TRPCTR.11 for output COUT61 TRPEN4   TRPCTR.12 for output CC62 TRPEN5   TRPCTR.13 for output COUT62</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TRPEN13</name>
							<description>Trap Enable Control for Timer T13   TRPEN13</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TRPPEN</name>
							<description>Trap Pin Enable   TRPPEN. This bit enables the input  pin  function for the trap generation. An interrupt can only be generated if a falling edge is detected at pin CTRAP while TRPPEN   1.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSLR</name>
					<description>Passive State Level Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>136</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PSL</name>
							<description>Compare Outputs Passive State Level   PSL. These bits define the passive level driven by the module outputs during the passive state. PSL0   PSLR.0 for output CC60 PSL1   PSLR.1 for output COUT60 PSL2   PSLR.2 for output CC61 PSL3   PSLR.3 for output COUT61 PSL4   PSLR.4 for output CC62 PSL5   PSLR.5 for output COUT62</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PSL63</name>
							<description>Passive State Level of Output COUT63   PSL63. This bit defines the passive level driven by the module output COUT63 during the passive state.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCMOUTS</name>
					<description>Multi Channel Mode Output Shadow Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>140</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MCMPS</name>
							<description>Multi Channel PWM Pattern Shadow   MCMPS. Bit field MCMPS is the shadow bit field for bit field MCMP. The multi channel shadow transfer is triggered by MCM ST according to the transfer conditions defined by register MCMCTR.</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STRMCM</name>
							<description>Shadow Transfer Request for MCMPS   STRMCM. Writing STRMCM  160    160 1 leads to an immediate activation of MCM ST to update        bit field MCMP by the value of MCMPS. When read  this bit always        delivers 0.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>EXPHS</name>
							<description>Expected Hall Pattern Shadow   EXPHS. Bit field EXPHS is the shadow bit field for bit field EXPH. The shadow transfer takes place when a correct Hall event is detected  CM CHE .</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CURHS</name>
							<description>Current Hall Pattern Shadow   CURHS. Bit field CURHS is the shadow bit field for bit field CURH. The shadow transfer takes place when a correct Hall event is detected  CM CHE .</description>
							<lsb>11</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STRHP</name>
							<description>Shadow Transfer Request for the Hall Pattern   STRHP. Writing STRHP   1 leads to an immediate activation of HP ST to update bit fields EXPH and CURH by EXPHS and CURHS. When read  this bit always delivers 0.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCMOUT</name>
					<description>Multi Channel Mode Output Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>144</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MCMP</name>
							<description>Multi Channel PWM Pattern   MCMP. Bit field MCMP defines the output pattern for the multi channel mode. If this mode is enabled by MODCTR.MCMEN   1  the output state of all T12 related PWM outputs can be modified. This bit field is 0 while IS.IDLE   1. MCMP0   MCMOUT.0 for output CC60 MCMP1   MCMOUT.1 for output COUT60 MCMP2   MCMOUT.2 for output CC61 MCMP3   MCMOUT.3 for output COUT61 MCMP4   MCMOUT.4 for output CC62 MCMP5   MCMOUT.5 for output COUT62</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>R</name>
							<description>Reminder Flag   R. This flag indicates that the shadow transfer from MCMPS to MCMP has been requested by the selected trigger source. It is cleared when the shadow transfer takes place or while MCMEN 0.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EXPH</name>
							<description>Expected Hall Pattern   EXPH. Bit field EXPH is updated by a shadow transfer HP ST from bit field EXPHS. If HCRDY   1  EXPH is compared to the sampled CCPOSx inputs in order to detect the occurrence of the next desired   expected  hall pattern or a wrong pattern. If the sampled hall pattern at the hall input pins is equal to bit field EXPH  a correct Hall event has been detected  CM CHE .</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CURH</name>
							<description>Current Hall Pattern   CURH. Bit field CURH is updated by a shadow transfer HP ST from bit field CURHS. If HCRDY   1  CURH is compared to the sampled CCPOSx inputs in order to detect a spike. If the sampled Hall pattern at the Hall input pins is equal to bit field CURH  no Hall event has been detected. If the sampled Hall input pattern is neither equal to CURH nor equal to EXPH  the Hall event was not the desired one and may be due to a fatal error  e.g. blocked rotor  etc. . In this case  a wrong Hall event has been detected  CM WHE .</description>
							<lsb>11</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCMCTR</name>
					<description>Multi Channel Mode Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>148</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SWSEL</name>
							<description>Switching Selection   SWSEL. Bit field SWSEL selects one of the following trigger request sources  next multi channel event  for the shadow transfer MCM ST from MCMPS to MCMP. The trigger request is stored in the reminder flag R until the shadow transfer is done and flag R is cleared automatically with the shadow transfer. The shadow transfer takes place synchronously with an event selected in bit field SWSYN.</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SWSYN</name>
							<description>Switching Synchronization   SWSYN. Bit field SWSYN defines the synchronization mechanism of the shadow transfer event MCM ST if it has been requested before  flag R set by an event selected by SWSEL  and if MCMEN   1. This feature permits the synchronization of the outputs to the PWM source  that is used for modulation  T12 or T13 .</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STE12U</name>
							<description>Shadow Transfer Enable for T12 Upcounting   STE12U. This bit enables the shadow transfer T12 ST if flag MCMOUT.R is set or becomes set while a T12 period match is detected while counting up.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STE12D</name>
							<description>Shadow Transfer Enable for T12 Downcounting   STE12D. This bit enables the shadow transfer T12 ST if flag MCMOUT.R is set or becomes set while a T12 one match is detected while counting down.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STE13U</name>
							<description>Shadow Transfer Enable for T13 Upcounting   STE13U. This bit enables the shadow transfer T13 ST if flag MCMOUT.R is set or becomes set while a T13 period match is detected.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IMON</name>
					<description>Input Monitoring Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>152</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LBE</name>
							<description>Lost Bit Event   LBE. This bit determines if a lost bit event has occurred. A lost bit event        occurs when a selected event occurs again with the previous event        captured  IMON.x remains set  and its lost indicator is enabled  for at        least one of the monitored input signals. The bit can be cleared by        writing a 1 to the same bit position  while writing a 0 has no effect.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CCPOS0I</name>
							<description>Event indication for input signal CCPOS2   CCPOS2I. The bit determines if the selected event has occurred via an edge        detection. The bit can be cleared by writing a 1 to the same bit        position  while writing a 0 has no effect. The dedicated edge is indicated for a selected event if          Hysteretic like Control or Capture modes are initialized in          T12MSEL.MSEL6x. If these modes are not selected  then all edges will          be indicated as an event for the inputs.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CCPOS1I</name>
							<description>Event indication for input signal CCPOS2   CCPOS2I. The bit determines if the selected event has occurred via an edge        detection. The bit can be cleared by writing a 1 to the same bit        position  while writing a 0 has no effect. The dedicated edge is indicated for a selected event if          Hysteretic like Control or Capture modes are initialized in          T12MSEL.MSEL6x. If these modes are not selected  then all edges will          be indicated as an event for the inputs.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CCPOS2I</name>
							<description>Event indication for input signal CCPOS2   CCPOS2I. The bit determines if the selected event has occurred via an edge        detection. The bit can be cleared by writing a 1 to the same bit        position  while writing a 0 has no effect. The dedicated edge is indicated for a selected event if          Hysteretic like Control or Capture modes are initialized in          T12MSEL.MSEL6x. If these modes are not selected  then all edges will          be indicated as an event for the inputs.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC60INI</name>
							<description>Event indication for input signal CC62IN   CC62INI. The bit determines if the selected event has occurred via an edge        detection. The bit can be cleared by writing a 1 to the same bit        position  while writing a 0 has no effect.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC61INI</name>
							<description>Event indication for input signal CC62IN   CC62INI. The bit determines if the selected event has occurred via an edge        detection. The bit can be cleared by writing a 1 to the same bit        position  while writing a 0 has no effect.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC62INI</name>
							<description>Event indication for input signal CC62IN   CC62INI. The bit determines if the selected event has occurred via an edge        detection. The bit can be cleared by writing a 1 to the same bit        position  while writing a 0 has no effect.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTRAPI</name>
							<description>Event indication for input signal CTRAP   CTRAPI. The bit determines if the selected event has occurred via an edge        detection. The bit can be cleared by writing a 1 to the same bit        position  while writing a 0 has no effect.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T12HRI</name>
							<description>Event indication for input signal T12HR   T12HRI. The bit determines if the selected event has occurred via an edge        detection. The bit can be cleared by writing a 1 to the same bit        position  while writing a 0 has no effect.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T13HRI</name>
							<description>Event indication for input signal T13HR   T13HRI. The bit determines if the selected event has occurred via an edge        detection. The bit can be cleared by writing a 1 to the same bit        position  while writing a 0 has no effect.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LI</name>
					<description>Lost Indicator Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>156</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CCPOS0EN</name>
							<description>Lost Indicator Enable for input signal CCPOS2   CCPOS2EN. This bit determines if the monitored event at the input signal is enabled for the detection of a lost bit event.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CCPOS1EN</name>
							<description>Lost Indicator Enable for input signal CCPOS2   CCPOS2EN. This bit determines if the monitored event at the input signal is enabled for the detection of a lost bit event.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CCPOS2EN</name>
							<description>Lost Indicator Enable for input signal CCPOS2   CCPOS2EN. This bit determines if the monitored event at the input signal is enabled for the detection of a lost bit event.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC60INEN</name>
							<description>Lost Indicator Enable for input signal CC62IN   CC62INEN. This bit determines if the monitored event at the input signal is enabled for the detection of a lost bit event.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC61INEN</name>
							<description>Lost Indicator Enable for input signal CC62IN   CC62INEN. This bit determines if the monitored event at the input signal is enabled for the detection of a lost bit event.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC62INEN</name>
							<description>Lost Indicator Enable for input signal CC62IN   CC62INEN. This bit determines if the monitored event at the input signal is enabled for the detection of a lost bit event.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTRAPEN</name>
							<description>Lost Indicator Enable for input signal CTRAP   CTRAPEN. This bit determines if the monitored event at the input signal is enabled for the detection of a lost bit event.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T12HREN</name>
							<description>Lost Indicator Enable for input signal T12HR   T12HREN. This bit determines if the monitored event at the input signal is enabled for the detection of a lost bit event.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T13HREN</name>
							<description>Lost Indicator Enable for input signal T13HR   T13HREN. This bit determines if the monitored event at the input signal is enabled for the detection of a lost bit event.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LBEEN</name>
							<description>Interrupt Enable for Lost Bit Event   LBEEN. This bit determines if a SRx line is activated if lost bit event is detected.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INPLBE</name>
							<description>Interrupt Node Pointer for lost bit event   INPLBE. This bit field defines which service request output line is selected to output an lost event alert for an enabled lost bit event.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
