J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>CCU61</name>
			<version>100</version>
			<description>CCU6</description>
			<baseAddress>4026542848</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>256</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CLC</name>
					<description>Clock Control Register
 resetvalue={Application Reset:0x3}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>3</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit   DISR. Used for enable disable control of the module.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit   DISS. Bit indicates the current status of the module.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EDIS</name>
							<description>Sleep Mode Enable Control   EDIS. Used to control module  8217 s sleep mode.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCFG</name>
					<description>Module Configuration Register
 resetvalue={Application Reset:0x08007,Application Reset:0x7}</description>
					<addressOffset>4</addressOffset>
					<size>32</size>
					<resetValue>7</resetValue>
					<resetMask>4294934527</resetMask>
					<fields>
						<field>
							<name>T12</name>
							<description>T12 Available   T12. This bit indicates if the T12 block is available.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>T13</name>
							<description>T13 Available   T13. This bit indicates if the T13 block is available.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MCM</name>
							<description>Multi Channel Mode Available   MCM. This bit indicates if the multi channel mode functionality is available.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Module Identification Register
 resetvalue={Application Reset:0x5400,Application Reset:0x5409}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>21504</resetValue>
					<resetMask>4294967040</resetMask>
					<fields>
						<field>
							<name>MODREV</name>
							<description>Module Revision Number   MODREV. MODREV defines the module revision number. The value of a module        revision starts with 01 H  first        revision   02 H          03 H    8230 up        to FF H .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODNUM</name>
							<description>Module Number Value   MODNUM. This bit field defines the module identification number for the CCU6  54 H</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PISEL0</name>
					<description>Port Input Select Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>16</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ISCC60</name>
							<description>Input Select for CC60 ISCC6x  x 0 1 2 . This bit field defines the input signal used as CC6x capture input.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ISCC61</name>
							<description>Input Select for CC60 ISCC6x  x 0 1 2 . This bit field defines the input signal used as CC6x capture input.</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ISCC62</name>
							<description>Input Select for CC60 ISCC6x  x 0 1 2 . This bit field defines the input signal used as CC6x capture input.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ISTRP</name>
							<description>Input Select for CTRAP   ISTRP. This bit field defines the input signal used as CTRAP input.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ISPOS0</name>
							<description>Input Select for CCPOS0 ISPOSx  x 0 1 2 . This bit field defines the input signal used as CCPOSx input.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ISPOS1</name>
							<description>Input Select for CCPOS0 ISPOSx  x 0 1 2 . This bit field defines the input signal used as CCPOSx input.</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ISPOS2</name>
							<description>Input Select for CCPOS0 ISPOSx  x 0 1 2 . This bit field defines the input signal used as CCPOSx input.</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IST12HR</name>
							<description>Input Select for T12HR   IST12HR. This bit field defines the input signal used as T12HR input.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PISEL2</name>
					<description>Port Input Select Register 2
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>20</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>IST13HR</name>
							<description>Input Select for T13HR   IST13HR. This bit field defines the input signal used as T13HR input.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ISCNT12</name>
							<description>Input Select for T12 Counting Input   ISCNT12. This bit field defines the input event leading to a counting action of T12.</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ISCNT13</name>
							<description>Input Select for T13 Counting Input   ISCNT13. This bit field defines the input event leading to a counting action of T13.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T12EXT</name>
							<description>Extension for T12HR Inputs   T12EXT. This bit extends the 2 bit field IST12HR.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T13EXT</name>
							<description>Extension for T13HR Inputs   T13EXT. This bit extends the 2 bit field IST13HR.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KSCSR</name>
					<description>Kernel State Control Sensitivity Register
 resetvalue={PowerOn Reset:0x0,Debug Reset:0x0}</description>
					<addressOffset>28</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SB0</name>
							<description>Sensitivity Block x  SBx  x 0 1 2 3 . This bit defines if block x of the CCU6 kernel is sensitive to Stop Mode 0 or Stop Mode 1. The functional        definition of the blocks is given in CROSSREFERENCE .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SB1</name>
							<description>Sensitivity Block x  SBx  x 0 1 2 3 . This bit defines if block x of the CCU6 kernel is sensitive to Stop Mode 0 or Stop Mode 1. The functional        definition of the blocks is given in CROSSREFERENCE .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SB2</name>
							<description>Sensitivity Block x  SBx  x 0 1 2 3 . This bit defines if block x of the CCU6 kernel is sensitive to Stop Mode 0 or Stop Mode 1. The functional        definition of the blocks is given in CROSSREFERENCE .</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SB3</name>
							<description>Sensitivity Block x  SBx  x 0 1 2 3 . This bit defines if block x of the CCU6 kernel is sensitive to Stop Mode 0 or Stop Mode 1. The functional        definition of the blocks is given in CROSSREFERENCE .</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T12</name>
					<description>Timer T12 Counter Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>32</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>T12CV</name>
							<description>Timer 12 Counter Value   T12CV. This register represents the 16 bit counter value of Timer12.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T12PR</name>
					<description>Timer 12 Period Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>36</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>T12PV</name>
							<description>T12 Period Value   T12PV. The value T12PV defines the counter value for T12 leading to a        period match. When reaching this value  the timer T12 is set to zero         edge aligned mode  or changes its count direction to down counting         center aligned mode .</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T12DTC</name>
					<description>Dead Time Control Register for Timer12
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>40</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DTM</name>
							<description>Dead Time   DTM. Bit field DTM determines the programmable delay between switching from        the passive state to the active state of the selected outputs. The        switching from the active state to the passive state is not delayed.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DTE0</name>
							<description>Dead Time Enable Bits DTEx  x 0 1 2  . Bits DTE0  8230 DTE2 enable and disable the dead time generation for each        compare channel  0  1  2  of timer T12.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DTE1</name>
							<description>Dead Time Enable Bits DTEx  x 0 1 2  . Bits DTE0  8230 DTE2 enable and disable the dead time generation for each        compare channel  0  1  2  of timer T12.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DTE2</name>
							<description>Dead Time Enable Bits DTEx  x 0 1 2  . Bits DTE0  8230 DTE2 enable and disable the dead time generation for each        compare channel  0  1  2  of timer T12.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DTR0</name>
							<description>Dead Time Run Indication Bits DTRx  x 1 2 3 . Bits DTR0  8230 DTR2 indicate the status of the dead time generation for each        compare channel  0  1  2  of timer T12.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DTR1</name>
							<description>Dead Time Run Indication Bits DTRx  x 1 2 3 . Bits DTR0  8230 DTR2 indicate the status of the dead time generation for each        compare channel  0  1  2  of timer T12.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DTR2</name>
							<description>Dead Time Run Indication Bits DTRx  x 1 2 3 . Bits DTR0  8230 DTR2 indicate the status of the dead time generation for each        compare channel  0  1  2  of timer T12.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>4</dimIncrement>
					<name>CC6xR[%s]</name>
					<description>Capture Compare Register for Channel CC60
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>48</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CCV</name>
							<description>Capture Compare Value   CCV. In compare mode  the bit fields CCV contain the values  that are compared to the T12 counter value. In capture mode  the captured value of T12 can be read from these registers.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>4</dimIncrement>
					<name>CC6xSR[%s]</name>
					<description>Capture Compare Shadow Reg. for Channel CC60
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>64</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CCS</name>
							<description>Shadow Register for Channel x Capture Compare Value   CCS. In compare mode  the bit fields contents of CCS are transferred to the bit fields CCV for the corresponding channel during a shadow transfer. In capture mode  the captured value of T12 can be read from these registers.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T13</name>
					<description>Timer T13 Counter Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>80</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>T13CV</name>
							<description>Timer 13 Counter Value   T13CV. This register represents the 16 bit counter value of Timer13.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T13PR</name>
					<description>Timer 13 Period Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>84</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>T13PV</name>
							<description>T13 Period Value   T13PV. The value T13PV defines the counter value for T13 leading to a period match. When reaching this value  the timer T13 is set to zero.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC63R</name>
					<description>Compare Register for T13
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>88</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CCV</name>
							<description>Channel CC63 Compare Value   CCV. The bit field CCV contains the value  that is compared to the T13 counter value.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC63SR</name>
					<description>Compare Shadow Register for T13
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>92</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CCS</name>
							<description>Shadow Register for Channel CC63 Compare Value   CCS. The bit field contents of CCS is transferred to the bit field CCV during a shadow transfer.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
