J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>CMPSTAT</name>
					<description>Compare State Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>96</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CC60ST</name>
							<description>Capture Compare State Bits for CC62  x   0  1  2    CC62ST. Bits CC6xST monitor the state of the capture compare channels. Bits        CC6xST  x  160    160 0  1  2  are related to T12 and are set and cleared        according to the T12 switching rules.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CC61ST</name>
							<description>Capture Compare State Bits for CC62  x   0  1  2    CC62ST. Bits CC6xST monitor the state of the capture compare channels. Bits        CC6xST  x  160    160 0  1  2  are related to T12 and are set and cleared        according to the T12 switching rules.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CC62ST</name>
							<description>Capture Compare State Bits for CC62  x   0  1  2    CC62ST. Bits CC6xST monitor the state of the capture compare channels. Bits        CC6xST  x  160    160 0  1  2  are related to T12 and are set and cleared        according to the T12 switching rules.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CCPOS60</name>
							<description>Sampled Hall Pattern Bits   CCPOS62. Bits CCPOS6x  x   0  1  2  are indicating the value of the input Hall pattern that has been compared to the current and expected value. The value is sampled when the event HCRDY  Hall Compare Ready  occurs.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CCPOS61</name>
							<description>Sampled Hall Pattern Bits   CCPOS62. Bits CCPOS6x  x   0  1  2  are indicating the value of the input Hall pattern that has been compared to the current and expected value. The value is sampled when the event HCRDY  Hall Compare Ready  occurs.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CCPOS62</name>
							<description>Sampled Hall Pattern Bits   CCPOS62. Bits CCPOS6x  x   0  1  2  are indicating the value of the input Hall pattern that has been compared to the current and expected value. The value is sampled when the event HCRDY  Hall Compare Ready  occurs.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CC63ST</name>
							<description>Capture Compare State Bit for CC63   CC63ST. Bit CC63ST monitors the state of the compare channel. Bit CC63ST is related to T13 and is set and cleared according to the T13 switching rules.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CC60PS</name>
							<description>Passive State Select for Compare Outputs CC62  x   0  1  2    CC62PS. Bits CC6xPS select the state of the corresponding compare channel  that is considered to be the passive state. During the passive state  the passive level  defined in register PSLR  is driven by the output pin. Bits CC6xPS  x   0  1  2  are related to T12. In capture mode  these bits are not used.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC61PS</name>
							<description>Passive State Select for Compare Outputs CC62  x   0  1  2    CC62PS. Bits CC6xPS select the state of the corresponding compare channel  that is considered to be the passive state. During the passive state  the passive level  defined in register PSLR  is driven by the output pin. Bits CC6xPS  x   0  1  2  are related to T12. In capture mode  these bits are not used.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC62PS</name>
							<description>Passive State Select for Compare Outputs CC62  x   0  1  2    CC62PS. Bits CC6xPS select the state of the corresponding compare channel  that is considered to be the passive state. During the passive state  the passive level  defined in register PSLR  is driven by the output pin. Bits CC6xPS  x   0  1  2  are related to T12. In capture mode  these bits are not used.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>COUT60PS</name>
							<description>Passive State Select for Compare Outputs COUT62  x   0  1  2    COUT62PS. Bits COUT6xPS select the state of the corresponding compare channel  that is considered to be the passive state. During the passive state  the passive level  defined in register PSLR  is driven by the output pin. Bits COUT6xPS  x   0  1  2  are related to T12. In capture mode  these bits are not used.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>COUT61PS</name>
							<description>Passive State Select for Compare Outputs COUT62  x   0  1  2    COUT62PS. Bits COUT6xPS select the state of the corresponding compare channel  that is considered to be the passive state. During the passive state  the passive level  defined in register PSLR  is driven by the output pin. Bits COUT6xPS  x   0  1  2  are related to T12. In capture mode  these bits are not used.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>COUT62PS</name>
							<description>Passive State Select for Compare Outputs COUT62  x   0  1  2    COUT62PS. Bits COUT6xPS select the state of the corresponding compare channel  that is considered to be the passive state. During the passive state  the passive level  defined in register PSLR  is driven by the output pin. Bits COUT6xPS  x   0  1  2  are related to T12. In capture mode  these bits are not used.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>COUT63PS</name>
							<description>Passive State Select for Compare Output COUT63   COUT63PS. Bit COUT63PS selects the state of the corresponding compare channel  that is considered to be the passive state. During the passive state  the passive level  defined in register PSLR  is driven by the output pin. Bit COUT63PS is related to T13.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T13IM</name>
							<description>T13 Inverted Modulation   T13IM. Bit T13IM inverts the T13 signal for the modulation of the CC6x and COUT6x  x   0  1  2  signals.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMPMODIF</name>
					<description>Compare State Modification Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>100</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MCC60S</name>
							<description>Capture Compare Status Modification Bits MCC62S  x   0  1  2    MCC62S. These bits are used to set the corresponding bits CC6xST by SW. The functionality of a write access to bits concerning the same        capture compare state bit is shown in CROSSREFERENCE .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MCC61S</name>
							<description>Capture Compare Status Modification Bits MCC62S  x   0  1  2    MCC62S. These bits are used to set the corresponding bits CC6xST by SW. The functionality of a write access to bits concerning the same        capture compare state bit is shown in CROSSREFERENCE .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MCC62S</name>
							<description>Capture Compare Status Modification Bits MCC62S  x   0  1  2    MCC62S. These bits are used to set the corresponding bits CC6xST by SW. The functionality of a write access to bits concerning the same        capture compare state bit is shown in CROSSREFERENCE .</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MCC63S</name>
							<description>Capture Compare Status Modification Bit MCC63S   MCC63S. This bit is used to set the corresponding bit CC63ST by SW. The functionality of a write access to bits concerning the same capture compare state bit is shown in CROSSREFERENCE .</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MCC60R</name>
							<description>Capture Compare Status Modification Bits MCC62R  x   0  1  2    MCC62R. These bits are used to clear the corresponding bits CC6xST by SW. The functionality of a write access to bits concerning the same        capture compare state bit is shown in CROSSREFERENCE .</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MCC61R</name>
							<description>Capture Compare Status Modification Bits MCC62R  x   0  1  2    MCC62R. These bits are used to clear the corresponding bits CC6xST by SW. The functionality of a write access to bits concerning the same        capture compare state bit is shown in CROSSREFERENCE .</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MCC62R</name>
							<description>Capture Compare Status Modification Bits MCC62R  x   0  1  2    MCC62R. These bits are used to clear the corresponding bits CC6xST by SW. The functionality of a write access to bits concerning the same        capture compare state bit is shown in CROSSREFERENCE .</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MCC63R</name>
							<description>Capture Compare Status Modification Bits MCC63R   MCC63R. This bit is used to clear the corresponding bit CC63ST by SW. The functionality of a write access to bits concerning the same capture compare state bit is shown in CROSSREFERENCE .</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T12MSEL</name>
					<description>T12 Mode Select Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>104</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MSEL60</name>
							<description>Capture Compare Mode Selection MSEL6x  x 0 1 2 . These bit fields select the operating mode of the three T12        capture compare channels. Each channel  x   0  1  2  can be programmed        individually for one of these modes  except for Hall Sensor Mode .        Coding see CROSSREFERENCE .</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSEL61</name>
							<description>Capture Compare Mode Selection MSEL6x  x 0 1 2 . These bit fields select the operating mode of the three T12        capture compare channels. Each channel  x   0  1  2  can be programmed        individually for one of these modes  except for Hall Sensor Mode .        Coding see CROSSREFERENCE .</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSEL62</name>
							<description>Capture Compare Mode Selection MSEL6x  x 0 1 2 . These bit fields select the operating mode of the three T12        capture compare channels. Each channel  x   0  1  2  can be programmed        individually for one of these modes  except for Hall Sensor Mode .        Coding see CROSSREFERENCE .</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HSYNC</name>
							<description>Hall Synchronization   HSYNC. Bit field HSYNC defines the source for the sampling of the Hall input        pattern and the comparison to the current and the expected Hall pattern        bit fields. Coding see CROSSREFERENCE .</description>
							<lsb>12</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DBYP</name>
							<description>Delay Bypass   DBYP. DBYP controls whether the source signal for the sampling of the Hall        input pattern  selected by HSYNC  is delayed by the Dead Time Counter 0.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCTR0</name>
					<description>Timer Control Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>112</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>T12CLK</name>
							<description>Timer T12 Input Clock Select   T12CLK. Selects the input clock for timer T12 that is derived from the peripheral clock according to the equation f T12   f CC6   2  lt T12CLK gt  .</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T12PRE</name>
							<description>Timer T12 Prescaler Bit   T12PRE. In order to support higher clock frequencies  an additional prescaler factor of 1 256 can be enabled for the prescaler for T12.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T12R</name>
							<description>Timer T12 Run Bit   T12R. T12R starts and stops timer T12. It is set cleared by SW by setting bits T12RR or T12RS or it is cleared by HW according to the function defined by bit field T12SSC.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>STE12</name>
							<description>Timer T12 Shadow Transfer Enable   STE12. Bit STE12 enables or disables the shadow transfer of the T12 period value  the compare values and passive state select bits and levels from their shadow registers to the actual registers if a T12 shadow transfer event is detected. Bit STE12 is cleared by hardware after the shadow transfer. A T12 shadow transfer event is a period match while counting up or a one match while counting down.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CDIR</name>
							<description>Count Direction of Timer T12   CDIR. This bit is set cleared according to the counting rules of T12.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CTM</name>
							<description>T12 Operating Mode   CTM</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T13CLK</name>
							<description>Timer T13 Input Clock Select   T13CLK. Selects the input clock for timer T13 that is derived from the peripheral clock according to the equation f T13   f CC6   2  lt T13CLK gt  .</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T13PRE</name>
							<description>Timer T13 Prescaler Bit   T13PRE. In order to support higher clock frequencies  an additional prescaler factor of 1 256 can be enabled for the prescaler for T13.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T13R</name>
							<description>Timer T13 Run Bit   T13R. T13R starts and stops timer T13. It is set cleared by SW by setting bits T13RR orT13RS or it is set cleared by HW according to the function defined by bit fields T13SSC  T13TEC and T13TED.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>STE13</name>
							<description>Timer T13 Shadow Transfer Enable   STE13. Bit STE13 enables or disables the shadow transfer of the T13 period value  the compare value and passive state select bit and level from their shadow registers to the actual registers if a T13 shadow transfer event is detected. Bit STE13 is cleared by hardware after the shadow transfer. A T13 shadow transfer event is a period match.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCTR2</name>
					<description>Timer Control Register 2
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>116</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>T12SSC</name>
							<description>Timer T12 Single Shot Control   T12SSC. This bit controls the single shot mode of T12.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T13SSC</name>
							<description>Timer T13 Single Shot Control   T13SSC. This bit controls the single shot mode of T13.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T13TEC</name>
							<description>T13 Trigger Event Control   T13TEC. Bit field T13TEC selects the trigger event to start T13  automatic set of T13R for synchronization to T12 compare signals  according to following combinations </description>
							<lsb>2</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T13TED</name>
							<description>Timer T13 Trigger Event Direction   T13TED. Bit field T13TED delivers additional information to control the automatic set of bit T13R in the case that the trigger action defined by T13TEC is detected.</description>
							<lsb>5</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T12RSEL</name>
							<description>Timer T12 External Run Selection   T12RSEL. Bit field T12RSEL defines the event of signal T12HR that can set the run bit T12R by HW.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T13RSEL</name>
							<description>Timer T13 External Run Selection   T13RSEL. Bit field T13RSEL defines the event of signal T13HR that can set the run bit T13R by HW.</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCTR4</name>
					<description>Timer Control Register 4
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>120</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>T12RR</name>
							<description>Timer T12 Run Reset   T12RR. Setting this bit clears the T12R bit.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>T12RS</name>
							<description>Timer T12 Run Set   T12RS. Setting this bit sets the T12R bit.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>T12RES</name>
							<description>Timer T12 Reset   T12RES</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>DTRES</name>
							<description>Dead Time Counter Reset   DTRES</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>T12CNT</name>
							<description>Timer T12 Count Event   T12CNT</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>T12STR</name>
							<description>Timer T12 Shadow Transfer Request   T12STR</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>T12STD</name>
							<description>Timer T12 Shadow Transfer Disable   T12STD</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>T13RR</name>
							<description>Timer T13 Run Reset   T13RR. Setting this bit clears the T13R bit.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>T13RS</name>
							<description>Timer T13 Run Set   T13RS. Setting this bit sets the T13R bit.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>T13RES</name>
							<description>Timer T13 Reset   T13RES</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>T13CNT</name>
							<description>Timer T13 Count Event   T13CNT</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>T13STR</name>
							<description>Timer T13 Shadow Transfer Request   T13STR</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>T13STD</name>
							<description>Timer T13 Shadow Transfer Disable   T13STD</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
