J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>IS</name>
					<description>Interrupt Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>160</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ICC60R</name>
							<description>Capture  Compare Match Rising Edge Flag ICC6xR  x 0 1 2 . This bit indicates that event CC6x R has been detected. This event        occurs in compare mode when a compare match is detected while T12 is        counting up  CM 6x and CDIR  160    160 0  and in capture mode when a rising edge        is detected at the related input CC6xIN.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ICC60F</name>
							<description>Capture  Compare Match Falling Edge Flag ICC6xF  x 0 1 2  . This bit indicates that event CC6x F has been detected. This event        occurs in compare mode when a compare match is detected while T12 is        counting down  CM 6x and CDIR  160    160 1  and in capture mode when a falling        edge is detected at the related input CC6xIN.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ICC61R</name>
							<description>Capture  Compare Match Rising Edge Flag ICC6xR  x 0 1 2 . This bit indicates that event CC6x R has been detected. This event        occurs in compare mode when a compare match is detected while T12 is        counting up  CM 6x and CDIR  160    160 0  and in capture mode when a rising edge        is detected at the related input CC6xIN.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ICC61F</name>
							<description>Capture  Compare Match Falling Edge Flag ICC6xF  x 0 1 2  . This bit indicates that event CC6x F has been detected. This event        occurs in compare mode when a compare match is detected while T12 is        counting down  CM 6x and CDIR  160    160 1  and in capture mode when a falling        edge is detected at the related input CC6xIN.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ICC62R</name>
							<description>Capture  Compare Match Rising Edge Flag ICC6xR  x 0 1 2 . This bit indicates that event CC6x R has been detected. This event        occurs in compare mode when a compare match is detected while T12 is        counting up  CM 6x and CDIR  160    160 0  and in capture mode when a rising edge        is detected at the related input CC6xIN.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ICC62F</name>
							<description>Capture  Compare Match Falling Edge Flag ICC6xF  x 0 1 2  . This bit indicates that event CC6x F has been detected. This event        occurs in compare mode when a compare match is detected while T12 is        counting down  CM 6x and CDIR  160    160 1  and in capture mode when a falling        edge is detected at the related input CC6xIN.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>T12OM</name>
							<description>Timer T12 One Match Flag   T12OM. This bit indicates that a timer T12 one match while counting down  T12 OM and CDIR   1  has been detected.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>T12PM</name>
							<description>Timer T12 Period Match Flag   T12PM. This bit indicates that a timer T12 period match while counting up  T12 PM and CDIR   0  has been detected.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>T13CM</name>
							<description>Timer T13 Compare Match Flag   T13CM. This bit indicates that a timer T13 compare match  CM 63  has been detected.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>T13PM</name>
							<description>Timer T13 Period Match Flag   T13PM. This bit indicates that a timer T13 period match  T13 PM  has been detected.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRPF</name>
							<description>Trap Flag   TRPF. This bit indicates if a trap condition  input CTRAP   0 or by SW  is   has been detected. If TRPM2  0  it becomes cleared automatically if CTRAP   1 or TRPPEN   0  whereas if TRPM2   1  it has to be cleared by writing RTRPF   1.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRPS</name>
							<description>Trap State   TRPS. This bit indicates the actual trap state. It is set if TRPF   1 and becomes cleared according to the mode selected in register TRPCTR.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CHE</name>
							<description>Correct Hall Event   CHE. This bit indicates that a correct Hall event  CM CHE  has been detected.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>WHE</name>
							<description>Wrong Hall Event   WHE. This bit indicates that a wrong Hall event  CM WHE  has been detected.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IDLE</name>
							<description>IDLE State   IDLE. If enabled by ENIDLE   1  this bit is set together with bit WHE and it has to be cleared by SW.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>STR</name>
							<description>Multi Channel Mode Shadow Transfer Request   STR. This bit indicates that a shadow transfer from MCMPS to MCMP  MCM ST  has taken place.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ISS</name>
					<description>Interrupt Status Set Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>164</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SCC60R</name>
							<description>Set Capture  Compare Match Rising Edge Flag   SCC6xR  x 0 1 2 </description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SCC60F</name>
							<description>Set Capture  Compare Match Falling Edge Flag   SCC6xF  x 0 1 2 </description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SCC61R</name>
							<description>Set Capture  Compare Match Rising Edge Flag   SCC6xR  x 0 1 2 </description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SCC61F</name>
							<description>Set Capture  Compare Match Falling Edge Flag   SCC6xF  x 0 1 2 </description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SCC62R</name>
							<description>Set Capture  Compare Match Rising Edge Flag   SCC6xR  x 0 1 2 </description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SCC62F</name>
							<description>Set Capture  Compare Match Falling Edge Flag   SCC6xF  x 0 1 2 </description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ST12OM</name>
							<description>Set Timer T12 One Match Flag   ST12OM</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ST12PM</name>
							<description>Set Timer T12 Period Match Flag   ST12PM</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ST13CM</name>
							<description>Set Timer T13 Compare Match Flag   ST13CM</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ST13PM</name>
							<description>Set Timer T13 Period Match Flag   ST13PM</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>STRPF</name>
							<description>Set Trap Flag   STRPF</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SWHC</name>
							<description>Software Hall Compare   SWHC</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SCHE</name>
							<description>Set Correct Hall Event Flag   SCHE</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SWHE</name>
							<description>Set Wrong Hall Event Flag   SWHE</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SIDLE</name>
							<description>Set IDLE Flag   SIDLE</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SSTR</name>
							<description>Set STR Flag   SSTR</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ISR</name>
					<description>Interrupt Status Reset Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>168</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RCC60R</name>
							<description>Reset Capture  Compare Match Rising Edge Flag   RCC6xR  x 0 1 2 </description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RCC60F</name>
							<description>Reset Capture  Compare Match Falling Edge Flag   RCC6xF  x 0 1 2 </description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RCC61R</name>
							<description>Reset Capture  Compare Match Rising Edge Flag   RCC6xR  x 0 1 2 </description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RCC61F</name>
							<description>Reset Capture  Compare Match Falling Edge Flag   RCC6xF  x 0 1 2 </description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RCC62R</name>
							<description>Reset Capture  Compare Match Rising Edge Flag   RCC6xR  x 0 1 2 </description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RCC62F</name>
							<description>Reset Capture  Compare Match Falling Edge Flag   RCC6xF  x 0 1 2 </description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RT12OM</name>
							<description>Reset Timer T12 One Match Flag   RT12OM</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RT12PM</name>
							<description>Reset Timer T12 Period Match Flag   RT12PM</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RT13CM</name>
							<description>Reset Timer T13 Compare Match Flag   RT13CM</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RT13PM</name>
							<description>Reset Timer T13 Period Match Flag   RT13PM</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RTRPF</name>
							<description>Reset Trap Flag   RTRPF</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RCHE</name>
							<description>Reset Correct Hall Event Flag   RCHE</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RWHE</name>
							<description>Reset Wrong Hall Event Flag   RWHE</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RIDLE</name>
							<description>Reset IDLE Flag   RIDLE</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSTR</name>
							<description>Reset STR Flag   RSTR</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>INP</name>
					<description>Interrupt Node Pointer Register
 resetvalue={Application Reset:0x3940}</description>
					<addressOffset>172</addressOffset>
					<size>32</size>
					<resetValue>14656</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>INPCC60</name>
							<description>Interrupt Node Pointer for Channel CC6x Interrupts  INPCC6x  x 0 1 2 . This bit field defines the service request output activated due to a set        condition for bit CC6xR  if enabled by bit ENCC6xR  or for bit CC6xF  if        enabled by bit ENCC6xF .</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INPCC61</name>
							<description>Interrupt Node Pointer for Channel CC6x Interrupts  INPCC6x  x 0 1 2 . This bit field defines the service request output activated due to a set        condition for bit CC6xR  if enabled by bit ENCC6xR  or for bit CC6xF  if        enabled by bit ENCC6xF .</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INPCC62</name>
							<description>Interrupt Node Pointer for Channel CC6x Interrupts  INPCC6x  x 0 1 2 . This bit field defines the service request output activated due to a set        condition for bit CC6xR  if enabled by bit ENCC6xR  or for bit CC6xF  if        enabled by bit ENCC6xF .</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INPCHE</name>
							<description>Interrupt Node Pointer for the CHE Interrupt   INPCHE. This bit field defines the service request output activated due to a set condition for bit CHE  if enabled by bit ENCHE  of for bit STR  if enabled by bit ENSTR . Coding see INPCC6x.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INPERR</name>
							<description>Interrupt Node Pointer for Error Interrupts   INPERR. This bit field defines the service request output activated due to a set        condition for bit TRPF  if enabled by bit ENTRPF  or for bit WHE  if        enabled by bit ENWHE . Coding see INPCC6x.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INPT12</name>
							<description>Interrupt Node Pointer for Timer12 Interrupts   INPT12. This bit field defines the service request output activated due to a set condition for bit T12OM  if enabled by bit ENT12OM  or for bit T12PM  if enabled by bit ENT12PM . Coding see INPCC6x.</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INPT13</name>
							<description>Interrupt Node Pointer for Timer13 Interrupt   INPT13. This bit field defines the service request output activated due to a set condition for bit T13CM  if enabled by bit ENT13CM  or for bit T13PM  if enabled by bit ENT13PM . Coding see INPCC6x.</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IEN</name>
					<description>Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>176</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ENCC60R</name>
							<description>Capture  Compare Match Rising Edge Interrupt Enable for Channel CC6x ENCC6xF  x 0 1 2 </description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENCC60F</name>
							<description>Capture  Compare Match Falling Edge Interrupt Enable for Channel CC6x ENCC6xF  x 0 1 2 </description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENCC61R</name>
							<description>Capture  Compare Match Rising Edge Interrupt Enable for Channel CC6x ENCC6xF  x 0 1 2 </description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENCC61F</name>
							<description>Capture  Compare Match Falling Edge Interrupt Enable for Channel CC6x ENCC6xF  x 0 1 2 </description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENCC62R</name>
							<description>Capture  Compare Match Rising Edge Interrupt Enable for Channel CC6x ENCC6xF  x 0 1 2 </description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENCC62F</name>
							<description>Capture  Compare Match Falling Edge Interrupt Enable for Channel CC6x ENCC6xF  x 0 1 2 </description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENT12OM</name>
							<description>Enable Interrupt for T12 One Match   ENT12OM</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENT12PM</name>
							<description>Enable Interrupt for T12 Period Match   ENT12PM</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENT13CM</name>
							<description>Enable Interrupt for T13 Compare Match   ENT13CM</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENT13PM</name>
							<description>Enable Interrupt for T13 Period Match   ENT13PM</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENTRPF</name>
							<description>Enable Interrupt for Trap Flag   ENTRPF</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENCHE</name>
							<description>Enable Interrupt for Correct Hall Event   ENCHE</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENWHE</name>
							<description>Enable Interrupt for Wrong Hall Event   ENWHE</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENIDLE</name>
							<description>Enable Idle   ENIDLE. This bit enables the automatic entering of the idle state  bit IDLE will be set  after a wrong hall event has been detected  bit WHE is set . During the idle state  the bit field MCMP is automatically cleared.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSTR</name>
							<description>Enable Multi Channel Mode Shadow Transfer Interrupt   ENSTR</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OCS</name>
					<description>OCDS Control and Status Register
 resetvalue={PowerOn Reset:0x0,Debug Reset:0x0}</description>
					<addressOffset>232</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TGS</name>
							<description>Trigger Set for OTGB0 1   TGS</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TGB</name>
							<description>OTGB0 1 Bus Select   TGB</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TG_P</name>
							<description>TGS  TGB Write Protection   TG P. TGS and TGB are only written when TG P is 1  otherwise unchanged. Read        as 0.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SUS</name>
							<description>OCDS Suspend Control   SUS. Controls the sensitivity to the suspend signal coming from the OCDS        Trigger Switch  OTGS  Effects of soft suspend options on CCU6 Functional Blocks are described        in section CROSSREFERENCE</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SUS_P</name>
							<description>SUS Write Protection   SUS P. SUS is only written when SUS P is 1  otherwise unchanged. Read as 0.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SUSSTA</name>
							<description>Suspend State   SUSSTA</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRSTCLR</name>
					<description>Kernel Reset Status Clear Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>236</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CLR</name>
							<description>Kernel Reset Status Clear   CLR. Read always as 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRST1</name>
					<description>Kernel Reset Register 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>240</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>Kernel Reset   RST. This reset bit can be used to request for a kernel reset. The kernel reset will be executed if the reset bits of both kernel reset registers are set. The RST bit will be cleared  re set to  0   by the BPI after the kernel reset was executed.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
