J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>EVADC</name>
			<version>100</version>
			<description>EVADC</description>
			<baseAddress>4026662912</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>15364</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<cluster>
					<name>GLOB</name>
					<description>GLOB</description>
					<addressOffset>160</addressOffset>
					<register>
						<dim>2</dim>
						<dimIncrement>4</dimIncrement>
						<name>GLOBICLASSi[%s]</name>
						<description>Input Class Register 0  Global
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>STCS</name>
								<description>Sample Time Control for Standard Conversions   STCS. Number of additional clock cycles to be added to the minimum sample        phase of 2 sample clock cycles  Coding and resulting sample time see CROSSREFERENCE . For conversions of external channels  the value from bitfield STCE can        be used.</description>
								<lsb>0</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AIPS</name>
								<description>Analog Input Precharge Control for Standard Conversions   AIPS. Buffer must be enabled by BE  160    160 1  see GxANCFG  .</description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CMS</name>
								<description>Conversion Mode for Standard Conversions   CMS</description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SESPS</name>
								<description>Spread Early Sample Point for Standard Conversions   SESPS</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>STCE</name>
								<description>Sample Time Control for EMUX Conversions   STCE. Number of additional clock cycles to be added to the minimum sample        phase of 2 sample clock cycles  Coding and resulting sample time see CROSSREFERENCE . For conversions of standard channels  the value from bitfield STCS is        used.</description>
								<lsb>16</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AIPE</name>
								<description>Analog Input Precharge Control for EMUX Conversions   AIPE. Buffer must be enabled by BE  160    160 1  see GxANCFG  .</description>
								<lsb>22</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CME</name>
								<description>Conversion Mode for EMUX Conversions   CME</description>
								<lsb>24</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SESPE</name>
								<description>Spread Early Sample Point for EMUX Conversions   SESPE</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GLOBBOUND</name>
						<description>Global Boundary Select Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>24</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>BOUNDARY0</name>
								<description>Boundary Value 0 for Limit Checking   BOUNDARY0. This value is compared against the conversion result.</description>
								<lsb>0</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BOUNDARY1</name>
								<description>Boundary Value 1 for Limit Checking   BOUNDARY1. This value is compared against the conversion result.</description>
								<lsb>16</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GLOBEFLAG</name>
						<description>Global Event Flag Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>64</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>REVGLB</name>
								<description>Global Result Event   REVGLB</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REVGLBCLR</name>
								<description>Clear Global Result Event   REVGLBCLR</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>write-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GLOBEVNP</name>
						<description>Global Event Node Pointer Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>160</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>REV0NP</name>
								<description>Service Request Node Pointer Global Result. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GLOBTF</name>
						<description>Global Test Functions Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>192</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CDCH</name>
								<description>Conversion Diagnostics Channel   CDCH. Defines the channel number to be used for diagnostic conversions. Applies to MDPD  MDPU.</description>
								<lsb>0</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CDGR</name>
								<description>Conversion Diagnostics Group   CDGR. Defines the group number to be used for diagnostic conversions. Applies to all test functions of primary and secondary groups.</description>
								<lsb>4</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CDEN</name>
								<description>Converter Diagnostics Enable   CDEN</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CDSEL</name>
								<description>Converter Diagnostics Pull Devices Select   CDSEL</description>
								<lsb>9</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CDWC</name>
								<description>Write Control for Conversion Diagnostics   CDWC</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>PDD</name>
								<description>Pull Down Diagnostics Enable   PDD. Channels with pull down diagnostics device are marked in the          product specific appendix.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MDPD</name>
								<description>Multiplexer Diagnostics Pull Down Devices Enable. Connecting combinations of pull up and or pull down devices generate        various loads for testing. Channels with pull down diagnostics device are marked in the          product specific appendix.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MDPU</name>
								<description>Multiplexer Diagnostics Pull Up Devices Enable. Connecting combinations of pull up and or pull down devices generate various loads for testing. Channels with pull up diagnostics device are marked in the product specific appendix.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MDWC</name>
								<description>Write Control for Multiplexer Diagnostics   MDWC</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>write-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GLOBTE</name>
						<description>Global Test Enable Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>196</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TFEP</name>
								<description>Test Function Enable  Primary Groups. Each bit of this bitfield is associated with the corresponding group. 0  No test functions for group x sequences 1  Test functions can be activated by group x sequences</description>
								<lsb>0</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TFES</name>
								<description>Test Function Enable  Secondary Groups. Each bit of this bitfield is associated with the corresponding group. 0  No test functions for group x sequences 1  Test functions can be activated by group x sequences</description>
								<lsb>8</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GLOBRCR</name>
						<description>Global Result Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>480</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DRCTR</name>
								<description>Data Reduction Control   DRCTR. Defines how result values are stored accumulated in this register for        the final result. The data reduction counter DRC can be loaded from this        bitfield. Coding see CROSSREFERENCE Only        standard data reduction is available for the global result register         i.e. DMM is assumed as 00 .</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WFR</name>
								<description>Wait for Read Mode Enable   WFR. Refer also to  Wait for Read Mode .</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SRGEN</name>
								<description>Service Request Generation Enable   SRGEN</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GLOBRES</name>
						<description>Global Result Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>608</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RESULT</name>
								<description>Result of most recent conversion   RESULT. The position of the result bits within this bitfield depends on the        configured operating mode. Refer to CROSSREFERENCE .</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GNR</name>
								<description>Group Number   GNR. Indicates the group to which the channel number in bitfield CHNR refers.</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CHNR</name>
								<description>Channel Number   CHNR. Indicates the channel number corresponding to the value in bitfield        RESULT.</description>
								<lsb>20</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>EMUX</name>
								<description>External Multiplexer Setting   EMUX. Indicates the setting of the external multiplexer  corresponding to the        value in bitfield RESULT.</description>
								<lsb>25</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CRS</name>
								<description>Converted Request Source   CRS. Indicates the request source that as requested the conversion to which        the result value in bitfield RESULT belongs.</description>
								<lsb>28</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>VF</name>
								<description>Valid Flag   VF. Indicates a new result in bitfield RESULT.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GLOBRESD</name>
						<description>Global Result Register  Debug
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>736</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RESULT</name>
								<description>Result of most recent conversion   RESULT. The position of the result bits within this bitfield depends on the        configured operating mode. Refer to CROSSREFERENCE .</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>GNR</name>
								<description>Group Number   GNR. Indicates the group to which the channel number in bitfield CHNR refers.</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CHNR</name>
								<description>Channel Number   CHNR. Indicates the channel number corresponding to the value in bitfield        RESULT.</description>
								<lsb>20</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>EMUX</name>
								<description>External Multiplexer Setting   EMUX. Indicates the setting of the external multiplexer  corresponding to the        value in bitfield RESULT.</description>
								<lsb>25</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CRS</name>
								<description>Converted Request Source   CRS. Indicates the request source that as requested the conversion to which        the result value in bitfield RESULT belongs.</description>
								<lsb>28</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>VF</name>
								<description>Valid Flag   VF. Indicates a new result in bitfield RESULT.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<dim>12</dim>
					<dimIncrement>1024</dimIncrement>
					<name>G[%s]</name>
					<description>G</description>
					<addressOffset>1024</addressOffset>
					<register>
						<name>GxTRCTR</name>
						<description>Trigger Control Register  Group 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>16</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TSC</name>
								<description>Trigger Sequence Counter   TSC. Controls the effect of an incoming internal trigger  If TSC  gt  00   decrement TSC by one.</description>
								<lsb>0</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>QACT</name>
								<description>Queue Active   QACT. Indicates that request source Q2 is currently executing a sequence. Cleared by writing 1 to bit COV.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>OV</name>
								<description>Overflow Detected   OV. Indicates that a trigger has been activated while the queue was still        active  QACT  160    160 1 . Cleared by writing 1 to bit COV.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TSCSET</name>
								<description>Trigger Sequence Counter Start Value   TSCSET. Defines the initial value of the trigger sequence counter TSC. TSC is reloaded with the value in TSCSET  when a trigger occurs while        TSC   00 . TSCSET is automatically copied to TSC when being written. CROSSREFERENCE</description>
								<lsb>16</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ITSEL</name>
								<description>Internal Trigger Input Selection   ITSEL. Internal triggers are generated by the respective source events. Enable a source event in the selected request source to generate an internal trigger signal. The selected trigger signal is internally connected to gate input GxREQGTP of this request source. It is selected when XTSEL   GTSEL   1111 .</description>
								<lsb>24</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SRDIS</name>
								<description>Service Request Disable   SRDIS. Controls if the source event of the selected trigger source also        activates a service request.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>COV</name>
								<description>Clear Overflow Flag   COV</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>write-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GxARBCFG</name>
						<description>Arbitration Config. Register  Group 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>128</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ANONC</name>
								<description>Analog Converter Control   ANONC. Defines the value of bitfield ANONS in a stand alone converter or a        converter in master mode. Coding see ANONS or CROSSREFERENCE .</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ANONS</name>
								<description>Analog Converter Control Status   ANONS. Defined by bitfield ANONC in a stand alone kernel or a kernel in master        mode. In slave mode  this bitfield is defined by bitfield ANONC of the        respective master kernel. See also CROSSREFERENCE .</description>
								<lsb>16</lsb>
								<msb>17</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CSRC</name>
								<description>Currently Converted Request Source   CSRC. Indicates the arbitration slot number of the current  BUSY  160    160 1  or of        the last  BUSY  160    160 0  conversion. This bitfield is updated when a        conversion is started.</description>
								<lsb>18</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CHNR</name>
								<description>Channel Number   CHNR. Indicates the current or last converted analog input channel. This        bitfield is updated when a conversion is started.</description>
								<lsb>20</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SYNRUN</name>
								<description>Synchronous Conversion Running   SYNRUN. Indicates that a synchronized    parallel  conversion is currently        running.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CAL</name>
								<description>Start Up Calibration Active Indication   CAL. Indicates the start up calibration phase of the corresponding analog        converter. Start conversions only after the start up calibration phase is          complete  because a start up calibration will abort a running          conversion.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>BUSY</name>
								<description>Converter Busy Flag   BUSY</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SAMPLE</name>
								<description>Sample Phase Flag   SAMPLE</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GxARBPR</name>
						<description>Arbitration Priority Register  Group 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>132</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>PRIO0</name>
								<description>Priority of Request Source i. Arbitration priority of request source i  at input i </description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CSM0</name>
								<description>Conversion Start Mode of Request Source 2</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PRIO1</name>
								<description>Priority of Request Source i. Arbitration priority of request source i  at input i </description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CSM1</name>
								<description>Conversion Start Mode of Request Source 2</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PRIO2</name>
								<description>Priority of Request Source i. Arbitration priority of request source i  at input i </description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CSM2</name>
								<description>Conversion Start Mode of Request Source 2</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ASEN0</name>
								<description>Arbitration Source Input 2 Enable. Enables the associated arbitration source input of the arbiter. The        request source bits are not modified by write actions to ASENi.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ASEN1</name>
								<description>Arbitration Source Input 2 Enable. Enables the associated arbitration source input of the arbiter. The        request source bits are not modified by write actions to ASENi.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ASEN2</name>
								<description>Arbitration Source Input 2 Enable. Enables the associated arbitration source input of the arbiter. The        request source bits are not modified by write actions to ASENi.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
