J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>GxANCFG</name>
						<description>Analog Fct. Config. Register  Group 0
 resetvalue={Application Reset:0x300004}</description>
						<addressOffset>136</addressOffset>
						<size>32</size>
						<resetValue>3145732</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>IPE</name>
								<description>Idle Precharge Enable   IPE</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BE</name>
								<description>Input Buffer Enable   BE</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RPE</name>
								<description>Reference Precharge Enable   RPE. Enabled after reset.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RPC</name>
								<description>Reference Precharge Control   RPC</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CALSTC</name>
								<description>Calibration Sample Time Control   CALSTC</description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DPCAL</name>
								<description>Disable Post Calibration   DPCAL</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACSD</name>
								<description>Analog Clock Synchronization Delay   ACSD. Defines the delay of the analog clock in clocks after the sync signal. Do not exceed the current DIVA setting for the clock delay. Valid only          if the phase synchronizer is selected  USC  160    160  0  </description>
								<lsb>16</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SSE</name>
								<description>Sample Synchronization Enable   SSE. See section CROSSREFERENCE .</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DIVA</name>
								<description>Divider Factor for the Analog Internal Clock   DIVA. Defines the frequency of the analog converter clock f ADCI  base clock for conversion steps   derived from the peripheral clock  f ADCI   f ADC   CP.</description>
								<lsb>20</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DCMSB</name>
								<description>Double Clock for the MSB Conversion   DCMSB. Selects an additional clock cycle for the conversion step of the MSB.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>2</dim>
						<dimIncrement>4</dimIncrement>
						<name>GxICLASSi[%s]</name>
						<description>Input Class Register 0  Group 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>160</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>STCS</name>
								<description>Sample Time Control for Standard Conversions   STCS. Number of additional clock cycles to be added to the minimum sample        phase of 2 sample clock cycles  Coding and resulting sample time see CROSSREFERENCE . For conversions of external channels  the value from bitfield STCE can        be used.</description>
								<lsb>0</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AIPS</name>
								<description>Analog Input Precharge Control for Standard Conversions   AIPS. Buffer must be enabled by BE  160    160 1  see GxANCFG  .</description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CMS</name>
								<description>Conversion Mode for Standard Conversions   CMS</description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SESPS</name>
								<description>Spread Early Sample Point for Standard Conversions   SESPS</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>STCE</name>
								<description>Sample Time Control for EMUX Conversions   STCE. Number of additional clock cycles to be added to the minimum sample        phase of 2 sample clock cycles  Coding and resulting sample time see CROSSREFERENCE . For conversions of standard channels  the value from bitfield STCS is        used.</description>
								<lsb>16</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AIPE</name>
								<description>Analog Input Precharge Control for EMUX Conversions   AIPE. Buffer must be enabled by BE  160    160 1  see GxANCFG  .</description>
								<lsb>22</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CME</name>
								<description>Conversion Mode for EMUX Conversions   CME</description>
								<lsb>24</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SESPE</name>
								<description>Spread Early Sample Point for EMUX Conversions   SESPE</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GxALIAS</name>
						<description>Alias Register  Group 0
 resetvalue={Application Reset:0x100}</description>
						<addressOffset>176</addressOffset>
						<size>32</size>
						<resetValue>256</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ALIAS0</name>
								<description>Alias Value for CH0 Conversion Requests   ALIAS0. Indicates the channel that is converted instead of channel CH0. The        conversion is done with the settings defined for channel CH0.</description>
								<lsb>0</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ALIAS1</name>
								<description>Alias Value for CH1 Conversion Requests   ALIAS1. Indicates the channel that is converted instead of channel CH1. The        conversion is done with the settings defined for channel CH1.</description>
								<lsb>8</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GxBOUND</name>
						<description>Boundary Select Register  Group 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>184</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>BOUNDARY0</name>
								<description>Boundary Value 0 for Limit Checking   BOUNDARY0. This value is compared against the conversion result.</description>
								<lsb>0</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BOUNDARY1</name>
								<description>Boundary Value 1 for Limit Checking   BOUNDARY1. This value is compared against the conversion result.</description>
								<lsb>16</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GxSYNCTR</name>
						<description>Synchronization Control Register  Group 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>192</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>STSEL</name>
								<description>Start Selection   STSEL. Controls the synchronization mechanism of the ADC kernel. Control inputs CIx see CROSSREFERENCE            connected kernels see product specific appendix.</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EVALR1</name>
								<description>Evaluate Ready Input Ri. Enables the ready input signal for a kernel of a synchronization group.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EVALR2</name>
								<description>Evaluate Ready Input Ri. Enables the ready input signal for a kernel of a synchronization group.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EVALR3</name>
								<description>Evaluate Ready Input Ri. Enables the ready input signal for a kernel of a synchronization group.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GxCEFLAG</name>
						<description>Channel Event Flag Register  Group 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>384</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CEV0</name>
								<description>Channel Event for Channel 15</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV1</name>
								<description>Channel Event for Channel 15</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV2</name>
								<description>Channel Event for Channel 15</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV3</name>
								<description>Channel Event for Channel 15</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV4</name>
								<description>Channel Event for Channel 15</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV5</name>
								<description>Channel Event for Channel 15</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV6</name>
								<description>Channel Event for Channel 15</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV7</name>
								<description>Channel Event for Channel 15</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV8</name>
								<description>Channel Event for Channel 15</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV9</name>
								<description>Channel Event for Channel 15</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV10</name>
								<description>Channel Event for Channel 15</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV11</name>
								<description>Channel Event for Channel 15</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV12</name>
								<description>Channel Event for Channel 15</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV13</name>
								<description>Channel Event for Channel 15</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV14</name>
								<description>Channel Event for Channel 15</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV15</name>
								<description>Channel Event for Channel 15</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GxREFLAG</name>
						<description>Result Event Flag Register  Group 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>388</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>REV0</name>
								<description>Result Event for Result Register 15</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV1</name>
								<description>Result Event for Result Register 15</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV2</name>
								<description>Result Event for Result Register 15</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV3</name>
								<description>Result Event for Result Register 15</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV4</name>
								<description>Result Event for Result Register 15</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV5</name>
								<description>Result Event for Result Register 15</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV6</name>
								<description>Result Event for Result Register 15</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV7</name>
								<description>Result Event for Result Register 15</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV8</name>
								<description>Result Event for Result Register 15</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV9</name>
								<description>Result Event for Result Register 15</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV10</name>
								<description>Result Event for Result Register 15</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV11</name>
								<description>Result Event for Result Register 15</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV12</name>
								<description>Result Event for Result Register 15</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV13</name>
								<description>Result Event for Result Register 15</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV14</name>
								<description>Result Event for Result Register 15</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV15</name>
								<description>Result Event for Result Register 15</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GxSEFLAG</name>
						<description>Source Event Flag Register  Group 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>392</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SEV0</name>
								<description>Source Event i</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEV1</name>
								<description>Source Event i</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEV2</name>
								<description>Source Event i</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GxCEFCLR</name>
						<description>Channel Event Flag Clear Register  Group 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>400</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CEV0</name>
								<description>Clear Channel Event for Channel 15   CEV15</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>CEV1</name>
								<description>Clear Channel Event for Channel 15   CEV15</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>CEV2</name>
								<description>Clear Channel Event for Channel 15   CEV15</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>CEV3</name>
								<description>Clear Channel Event for Channel 15   CEV15</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>CEV4</name>
								<description>Clear Channel Event for Channel 15   CEV15</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>CEV5</name>
								<description>Clear Channel Event for Channel 15   CEV15</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>CEV6</name>
								<description>Clear Channel Event for Channel 15   CEV15</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>CEV7</name>
								<description>Clear Channel Event for Channel 15   CEV15</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>CEV8</name>
								<description>Clear Channel Event for Channel 15   CEV15</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>CEV9</name>
								<description>Clear Channel Event for Channel 15   CEV15</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>CEV10</name>
								<description>Clear Channel Event for Channel 15   CEV15</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>CEV11</name>
								<description>Clear Channel Event for Channel 15   CEV15</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>CEV12</name>
								<description>Clear Channel Event for Channel 15   CEV15</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>CEV13</name>
								<description>Clear Channel Event for Channel 15   CEV15</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>CEV14</name>
								<description>Clear Channel Event for Channel 15   CEV15</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>CEV15</name>
								<description>Clear Channel Event for Channel 15   CEV15</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>write-only</access>
							</field>
						</fields>
					</register>
