J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>GxREFCLR</name>
						<description>Result Event Flag Clear Register  Group 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>404</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>REV0</name>
								<description>Clear Result Event for Result Register 15</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>REV1</name>
								<description>Clear Result Event for Result Register 15</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>REV2</name>
								<description>Clear Result Event for Result Register 15</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>REV3</name>
								<description>Clear Result Event for Result Register 15</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>REV4</name>
								<description>Clear Result Event for Result Register 15</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>REV5</name>
								<description>Clear Result Event for Result Register 15</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>REV6</name>
								<description>Clear Result Event for Result Register 15</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>REV7</name>
								<description>Clear Result Event for Result Register 15</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>REV8</name>
								<description>Clear Result Event for Result Register 15</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>REV9</name>
								<description>Clear Result Event for Result Register 15</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>REV10</name>
								<description>Clear Result Event for Result Register 15</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>REV11</name>
								<description>Clear Result Event for Result Register 15</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>REV12</name>
								<description>Clear Result Event for Result Register 15</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>REV13</name>
								<description>Clear Result Event for Result Register 15</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>REV14</name>
								<description>Clear Result Event for Result Register 15</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>REV15</name>
								<description>Clear Result Event for Result Register 15</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>write-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GxSEFCLR</name>
						<description>Source Event Flag Clear Reg.  Group 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>408</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SEV0</name>
								<description>Clear Source Event i</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>SEV1</name>
								<description>Clear Source Event i</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>SEV2</name>
								<description>Clear Source Event i</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>write-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GxCEVNP0</name>
						<description>Channel Event Node Pointer Reg. 0  Group 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>416</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CEV0NP</name>
								<description>Service Request Node Pointer Channel Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>0</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV1NP</name>
								<description>Service Request Node Pointer Channel Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>4</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV2NP</name>
								<description>Service Request Node Pointer Channel Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>8</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV3NP</name>
								<description>Service Request Node Pointer Channel Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>12</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV4NP</name>
								<description>Service Request Node Pointer Channel Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV5NP</name>
								<description>Service Request Node Pointer Channel Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>20</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV6NP</name>
								<description>Service Request Node Pointer Channel Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>24</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV7NP</name>
								<description>Service Request Node Pointer Channel Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>28</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GxCEVNP1</name>
						<description>Channel Event Node Pointer Reg. 1  Group 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>420</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CEV8NP</name>
								<description>Service Request Node Pointer Channel Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>0</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV9NP</name>
								<description>Service Request Node Pointer Channel Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>4</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV10NP</name>
								<description>Service Request Node Pointer Channel Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>8</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV11NP</name>
								<description>Service Request Node Pointer Channel Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>12</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV12NP</name>
								<description>Service Request Node Pointer Channel Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV13NP</name>
								<description>Service Request Node Pointer Channel Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>20</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV14NP</name>
								<description>Service Request Node Pointer Channel Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>24</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEV15NP</name>
								<description>Service Request Node Pointer Channel Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>28</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GxREVNP0</name>
						<description>Result Event Node Pointer Reg. 0  Group 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>432</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>REV0NP</name>
								<description>Service Request Node Pointer Result Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>0</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV1NP</name>
								<description>Service Request Node Pointer Result Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>4</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV2NP</name>
								<description>Service Request Node Pointer Result Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>8</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV3NP</name>
								<description>Service Request Node Pointer Result Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>12</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV4NP</name>
								<description>Service Request Node Pointer Result Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV5NP</name>
								<description>Service Request Node Pointer Result Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>20</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV6NP</name>
								<description>Service Request Node Pointer Result Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>24</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV7NP</name>
								<description>Service Request Node Pointer Result Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>28</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GxREVNP1</name>
						<description>Result Event Node Pointer Reg. 1  Group 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>436</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>REV8NP</name>
								<description>Service Request Node Pointer Result Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>0</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV9NP</name>
								<description>Service Request Node Pointer Result Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>4</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV10NP</name>
								<description>Service Request Node Pointer Result Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>8</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV11NP</name>
								<description>Service Request Node Pointer Result Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>12</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV12NP</name>
								<description>Service Request Node Pointer Result Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV13NP</name>
								<description>Service Request Node Pointer Result Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>20</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV14NP</name>
								<description>Service Request Node Pointer Result Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>24</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REV15NP</name>
								<description>Service Request Node Pointer Result Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>28</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GxSEVNP</name>
						<description>Source Event Node Pointer Reg.  Group 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>448</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SEV0NP</name>
								<description>Service Request Node Pointer Source Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>0</lsb>
								<msb>3</msb>
								<access>read-write</access>
								<enumeratedValues>
									<enumeratedValue>
										<name>Const_F15</name>
										<description>No service request line selected</description>
										<value>15</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>SEV1NP</name>
								<description>Service Request Node Pointer Source Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>4</lsb>
								<msb>7</msb>
								<access>read-write</access>
								<enumeratedValues>
									<enumeratedValue>
										<name>Const_F15</name>
										<description>No service request line selected</description>
										<value>15</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>SEV2NP</name>
								<description>Service Request Node Pointer Source Event i. Routes the corresponding event trigger to one of the service request        lines  nodes . For shared service request lines see common groups in the          product specific appendix. Not listed combinations are reserved.</description>
								<lsb>8</lsb>
								<msb>11</msb>
								<access>read-write</access>
								<enumeratedValues>
									<enumeratedValue>
										<name>Const_F15</name>
										<description>No service request line selected</description>
										<value>15</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
						</fields>
					</register>
