J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>GxSRACT</name>
						<description>Service Request Software Activation Trigger  Group 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>456</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>AGSR0</name>
								<description>Activate Group Service Request Node 3   AGSR3</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>AGSR1</name>
								<description>Activate Group Service Request Node 3   AGSR3</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>AGSR2</name>
								<description>Activate Group Service Request Node 3   AGSR3</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>AGSR3</name>
								<description>Activate Group Service Request Node 3   AGSR3</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>ASSR0</name>
								<description>Activate Shared Service Request Node 3   ASSR3</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>ASSR1</name>
								<description>Activate Shared Service Request Node 3   ASSR3</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>ASSR2</name>
								<description>Activate Shared Service Request Node 3   ASSR3</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>ASSR3</name>
								<description>Activate Shared Service Request Node 3   ASSR3</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>write-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GxEMUXCTR</name>
						<description>External Multiplexer Control Reg.  Group 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>496</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>EMUXSET</name>
								<description>External Multiplexer Start Selection   EMUXSET. Defines the initial selection for the external multiplexer.</description>
								<lsb>0</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EMUXMODE</name>
								<description>External Multiplexer Mode   EMUXMODE. Not listed combinations are reserved. For        single step mode  sequence mode and block mode  Select the start value        with EMUXMODE  000 before selecting the        respective mode.</description>
								<lsb>4</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EMXCOD</name>
								<description>External Multiplexer Coding Scheme   EMXCOD</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EMXST</name>
								<description>External Multiplexer Sample Time Control   EMXST</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EMXCSS</name>
								<description>External Multiplexer Channel Selection Style   EMXCSS</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EMXWC</name>
								<description>Write Control for EMUX Configuration   EMXWC</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>EMUXACT</name>
								<description>External Multiplexer Actual Selection   EMUXACT. Defines the current value for the external multiplexer selection. This        bitfield is loaded from bitfield EMUXSET and modified according to the        operating mode selected by bitfield EMUXMODE.</description>
								<lsb>16</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>EMUXCCB</name>
								<description>External Multiplexer Channel Selection for Block Mode   EMUXCCB. Defines the channel that switches EMUXACT when converted. In block mode         all EMUX channels use the same control value.</description>
								<lsb>20</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GxEMUXCS</name>
						<description>Ext. Multiplexer Channel Select Reg.  Group 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>500</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>EMUXCH</name>
								<description>External Multiplexer Channel Select   EMUXCH. Defines the channel s  to which the external multiplexer control is        applied. EMXCSS  160    160 0  Channel number the lower 5 bits select an arbitrary channel  valid numbers are limited        by the number of available channels  unused bits shall be 0  EMXCSS  160    160 1  Channel enable each bit enables the associated channel  multiple channels can be        selected enabled </description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GxVFR</name>
						<description>Valid Flag Register  Group 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>504</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>VF0</name>
								<description>Valid Flag of Result Register x   VF15. Indicates a new result in bitfield RESULT.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VF1</name>
								<description>Valid Flag of Result Register x   VF15. Indicates a new result in bitfield RESULT.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VF2</name>
								<description>Valid Flag of Result Register x   VF15. Indicates a new result in bitfield RESULT.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VF3</name>
								<description>Valid Flag of Result Register x   VF15. Indicates a new result in bitfield RESULT.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VF4</name>
								<description>Valid Flag of Result Register x   VF15. Indicates a new result in bitfield RESULT.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VF5</name>
								<description>Valid Flag of Result Register x   VF15. Indicates a new result in bitfield RESULT.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VF6</name>
								<description>Valid Flag of Result Register x   VF15. Indicates a new result in bitfield RESULT.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VF7</name>
								<description>Valid Flag of Result Register x   VF15. Indicates a new result in bitfield RESULT.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VF8</name>
								<description>Valid Flag of Result Register x   VF15. Indicates a new result in bitfield RESULT.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VF9</name>
								<description>Valid Flag of Result Register x   VF15. Indicates a new result in bitfield RESULT.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VF10</name>
								<description>Valid Flag of Result Register x   VF15. Indicates a new result in bitfield RESULT.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VF11</name>
								<description>Valid Flag of Result Register x   VF15. Indicates a new result in bitfield RESULT.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VF12</name>
								<description>Valid Flag of Result Register x   VF15. Indicates a new result in bitfield RESULT.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VF13</name>
								<description>Valid Flag of Result Register x   VF15. Indicates a new result in bitfield RESULT.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VF14</name>
								<description>Valid Flag of Result Register x   VF15. Indicates a new result in bitfield RESULT.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VF15</name>
								<description>Valid Flag of Result Register x   VF15. Indicates a new result in bitfield RESULT.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>16</dim>
						<dimIncrement>4</dimIncrement>
						<name>GxCHCTRy[%s]</name>
						<description>Group 0  Channel 0 Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>512</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ICLSEL</name>
								<description>Input Class Select   ICLSEL</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BNDSELL</name>
								<description>Lower Boundary Select   BNDSELL</description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BNDSELU</name>
								<description>Upper Boundary Select   BNDSELU</description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CHEVMODE</name>
								<description>Channel Event Mode   CHEVMODE. Generate a channel event  with limit checking The        boundary band is defined as the area where the result is less than or        equal to the selected upper boundary and greater than or equal to the        selected lower boundary  see CROSSREFERENCE .  </description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SYNC</name>
								<description>Synchronization Request   SYNC</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REFSEL</name>
								<description>Reference Input Selection   REFSEL. Defines the reference voltage input to be used for conversions on this        channel. Some channels cannot select an        alternate reference.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BNDSELX</name>
								<description>BoundaryExtension   BNDSELX. While BNDSELX   8800  0000   bitfields        BNDSELU and BNDSELL are concatenated and select the corresponding result        register as lower boundary.</description>
								<lsb>12</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RESREG</name>
								<description>Result Register   RESREG</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RESTGT</name>
								<description>Result Target   RESTGT</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RESPOS</name>
								<description>Result Position   RESPOS</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BWDCH</name>
								<description>Broken Wire Detection Channel   BWDCH. Reserved        combinations shall select VAGND.</description>
								<lsb>28</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BWDEN</name>
								<description>Broken Wire Detection Enable   BWDEN</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>16</dim>
						<dimIncrement>4</dimIncrement>
						<name>GxRCRy[%s]</name>
						<description>Group 0 Result Control Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>640</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DRCTR</name>
								<description>Data Reduction Control   DRCTR. Defines how result values are stored accumulated in this register for        the final result. The data reduction counter DRC can be loaded from this        bitfield. The function of bitfield DRCTR is determined by bitfield DMM.</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DMM</name>
								<description>Data Modification Mode   DMM. See CROSSREFERENCE</description>
								<lsb>20</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WFR</name>
								<description>Wait for Read Mode Enable   WFR</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FEN</name>
								<description>FIFO Mode Enable   FEN</description>
								<lsb>25</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SRGEN</name>
								<description>Service Request Generation Enable   SRGEN</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>16</dim>
						<dimIncrement>4</dimIncrement>
						<name>GxRESy[%s]</name>
						<description>Group 0 Result Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>768</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RESULT</name>
								<description>Result of Most Recent Conversion   RESULT. The position of the result bits within this bitfield depends on the        configured operating mode. Refer to CROSSREFERENCE . Bitfield RESULT is writeable by the application to set the initial value        for min max detection.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DRC</name>
								<description>Data Reduction Counter   DRC. Indicates the number of values still to be accumulated for the final        result. The final result is available and valid flag VF is set when        bitfield DRC becomes zero  by decrementing or by reload . See CROSSREFERENCE</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CHNR</name>
								<description>Channel Number   CHNR. Indicates the channel number corresponding to the value in bitfield        RESULT.</description>
								<lsb>20</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>EMUX</name>
								<description>External Multiplexer Setting   EMUX. Indicates the setting of the external multiplexer  corresponding to the        value in bitfield RESULT. Available in GxRES0 only. Use GxRES0 if EMUX information is required.</description>
								<lsb>25</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CRS</name>
								<description>Converted Request Source   CRS. Indicates the request source that as requested the conversion to which        the result value in bitfield RESULT belongs.</description>
								<lsb>28</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>VF</name>
								<description>Valid Flag   VF. Indicates a new result in bitfield RESULT. Bit VF is automatically cleared upon reading register GxRESy.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>16</dim>
						<dimIncrement>4</dimIncrement>
						<name>GxRESDy[%s]</name>
						<description>Group 0 Result Reg. 0  Debug
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>896</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RESULT</name>
								<description>Result of Most Recent Conversion   RESULT. The position of the result bits within this bitfield depends on the        configured operating mode. Refer to CROSSREFERENCE .</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>DRC</name>
								<description>Data Reduction Counter   DRC. Indicates the number of values still to be accumulated for the final        result. The final result is available and valid flag VF is set when        bitfield DRC becomes zero  by decrementing or by reload . See CROSSREFERENCE</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CHNR</name>
								<description>Channel Number   CHNR. Indicates the channel number corresponding to the value in bitfield        RESULT.</description>
								<lsb>20</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>EMUX</name>
								<description>External Multiplexer Setting   EMUX. Indicates the setting of the external multiplexer  corresponding to the        value in bitfield RESULT. Available in GxRESD0 only. Use GxRESD0 if EMUX information is required.</description>
								<lsb>25</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CRS</name>
								<description>Converted Request Source   CRS. Indicates the request source that as requested the conversion to which        the result value in bitfield RESULT belongs.</description>
								<lsb>28</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>VF</name>
								<description>Valid Flag   VF. Indicates a new result in bitfield RESULT.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<cluster>
						<dim>3</dim>
						<dimIncrement>32</dimIncrement>
						<name>Q[%s]</name>
						<description>Q</description>
						<addressOffset>256</addressOffset>
						<register>
							<name>GxQCTRLi</name>
							<description>Queue 0 Source Contr. Register  Group 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>SRCRESREG</name>
									<description>Source specific Result Register   SRCRESREG</description>
									<lsb>0</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRSEL</name>
									<description>Trigger Source Selection   TRSEL. Daisy chaining via source events from the corresponding adjacent request source Qi. Use XTMODE   10 B .</description>
									<lsb>6</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>XTSEL</name>
									<description>External Trigger Input Selection   XTSEL. The connected trigger input signals are listed in the product specific        appendix. XTSEL  160    160  1111 uses the          selected gate input as trigger source  ENGT must be 0X  .</description>
									<lsb>8</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>XTLVL</name>
									<description>External Trigger Level   XTLVL. Current level of the selected trigger input</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>XTMODE</name>
									<description>Trigger Operating Mode   XTMODE</description>
									<lsb>13</lsb>
									<msb>14</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>XTWC</name>
									<description>Write Control for Trigger Configuration   XTWC</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>GTSEL</name>
									<description>Gate Input Selection   GTSEL. The connected gate input signals are listed in the product specific        appendix. GTSEL  160    160  1111 uses the          selected internal trigger source for queue 2.</description>
									<lsb>16</lsb>
									<msb>19</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>GTLVL</name>
									<description>Gate Input Level   GTLVL. Current level of the selected gate input</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>GTWC</name>
									<description>Write Control for Gate Configuration   GTWC</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>TMEN</name>
									<description>Timer Mode Enable   TMEN</description>
									<lsb>28</lsb>
									<msb>28</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TMWC</name>
									<description>Write Control for Timer Mode   TMWC</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>write-only</access>
								</field>
							</fields>
						</register>
