J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
						<register>
							<name>GxQMRi</name>
							<description>Queue 0 Mode Register  Group 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>4</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>ENGT</name>
									<description>Enable Gate   ENGT. Selects the gating functionality for the request source. REQGTx is the selected gating signal.</description>
									<lsb>0</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ENTR</name>
									<description>Enable External Trigger   ENTR</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CLRV</name>
									<description>Clear Valid Bit   CLRV</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>TREV</name>
									<description>Trigger Event   TREV. Generates a software trigger for the request source. To trigger the request timer instead  write 1 to bit GxREQTIMi.REQTS.</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>FLUSH</name>
									<description>Flush Queue   FLUSH</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>CEV</name>
									<description>Clear Event Flag   CEV</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>RPTDIS</name>
									<description>Repeat Disable   RPTDIS</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>GxQSRi</name>
							<description>Queue 0 Status Register  Group 0
 resetvalue={Application Reset:0x20}</description>
							<addressOffset>8</addressOffset>
							<size>32</size>
							<resetValue>32</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>FILL</name>
									<description>Filling Level for Queue   FILL. Indicates the number of valid queue entries. It is incremented each time        a new entry is written to QINRx or by an enabled refill mechanism. It is        decremented each time a requested conversion has been started. A new        entry is ignored if the filling level has reached its maximum value. Maximum fill level for primary groups  8 entries Maximum fill level for secondary groups  16 entries</description>
									<lsb>0</lsb>
									<msb>3</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>EMPTY</name>
									<description>Queue Empty   EMPTY</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>REQGT</name>
									<description>Request Gate Level   REQGT. Monitors the level at the selected REQGT input.</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>EV</name>
									<description>Event Detected   EV. Indicates that an event has been detected while at least one valid entry        has been in the queue  queue register 0 or backup stage . Once set  this        bit is cleared automatically when the requested conversion is started.</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
						<register>
							<name>GxQ0Ri</name>
							<description>Queue 0 Register 0  Group 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>12</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>REQCHNR</name>
									<description>Request Channel Number   REQCHNR. Indicates the channel number to be converted.</description>
									<lsb>0</lsb>
									<msb>4</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>RF</name>
									<description>Refill   RF. Indicates the handling of handled requests.</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ENSI</name>
									<description>Enable Source Interrupt   ENSI</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>EXTR</name>
									<description>External Trigger   EXTR. Enables external trigger events.</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>V</name>
									<description>Request Channel Number Valid   V. Indicates a valid queue entry in queue register 0.</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PDD</name>
									<description>Pull Down Diagnostics Enable   PDD. Channels with pull down diagnostics device are marked in the          product specific appendix.</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MDPD</name>
									<description>Multiplexer Diagnostics Pull Devices Enable   MDPD MDPU. Connecting combinations of pull up and or pull down devices generate        various loads for testing. Channels with multiplexer diagnostics pull devices are marked in the          product specific appendix.</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MDPU</name>
									<description>Multiplexer Diagnostics Pull Devices Enable   MDPD MDPU. Connecting combinations of pull up and or pull down devices generate        various loads for testing. Channels with multiplexer diagnostics pull devices are marked in the          product specific appendix.</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CDEN</name>
									<description>Converter Diagnostics Enable   CDEN</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CDSEL</name>
									<description>Converter Diagnostics Pull Devices Select   CDSEL</description>
									<lsb>13</lsb>
									<msb>14</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
						<register>
							<name>GxQINRi</name>
							<description>Queue 0 Input Register  Group 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>16</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>REQCHNR</name>
									<description>Request Channel Number   REQCHNR. Defines the channel number to be converted. Not available channel numbers are treated as channel 0.</description>
									<lsb>0</lsb>
									<msb>4</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>RF</name>
									<description>Refill   RF</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>ENSI</name>
									<description>Enable Source Interrupt   ENSI</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>EXTR</name>
									<description>External Trigger   EXTR. Enables the external trigger functionality. To use external triggers  enable them by setting bit GxQMRy.ENTR.</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>PDD</name>
									<description>Pull Down Diagnostics Enable   PDD. Channels with pull down diagnostics device are marked in the          product specific appendix.</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>MDPD</name>
									<description>Multiplexer Diagnostics Pull Devices Enable   MDPD MDPU. Connecting combinations of pull up and or pull down devices generate        various loads for testing. Channels with multiplexer diagnostics pull devices are marked in the          product specific appendix.</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>MDPU</name>
									<description>Multiplexer Diagnostics Pull Devices Enable   MDPD MDPU. Connecting combinations of pull up and or pull down devices generate        various loads for testing. Channels with multiplexer diagnostics pull devices are marked in the          product specific appendix.</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>CDEN</name>
									<description>Converter Diagnostics Enable   CDEN</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>CDSEL</name>
									<description>Converter Diagnostics Pull Devices Select   CDSEL</description>
									<lsb>13</lsb>
									<msb>14</msb>
									<access>write-only</access>
								</field>
							</fields>
						</register>
						<register>
							<name>GxQBURi</name>
							<description>Queue 0 Backup Register  Group 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>20</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>REQCHNR</name>
									<description>Request Channel Number   REQCHNR. The channel number of the aborted conversion that has been requested by        this request source</description>
									<lsb>0</lsb>
									<msb>4</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>RF</name>
									<description>Refill   RF. The refill control bit of the aborted conversion</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ENSI</name>
									<description>Enable Source Interrupt   ENSI. The enable source interrupt control bit of the aborted conversion</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>EXTR</name>
									<description>External Trigger   EXTR. The external trigger control bit of the aborted conversion</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>V</name>
									<description>Request Channel Number Valid   V. Indicates if the entry  REQCHNR  RF  TR  ENSI  in the queue backup        register is valid. Bit V is set when a running conversion  that has been        requested by this request source  is aborted  it is cleared when the        aborted conversion is restarted.</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PDD</name>
									<description>Pull Down Diagnostics Enable   PDD. Channels with pull down diagnostics device are marked in the          product specific appendix.</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MDPD</name>
									<description>Multiplexer Diagnostics Pull Down Devices Enable. Connecting combinations of pull up and or pull down devices generate        various loads for testing. Channels with multiplexer diagnostics pull devices are marked in the          product specific appendix.</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MDPU</name>
									<description>Multiplexer Diagnostics Pull Up Devices Enable. Connecting combinations of pull up and or pull down devices generate        various loads for testing. Channels with multiplexer diagnostics pull devices are marked in the          product specific appendix.</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CDEN</name>
									<description>Converter Diagnostics Enable   CDEN</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CDSEL</name>
									<description>Converter Diagnostics Pull Devices Select   CDSEL</description>
									<lsb>13</lsb>
									<msb>14</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
						<register>
							<name>GxREQTMi</name>
							<description>Queue 0 Requ. Timer Mode Reg.  Group 0
 resetvalue={Application Reset:0x0FFC00000}</description>
							<addressOffset>24</addressOffset>
							<size>32</size>
							<resetValue>4290772992</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>SEQMOD</name>
									<description>Sequence Mode   SEQMOD. Selects how the request timer controls the conversion sequence. Before changing the operating mode  stop the sequence timer  i.e. SEQMOD          00 .</description>
									<lsb>0</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEQTIMSET</name>
									<description>Sequence Timer  Set Value   SEQTIMSET. Initial value for the sequence timer in steps of 16   215  t PER .        This value is loaded into SEQTIMER when a new request timer period is        started.</description>
									<lsb>6</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>REQTS</name>
									<description>Request Timer Start Trigger   REQTS</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>ENTR</name>
									<description>Enable External Trigger   ENTR</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEQTIMOFF</name>
									<description>Sequence Timer  Switch Off Value   SEQTIMOFF. The generated trigger signal is disabled when the timer value is equal to or below this threshold.</description>
									<lsb>22</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>GxREQTSi</name>
							<description>Queue 0 Requ. Timer Status Reg.  Group 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>28</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>SEQTIMER</name>
									<description>Sequence Timer   SEQTIMER. Counts the request timer periods in steps of 16   215  t ADC .        This timer is loaded from bitfield SEQTIMSET at the beginning of a        period.</description>
									<lsb>6</lsb>
									<msb>15</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
					</cluster>
				</cluster>
				<cluster>
					<dim>4</dim>
					<dimIncrement>256</dimIncrement>
					<name>FC[%s]</name>
					<description>FC</description>
					<addressOffset>13312</addressOffset>
					<register>
						<name>FCxFCCTRL</name>
						<description>Fast Compare Control Register  FC Channel 0
 resetvalue={Application Reset:0x0C20}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>3104</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>STCF</name>
								<description>Sample Time Control for Fast Comparisons   STCF. Number of additional clock cycles to be added to the minimum sample        phase of 2 analog clock cycles  Coding and resulting sample time see CROSSREFERENCE .</description>
								<lsb>0</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RPE</name>
								<description>Reference Precharge Enable   RPE. Enabled after reset.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AIPF</name>
								<description>Analog Input Precharge Enable for Fast Comparisons   AIPF. The buffer is enabled automatically while AIPF   8800  00 .</description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CHEVMODE</name>
								<description>Channel Event Mode   CHEVMODE. Generate a channel event  For a service request summary  refer to CROSSREFERENCE .</description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DIVA</name>
								<description>Divider Factor for the Analog Internal Clock   DIVA. Defines the frequency of the analog converter clock f ADCI  base clock for conversion steps   derived from the peripheral clock  f ADCI   f ADC   CP.</description>
								<lsb>10</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CPWC</name>
								<description>Write Control for Control Parameters   CPWC</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>XTSEL</name>
								<description>External Trigger Input Selection   XTSEL. The connected trigger input signals are listed in the product specific        appendix. The selected input signal can be used as a trigger source or as a gate          signal  depending on the operating mode.</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>XTLVL</name>
								<description>External Trigger Level   XTLVL. Current level of the selected trigger input</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>XTMODE</name>
								<description>Trigger Operating Mode   XTMODE</description>
								<lsb>21</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>XTPOL</name>
								<description>External Trigger Polarity   XTPOL</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GTMODE</name>
								<description>Gate Operating Mode   GTMODE</description>
								<lsb>24</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FCCHNR</name>
								<description>Fast Compare Channel  Cannel Number   FCCHNR. Selects the input signal to be compared  1C   8230  1F select internal        signals  used for testing   all other channel numbers are reserved. See   8220 Common Input Signals  8221  in the product specific appendix.</description>
								<lsb>26</lsb>
								<msb>30</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>XTWC</name>
								<description>Write Control for Trigger Gate Configuration   XTWC</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>write-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>FCxFCM</name>
						<description>Fast Compare Mode Register  FC Channel 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RUNCOMP</name>
								<description>Run Control for Compare Channel   RUNCOMP. Defines the basic run conditions of the fast compare channel.</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RUNRAMP</name>
								<description>Run Control for Ramp   RUNRAMP. Defines the run conditions for the ramp generation. Before changing the operating mode  stop the ramp timer  i.e. RUNRAMP            00 . REQTRx is the selected trigger          signal.</description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FCRDIR</name>
								<description>Fast Compare Ramp Direction   FCRDIR</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ANON</name>
								<description>Analog Converter Control   ANON. The extended wakeup time is required before the analog part is fully          operable  see CROSSREFERENCE  .</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACSD</name>
								<description>Analog Clock Synchronization Delay   ACSD. Defines the delay of the analog clock in clocks after the sync signal. Do not exceed the current DIVA setting for the clock delay. Valid only          if the phase synchronizer is selected  USC  160    160  0  </description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FCTRIV</name>
								<description>Fast Compare Trigger Interval   FCTRIV. Defines the interval at which fast compare operations are triggered in        steps of 16   215  1  f ADC .</description>
								<lsb>8</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SRG</name>
								<description>Service Request Generation   SRG. For a service request summary  refer to CROSSREFERENCE .</description>
								<lsb>16</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AUE</name>
								<description>Automatic Update Enable   AUE. Defines the source of the value s  in bitfield FCREF.</description>
								<lsb>18</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SSE</name>
								<description>Sample Synchronization Enable   SSE. See section CROSSREFERENCE .</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FCMWC</name>
								<description>Write Control for Fast Compare Mode Configuration   FCMWC</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>FCREF</name>
								<description>Fast Compare Reference Value   FCREF. The input level is compared to this value. The resulting reference level is V AREF   1  xa0 024   xd7   lt FCREF gt .</description>
								<lsb>22</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
