J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>GLOBCFG</name>
					<description>Global Configuration Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>128</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>USC</name>
							<description>Unsynchronized Clock Generation   USC. Defines the way the analog clock is generated.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SUPLEV</name>
							<description>Supply Voltage Level   SUPLEV. Adjusts the analog circuitry to the supply voltage used in the        application system. Make sure to keep SUPLEV  160    160  00 or 01 in the case of a 5  160 V supply.</description>
							<lsb>13</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPWC</name>
							<description>Write Control for Control Parameters   CPWC</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SUCAL</name>
							<description>Start Up Calibration   SUCAL. Writing 1 to bit SUCAL initiates the start up calibration phase of all enabled analog converters  except for the fast compare channels . Before and during start up calibration  all converters must be inactive. After reset this is the case anyway.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ACCPROT0</name>
					<description>Access Protection Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>136</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>APCP</name>
							<description>Access Protection Channel Control  Primary Groups. Each bit of this bitfield is associated with the corresponding group. 0  Full access to registers 1  Write access to channel control registers is blocked</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>APCS</name>
							<description>Access Protection Channel Control  Secondary Groups. Each bit of this bitfield is associated with the corresponding group. 0  Full access to registers 1  Write access to channel control registers is blocked</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>APIP</name>
							<description>Access Protection Initialization  Primary Groups. Each bit of this bitfield is associated with the corresponding group. 0  Full access to registers 1  Write access to initialization registers is blocked</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>APIS</name>
							<description>Access Protection Initialization  Secondary Groups. Each bit of this bitfield is associated with the corresponding group. 0  Full access to registers 1  Write access to initialization registers is blocked</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ACCPROT1</name>
					<description>Access Protection Register 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>140</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>APSP</name>
							<description>Access Protection Service Request  Primary Groups. Each bit of this bitfield is associated with the corresponding group. 0  Full access to registers 1  Write access to service request registers is blocked</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>APSS</name>
							<description>Access Protection Service Request  Secondary Groups. Each bit of this bitfield is associated with the corresponding group. 0  Full access to registers 1  Write access to service request registers is blocked</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>APRP</name>
							<description>Access Protection Result Registers  Primary Groups. Each bit of this bitfield is associated with the corresponding group. 0  Full access to registers 1  Write access to result registers is blocked</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>APRS</name>
							<description>Access Protection Result Registers  Secondary Groups. Each bit of this bitfield is associated with the corresponding group. 0  Full access to registers 1  Write access to result registers is blocked</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ACCPROT2</name>
					<description>Access Protection Register 2
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>144</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>APF</name>
							<description>Access Protection Fast Compare Channels. Each bit of this bitfield is associated with the corresponding channel. 0  Full access to registers 1  Write access to fast compare channel registers is blocked</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>APGC</name>
							<description>Access Protection Global Configuration   APGC</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>APEM</name>
							<description>Access Protection External Multiplexer   APEM</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>APTF</name>
							<description>Access Protection Test Function   APTF</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EMUXSEL</name>
					<description>External Multiplexer Interface Select Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1008</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EMUXGRP0</name>
							<description>External Multiplexer Group for Interface 0. Defines the group whose external multiplexer control signals are routed        to EMUX interface 0  pins EMUX0x .</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EMUXGRP1</name>
							<description>External Multiplexer Group for Interface 1. Defines the group whose external multiplexer control signals are routed        to EMUX interface 1  pins EMUX1x .</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
