J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>EDSADC</name>
			<version>100</version>
			<description>EDSADC</description>
			<baseAddress>4026679296</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>1792</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<cluster>
					<dim>6</dim>
					<dimIncrement>256</dimIncrement>
					<name>CH[%s]</name>
					<description>CH</description>
					<addressOffset>256</addressOffset>
					<register>
						<name>MODCFGx</name>
						<description>Modulator Configuration Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>INCFGP</name>
								<description>Configuration of Positive Input Line   INCFGP. Defines the internal connection of the positive input.</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INCFGN</name>
								<description>Configuration of Negative Input Line   INCFGN. Defines the internal connection of the negative input.</description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GAINSEL</name>
								<description>Gain Select of Analog Input Path   GAINSEL. Not listed combinations are reserved.</description>
								<lsb>4</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INSEL</name>
								<description>Input Pin Selection   INSEL. Defines the initial or permanent setting for the input multiplexer         bitfield INMUX  depending on the selected operating mode  bitfield        INMODE .</description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INMUX</name>
								<description>Input Multiplexer Setting   INMUX. Indicates the current setting of the input multiplexer connecting the        input pins to the buffer inputs. The product specific appendix details the available channels and their        inputs.</description>
								<lsb>10</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>INMODE</name>
								<description>Input Multiplexer Control Mode   INMODE. Defines the condition for a trigger event to control the input        multiplexer. Bitfield INMAC selects the action upon a trigger event.</description>
								<lsb>12</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INMAC</name>
								<description>Input Multiplexer Action Control   INMAC. Defines the mechanism by which the input multiplexer is controlled.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INCWC</name>
								<description>Write Control for Input Parameters   INCWC</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>DIVM</name>
								<description>Modulator Clock Period   DIVM. Defines the period of the modulator clock  on chip external   derived from the peripheral clock  t MOD   t ADC   xd7  CP   f MOD   f ADC   CP   with CP   4   DIVM   xd7  2.</description>
								<lsb>16</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACSD</name>
								<description>Analog Clock Synchronization Delay   ACSD. Defines the delay in clocks after the sync signal. Valid only if the phase synchronizer is selected  USC  160    160  0  .</description>
								<lsb>20</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DITHEN</name>
								<description>Dithering Function Enable   DITHEN. Controls the dithering function for each modulator separately.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IREN</name>
								<description>Integrator Reset Enable   IREN. Controls the modulator overdrive handling</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>APC</name>
								<description>Automatic Power Control   APC</description>
								<lsb>28</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MMWC</name>
								<description>Write Control for Modulator Mode Settings   MMWC</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>write-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DICFGx</name>
						<description>Demodulator Input Config. Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DSS</name>
								<description>Data Stream Select   DSS</description>
								<lsb>0</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DSRCEX</name>
								<description>Data Source for External Modulator   DSRCEX</description>
								<lsb>4</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CSRCEX</name>
								<description>Clock Source for External Modulator   CSRCEX</description>
								<lsb>8</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DSWC</name>
								<description>Write Control for Data Stream Selection   DSWC</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>TRSEL</name>
								<description>Trigger Select   TRSEL. Selects an input for the trigger signal used for the following features         see also CROSSREFERENCE    To avoid unintended triggers  select the        trigger source first before enabling the corresponding function. integrator control  timestamp  multiplexer control  modulator control         APC   service request gating. The product specific appendix details the connected trigger input        signals.</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ITRMODE</name>
								<description>Integrator Trigger Mode   ITRMODE. To ensure proper operation  ensure that bitfield ITRMODE is 00 before selecting any other trigger mode. The        integration trigger mode controls bit INTEN in register IWCTRx and hence the operation of the integrator  Bit INTEN is set when ITRMODE  160    160  11 or when the selected trigger signal transition occurs. Bit INTEN is cleared when ITRMODE  160    160  00          after REPVAL 1 integration cycles  IWS  160    160 0  or when the inverse trigger        signal transition occurs  IWS  160    160 1 .</description>
								<lsb>20</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TSTRMODE</name>
								<description>Timestamp Trigger Mode   TSTRMODE. The timestamp trigger mode controls capturing the timestamp information        to register TSTMPx .</description>
								<lsb>22</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DRM</name>
								<description>Data Read Mode   DRM. Selects the data that is returned when register RESMx is read  see CROSSREFERENCE  .</description>
								<lsb>26</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TSM</name>
								<description>Time Stamp Mode   TSM. See CROSSREFERENCE .</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RDM</name>
								<description>Result Display Mode   RDM</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MSWC</name>
								<description>Write Control for Mode Settings   MSWC</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>write-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>FCFGMx</name>
						<description>Filter Configuration Register 0  Main
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>16</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>FIR0EN</name>
								<description>FIR0 Filter Enable   FIR0EN</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FIR1EN</name>
								<description>FIR1 Filter Enable   FIR1EN</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OVCEN</name>
								<description>Overshoot Compensation Enable</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FIR1DEC</name>
								<description>FIR1 Filter Decimation Rate   FIR1DEC</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CICMOD</name>
								<description>CIC Filter Mode   CICMOD</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PFEN</name>
								<description>Prefilter Enable   PFEN</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OCEN</name>
								<description>Offset Compensation Filter Enable   OCEN</description>
								<lsb>8</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OFFPROT</name>
								<description>Offset Protection   OFFPROT. Controls the influence of the calibration sequence on register OFFCOMP.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FMWC</name>
								<description>Write Control for Filter Modes   FMWC</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>SRGM</name>
								<description>Service Request Generation for Main Service Request   SRGM</description>
								<lsb>16</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SRGA</name>
								<description>Service Request Generation for Alternate Service Request   SRGA. SRGA  160    160  00 can be used for testing  If TEST.ICTEN  160    160  1            Reload request for test shift register</description>
								<lsb>20</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ESEL</name>
								<description>Event Select   ESEL. Defines when a comparator event is generated.</description>
								<lsb>22</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EGT</name>
								<description>Event Gating. Defines if alarm events are coupled to the integration window.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CALIB</name>
								<description>Calibration Trigger   CALIB</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>AUTOCAL</name>
								<description>Automatic Calibration Control   AUTOCAL</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CSRWC</name>
								<description>Write Control for Calibration and Service Request Modes   CSRWC</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>write-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>FCFGCx</name>
						<description>Filter Configuration Register 0  CIC Filter
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>20</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CFMDF</name>
								<description>CIC Filter Decimation Factor   CFMDF. Defines the oversampling rate of the CIC filter  OSR   CFMDF  160    160 1. Valid values are 0 03 to 1FF  OSR   4 to 512 .</description>
								<lsb>0</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CFMSV</name>
								<description>CIC Filter Start Value   CFMSV. The decimation counter begins counting at value CFMSV  when started or        restarted. Valid values are 003 to CFMDF  4 to        selected OSR . Start values above the selected        oversampling rate may lead to overflows in the CIC filter </description>
								<lsb>16</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>FCNTCx</name>
						<description>Filter Counter Register 0  CIC Filter
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>24</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CFMDCNT</name>
								<description>CIC Filter Decimation Counter   CFMDCNT. The decimation counter counts the filter cycles until an output is        generated  i.e. the oversampling rate. CFMDCNT counts down from the respective start value.</description>
								<lsb>0</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CAL</name>
								<description>Calibration Status Flag   CAL. Bitfield CAL is set to 01 in the next          clock cycle after setting bit CALIB or after detecting the selected          trigger  if auto calibration is activated .</description>
								<lsb>30</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>OVSCFGx</name>
						<description>Overshoot Compensation Cfg. Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>28</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SRFS</name>
								<description>Slew Rate Filter Strength. Defines the time constant for the slew rate filter.</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SRFRT</name>
								<description>Slew Rate Filter Run Time. Defines the time constant for the slew rate filter.</description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SDM</name>
								<description>Step Detection Mode. Defines when the slew rate filter is activated.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SDTH</name>
								<description>Step Detection Threshold. Defines the threshold value  magnitude  used for step detection. The        threshold value is  lt SDTH gt    215  32</description>
								<lsb>16</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>IWCTRx</name>
						<description>Integration Window Control Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>32</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ISC</name>
								<description>Integrator Shift Control   ISC. Controls the data shifter after the integrator that selects the portion        of the integrator data for the result register. 110   8230  111 are reserved. ISC selects the respective bits in register IIVAL. The lowest selected          bit is used for rounding and is then removed.</description>
								<lsb>0</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IWS</name>
								<description>Integration Window Size   IWS</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FRC</name>
								<description>Filter Chain Restart Control</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REPVAL</name>
								<description>Number of Integration Cycles   REPVAL. Defines the number of integration cycles to be counted by REPCNT if        activated  IWS  160    160 0 . The number of cycles is REPVAL 1.</description>
								<lsb>8</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>NVALDIS</name>
								<description>Number of Values Discarded   NVALDIS. Start the integration cycle after NVALDIS values</description>
								<lsb>16</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>NVALINT</name>
								<description>Number of Values to be Accumulated   NVALINT. Stop the integration cycle after NVALINT 1 values Use intervals of 2 minimum  so no data is lost due to the data shifter.</description>
								<lsb>24</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>IIVALx</name>
						<description>Intermediate Integration Value
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>36</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>IVAL</name>
								<description>Result of most recent accumulation   IVAL</description>
								<lsb>0</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ISTATx</name>
						<description>Integrator Status Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>40</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>NVALCNT</name>
								<description>Number of Values Counted   NVALCNT. Counts the number of integrated values until integration is started         NVALDIS  or completed  NVALINT </description>
								<lsb>0</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>REPCNT</name>
								<description>Integration Cycle Counter   REPCNT. Counts the number of integration cycles if activated  IWS  160    160 0 . This number is selected via bitfield REPVAL.</description>
								<lsb>8</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>INTEN</name>
								<description>Integration Enable   INTEN. Indicates the activity of the integrator. For        the control of bit INTEN  see also bitfield ITRMODE in register DICFGx .</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>RFCx</name>
						<description>Result FIFO Control Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>44</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SRLVL</name>
								<description>Service Request FIFO Level</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RDEC</name>
								<description>Read Error Flag Clear</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>WREC</name>
								<description>Write Error Flag Clear</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>FIFL</name>
								<description>FIFO Flush</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>FILL</name>
								<description>FIFO Fill Level. Not listed combinations are reserved.</description>
								<lsb>16</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RDERR</name>
								<description>Read Error Flag</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>WRERR</name>
								<description>Write Error Flag</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>RESMx</name>
						<description>Result Register 0 Main
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>48</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RESULTLO</name>
								<description>Result Value Lower Part   RESULTLO. Returns the next value from the result FIFO  Result or timestamp  see CROSSREFERENCE  </description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RESULTHI</name>
								<description>Result Value Higher Part   RESULTHI. Returns an additional value  Sign extension  result from FIFO  timestamp  or zero  see CROSSREFERENCE  </description>
								<lsb>16</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>OFFCOMPx</name>
						<description>Offset Compensation Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>56</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>OFFSET</name>
								<description>Offset Value   OFFSET. Half of this signed value is subtracted from each result produced by the        filter chain. Bit 0 represents 1 2 LSB. This increases the precision in case of          accumulated result values  e.g. in the integrator.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
