J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>GAINCALx</name>
						<description>Gain Calibration Register 0
 resetvalue={Application Reset:0x61A81000}</description>
						<addressOffset>60</addressOffset>
						<size>32</size>
						<resetValue>1638404096</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CALFACTOR</name>
								<description>Multiplication Factor for Gain Calibration   CALFACTOR. The resulting factor is   lt CALFACTOR gt    4  160 096  The initial value of 4  160 096   1000            corresponds to a factor of 1.000.</description>
								<lsb>0</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CALTARGET</name>
								<description>Target Value for Calibrated Fullscale   CALTARGET. Defines the target value for the calibration algorithm. The initial value of 25  160 000   61A8            corresponds to 0.2  160 mV per LSB.</description>
								<lsb>16</lsb>
								<msb>30</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GAINCTRx</name>
						<description>Gain Control Register 0
 resetvalue={Application Reset:0x1000}</description>
						<addressOffset>64</addressOffset>
						<size>32</size>
						<resetValue>4096</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>GAINFACTOR</name>
								<description>Multiplication Factor for Gain Correction During Calibration   GAINFACTOR. The resulting factor is   lt GAINFACTOR gt    4  160 096 </description>
								<lsb>0</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CICSHIFT</name>
								<description>Position of the CIC Filter Output Shifter During Calibration   CICSHIFT. Selects the valid outputs bits from the CIC filter  depending on the chosen decimation factor  see data shifter formula   1D   x2026  1F are reserved.</description>
								<lsb>16</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CICDEC</name>
								<description>Decimation Rate of the CIC Filter During Calibration   CICDEC. Factor   2    CICDEC   3 </description>
								<lsb>24</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GAINCORRx</name>
						<description>Gain Correction Register 0
 resetvalue={Application Reset:0x1000}</description>
						<addressOffset>68</addressOffset>
						<size>32</size>
						<resetValue>4096</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>GAINFACTOR</name>
								<description>Multiplication Factor for Gain Correction   GAINFACTOR. The resulting factor is   lt GAINFACTOR gt    4  160 096 </description>
								<lsb>0</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CICSHIFT</name>
								<description>Position of the CIC Filter Output Shifter. Selects the valid outputs bits from the CIC filter  depending on the        chosen decimation factor  see formula above  1D   8230  1F are reserved.</description>
								<lsb>16</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TSTMPx</name>
						<description>Time Stamp Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>80</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TIMESTAMP</name>
								<description>The Most Recent Captured Timestamp Value   TIMESTAMP. This value is copied from the timestamp counter TSCOUNT If bit AMXCOPY in register TSCNTx is 1  bits TIMESTAMP 15 14  are replaced with a copy of bitfield AMX.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>AMX</name>
								<description>Analog Multiplexer Setting   AMX. This value is copied from bitfield INMUX in register MODCFGx</description>
								<lsb>16</lsb>
								<msb>17</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TSVAL</name>
								<description>Timestamp Valid   TSVAL. Indicates valid timestamp information.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TSCNTx</name>
						<description>Time Stamp Counter 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>84</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TSCOUNT</name>
								<description>Timestamp Counter Value   TSCOUNT. TSCOUNT is clocked with the modulator clock and is cleared when a new result value has been generated.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TSCLK</name>
								<description>Timestamp Counter Clock Selection   TSCLK</description>
								<lsb>16</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TSCRUN</name>
								<description>Timestamp Counter Run Control   TSCRUN</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AMXCOPY</name>
								<description>Analog MUX Setting Copy Enable   AMXCOPY. Allows copying of bitfield AMX into bitfield TIMESTAMP  in register TSTMPx  .</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>FCFGAx</name>
						<description>Auxiliary Filter Configuration Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>112</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CFAEN</name>
								<description>CIC Filter  Auxiliary  Enable</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CFADF</name>
								<description>CIC Filter  Auxiliary  Decimation Factor</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CFACNT</name>
								<description>CIC Filter  Auxiliary  Decimation Counter. The decimation counter counts the filter cycles until an output is        generated  i.e. the oversampling rate.</description>
								<lsb>16</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>BOUNDSELx</name>
						<description>Boundary Select Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>120</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>BOUNDARYL</name>
								<description>Lower Boundary Value for Limit Checking   BOUNDARYL. This  two  8217 s complement  value is compared to the upper bits of the CIC        filter results.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BOUNDARYU</name>
								<description>Upper Boundary Value for Limit Checking   BOUNDARYU. This  two  8217 s complement  value is compared to the upper bits of the CIC        filter results.</description>
								<lsb>16</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>RESAx</name>
						<description>Result Register 0 Auxiliary
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>128</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RESULT</name>
								<description>Most Recent Result of Auxiliary Filter</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CGSYNCx</name>
						<description>Carrier Generator Synchronization Reg. 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>160</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SDCOUNT</name>
								<description>Sign Delay Counter   SDCOUNT. Counts the result values from the filter chain to delay the carrier sign        signal</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SDCAP</name>
								<description>Sign Delay Capture Value   SDCAP. Indicates the result values counted between the begin of the positive        halfwave of the carrier signal and the first received positive value.</description>
								<lsb>8</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SDPOS</name>
								<description>Sign Delay Value for Positive Halfwave   SDPOS. Defines the content of SDCOUNT to generate a negative delayed sign        signal  SGND .</description>
								<lsb>16</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SDNEG</name>
								<description>Sign Delay Value for Negative Halfwave   SDNEG. Defines the content of SDCOUNT to generate a positive delayed sign        signal  SGND .</description>
								<lsb>24</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>RECTCFGx</name>
						<description>Rectification Configuration Register 0
 resetvalue={Application Reset:0x080000000}</description>
						<addressOffset>168</addressOffset>
						<size>32</size>
						<resetValue>2147483648</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RFEN</name>
								<description>Rectification Enable   RFEN. General control of the rectifier circuit. Rectification is only active while the integrator is active.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SSRC</name>
								<description>Sign Source. Selects the sign signal that is to be delayed.</description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SSCH</name>
								<description>Sign Source Channel. Selects the channel providing the sign signal if SSRC   01 . Other products of the family may have less channels and  consequently         less valid SSCH codes. Not listed combinations are reserved.</description>
								<lsb>8</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SDCVAL</name>
								<description>Valid Flag   SDCVAL. Indicates a new value in bitfield SDCAP.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SGNCS</name>
								<description>Selected Carrier Sign Signal   SGNCS</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SGND</name>
								<description>Sign Signal Delayed   SGND</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>VCMx</name>
						<description>Common Mode Voltage Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>176</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>VREFXSEL</name>
								<description>Fractional Reference Voltage Selection   VREFXSEL</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VXON</name>
								<description>Fractional Reference Voltage Enable   VXON</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INPVC0</name>
								<description>Voltage Control of Positive Inputs 3 of CH0. Defines the connection of the respective positive input y to the common        mode voltage. y indicates the input of the analog multiplexers  if available .</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INPVC1</name>
								<description>Voltage Control of Positive Inputs 3 of CH0. Defines the connection of the respective positive input y to the common        mode voltage. y indicates the input of the analog multiplexers  if available .</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INPVC2</name>
								<description>Voltage Control of Positive Inputs 3 of CH0. Defines the connection of the respective positive input y to the common        mode voltage. y indicates the input of the analog multiplexers  if available .</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INPVC3</name>
								<description>Voltage Control of Positive Inputs 3 of CH0. Defines the connection of the respective positive input y to the common        mode voltage. y indicates the input of the analog multiplexers  if available .</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INNVC0</name>
								<description>Voltage Control of Negative Inputs 3 of CH0. Defines the connection of the respective negative input y to the common        mode voltage. y indicates the input of the analog multiplexers  if available .</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INNVC1</name>
								<description>Voltage Control of Negative Inputs 3 of CH0. Defines the connection of the respective negative input y to the common        mode voltage. y indicates the input of the analog multiplexers  if available .</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INNVC2</name>
								<description>Voltage Control of Negative Inputs 3 of CH0. Defines the connection of the respective negative input y to the common        mode voltage. y indicates the input of the analog multiplexers  if available .</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INNVC3</name>
								<description>Voltage Control of Negative Inputs 3 of CH0. Defines the connection of the respective negative input y to the common        mode voltage. y indicates the input of the analog multiplexers  if available .</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
				<register>
					<name>CLC</name>
					<description>Clock Control Register
 resetvalue={Application Reset:0x3}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>3</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit   DISR. Used for enable disable control of the module.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit   DISS</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EDIS</name>
							<description>Sleep Mode Enable Control   EDIS. Used to control the module  8217 s reaction to sleep mode.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Module Identification Register
 resetvalue={PowerOn Reset:0x0C6C007}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>13025287</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision   MOD REV. Indicates the revision number of the implementation. This information        depends on the design step.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type   MOD TYPE. This internal marker is fixed to C0 .</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number   MOD NUMBER. Indicates the module identification number   00C6   EDSADC  </description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OCS</name>
					<description>OCDS Control and Status Register
 resetvalue={PowerOn Reset:0x0,Debug Reset:0x0}</description>
					<addressOffset>40</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SUS</name>
							<description>OCDS Suspend Control   SUS. Controls the sensitivity to the suspend signal coming from the OCDS        Trigger Switch  OTGS . In soft suspend mode  the respective channel is stopped after the next        result has been stored. For products with less channels the upper codes are reserved.</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SUS_P</name>
							<description>SUS Write Protection   SUS P. SUS is only written when SUS P is 1  otherwise unchanged. Read as 0.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SUSSTA</name>
							<description>Suspend State   SUSSTA</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRSTCLR</name>
					<description>Kernel Reset Status Clear Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>44</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CLR</name>
							<description>Kernel Reset Status Clear   CLR. Read always as 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRST1</name>
					<description>Kernel Reset Register 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>48</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>Kernel Reset   RST. Request a kernel reset. The reset is executed if the reset bits of both        kernel reset registers are set. RST is cleared after the kernel reset was executed.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRST0</name>
					<description>Kernel Reset Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>52</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>Kernel Reset   RST. Request a kernel reset. The reset is executed if the reset bits of both        kernel reset registers are set. RST is cleared after the kernel reset was executed.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RSTSTAT</name>
							<description>Kernel Reset Status   RSTSTAT. Indicates an executed kernel reset. RSTSTAT is set after the execution        of a kernel reset in the same clock cycle in which the reset bits are        cleared. Clear RSTSTAT by setting bit CLR in register KRSTCLR.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
