J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>PHSSFTY</name>
					<description>Phase Synchronizer Safety Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>132</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ALF</name>
							<description>Alarm Flag for Safety Features. This sticky flag is set when a described error is detected  see  quot Safety        Measures quot    it is cleared by writing a  quot 1 quot  to bit ALFCLR.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FIPD0</name>
							<description>Fault Injection Phase sync Divider</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FICN0</name>
							<description>Fault Injection Counter</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ALFCLR</name>
							<description>Alarm Flag ALF Clear</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FIPD1</name>
							<description>Fault Injection Phase sync Divider</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FICN1</name>
							<description>Fault Injection Phase sync Divider</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>GPT120</name>
			<version>100</version>
			<description>GPT12</description>
			<baseAddress>4026537984</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>256</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CLC</name>
					<description>Clock Control Register
 resetvalue={Application Reset:0x3}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>3</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit   DISR. Used for enable disable control of the module.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit   DISS. Bit indicates the current status of the module.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EDIS</name>
							<description>Sleep Mode Enable Control   EDIS. Used to control module  8217 s sleep mode.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PISEL</name>
					<description>Port Input Select Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>IST2IN</name>
							<description>Input Select for T2IN   IST2IN</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IST2EUD</name>
							<description>Input Select for T2EUD   IST2EUD</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IST3IN</name>
							<description>Input Select for T3IN   IST3IN</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IST3EUD</name>
							<description>Input Select for T3EUD   IST3EUD</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IST4IN</name>
							<description>Input Select for T4IN   IST4IN</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IST4EUD</name>
							<description>Input Select for T4EUD   IST4EUD</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IST5IN</name>
							<description>Input Select for T5IN   IST5IN</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IST5EUD</name>
							<description>Input Select for T5EUD   IST5EUD</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IST6IN</name>
							<description>Input Select for T6IN   IST6IN</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IST6EUD</name>
							<description>Input Select for T6EUD   IST6EUD</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ISCAPIN</name>
							<description>Input Select for CAPIN   ISCAPIN</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Identification Register
 resetvalue={Application Reset:0x68C000,Application Reset:0x68C001}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>6864896</resetValue>
					<resetMask>4294967040</resetMask>
					<fields>
						<field>
							<name>MODREV</name>
							<description>Module Revision Number   MODREV. This bit field indicates the revision number of the module  01 H   160    160 first        revision .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODTYPE</name>
							<description>Module Type   MODTYPE. This bit field is C0 H . It defines a        32 bit module</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODNUMBER</name>
							<description>Module Number   MODNUMBER. This bit field defines the module identification number. For the GPT12 module the module identification number is 68 H .</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T2CON</name>
					<description>Timer T2 Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>16</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>T2I</name>
							<description>Timer T2 Input Parameter Selection   T2I. Depends on the operating mode  see respective sections for encoding  CROSSREFERENCE for Timer Mode and Gated Timer Mode CROSSREFERENCE for Counter Mode CROSSREFERENCE for Incremental Interface Mode</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T2M</name>
							<description>Timer T2 Mode Control  Basic Operating Mode    T2M</description>
							<lsb>3</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T2R</name>
							<description>Timer T2 Run Bit   T2R. This bit only controls timer T2 if bit T2RC   0.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T2UD</name>
							<description>Timer T2 Up Down Control   T2UD. This bit only directly controls count direction of T2 if bit T2UDE   0.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T2UDE</name>
							<description>Timer T2 External Up Down Enable   T2UDE</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T2RC</name>
							<description>Timer T2 Remote Control   T2RC</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T2IRDIS</name>
							<description>Timer T2 Interrupt Disable   T2IRDIS</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T2EDGE</name>
							<description>Timer T2 Edge Detection   T2EDGE. The bit is set each time a count edge is detected. T2EDGE must be cleared by software.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T2CHDIR</name>
							<description>Timer T2 Count Direction Change   T2CHDIR. The bit is set each time the count direction of timer T2 changes. T2CHDIR must be cleared by software.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T2RDIR</name>
							<description>Timer T2 Rotation Direction   T2RDIR</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T3CON</name>
					<description>Timer T3 Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>20</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>T3I</name>
							<description>Timer T3 Input Parameter Selection   T3I. Depends on the operating mode  see respective sections for encoding  CROSSREFERENCE for Timer Mode and Gated Timer Mode CROSSREFERENCE for Counter Mode CROSSREFERENCE for Incremental Interface Mode</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T3M</name>
							<description>Timer T3 Mode Control   T3M</description>
							<lsb>3</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T3R</name>
							<description>Timer T3 Run Bit   T3R</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T3UD</name>
							<description>Timer T3 Up Down Control   T3UD. This bit only directly controls count direction of T3 if bit T3UDE   0.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T3UDE</name>
							<description>Timer T3 External Up Down Enable   T3UDE</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T3OE</name>
							<description>Overflow Underflow Output Enable   T3OE</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T3OTL</name>
							<description>Timer T3 Overflow Toggle Latch   T3OTL. Toggles on each overflow underflow of T3. Can be set or cleared by        software  see separate description </description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BPS1</name>
							<description>GPT1 Block Prescaler Control   BPS1. Selects the basic clock for block GPT1  see also CROSSREFERENCE  </description>
							<lsb>11</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T3EDGE</name>
							<description>Timer T3 Edge Detection Flag   T3EDGE. The bit is set each time a count edge is detected. T3EDGE must be        cleared by software.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T3CHDIR</name>
							<description>Timer T3 Count Direction Change Flag   T3CHDIR. This bit is set each time the count direction of timer T3 changes.        T3CHDIR must be cleared by software.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T3RDIR</name>
							<description>Timer T3 Rotation Direction Flag   T3RDIR</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T4CON</name>
					<description>Timer T4 Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>24</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>T4I</name>
							<description>Timer T4 Input Parameter Selection   T4I. Depends on the operating mode  see respective sections for encoding  CROSSREFERENCE for Timer Mode and Gated Timer Mode CROSSREFERENCE for Counter Mode CROSSREFERENCE for Incremental Interface Mode</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T4M</name>
							<description>Timer T4 Mode Control  Basic Operating Mode    T4M</description>
							<lsb>3</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T4R</name>
							<description>Timer T4 Run Bit   T4R. This bit only controls timer T4 if bit T4RC   0.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T4UD</name>
							<description>Timer T4 Up Down Control   T4UD. This bit only directly controls count direction of T4 if bit T4UDE   0.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T4UDE</name>
							<description>Timer T4 External Up Down Enable   T4UDE</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T4RC</name>
							<description>Timer T4 Remote Control   T4RC</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLRT2EN</name>
							<description>Clear Timer T2 Enable   CLRT2EN. Enables the automatic clearing of timer T2 upon a falling edge of the selected T4EUD input.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLRT3EN</name>
							<description>Clear Timer T3 Enable   CLRT3EN. Enables the automatic clearing of timer T3 upon a falling edge of the selected T4IN input.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T4IRDIS</name>
							<description>Timer T4 Interrupt Disable   T4IRDIS</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T4EDGE</name>
							<description>Timer T4 Edge Detection   T4EDGE. The bit is set each time a count edge is detected. T4EDGE has to be cleared by software.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T4CHDIR</name>
							<description>Timer T4 Count Direction Change   T4CHDIR. The bit is set each time the count direction of timer T4 changes. T4CHDIR must be cleared by software.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T4RDIR</name>
							<description>Timer T4 Rotation Direction   T4RDIR</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T5CON</name>
					<description>Timer T5 Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>28</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>T5I</name>
							<description>Timer T5 Input Parameter Selection   T5I. Depends on the operating mode  see respective sections for encoding  CROSSREFERENCE for Timer Mode and Gated Timer Mode CROSSREFERENCE for Counter Mode</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T5M</name>
							<description>Timer T5 Mode Control  Basic Operating Mode    T5M. In the implementation the T5M bit field has only 2 bits and T5CON bit          5 is reserved  AI00045855 .</description>
							<lsb>3</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T5R</name>
							<description>Timer T5 Run Bit   T5R. This bit only controls timer T5 if bit T5RC   0.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T5UD</name>
							<description>Timer T5 Up Down Control   T5UD. This bit only directly controls count direction of T5 if bit T5UDE   0.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T5UDE</name>
							<description>Timer T5 External Up Down Enable   T5UDE</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T5RC</name>
							<description>Timer T5 Remote Control   T5RC</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CT3</name>
							<description>Timer T3 Capture Trigger Enable   CT3</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CI</name>
							<description>Register CAPREL Capture Trigger Selection   CI</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T5CLR</name>
							<description>Timer T5 Clear Enable Bit   T5CLR</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T5SC</name>
							<description>Timer T5 Capture Mode Enable   T5SC</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T6CON</name>
					<description>Timer T6 Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>32</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>T6I</name>
							<description>Timer T6 Input Parameter Selection   T6I. Depends on the operating mode  see respective sections for encoding  CROSSREFERENCE for Timer Mode and Gated Timer Mode CROSSREFERENCE for Counter Mode</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T6M</name>
							<description>Timer T6 Mode Control  Basic Operating Mode    T6M</description>
							<lsb>3</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T6R</name>
							<description>Timer T6 Run Bit   T6R</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T6UD</name>
							<description>Timer T6 Up Down Control   T6UD. This bit only directly controls count direction of T6 if bit T6UDE   0.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T6UDE</name>
							<description>Timer T6 External Up Down Enable   T6UDE</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T6OE</name>
							<description>Overflow Underflow Output Enable   T6OE</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T6OTL</name>
							<description>Timer T6 Overflow Toggle Latch   T6OTL. Toggles on each overflow underflow of timer T6. Can be set or cleared by        software  see separate description </description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BPS2</name>
							<description>GPT2 Block Prescaler Control   BPS2. Selects the basic clock for block GPT2  see also CROSSREFERENCE  </description>
							<lsb>11</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T6CLR</name>
							<description>Timer T6 Clear Enable Bit   T6CLR</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T6SR</name>
							<description>Timer T6 Reload Mode Enable   T6SR</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAPREL</name>
					<description>Capture and Reload Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>48</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CAPREL</name>
							<description>Current reload value or Captured value   CAPREL</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T2</name>
					<description>Timer T2 Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>52</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>T2</name>
							<description>Timer T2   T2. Contains the current value of Timer T2.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T3</name>
					<description>Timer T3 Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>56</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>T3</name>
							<description>Timer T3   T3. Contains the current value of Timer T3.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T4</name>
					<description>Timer T4 Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>60</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>T4</name>
							<description>Timer T4   T4. Contains the current value of Timer T4.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
