J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>GTM</name>
			<version>100</version>
			<description>GTM</description>
			<baseAddress>4027580416</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>1003520</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<cluster>
					<name>IRQ</name>
					<description>IRQ</description>
					<addressOffset>16</addressOffset>
					<register>
						<name>NOTIFY</name>
						<description>GTM Interrupt Notification Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>AEI_TO_XPT</name>
								<description>AEI timeout exception occurred. This bit will be cleared on a CPU write access of value  1 .  As the bit is rw  otherwise no clear.  A read access leaves the bit unchanged.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEI_USP_ADDR</name>
								<description>AEI unsupported address interrupt. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEI_IM_ADDR</name>
								<description>AEI illegal Module address interrupt. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEI_USP_BE</name>
								<description>AEI unsupported byte enable interrupt. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEIM_USP_ADDR</name>
								<description>AEI master port unsupported address interrupt. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEIM_IM_ADDR</name>
								<description>AEI master port illegal Module address interrupt. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEIM_USP_BE</name>
								<description>AEI master port unsupported byte enable interrupt. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK_EN_ERR</name>
								<description>Clock enable error interrupt. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged. Read as zero in case of INT CLK EN GEN   0b1.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK_PER_ERR</name>
								<description>Clock period error interrupt. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged. Read as zero in case of INT CLK EN GEN   0b1.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK_EN_ERR_STATE0</name>
								<description>Erroneous clock enable state. This bit field defines the GTM external clk enable state for internal        clock aei sys clkat occurrence of the CLK EN ERR event. Function only available with INT CLK EN GEN   0b0  Read as zero in case of INT CLK EN GEN   0b1.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CLK_EN_ERR_STATE1</name>
								<description>Erroneous clock enable state. This bit field defines the GTM external clk enable state for internal clock aei sys clk   2 at occurrence of the CLK EN ERR event. Function only available with INT CLK EN GEN   0b0  Read as zero in case of INT CLK EN GEN   0b1.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CLK_EN_EXP_STATE0</name>
								<description>Expected clock enable state. This bit field defines the GTM expected clk enable state for internal        clock aei sys clk at occurrence of the CLK EN ERR event. Function only available with INT CLK EN GEN   0b0  Read as zero in case of INT CLK EN GEN   0b1.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CLK_EN_EXP_STATE1</name>
								<description>Expected clock enable state. This bit field defines the GTM expected clk enable state for internal clock aei sys clk   2 at occurrence of the CLK EN ERR event. Function only available with INT CLK EN GEN   0b0  Read as zero in case of INT CLK EN GEN   0b1.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>EN</name>
						<description>GTM Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>AEI_TO_XPT_IRQ_EN</name>
								<description>AEI TO XPT IRQ interrupt enable</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEI_USP_ADDR_IRQ_EN</name>
								<description>AEI USP ADDR IRQ interrupt enable</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEI_IM_ADDR_IRQ_EN</name>
								<description>AEI IM ADDR IRQ interrupt enable</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEI_USP_BE_IRQ_EN</name>
								<description>AEI USP BE IRQ interrupt enable</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEIM_USP_ADDR_IRQ_EN</name>
								<description>AEI MUSP ADDR IRQ interrupt enable</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEIM_IM_ADDR_IRQ_EN</name>
								<description>AEIM IM ADDR IRQ interrupt enable</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEIM_USP_BE_IRQ_EN</name>
								<description>AEIM USP BE IRQ interrupt enable</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK_EN_ERR_IRQ_EN</name>
								<description>CLK EN ERR IRQ interrupt enable. Read as zero in case of INT CLK EN GEN   0b1.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK_PER_ERR_IRQ_EN</name>
								<description>CLK PER ERR IRQ interrupt enable. Read as zero in case of INT CLK EN GEN   0b1.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>FORCINT</name>
						<description>GTM Software Interrupt Generation Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TRG_AEI_TO_XPT</name>
								<description>Trigger AEI TO XPT IRQ interrupt by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of CTRL</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_AEI_USP_ADDR</name>
								<description>Trigger AEI USP ADDR IRQ interrupt by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of CTRL</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_AEI_IM_ADDR</name>
								<description>Trigger AEI IM ADDR IRQ interrupt by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of CTRL</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_AEI_USP_BE</name>
								<description>Trigger AEI USP BE IRQ interrupt by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of CTRL</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_AEIM_USP_ADDR</name>
								<description>Trigger AEIM USP ADDR IRQ interrupt by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of CTRL</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_AEIM_IM_ADDR</name>
								<description>Trigger AEIM IM ADDR IRQ interrupt by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of CTRL</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_AEIM_USP_BE</name>
								<description>Trigger AEIM USP BE IRQ interrupt by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of CTRL</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_CLK_EN_ERR</name>
								<description>Trigger CLK EN ERR IRQ interrupt by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of CTRL Read as zero in case of INT CLK EN GEN   0b1.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_CLK_PER_ERR</name>
								<description>Trigger CLK PER ERR IRQ interrupt by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of CTRL Read as zero in case of INT CLK EN GEN   0b1.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MODE</name>
						<description>GTM Top Level Interrupts Mode Selection Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>12</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>IRQ_MODE</name>
								<description>Interrupt strategy mode selection for the AEI timeout and address monitoring interrupts. The interrupt modes are described in CROSSREFERENCE .Note         This mode selection is only valid for the six interrupts described in        section CROSSREFERENCE</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<name>BRIDGE</name>
					<description>BRIDGE</description>
					<addressOffset>48</addressOffset>
					<register>
						<name>MODE</name>
						<description>GTM AEI Bridge Mode Register
 resetvalue={Application Reset:0x2001001}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>33558529</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>BRG_MODE</name>
								<description>Defines the operation mode for the AEI bridge. Reset value depends on the hardware configuration chosen by silicon vendor. BRG MODE shall  not be written with 0.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MSK_WR_RSP</name>
								<description>Mask write response. With active write buffer MSK WR RSP 1  execution of actions can be        delayed due to previous inserted write actions in the transaction buffer        which wait to be serviced. This can lead to the fact that an access on        the bus to a different peripheral than the GTM might be executed earlier        in time than the write access buffered in the GTM. Applications must be        setup up with this in mind otherwise unexpected operation can happen.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BYPASS_SYNC</name>
								<description>Bypass synchronizer flipflops. Function only available with BRG MODE 1</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MODE_UP_PGR</name>
								<description>Mode update in progress</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>BUFF_OVL</name>
								<description>Buffer overflow register. A buffer overflow can occur while multiple aborts are issued by the        external bus or a pipelined instruction is started while FBC   0  see        GTM BRIDGE PTR1 register .</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SYNC_INPUT_REG</name>
								<description>Additional pipelined stage in synchronous bridge mode. Reset value depends on the hardware configuration chosen by silicon        vendor.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>BRG_RST</name>
								<description>Bridge software reset. This bit is cleared automatically after write.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BUFF_DPT</name>
								<description>Buffer depth of AEI bridge. Signals the buffer depth of the GTM AEI bridge implementation. Reset value depends on the hardware configuration chosen by silicon        vendor.</description>
								<lsb>24</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>PTR1</name>
						<description>GTM AEI Bridge Pointer 1 Register
 resetvalue={Application Reset:0x200000}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>2097152</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>NEW_TRAN_PTR</name>
								<description>New transaction pointer. Signals the actual value of the new transaction pointer.</description>
								<lsb>0</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>FIRST_RSP_PTR</name>
								<description>First response pointer. Signals the actual value of first response pointer.</description>
								<lsb>5</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TRAN_IN_PGR</name>
								<description>Transaction in progress pointer  acquire . Transaction in progress pointer.</description>
								<lsb>10</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ABT_TRAN_PGR</name>
								<description>Aborted transaction in progress pointer. Aborted transaction in progress pointer.</description>
								<lsb>15</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>FBC</name>
								<description>Free buffer count. Number of free buffer entries. Initial value depends on the hardware configuration chosen by silicon        vendor.  see BUFF DPT in GTM BRIDGE MODE register .</description>
								<lsb>20</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RSP_TRAN_RDY</name>
								<description>Response transactions ready.   RSP TRAN RDY. Amount of ready response transactions.</description>
								<lsb>26</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>PTR2</name>
						<description>GTM AEI Bridge Pointer 2 Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TRAN_IN_PGR2</name>
								<description>Transaction in progress pointer  aquire2 . Transaction in progress pointer 2.</description>
								<lsb>0</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<name>AUX_IN_SRC</name>
					<description>AUX IN SRC</description>
					<addressOffset>64</addressOffset>
					<register>
						<dim>6</dim>
						<dimIncrement>4</dimIncrement>
						<name>TIMi_AUX_IN_SRC[%s]</name>
						<description>GTM TIM 0 Module AUX IN Source Selection Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SRC_CH0</name>
								<description>Defines AUX IN source of TIM i  channel 0. SEL OUT N CH0   SEL OUT N CH0   1 </description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SRC_CH1</name>
								<description>Defines AUX IN source of TIM i  channel 1. SEL OUT N CH1   0   SEL OUT N CH1   1 </description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SRC_CH2</name>
								<description>Defines AUX IN source of TIM i  channel 2. SEL OUT N CH2   0   SEL OUT N CH2   1 </description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SRC_CH3</name>
								<description>Defines AUX IN source of TIM i  channel 3. SEL OUT N CH3   0   SEL OUT N CH3   1 </description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SRC_CH4</name>
								<description>Defines AUX IN source of TIM i  channel 4. SEL OUT N CH4   0   SEL OUT N CH4   1 </description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SRC_CH5</name>
								<description>Defines AUX IN source of TIM i  channel 5. SEL OUT N CH5   0   SEL OUT N CH5   1 </description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SRC_CH6</name>
								<description>Defines AUX IN source of TIM i  channel 6. SEL OUT N CH6   0   SEL OUT N CH6   1 </description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SRC_CH7</name>
								<description>Defines AUX IN source of TIM i  channel 7. SEL OUT N CH7   0   SEL OUT N CH7   1 </description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL_OUT_N_CH0</name>
								<description>Use DTM OUT or DTM OUT N signals as AUX IN source of TIM i  channel 0</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL_OUT_N_CH1</name>
								<description>Use DTM OUT or DTM OUT N signals as AUX IN source of TIM i  channel 1</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL_OUT_N_CH2</name>
								<description>Use DTM OUT or DTM OUT N signals as AUX IN source of TIM i  channel 2</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL_OUT_N_CH3</name>
								<description>Use DTM OUT or DTM OUT N signals as AUX IN source of TIM i  channel 3</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL_OUT_N_CH4</name>
								<description>Use DTM OUT or DTM OUT N signals as AUX IN source of TIM i  channel 4</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL_OUT_N_CH5</name>
								<description>Use DTM OUT or DTM OUT N signals as AUX IN source of TIM i  channel 5</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL_OUT_N_CH6</name>
								<description>Use DTM OUT or DTM OUT N signals as AUX IN source of TIM i  channel 6</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL_OUT_N_CH7</name>
								<description>Use DTM OUT or DTM OUT N signals as AUX IN source of TIM i  channel 7</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<name>OUT</name>
					<description>OUT</description>
					<addressOffset>128</addressOffset>
					<register>
						<dim>3</dim>
						<dimIncrement>4</dimIncrement>
						<name>TOMi_OUT[%s]</name>
						<description>GTM TOM 0 Output Level
 resetvalue={Application Reset:0x0,Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TOM_OUT</name>
								<description>Output level snapshot of TOM i  OUT all channels. Actual level of primary output ports TOM i  OUT of channel 0 to 15         after DTM . Reset value depends on the hardware configuration chosen by silicon        vendor. See GTM HW CONF for chosen value.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TOM_OUT_N</name>
								<description>Output level snapshot of TOM i  OUT N all channels. Actual level of primary output ports TOM i  OUT N of channel 0 to 15         after DTM . Reset value depends on the hardware configuration chosen by silicon        vendor. See GTM HW CONF for chosen value.</description>
								<lsb>16</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
