J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>ATOM0_OUT</name>
						<description>GTM ATOM 0 Output Level
 resetvalue={Application Reset:0x0,Application Reset:0x0}</description>
						<addressOffset>24</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ATOM_I_OUT</name>
								<description>Output level snapshot of ATOM k  OUT all channels. Actual level of primary output ports ATOM k  OUT of channel 0 to 7         after DTM .</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ATOM_I_OUT_N</name>
								<description>Output level snapshot of ATOM k  OUT N all channels. Actual level of primary output ports ATOM k  OUT N of channel 0 to 7         after DTM </description>
								<lsb>8</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ATOM_IP1_OUT</name>
								<description>Output level snapshot of ATOM k 1  OUT all channels. Actual level of primary output ports ATOM k 1  OUT of channel 0 to 7         after DTM </description>
								<lsb>16</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ATOM_IP1_OUT_N</name>
								<description>Output level snapshot of ATOM k 1  OUT N all channels. Actual level of primary output ports ATOM k 1  OUT N of channel 0 to 7         after DTM </description>
								<lsb>24</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ATOM2_OUT</name>
						<description>GTM ATOM 2 Output Level
 resetvalue={Application Reset:0x0,Application Reset:0x0}</description>
						<addressOffset>28</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ATOM_I_OUT</name>
								<description>Output level snapshot of ATOM k  OUT all channels. Actual level of primary output ports ATOM k  OUT of channel 0 to 7         after DTM .</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ATOM_I_OUT_N</name>
								<description>Output level snapshot of ATOM k  OUT N all channels. Actual level of primary output ports ATOM k  OUT N of channel 0 to 7         after DTM </description>
								<lsb>8</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ATOM_IP1_OUT</name>
								<description>Output level snapshot of ATOM k 1  OUT all channels. Actual level of primary output ports ATOM k 1  OUT of channel 0 to 7         after DTM </description>
								<lsb>16</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ATOM_IP1_OUT_N</name>
								<description>Output level snapshot of ATOM k 1  OUT N all channels. Actual level of primary output ports ATOM k 1  OUT N of channel 0 to 7         after DTM </description>
								<lsb>24</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ATOM4_OUT</name>
						<description>GTM ATOM 4 Output Level
 resetvalue={Application Reset:0x0,Application Reset:0x0}</description>
						<addressOffset>32</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ATOM_I_OUT</name>
								<description>Output level snapshot of ATOM k  OUT all channels. Actual level of primary output ports ATOM k  OUT of channel 0 to 7         after DTM .</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ATOM_I_OUT_N</name>
								<description>Output level snapshot of ATOM k  OUT N all channels. Actual level of primary output ports ATOM k  OUT N of channel 0 to 7         after DTM </description>
								<lsb>8</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ATOM_IP1_OUT</name>
								<description>Output level snapshot of ATOM k 1  OUT all channels. Actual level of primary output ports ATOM k 1  OUT of channel 0 to 7         after DTM </description>
								<lsb>16</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ATOM_IP1_OUT_N</name>
								<description>Output level snapshot of ATOM k 1  OUT N all channels. Actual level of primary output ports ATOM k 1  OUT N of channel 0 to 7         after DTM </description>
								<lsb>24</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<name>TBU</name>
					<description>TBU</description>
					<addressOffset>256</addressOffset>
					<register>
						<name>CHEN</name>
						<description>TBU Global Channel Enable
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ENDIS_CH0</name>
								<description>TBU channel 3 enable disable control. Write   Read  </description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_CH1</name>
								<description>TBU channel 3 enable disable control. Write   Read  </description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_CH2</name>
								<description>TBU channel 3 enable disable control. Write   Read  </description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_CH3</name>
								<description>TBU channel 3 enable disable control. Write   Read  </description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH0_CTRL</name>
						<description>TBU Channel 0 Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>LOW_RES</name>
								<description>TBU CH0 BASE register resolution. The two resolutions for the TBU channel 0 can be used in the TIM channel        0 and the DPLL sub modules. This value can only be modified if channel 0 is disabled.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CH_CLK_SRC</name>
								<description>Clock source for channel x  x 0...2  time base counter. This value can only be modified if channel 0 is disabled.</description>
								<lsb>1</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH0_BASE</name>
						<description>TBU Channel 0 Base Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>BASE</name>
								<description>Time base value for channel 0. The value of BASE can only be written if        the TBU channel 0 is disabled. If channel 0 is enabled  a read access to this register provides the        current value of the underlying 27 bit counter.</description>
								<lsb>0</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH1_CTRL</name>
						<description>TBU Channel 1 Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>12</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CH_MODE</name>
								<description>Channel mode. This value can only be modified if channel 1 is disabled. In Free        running counter mode the CMU clock source specified by CH CLK SRC is used for the counter. In Forward Backward counter mode the SUB INC1c clock signal in combination with the DIR1 input signal is used to determine the counter direction and clock        frequency.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CH_CLK_SRC</name>
								<description>Clock source for channel 1 time base counter. This value can only be modified if channel 1 was disabled</description>
								<lsb>1</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH1_BASE</name>
						<description>TBU Channel 1 Base Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>16</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>BASE</name>
								<description>Time base value for channel y  y  1  2 . The value of BASE can only be written if        the corresponding TBU channel y is disabled. If the corresponding channel y is enabled  a read access to this        register provides the current value of the underlying counter.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH2_CTRL</name>
						<description>TBU Channel 2 Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>20</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CH_MODE</name>
								<description>Channel mode. This value can only be modified if channel 2 is disabled. In Free        running counter mode the CMU clock source specified by CH CLK SRC is used for the counter. In Forward Backward counter mode the SUB INC2c clock signal in combination with the DIR2 input signal is used to determine the counter direction and clock        frequency.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CH_CLK_SRC</name>
								<description>Clock source for channel 2 time base counter. This value can only be modified if channel 2 was disabled</description>
								<lsb>1</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH2_BASE</name>
						<description>TBU Channel 2 Base Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>24</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>BASE</name>
								<description>Time base value for channel y  y  1  2 . The value of BASE can only be written if        the corresponding TBU channel y is disabled. If the corresponding channel y is enabled  a read access to this        register provides the current value of the underlying counter.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH3_CTRL</name>
						<description>TBU Channel 3 Control Register
 resetvalue={Application Reset:0x1}</description>
						<addressOffset>28</addressOffset>
						<size>32</size>
						<resetValue>1</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CH_MODE</name>
								<description>Channel mode. 1   Forward backward counter mode</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>USE_CH2</name>
								<description>Channel selector for modulo counter. This value can only be modified if channel 3 was disabled</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH3_BASE</name>
						<description>TBU Channel 3 Base Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>32</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>BASE</name>
								<description>Time base value for channel 3. The value of BASE can only be written if        the corresponding TBU channel 3 is disabled. If the corresponding channel 3 is enabled  a read access to this        register provides the current value of the underlying counter.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH3_BASE_MARK</name>
						<description>TBU Channel 3 Modulo Value Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>36</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>BASE_MARK</name>
								<description>Modulo value for channel 3. The value of BASE MARK can only be written        if the corresponding TBU channel 3 is disabled.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH3_BASE_CAPTURE</name>
						<description>TBU Channel 3 Base Captured Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>40</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>BASE_CAPTURE</name>
								<description>Captured value of time base channel 1 or 2. When USE CH2 0  TBU TS1 is captured  and if USE CH2 is set TBU TS2 is        captured.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<name>MON</name>
					<description>MON</description>
					<addressOffset>384</addressOffset>
					<register>
						<name>STATUS</name>
						<description>Monitor Status Register
 resetvalue={Application Reset:0x4000}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>16384</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ACT_CMU0</name>
								<description>CMU CLK7 activity. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged. Bits is set  when a rising edge is detected at the considered clock.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACT_CMU1</name>
								<description>CMU CLK7 activity. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged. Bits is set  when a rising edge is detected at the considered clock.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACT_CMU2</name>
								<description>CMU CLK7 activity. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged. Bits is set  when a rising edge is detected at the considered clock.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACT_CMU3</name>
								<description>CMU CLK7 activity. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged. Bits is set  when a rising edge is detected at the considered clock.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACT_CMU4</name>
								<description>CMU CLK7 activity. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged. Bits is set  when a rising edge is detected at the considered clock.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACT_CMU5</name>
								<description>CMU CLK7 activity. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged. Bits is set  when a rising edge is detected at the considered clock.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACT_CMU6</name>
								<description>CMU CLK7 activity. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged. Bits is set  when a rising edge is detected at the considered clock.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACT_CMU7</name>
								<description>CMU CLK7 activity. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged. Bits is set  when a rising edge is detected at the considered clock.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACT_CMUFX0</name>
								<description>CMU CLKFX4 activity. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged. Bits is set  when a rising edge is detected at the considered clock.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACT_CMUFX1</name>
								<description>CMU CLKFX4 activity. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged. Bits is set  when a rising edge is detected at the considered clock.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACT_CMUFX2</name>
								<description>CMU CLKFX4 activity. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged. Bits is set  when a rising edge is detected at the considered clock.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACT_CMUFX3</name>
								<description>CMU CLKFX4 activity. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged. Bits is set  when a rising edge is detected at the considered clock.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACT_CMUFX4</name>
								<description>CMU CLKFX4 activity. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged. Bits is set  when a rising edge is detected at the considered clock.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACT_CMU8</name>
								<description>CMU CLK8 activity. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged. Bit is set  when a rising edge is detected at the considered clock.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CMP_ERR</name>
								<description>Error detected at CMP. This bit will be readable only. Bits is set  when the corresponding unit reports an error.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>MCS0_ERR</name>
								<description>Error detected at MCS9. This bit will be readable only. Bits is set  when the corresponding unit reports an error.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>MCS1_ERR</name>
								<description>Error detected at MCS9. This bit will be readable only. Bits is set  when the corresponding unit reports an error.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>MCS2_ERR</name>
								<description>Error detected at MCS9. This bit will be readable only. Bits is set  when the corresponding unit reports an error.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>MCS3_ERR</name>
								<description>Error detected at MCS9. This bit will be readable only. Bits is set  when the corresponding unit reports an error.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>MCS4_ERR</name>
								<description>Error detected at MCS9. This bit will be readable only. Bits is set  when the corresponding unit reports an error.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
