J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<cluster>
						<name>ACTIVITY</name>
						<description>ACTIVITY</description>
						<addressOffset>4</addressOffset>
						<register>
							<name>MON_ACTIVITY_0</name>
							<description>Monitor Activity Register 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>MCA_0_0</name>
									<description>Activity of check performed in module MCS 0 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_0_1</name>
									<description>Activity of check performed in module MCS 0 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_0_2</name>
									<description>Activity of check performed in module MCS 0 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_0_3</name>
									<description>Activity of check performed in module MCS 0 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_0_4</name>
									<description>Activity of check performed in module MCS 0 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_0_5</name>
									<description>Activity of check performed in module MCS 0 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_0_6</name>
									<description>Activity of check performed in module MCS 0 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_0_7</name>
									<description>Activity of check performed in module MCS 0 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_1_0</name>
									<description>Activity of check performed in module MCS 1 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_1_1</name>
									<description>Activity of check performed in module MCS 1 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_1_2</name>
									<description>Activity of check performed in module MCS 1 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_1_3</name>
									<description>Activity of check performed in module MCS 1 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_1_4</name>
									<description>Activity of check performed in module MCS 1 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_1_5</name>
									<description>Activity of check performed in module MCS 1 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_1_6</name>
									<description>Activity of check performed in module MCS 1 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_1_7</name>
									<description>Activity of check performed in module MCS 1 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_2_0</name>
									<description>Activity of check performed in module MCS 2 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_2_1</name>
									<description>Activity of check performed in module MCS 2 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_2_2</name>
									<description>Activity of check performed in module MCS 2 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_2_3</name>
									<description>Activity of check performed in module MCS 2 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_2_4</name>
									<description>Activity of check performed in module MCS 2 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_2_5</name>
									<description>Activity of check performed in module MCS 2 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_2_6</name>
									<description>Activity of check performed in module MCS 2 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_2_7</name>
									<description>Activity of check performed in module MCS 2 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_3_0</name>
									<description>Activity of check performed in module MCS 3 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_3_1</name>
									<description>Activity of check performed in module MCS 3 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_3_2</name>
									<description>Activity of check performed in module MCS 3 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_3_3</name>
									<description>Activity of check performed in module MCS 3 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_3_4</name>
									<description>Activity of check performed in module MCS 3 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>28</lsb>
									<msb>28</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_3_5</name>
									<description>Activity of check performed in module MCS 3 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>29</lsb>
									<msb>29</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_3_6</name>
									<description>Activity of check performed in module MCS 3 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_3_7</name>
									<description>Activity of check performed in module MCS 3 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>MON_ACTIVITY_1</name>
							<description>Monitor Activity Register 1
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>4</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>MCA_4_0</name>
									<description>Activity of check performed in module MCS 4 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_4_1</name>
									<description>Activity of check performed in module MCS 4 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_4_2</name>
									<description>Activity of check performed in module MCS 4 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_4_3</name>
									<description>Activity of check performed in module MCS 4 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_4_4</name>
									<description>Activity of check performed in module MCS 4 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_4_5</name>
									<description>Activity of check performed in module MCS 4 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_4_6</name>
									<description>Activity of check performed in module MCS 4 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_4_7</name>
									<description>Activity of check performed in module MCS 4 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_5_0</name>
									<description>Activity of check performed in module MCS 5 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_5_1</name>
									<description>Activity of check performed in module MCS 5 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_5_2</name>
									<description>Activity of check performed in module MCS 5 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_5_3</name>
									<description>Activity of check performed in module MCS 5 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_5_4</name>
									<description>Activity of check performed in module MCS 5 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_5_5</name>
									<description>Activity of check performed in module MCS 5 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_5_6</name>
									<description>Activity of check performed in module MCS 5 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_5_7</name>
									<description>Activity of check performed in module MCS 5 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_6_0</name>
									<description>Activity of check performed in module MCS 6 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_6_1</name>
									<description>Activity of check performed in module MCS 6 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_6_2</name>
									<description>Activity of check performed in module MCS 6 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_6_3</name>
									<description>Activity of check performed in module MCS 6 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_6_4</name>
									<description>Activity of check performed in module MCS 6 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_6_5</name>
									<description>Activity of check performed in module MCS 6 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_6_6</name>
									<description>Activity of check performed in module MCS 6 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_6_7</name>
									<description>Activity of check performed in module MCS 6 at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_7_0</name>
									<description>Activity of check performed in module MCS 7 at channel 7   MCA 7 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_7_1</name>
									<description>Activity of check performed in module MCS 7 at channel 7   MCA 7 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_7_2</name>
									<description>Activity of check performed in module MCS 7 at channel 7   MCA 7 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_7_3</name>
									<description>Activity of check performed in module MCS 7 at channel 7   MCA 7 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_7_4</name>
									<description>Activity of check performed in module MCS 7 at channel 7   MCA 7 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>28</lsb>
									<msb>28</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_7_5</name>
									<description>Activity of check performed in module MCS 7 at channel 7   MCA 7 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>29</lsb>
									<msb>29</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_7_6</name>
									<description>Activity of check performed in module MCS 7 at channel 7   MCA 7 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_7_7</name>
									<description>Activity of check performed in module MCS 7 at channel 7   MCA 7 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
