J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
						<register>
							<dim>5</dim>
							<dimIncrement>4</dimIncrement>
							<name>MON_ACTIVITY_MCSz[%s]</name>
							<description>Monitor Activity Register for MCS 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>8</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>MCA_0</name>
									<description>Activity of check performed in module MCS z  at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_1</name>
									<description>Activity of check performed in module MCS z  at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_2</name>
									<description>Activity of check performed in module MCS z  at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_3</name>
									<description>Activity of check performed in module MCS z  at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_4</name>
									<description>Activity of check performed in module MCS z  at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_5</name>
									<description>Activity of check performed in module MCS z  at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_6</name>
									<description>Activity of check performed in module MCS z  at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MCA_7</name>
									<description>Activity of check performed in module MCS z  at channel 7. This bit will be cleared on a CPU write access of value 1. A read access        leaves the bit unchanged.</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
					</cluster>
				</cluster>
				<cluster>
					<name>CMP</name>
					<description>CMP</description>
					<addressOffset>512</addressOffset>
					<register>
						<name>EN</name>
						<description>CMP Comparator Enable Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ABWC0_EN</name>
								<description>Enable comparator 11 in ABWC. see CROSSREFERENCE</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABWC1_EN</name>
								<description>Enable comparator 11 in ABWC. see CROSSREFERENCE</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABWC2_EN</name>
								<description>Enable comparator 11 in ABWC. see CROSSREFERENCE</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABWC3_EN</name>
								<description>Enable comparator 11 in ABWC. see CROSSREFERENCE</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABWC4_EN</name>
								<description>Enable comparator 11 in ABWC. see CROSSREFERENCE</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABWC5_EN</name>
								<description>Enable comparator 11 in ABWC. see CROSSREFERENCE</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABWC6_EN</name>
								<description>Enable comparator 11 in ABWC. see CROSSREFERENCE</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABWC7_EN</name>
								<description>Enable comparator 11 in ABWC. see CROSSREFERENCE</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABWC8_EN</name>
								<description>Enable comparator 11 in ABWC. see CROSSREFERENCE</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABWC9_EN</name>
								<description>Enable comparator 11 in ABWC. see CROSSREFERENCE</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABWC10_EN</name>
								<description>Enable comparator 11 in ABWC. see CROSSREFERENCE</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABWC11_EN</name>
								<description>Enable comparator 11 in ABWC. see CROSSREFERENCE</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBWC0_EN</name>
								<description>Enable comparator 11 in TBWC. see CROSSREFERENCE</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBWC1_EN</name>
								<description>Enable comparator 11 in TBWC. see CROSSREFERENCE</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBWC2_EN</name>
								<description>Enable comparator 11 in TBWC. see CROSSREFERENCE</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBWC3_EN</name>
								<description>Enable comparator 11 in TBWC. see CROSSREFERENCE</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBWC4_EN</name>
								<description>Enable comparator 11 in TBWC. see CROSSREFERENCE</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBWC5_EN</name>
								<description>Enable comparator 11 in TBWC. see CROSSREFERENCE</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBWC6_EN</name>
								<description>Enable comparator 11 in TBWC. see CROSSREFERENCE</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBWC7_EN</name>
								<description>Enable comparator 11 in TBWC. see CROSSREFERENCE</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBWC8_EN</name>
								<description>Enable comparator 11 in TBWC. see CROSSREFERENCE</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBWC9_EN</name>
								<description>Enable comparator 11 in TBWC. see CROSSREFERENCE</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBWC10_EN</name>
								<description>Enable comparator 11 in TBWC. see CROSSREFERENCE</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBWC11_EN</name>
								<description>Enable comparator 11 in TBWC. see CROSSREFERENCE</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>EIRQ_EN</name>
						<description>CMP error interrupt enable register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>20</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ABWC0_EN_EIRQ</name>
								<description>Enable ABWC11 interrupt source for CMP EIRQ line</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABWC1_EN_EIRQ</name>
								<description>Enable ABWC11 interrupt source for CMP EIRQ line</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABWC2_EN_EIRQ</name>
								<description>Enable ABWC11 interrupt source for CMP EIRQ line</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABWC3_EN_EIRQ</name>
								<description>Enable ABWC11 interrupt source for CMP EIRQ line</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABWC4_EN_EIRQ</name>
								<description>Enable ABWC11 interrupt source for CMP EIRQ line</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABWC5_EN_EIRQ</name>
								<description>Enable ABWC11 interrupt source for CMP EIRQ line</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABWC6_EN_EIRQ</name>
								<description>Enable ABWC11 interrupt source for CMP EIRQ line</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABWC7_EN_EIRQ</name>
								<description>Enable ABWC11 interrupt source for CMP EIRQ line</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABWC8_EN_EIRQ</name>
								<description>Enable ABWC11 interrupt source for CMP EIRQ line</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABWC9_EN_EIRQ</name>
								<description>Enable ABWC11 interrupt source for CMP EIRQ line</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABWC10_EN_EIRQ</name>
								<description>Enable ABWC11 interrupt source for CMP EIRQ line</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABWC11_EN_EIRQ</name>
								<description>Enable ABWC11 interrupt source for CMP EIRQ line</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBWC0_EN_EIRQ</name>
								<description>Enable TBWC11 interrupt source for CMP EIRQ line</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBWC1_EN_EIRQ</name>
								<description>Enable TBWC11 interrupt source for CMP EIRQ line</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBWC2_EN_EIRQ</name>
								<description>Enable TBWC11 interrupt source for CMP EIRQ line</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBWC3_EN_EIRQ</name>
								<description>Enable TBWC11 interrupt source for CMP EIRQ line</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBWC4_EN_EIRQ</name>
								<description>Enable TBWC11 interrupt source for CMP EIRQ line</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBWC5_EN_EIRQ</name>
								<description>Enable TBWC11 interrupt source for CMP EIRQ line</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBWC6_EN_EIRQ</name>
								<description>Enable TBWC11 interrupt source for CMP EIRQ line</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBWC7_EN_EIRQ</name>
								<description>Enable TBWC11 interrupt source for CMP EIRQ line</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBWC8_EN_EIRQ</name>
								<description>Enable TBWC11 interrupt source for CMP EIRQ line</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBWC9_EN_EIRQ</name>
								<description>Enable TBWC11 interrupt source for CMP EIRQ line</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBWC10_EN_EIRQ</name>
								<description>Enable TBWC11 interrupt source for CMP EIRQ line</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBWC11_EN_EIRQ</name>
								<description>Enable TBWC11 interrupt source for CMP EIRQ line</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<cluster>
						<name>IRQ</name>
						<description>IRQ</description>
						<addressOffset>4</addressOffset>
						<register>
							<name>NOTIFY</name>
							<description>CMP Event Notification Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>ABWC0</name>
									<description>Error indication for ABWC11. This bit will be cleared on a CPU write access of value  1 .  As the bit is rw  otherwise no clear.  A read access leaves the bit unchanged.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ABWC1</name>
									<description>Error indication for ABWC11. This bit will be cleared on a CPU write access of value  1 .  As the bit is rw  otherwise no clear.  A read access leaves the bit unchanged.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ABWC2</name>
									<description>Error indication for ABWC11. This bit will be cleared on a CPU write access of value  1 .  As the bit is rw  otherwise no clear.  A read access leaves the bit unchanged.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ABWC3</name>
									<description>Error indication for ABWC11. This bit will be cleared on a CPU write access of value  1 .  As the bit is rw  otherwise no clear.  A read access leaves the bit unchanged.</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ABWC4</name>
									<description>Error indication for ABWC11. This bit will be cleared on a CPU write access of value  1 .  As the bit is rw  otherwise no clear.  A read access leaves the bit unchanged.</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ABWC5</name>
									<description>Error indication for ABWC11. This bit will be cleared on a CPU write access of value  1 .  As the bit is rw  otherwise no clear.  A read access leaves the bit unchanged.</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ABWC6</name>
									<description>Error indication for ABWC11. This bit will be cleared on a CPU write access of value  1 .  As the bit is rw  otherwise no clear.  A read access leaves the bit unchanged.</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ABWC7</name>
									<description>Error indication for ABWC11. This bit will be cleared on a CPU write access of value  1 .  As the bit is rw  otherwise no clear.  A read access leaves the bit unchanged.</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ABWC8</name>
									<description>Error indication for ABWC11. This bit will be cleared on a CPU write access of value  1 .  As the bit is rw  otherwise no clear.  A read access leaves the bit unchanged.</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ABWC9</name>
									<description>Error indication for ABWC11. This bit will be cleared on a CPU write access of value  1 .  As the bit is rw  otherwise no clear.  A read access leaves the bit unchanged.</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ABWC10</name>
									<description>Error indication for ABWC11. This bit will be cleared on a CPU write access of value  1 .  As the bit is rw  otherwise no clear.  A read access leaves the bit unchanged.</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ABWC11</name>
									<description>Error indication for ABWC11. This bit will be cleared on a CPU write access of value  1 .  As the bit is rw  otherwise no clear.  A read access leaves the bit unchanged.</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TBWC0</name>
									<description>TOM sub modules outputs bitwise comparator 11 error indication. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TBWC1</name>
									<description>TOM sub modules outputs bitwise comparator 11 error indication. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TBWC2</name>
									<description>TOM sub modules outputs bitwise comparator 11 error indication. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TBWC3</name>
									<description>TOM sub modules outputs bitwise comparator 11 error indication. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TBWC4</name>
									<description>TOM sub modules outputs bitwise comparator 11 error indication. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TBWC5</name>
									<description>TOM sub modules outputs bitwise comparator 11 error indication. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TBWC6</name>
									<description>TOM sub modules outputs bitwise comparator 11 error indication. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TBWC7</name>
									<description>TOM sub modules outputs bitwise comparator 11 error indication. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TBWC8</name>
									<description>TOM sub modules outputs bitwise comparator 11 error indication. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TBWC9</name>
									<description>TOM sub modules outputs bitwise comparator 11 error indication. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TBWC10</name>
									<description>TOM sub modules outputs bitwise comparator 11 error indication. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TBWC11</name>
									<description>TOM sub modules outputs bitwise comparator 11 error indication. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
