J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
						<register>
							<name>EN</name>
							<description>CMP Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>4</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>ABWC0_EN_IRQ</name>
									<description>Enable ABWC11 interrupt source for CMP IRQ line</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ABWC1_EN_IRQ</name>
									<description>Enable ABWC11 interrupt source for CMP IRQ line</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ABWC2_EN_IRQ</name>
									<description>Enable ABWC11 interrupt source for CMP IRQ line</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ABWC3_EN_IRQ</name>
									<description>Enable ABWC11 interrupt source for CMP IRQ line</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ABWC4_EN_IRQ</name>
									<description>Enable ABWC11 interrupt source for CMP IRQ line</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ABWC5_EN_IRQ</name>
									<description>Enable ABWC11 interrupt source for CMP IRQ line</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ABWC6_EN_IRQ</name>
									<description>Enable ABWC11 interrupt source for CMP IRQ line</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ABWC7_EN_IRQ</name>
									<description>Enable ABWC11 interrupt source for CMP IRQ line</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ABWC8_EN_IRQ</name>
									<description>Enable ABWC11 interrupt source for CMP IRQ line</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ABWC9_EN_IRQ</name>
									<description>Enable ABWC11 interrupt source for CMP IRQ line</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ABWC10_EN_IRQ</name>
									<description>Enable ABWC11 interrupt source for CMP IRQ line</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ABWC11_EN_IRQ</name>
									<description>Enable ABWC11 interrupt source for CMP IRQ line</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TBWC0_EN_IRQ</name>
									<description>Enable TBWC11 interrupt source for CMP IRQ line</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TBWC1_EN_IRQ</name>
									<description>Enable TBWC11 interrupt source for CMP IRQ line</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TBWC2_EN_IRQ</name>
									<description>Enable TBWC11 interrupt source for CMP IRQ line</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TBWC3_EN_IRQ</name>
									<description>Enable TBWC11 interrupt source for CMP IRQ line</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TBWC4_EN_IRQ</name>
									<description>Enable TBWC11 interrupt source for CMP IRQ line</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TBWC5_EN_IRQ</name>
									<description>Enable TBWC11 interrupt source for CMP IRQ line</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TBWC6_EN_IRQ</name>
									<description>Enable TBWC11 interrupt source for CMP IRQ line</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TBWC7_EN_IRQ</name>
									<description>Enable TBWC11 interrupt source for CMP IRQ line</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TBWC8_EN_IRQ</name>
									<description>Enable TBWC11 interrupt source for CMP IRQ line</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TBWC9_EN_IRQ</name>
									<description>Enable TBWC11 interrupt source for CMP IRQ line</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TBWC10_EN_IRQ</name>
									<description>Enable TBWC11 interrupt source for CMP IRQ line</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TBWC11_EN_IRQ</name>
									<description>Enable TBWC11 interrupt source for CMP IRQ line</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>FORCINT</name>
							<description>CMP Interrupt Force Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>8</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>TRG_ABWC0</name>
									<description>Trigger ABWC11 bit in CMP IRQ NOTIFY register by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_ABWC1</name>
									<description>Trigger ABWC11 bit in CMP IRQ NOTIFY register by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_ABWC2</name>
									<description>Trigger ABWC11 bit in CMP IRQ NOTIFY register by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_ABWC3</name>
									<description>Trigger ABWC11 bit in CMP IRQ NOTIFY register by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_ABWC4</name>
									<description>Trigger ABWC11 bit in CMP IRQ NOTIFY register by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_ABWC5</name>
									<description>Trigger ABWC11 bit in CMP IRQ NOTIFY register by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_ABWC6</name>
									<description>Trigger ABWC11 bit in CMP IRQ NOTIFY register by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_ABWC7</name>
									<description>Trigger ABWC11 bit in CMP IRQ NOTIFY register by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_ABWC8</name>
									<description>Trigger ABWC11 bit in CMP IRQ NOTIFY register by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_ABWC9</name>
									<description>Trigger ABWC11 bit in CMP IRQ NOTIFY register by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_ABWC10</name>
									<description>Trigger ABWC11 bit in CMP IRQ NOTIFY register by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_ABWC11</name>
									<description>Trigger ABWC11 bit in CMP IRQ NOTIFY register by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_TBWC0</name>
									<description>Trigger TBWCx bit in CMP IRQ NOTIFY register by software. This bit is cleared automatically after write.</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_TBWC1</name>
									<description>Trigger TBWCx bit in CMP IRQ NOTIFY register by software. This bit is cleared automatically after write.</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_TBWC2</name>
									<description>Trigger TBWCx bit in CMP IRQ NOTIFY register by software. This bit is cleared automatically after write.</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_TBWC3</name>
									<description>Trigger TBWCx bit in CMP IRQ NOTIFY register by software. This bit is cleared automatically after write.</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_TBWC4</name>
									<description>Trigger TBWCx bit in CMP IRQ NOTIFY register by software. This bit is cleared automatically after write.</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_TBWC5</name>
									<description>Trigger TBWCx bit in CMP IRQ NOTIFY register by software. This bit is cleared automatically after write.</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_TBWC6</name>
									<description>Trigger TBWCx bit in CMP IRQ NOTIFY register by software. This bit is cleared automatically after write.</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_TBWC7</name>
									<description>Trigger TBWCx bit in CMP IRQ NOTIFY register by software. This bit is cleared automatically after write.</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_TBWC8</name>
									<description>Trigger TBWCx bit in CMP IRQ NOTIFY register by software. This bit is cleared automatically after write.</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_TBWC9</name>
									<description>Trigger TBWCx bit in CMP IRQ NOTIFY register by software. This bit is cleared automatically after write.</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_TBWC10</name>
									<description>Trigger TBWCx bit in CMP IRQ NOTIFY register by software. This bit is cleared automatically after write.</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_TBWC11</name>
									<description>Trigger TBWCx bit in CMP IRQ NOTIFY register by software. This bit is cleared automatically after write.</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>MODE</name>
							<description>CMP Interrupt Mode Configuration Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>12</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>IRQ_MODE</name>
									<description>IRQ mode selection   IRQ MODE. The interrupt modes are described in CROSSREFERENCE</description>
									<lsb>0</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
					</cluster>
				</cluster>
				<cluster>
					<name>ARU</name>
					<description>ARU</description>
					<addressOffset>640</addressOffset>
					<register>
						<name>ACCESS</name>
						<description>ARU Access Register
 resetvalue={Application Reset:0x1FE}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>510</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ADDR</name>
								<description>ARU address. Define the ARU address used for transferring data. For an ARU write request  the preferred address 0x0 have to be used. A write request to the address 0x1FF  always full address  or 0x1FE         always empty address  are ignored and doesn t have any effect. ARU address bits ADDR are only writable if RREQ and WREQ bits are zero.</description>
								<lsb>0</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RREQ</name>
								<description>Initiate read request. This bit is cleared automatically after transaction. Moreover  it can be        cleared by software to cancel a read request. RREQ bit is only writable if WREQ bit is zero  so to switch from RREQ to        WREQ a cancel request has to be performed before. Configuring both RREQ and WREQ bits results in a read request  so RREQ        bit will be set if the WREQ bit of the register isn t already set. The ARU read request on address ADDR is served immediately when no other        destination has actually a read request when the RREQ bit is set by CPU.        In a worst case scenario  the read request is served after one round        trip of the ARU  but this is only the case when every destination        channel issues a read request at consecutive points in time.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WREQ</name>
								<description>Initiate write request. This bit is cleared automatically after transaction. Moreover  it can be        cleared by software to cancel a write request. WREQ bit is only writable if RREQ bit is zero  so to switch from WREQ to        RREQ a cancel request has to be performed before. Configuring both RREQ and WREQ bits results in a read request  so WREQ        bit will not be set The data is provided at address ADDR. This address has to be programmed        as the source address in the destination sub module channel. In worst        case  the data is provided after one full ARU round trip.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DATA_H</name>
						<description>ARU Access Register Upper Data Word
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DATA</name>
								<description>Upper ARU data word. Transfer upper ARU data word addressed by ADDR. The data bits 24 to 52        of an ARU word are mapped to the data bits 0 to 28 of this register.</description>
								<lsb>0</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DATA_L</name>
						<description>ARU Access Register Lower Data Word
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DATA</name>
								<description>Lower ARU data word. Transfer lower ARU data word addressed by ADDR. The data bits 0 to 23 of        an ARU word are mapped to the data bits 0 to 23 of this register and the        data bits 48 to 52 of an ARU word are mapped to the data bits 24 to 28        of this register when data is read by the CPU. For writing data into the ARU by the CPU the bits 24 to 28 are not transferred to bit 48 to 52 of the ARU word. Only bits 0 to 23 are        written to bits 0 to 23 of the ARU word.</description>
								<lsb>0</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CADDR_END</name>
						<description>ARU caddr Counter End Value Register
 resetvalue={Application Reset:0x60}</description>
						<addressOffset>52</addressOffset>
						<size>32</size>
						<resetValue>96</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CADDR_END</name>
								<description>Set end value of ARU caddr counter. The ARU roundtrip counter aru caddr runs from zero to caddr end value. Shorten the ARU roundtrip cycle by setting a smaller number than the        defined reset value will cause that not all ARU connected modules will        be served. Making the roundtrip cycle longer than the reset value would cause        longer ARU roundtrip time and as a result some ARU connected modules        will not be served as fast as possible for this device. This bit is write protected by bit RF PROT of register GTM CTRL</description>
								<lsb>0</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CTRL</name>
						<description>ARU Enable Dynamic Routing Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>60</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ARU_0_DYN_EN</name>
								<description>Enable dynamic routing for ARU 0. Dynamic routing enable of ARU 0. Write of following double bit values is        possible  If dynamic routing is disabled  the normal ARU routing scheme for ARU 0        is executed.</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ARU_1_DYN_EN</name>
								<description>Enable dynamic routing for ARU 1. Dynamic routing enable of ARU 1. Write of following double bit values is        possible  If dynamic routing is disabled  the normal ARU routing scheme for ARU 1        is executed.</description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ARU_DYN_RING_MODE</name>
								<description>Enable dynamic routing ring mode. Dynamic routing ring mode for both ARU 0 and ARU 1.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>2</dim>
						<dimIncrement>4</dimIncrement>
						<name>ARU_z_DYN_CTRL[%s]</name>
						<description>ARU 0 Dynamic Routing Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>64</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DYN_ARU_UPDATE_EN</name>
								<description>Enable reload of DYN ROUTE register from ARU itself. Enable reload of DYN ROUTE register from ARU itself.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DYN_ROUTE_SWAP</name>
								<description>Enable swapping DYN ROUTE SR with DYN ROUTE register. Enable swapping DYN ROUTE SR with DYN ROUTE register.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>2</dim>
						<dimIncrement>4</dimIncrement>
						<name>ARU_z_DYN_ROUTE_LOW[%s]</name>
						<description>ARU 0 Lower Bits of DYN ROUTE Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>72</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DYN_READ_ID0</name>
								<description>ARU read ID 0. ARU read ID 0 for dynamic routing.</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DYN_READ_ID1</name>
								<description>ARU read ID 2. ARU read ID 1 for dynamic routing.</description>
								<lsb>8</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DYN_READ_ID2</name>
								<description>ARU read ID 2. ARU read ID 2 for dynamic routing.</description>
								<lsb>16</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
