J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<dim>2</dim>
						<dimIncrement>4</dimIncrement>
						<name>ARU_z_DYN_ROUTE_HIGH[%s]</name>
						<description>ARU 0 Higher Bits of DYN ROUTE Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>80</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DYN_READ_ID3</name>
								<description>ARU read ID 3. ARU read ID 3 for dynamic routing.</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DYN_READ_ID4</name>
								<description>ARU read ID 4. ARU read ID 4 for dynamic routing.</description>
								<lsb>8</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DYN_READ_ID5</name>
								<description>ARU read ID 5. ARU read ID 5 for dynamic routing.</description>
								<lsb>16</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DYN_CLK_WAIT</name>
								<description>Number of clk cycles for dynamic routing. Defines the number of clk cycles between each dynamic routing ID.</description>
								<lsb>24</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>2</dim>
						<dimIncrement>4</dimIncrement>
						<name>ARU_z_DYN_ROUTE_SR_LOW[%s]</name>
						<description>ARU 0 Shadow Register for ARU 0 DYN ROUTE LOW
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>88</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DYN_READ_ID6</name>
								<description>ARU read ID 6. ARU read ID 6 for dynamic routing. These bits are mapped to ARU data bits aru data 7 0 .</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DYN_READ_ID7</name>
								<description>ARU read ID 7. ARU read ID 7 for dynamic routing. These bits are mapped to ARU data bits aru data 15 8 .</description>
								<lsb>8</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DYN_READ_ID8</name>
								<description>ARU read ID 8. ARU read ID 8 for dynamic routing. These bits are mapped to ARU data bits aru data 23 16 .</description>
								<lsb>16</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>2</dim>
						<dimIncrement>4</dimIncrement>
						<name>ARU_z_DYN_ROUTE_SR_HIGH[%s]</name>
						<description>ARU 0 Shadow Register for ARU 0 DYN ROUTE HIGH
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>96</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DYN_READ_ID9</name>
								<description>ARU read ID 9. ARU read ID 9 for dynamic routing. These bits are mapped to ARU data bits aru data 31 24 .</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DYN_READ_ID10</name>
								<description>ARU read ID 10. ARU read ID 10 for dynamic routing. These bits are mapped to ARU data bits aru data 39 32 .</description>
								<lsb>8</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DYN_READ_ID11</name>
								<description>ARU read ID 11. ARU read ID 11 for dynamic routing. These bits are mapped to ARU data bits aru data 47 40 .</description>
								<lsb>16</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DYN_CLK_WAIT</name>
								<description>Number of clk cycles for dynamic routing. Defines the number of clk cycles between each dynamic routing ID. These bits are mapped to ARU data bits aru data 51 48 .</description>
								<lsb>24</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DYN_UPDATE_EN</name>
								<description>Update enable from shadow register. Enable update ARU  z  DYN ROUTE LOW  HIGH registers from shadow registers ARU  z  DYN ROUTE SR LOW  HIGH . This bit is mapped to ARU data bit aru data 52 .</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>2</dim>
						<dimIncrement>4</dimIncrement>
						<name>ARU_z_DYN_RDADDR[%s]</name>
						<description>ARU 0 Read ID for Dynamic Routing
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>104</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DYN_ARU_RDADDR</name>
								<description>ARU read address ID to reload the DYN ROUTE register. ARU read address ID to reload the DYN ROUTE register from ARU itself.</description>
								<lsb>0</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CADDR</name>
						<description>ARU caddr Counter Value
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>124</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CADDR_0</name>
								<description>Value of ARU 0 caddr counter</description>
								<lsb>0</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CADDR_1</name>
								<description>Value of ARU 1 caddr counter</description>
								<lsb>16</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<cluster>
						<name>DBG</name>
						<description>DBG</description>
						<addressOffset>12</addressOffset>
						<register>
							<name>ACCESS0</name>
							<description>ARU Debug Access Channel 0
 resetvalue={Application Reset:0x1FE}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>510</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>ADDR</name>
									<description>ARU debugging address. Define address of ARU debugging channel 0.</description>
									<lsb>0</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>DATA0_H</name>
							<description>ARU Debug Access 0 Transfer Register Upper Data Word
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>4</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>DATA</name>
									<description>Upper debug data word. Transfer upper ARU data word addressed by register DBG ACCESS0 .        The data bits 24 to 52 of an ARU word are mapped to the data bits 0 to        28 of this register The interrupt ARU NEW DATA0 IRQ is raised if a new data word is available.</description>
									<lsb>0</lsb>
									<msb>28</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
						<register>
							<name>DATA0_L</name>
							<description>ARU Debug Access 0 Transfer Register Lower Data Word
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>8</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>DATA</name>
									<description>Lower debug data word. Transfer lower ARU data word addressed by register DBG ACCESS0 .        The data bits 0 to 23 of an ARU word are mapped to the data bits 0 to 23        of this register and the data bits 48 to 52 of an ARU word is mapped to        the data bits 24 to 28 of this register. The interrupt ARU NEW DATA0 IRQ is raised if a new data word is available.</description>
									<lsb>0</lsb>
									<msb>28</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
						<register>
							<name>ACCESS1</name>
							<description>ARU Debug Access Channel 1
 resetvalue={Application Reset:0x1FE}</description>
							<addressOffset>12</addressOffset>
							<size>32</size>
							<resetValue>510</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>ADDR</name>
									<description>ARU debugging address. Define address of ARU debugging channel 1.</description>
									<lsb>0</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>DATA1_H</name>
							<description>ARU Debug Access 1 Transfer Register Upper Data Word
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>16</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>DATA</name>
									<description>Upper debug data word. Transfer upper ARU data word addressed by register DBG ACCESS1 .        The data bits 24 to 52 of an ARU word are mapped to the data bits 0 to        28 of this register. The interrupt ARU NEW DATA1 IRQ is raised if a new data word is available.</description>
									<lsb>0</lsb>
									<msb>28</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
						<register>
							<name>DATA1_L</name>
							<description>ARU Debug Access 1 Transfer Register Lower Data Word
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>20</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>DATA</name>
									<description>Lower debug data word   DATA. Transfer lower ARU data word addressed by register DBG ACCESS1 .        The data bits 0 to 23 of an ARU word are mapped to the data bits 0 to 23        of this register and the data bits 48 to 52 of an ARU word is mapped to        the data bits 24 to 28 of this register. The interrupt ARU NEW DATA1 IRQ is raised if a new data word is available.</description>
									<lsb>0</lsb>
									<msb>28</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
					</cluster>
					<cluster>
						<name>IRQ</name>
						<description>IRQ</description>
						<addressOffset>36</addressOffset>
						<register>
							<name>NOTIFY</name>
							<description>ARU Interrupt Notification Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>NEW_DATA0</name>
									<description>Data was transferred for addr ARU DBG ACCESS0. This bit will be cleared on a CPU write access of value  1 .  As the bit is rw  otherwise no clear.  A read access leaves the bit unchanged.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>NEW_DATA1</name>
									<description>Data was transferred for addr ARU DBG ACCESS1. This bit will be cleared on a CPU write access of value  1 .  As the bit is rw  otherwise no clear.  A read access leaves the bit unchanged.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ACC_ACK</name>
									<description>AEI to ARU access finished  on read access data are valid. This bit will be cleared on a CPU write access of value  1 .   As the bit is rw  otherwise no clear.  A read access leaves the bit unchanged.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>EN</name>
							<description>ARU Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>4</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>NEW_DATA0_IRQ_EN</name>
									<description>ARU NEW DATA0 IRQ interrupt enable</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>NEW_DATA1_IRQ_EN</name>
									<description>ARU NEW DATA1 IRQ interrupt enable</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ACC_ACK_IRQ_EN</name>
									<description>ACC ACK IRQ interrupt enable</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>FORCINT</name>
							<description>ARU Force Interrupt Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>8</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>TRG_NEW_DATA0</name>
									<description>Trigger new data 0 interrupt. Note  This bit is cleared automatically after write. This bit is write        protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_NEW_DATA1</name>
									<description>Trigger new data 1 interrupt. Note  This bit is cleared automatically after write. This bit is write        protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_ACC_ACK</name>
									<description>Trigger ACC ACK interrupt. Note  This bit is cleared automatically after write. This bit is write        protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>MODE</name>
							<description>ARU Interrupt Mode Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>12</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>IRQ_MODE</name>
									<description>IRQ mode selection. The interrupt modes are described in CROSSREFERENCE .</description>
									<lsb>0</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
					</cluster>
				</cluster>
				<cluster>
					<name>CMU</name>
					<description>CMU</description>
					<addressOffset>768</addressOffset>
					<register>
						<name>CLK_EN</name>
						<description>CMU Clock Enable Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>EN_CLK0</name>
								<description>Enable clock source x. Any read access to an EN CLK x    EN ECLK z  or EN FXCLK bit field will always result in        a value 00 or 11 indicating current state. A modification of the state        is only performed with the values 01 and 10. Writing the values 00 and        11 is always ignored. Any disabling to EN CLK x  will be reset        internal counters for configurable clocks.</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN_CLK1</name>
								<description>Enable clock source x. Any read access to an EN CLK x    EN ECLK z  or EN FXCLK bit field will always result in        a value 00 or 11 indicating current state. A modification of the state        is only performed with the values 01 and 10. Writing the values 00 and        11 is always ignored. Any disabling to EN CLK x  will be reset        internal counters for configurable clocks.</description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN_CLK2</name>
								<description>Enable clock source x. Any read access to an EN CLK x    EN ECLK z  or EN FXCLK bit field will always result in        a value 00 or 11 indicating current state. A modification of the state        is only performed with the values 01 and 10. Writing the values 00 and        11 is always ignored. Any disabling to EN CLK x  will be reset        internal counters for configurable clocks.</description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN_CLK3</name>
								<description>Enable clock source x. Any read access to an EN CLK x    EN ECLK z  or EN FXCLK bit field will always result in        a value 00 or 11 indicating current state. A modification of the state        is only performed with the values 01 and 10. Writing the values 00 and        11 is always ignored. Any disabling to EN CLK x  will be reset        internal counters for configurable clocks.</description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN_CLK4</name>
								<description>Enable clock source x. Any read access to an EN CLK x    EN ECLK z  or EN FXCLK bit field will always result in        a value 00 or 11 indicating current state. A modification of the state        is only performed with the values 01 and 10. Writing the values 00 and        11 is always ignored. Any disabling to EN CLK x  will be reset        internal counters for configurable clocks.</description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN_CLK5</name>
								<description>Enable clock source x. Any read access to an EN CLK x    EN ECLK z  or EN FXCLK bit field will always result in        a value 00 or 11 indicating current state. A modification of the state        is only performed with the values 01 and 10. Writing the values 00 and        11 is always ignored. Any disabling to EN CLK x  will be reset        internal counters for configurable clocks.</description>
								<lsb>10</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN_CLK6</name>
								<description>Enable clock source x. Any read access to an EN CLK x    EN ECLK z  or EN FXCLK bit field will always result in        a value 00 or 11 indicating current state. A modification of the state        is only performed with the values 01 and 10. Writing the values 00 and        11 is always ignored. Any disabling to EN CLK x  will be reset        internal counters for configurable clocks.</description>
								<lsb>12</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN_CLK7</name>
								<description>Enable clock source x. Any read access to an EN CLK x    EN ECLK z  or EN FXCLK bit field will always result in        a value 00 or 11 indicating current state. A modification of the state        is only performed with the values 01 and 10. Writing the values 00 and        11 is always ignored. Any disabling to EN CLK x  will be reset        internal counters for configurable clocks.</description>
								<lsb>14</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN_ECLK0</name>
								<description>Enable ECLK 2 generation sub unit. Coding see bit EN CLKx.</description>
								<lsb>16</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN_ECLK1</name>
								<description>Enable ECLK 2 generation sub unit. Coding see bit EN CLKx.</description>
								<lsb>18</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN_ECLK2</name>
								<description>Enable ECLK 2 generation sub unit. Coding see bit EN CLKx.</description>
								<lsb>20</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN_FXCLK</name>
								<description>Enable all CMU FXCLK  see bits 1 0. An enable to EN FXCLK from disable state        will be reset internal fixed clock counters.</description>
								<lsb>22</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GCLK_NUM</name>
						<description>CMU Global Clock Control Numerator
 resetvalue={Application Reset:0x1}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>1</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>GCLK_NUM</name>
								<description>GCLK NUM. Value can only be modified when all clock enables EN CLK x  and the EN FXCLK are disabled. The CMU hardware alters the content of CMU GCLK NUM and CMU GCLK DEN automatically to 0x1  if CMU GCLK NUM is specified less than CMU GCLK DEN or one        of the values is specified with a value zero. Thus         a secure way for altering the values is writing twice to the register CMU GCLK NUM followed by a single write to register CMU GCLK DEN .</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GCLK_DEN</name>
						<description>CMU Global Clock Control Denominator
 resetvalue={Application Reset:0x1}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>1</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>GCLK_DEN</name>
								<description>GCLK DEN. Value can only be modified when all clock enables EN CLK x  and the EN FXCLK are disabled. The CMU hardware alters the content of CMU GCLK NUM and CMU GCLK DEN automatically to 0x1  if CMU GCLK NUM is specified less than CMU GCLK DEN or one        of the values is specified with a value zero. Thus         a secure way for altering the values is writing twice to the register CMU GCLK NUM followed by a single write to register CMU GCLK DEN .</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
