J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>GLB_CTRL</name>
						<description>CMU Synchronizing ARU and Clock Source
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>72</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ARU_ADDR_RSTGLB</name>
								<description>Reset ARU caddr counter and ARU dynamic route counter. Writing value 1 to this bit field results in a request to reset the ARU        caddr counter and ARU dynamic route counter. The next following write        access to register CMU CLK EN applies the        ARU caddr counter reset  ARU dynamic route counter reset and resets this        bit. This feature can be used to synchronize the ARU round trip time to        the CMU clocks. This bit is write protected. Before writing to this bit set bit RF PROT        of register GTM CTRL to 0.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CLK_CTRL</name>
						<description>CMU Control for Clock Source Selection
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>76</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CLK0_EXT_DIVIDER</name>
								<description>Clock source selection for CMU CLK 0 CTRL. Value can only be modified when clock enable EN CLK0 and EN ECLK1 are disabled.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK1_EXT_DIVIDER</name>
								<description>Clock source selection for CMU CLK 1 CTRL. Value can only be modified when clock enable EN CLK1 and EN ECLK1 are disabled.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK2_EXT_DIVIDER</name>
								<description>Clock source selection for CMU CLK 2 CTRL. Value can only be modified when clock enable EN CLK2 and EN ECLK1 are disabled.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK3_EXT_DIVIDER</name>
								<description>Clock source selection for CMU CLK 3 CTRL. Value can only be modified when clock enable EN CLK3 and EN ECLK1 are disabled.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK4_EXT_DIVIDER</name>
								<description>Clock source selection for CMU CLK 4 CTRL. Value can only be modified when clock enable EN CLK4 and EN ECLK1 are disabled.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK5_EXT_DIVIDER</name>
								<description>Clock source selection for CMU CLK 5 CTRL. Value can only be modified when clock enable EN CLK5 and EN ECLK1 are disabled.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK6_EXT_DIVIDER</name>
								<description>Clock source selection for CMU CLK 6 CTRL. Value can only be modified when clock enable EN CLK6 and EN ECLK1 are disabled.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK7_EXT_DIVIDER</name>
								<description>Clock source selection for CMU CLK 7 CTRL. Value can only be modified when clock enable EN CLK7 and EN ECLK1 are disabled.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK8_EXT_DIVIDER</name>
								<description>Clock source selection for CMU CLK8. Value can only be modified when EN ECLK0 is        disabled.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<cluster>
						<dim>8</dim>
						<dimIncrement>4</dimIncrement>
						<name>CLK[%s]</name>
						<description>CLK</description>
						<addressOffset>12</addressOffset>
						<register>
							<name>CMU_CLK_z_CTRL</name>
							<description>CMU Control for Clock Source 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>CLK_CNT</name>
									<description>Clock count. Defines count value for the clock divider. Value can only be modified when clock enable EN CLKz and EN ECLK1 are disabled.</description>
									<lsb>0</lsb>
									<msb>23</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CLK_SEL</name>
									<description>Clock source selection for CMU CLKz. Value can only be modified when clock enable EN CLKz and EN ECLK1 are disabled. Note   The existence and interpretation of this bit field depends on z. z gt 5</description>
									<lsb>24</lsb>
									<msb>25</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
					</cluster>
					<cluster>
						<dim>3</dim>
						<dimIncrement>8</dimIncrement>
						<name>ECLK[%s]</name>
						<description>ECLK</description>
						<addressOffset>44</addressOffset>
						<register>
							<name>CMU_ECLK_z_NUM</name>
							<description>CMU External Clock 0 Control Numerator
 resetvalue={Application Reset:0x1}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>1</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>ECLK_NUM</name>
									<description>ECLK NUM. Numerator for external clock divider. Defines numerator of the        fractional divider. Value can only be modified when clock enable EN ECLK z  disabled. The CMU hardware alters the content of CMU ECLK  z  NUM and CMU ECLK  z  DEN automatically to          0x1  if CMU ECLK  z  NUM is specified          less than CMU ECLK  z  DEN or one of the          values is specified with a value zero. Thus  a secure way for altering          the values is writing twice to the register CMU ECLK  z  NUM followed by a single write to register CMU ECLK  z  DEN .</description>
									<lsb>0</lsb>
									<msb>23</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>CMU_ECLK_z_DEN</name>
							<description>CMU External Clock 0 Control Denominator
 resetvalue={Application Reset:0x1}</description>
							<addressOffset>4</addressOffset>
							<size>32</size>
							<resetValue>1</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>ECLK_DEN</name>
									<description>ECLK DEN. Denominator for external clock divider. Defines denominator of the        fractional divider Value can only be modified when clock enable EN ECLK z  disabled. The CMU hardware alters the content of CMU ECLK  z  NUM and CMU ECLK  z  DEN automatically to          0x1  if CMU ECLK  z  NUM is specified          less than CMU ECLK  z  DEN or one of the          values is specified with a value zero. Thus  a secure way for altering          the values is writing twice to the register CMU ECLK  z  NUM followed by a single write to register CMU ECLK  z  DEN .</description>
									<lsb>0</lsb>
									<msb>23</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
					</cluster>
				</cluster>
				<cluster>
					<name>BRC</name>
					<description>BRC</description>
					<addressOffset>1024</addressOffset>
					<register>
						<name>RST</name>
						<description>BRC Software Reset Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>112</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RST</name>
								<description>Software reset. This bit is cleared automatically after write by CPU. The channel        registers are set to their reset values and channel operation is stopped        immediately.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>EIRQ_EN</name>
						<description>BRC Error Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>116</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DEST_ERR_EIRQ_EN</name>
								<description>BRC DEST ERR EIRQ error interrupt enable</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DID_EIRQ_EN0</name>
								<description>Enable DID interrupt for channel x</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DID_EIRQ_EN1</name>
								<description>Enable DID interrupt for channel x</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DID_EIRQ_EN2</name>
								<description>Enable DID interrupt for channel x</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DID_EIRQ_EN3</name>
								<description>Enable DID interrupt for channel x</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DID_EIRQ_EN4</name>
								<description>Enable DID interrupt for channel x</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DID_EIRQ_EN5</name>
								<description>Enable DID interrupt for channel x</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DID_EIRQ_EN6</name>
								<description>Enable DID interrupt for channel x</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DID_EIRQ_EN7</name>
								<description>Enable DID interrupt for channel x</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DID_EIRQ_EN8</name>
								<description>Enable DID interrupt for channel x</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DID_EIRQ_EN9</name>
								<description>Enable DID interrupt for channel x</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DID_EIRQ_EN10</name>
								<description>Enable DID interrupt for channel x</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DID_EIRQ_EN11</name>
								<description>Enable DID interrupt for channel x</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<cluster>
						<dim>12</dim>
						<dimIncrement>8</dimIncrement>
						<name>SRC[%s]</name>
						<description>SRC</description>
						<addressOffset>0</addressOffset>
						<register>
							<name>BRC_SRC_z_ADDR</name>
							<description>BRC Read Address for Input Channel 0
 resetvalue={Application Reset:0x1FE}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>510</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>ADDR</name>
									<description>Source ARU address. Defines an ARU read address used as data source for input channel z. This bit field is only writable if channel is disabled.</description>
									<lsb>0</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>BRC_MODE</name>
									<description>BRC MODE  BRC Operation mode select. This bit field is only writable if channel is disabled.</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
