J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
						<register>
							<name>BRC_SRC_z_DEST</name>
							<description>BRC Destination Channels for Input Channel 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>4</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>EN_DEST0</name>
									<description>Enable BRC destination address q. The bits 0 to 21 are cleared by auto correction mechanism if a        destination channel is assigned to multiple source channels. When a BRC input channel is disabled  all EN DESTq  q  0...21  bits are        reset to zero   the internal states are reset to their reset value.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EN_DEST1</name>
									<description>Enable BRC destination address q. The bits 0 to 21 are cleared by auto correction mechanism if a        destination channel is assigned to multiple source channels. When a BRC input channel is disabled  all EN DESTq  q  0...21  bits are        reset to zero   the internal states are reset to their reset value.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EN_DEST2</name>
									<description>Enable BRC destination address q. The bits 0 to 21 are cleared by auto correction mechanism if a        destination channel is assigned to multiple source channels. When a BRC input channel is disabled  all EN DESTq  q  0...21  bits are        reset to zero   the internal states are reset to their reset value.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EN_DEST3</name>
									<description>Enable BRC destination address q. The bits 0 to 21 are cleared by auto correction mechanism if a        destination channel is assigned to multiple source channels. When a BRC input channel is disabled  all EN DESTq  q  0...21  bits are        reset to zero   the internal states are reset to their reset value.</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EN_DEST4</name>
									<description>Enable BRC destination address q. The bits 0 to 21 are cleared by auto correction mechanism if a        destination channel is assigned to multiple source channels. When a BRC input channel is disabled  all EN DESTq  q  0...21  bits are        reset to zero   the internal states are reset to their reset value.</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EN_DEST5</name>
									<description>Enable BRC destination address q. The bits 0 to 21 are cleared by auto correction mechanism if a        destination channel is assigned to multiple source channels. When a BRC input channel is disabled  all EN DESTq  q  0...21  bits are        reset to zero   the internal states are reset to their reset value.</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EN_DEST6</name>
									<description>Enable BRC destination address q. The bits 0 to 21 are cleared by auto correction mechanism if a        destination channel is assigned to multiple source channels. When a BRC input channel is disabled  all EN DESTq  q  0...21  bits are        reset to zero   the internal states are reset to their reset value.</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EN_DEST7</name>
									<description>Enable BRC destination address q. The bits 0 to 21 are cleared by auto correction mechanism if a        destination channel is assigned to multiple source channels. When a BRC input channel is disabled  all EN DESTq  q  0...21  bits are        reset to zero   the internal states are reset to their reset value.</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EN_DEST8</name>
									<description>Enable BRC destination address q. The bits 0 to 21 are cleared by auto correction mechanism if a        destination channel is assigned to multiple source channels. When a BRC input channel is disabled  all EN DESTq  q  0...21  bits are        reset to zero   the internal states are reset to their reset value.</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EN_DEST9</name>
									<description>Enable BRC destination address q. The bits 0 to 21 are cleared by auto correction mechanism if a        destination channel is assigned to multiple source channels. When a BRC input channel is disabled  all EN DESTq  q  0...21  bits are        reset to zero   the internal states are reset to their reset value.</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EN_DEST10</name>
									<description>Enable BRC destination address q. The bits 0 to 21 are cleared by auto correction mechanism if a        destination channel is assigned to multiple source channels. When a BRC input channel is disabled  all EN DESTq  q  0...21  bits are        reset to zero   the internal states are reset to their reset value.</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EN_DEST11</name>
									<description>Enable BRC destination address q. The bits 0 to 21 are cleared by auto correction mechanism if a        destination channel is assigned to multiple source channels. When a BRC input channel is disabled  all EN DESTq  q  0...21  bits are        reset to zero   the internal states are reset to their reset value.</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EN_DEST12</name>
									<description>Enable BRC destination address q. The bits 0 to 21 are cleared by auto correction mechanism if a        destination channel is assigned to multiple source channels. When a BRC input channel is disabled  all EN DESTq  q  0...21  bits are        reset to zero   the internal states are reset to their reset value.</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EN_DEST13</name>
									<description>Enable BRC destination address q. The bits 0 to 21 are cleared by auto correction mechanism if a        destination channel is assigned to multiple source channels. When a BRC input channel is disabled  all EN DESTq  q  0...21  bits are        reset to zero   the internal states are reset to their reset value.</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EN_DEST14</name>
									<description>Enable BRC destination address q. The bits 0 to 21 are cleared by auto correction mechanism if a        destination channel is assigned to multiple source channels. When a BRC input channel is disabled  all EN DESTq  q  0...21  bits are        reset to zero   the internal states are reset to their reset value.</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EN_DEST15</name>
									<description>Enable BRC destination address q. The bits 0 to 21 are cleared by auto correction mechanism if a        destination channel is assigned to multiple source channels. When a BRC input channel is disabled  all EN DESTq  q  0...21  bits are        reset to zero   the internal states are reset to their reset value.</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EN_DEST16</name>
									<description>Enable BRC destination address q. The bits 0 to 21 are cleared by auto correction mechanism if a        destination channel is assigned to multiple source channels. When a BRC input channel is disabled  all EN DESTq  q  0...21  bits are        reset to zero   the internal states are reset to their reset value.</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EN_DEST17</name>
									<description>Enable BRC destination address q. The bits 0 to 21 are cleared by auto correction mechanism if a        destination channel is assigned to multiple source channels. When a BRC input channel is disabled  all EN DESTq  q  0...21  bits are        reset to zero   the internal states are reset to their reset value.</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EN_DEST18</name>
									<description>Enable BRC destination address q. The bits 0 to 21 are cleared by auto correction mechanism if a        destination channel is assigned to multiple source channels. When a BRC input channel is disabled  all EN DESTq  q  0...21  bits are        reset to zero   the internal states are reset to their reset value.</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EN_DEST19</name>
									<description>Enable BRC destination address q. The bits 0 to 21 are cleared by auto correction mechanism if a        destination channel is assigned to multiple source channels. When a BRC input channel is disabled  all EN DESTq  q  0...21  bits are        reset to zero   the internal states are reset to their reset value.</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EN_DEST20</name>
									<description>Enable BRC destination address q. The bits 0 to 21 are cleared by auto correction mechanism if a        destination channel is assigned to multiple source channels. When a BRC input channel is disabled  all EN DESTq  q  0...21  bits are        reset to zero   the internal states are reset to their reset value.</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EN_DEST21</name>
									<description>Enable BRC destination address q. The bits 0 to 21 are cleared by auto correction mechanism if a        destination channel is assigned to multiple source channels. When a BRC input channel is disabled  all EN DESTq  q  0...21  bits are        reset to zero   the internal states are reset to their reset value.</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EN_TRASHBIN</name>
									<description>EN TRASHBIN  Control trash bin functionality. When bit EN TRASHBIN is enabled bits 0 to        21 are ignored for this input channel. Therefore  the bits 0 to 21 are        set to zero  0  when trash bin functionality is enabled.</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
					</cluster>
					<cluster>
						<name>IRQ</name>
						<description>IRQ</description>
						<addressOffset>96</addressOffset>
						<register>
							<name>NOTIFY</name>
							<description>BRC Interrupt Notification Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>DEST_ERR</name>
									<description>Configuration error interrupt for BRC sub module. This bit will be cleared on a CPU write access of value  1 .  As the bit is rw  otherwise no clear.  A read access leaves the bit unchanged.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DID0</name>
									<description>Data inconsistency occurred for channel x in MTM mode. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DID1</name>
									<description>Data inconsistency occurred for channel x in MTM mode. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DID2</name>
									<description>Data inconsistency occurred for channel x in MTM mode. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DID3</name>
									<description>Data inconsistency occurred for channel x in MTM mode. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DID4</name>
									<description>Data inconsistency occurred for channel x in MTM mode. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DID5</name>
									<description>Data inconsistency occurred for channel x in MTM mode. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DID6</name>
									<description>Data inconsistency occurred for channel x in MTM mode. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DID7</name>
									<description>Data inconsistency occurred for channel x in MTM mode. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DID8</name>
									<description>Data inconsistency occurred for channel x in MTM mode. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DID9</name>
									<description>Data inconsistency occurred for channel x in MTM mode. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DID10</name>
									<description>Data inconsistency occurred for channel x in MTM mode. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DID11</name>
									<description>Data inconsistency occurred for channel x in MTM mode. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>EN</name>
							<description>BRC Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>4</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>DEST_ERR_IRQ_EN</name>
									<description>BRC DEST ERR IRQ interrupt enable</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DID_IRQ_EN0</name>
									<description>Enable DID interrupt for channel x</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DID_IRQ_EN1</name>
									<description>Enable DID interrupt for channel x</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DID_IRQ_EN2</name>
									<description>Enable DID interrupt for channel x</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DID_IRQ_EN3</name>
									<description>Enable DID interrupt for channel x</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DID_IRQ_EN4</name>
									<description>Enable DID interrupt for channel x</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DID_IRQ_EN5</name>
									<description>Enable DID interrupt for channel x</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DID_IRQ_EN6</name>
									<description>Enable DID interrupt for channel x</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DID_IRQ_EN7</name>
									<description>Enable DID interrupt for channel x</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DID_IRQ_EN8</name>
									<description>Enable DID interrupt for channel x</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DID_IRQ_EN9</name>
									<description>Enable DID interrupt for channel x</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DID_IRQ_EN10</name>
									<description>Enable DID interrupt for channel x</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DID_IRQ_EN11</name>
									<description>Enable DID interrupt for channel x</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
