J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
						<register>
							<name>FORCINT</name>
							<description>BRC Force Interrupt Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>8</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>TRG_DEST_ERR</name>
									<description>Trigger destination error interrupt. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_DID0</name>
									<description>Trigger DID interrupt for channel x. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_DID1</name>
									<description>Trigger DID interrupt for channel x. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_DID2</name>
									<description>Trigger DID interrupt for channel x. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_DID3</name>
									<description>Trigger DID interrupt for channel x. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_DID4</name>
									<description>Trigger DID interrupt for channel x. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_DID5</name>
									<description>Trigger DID interrupt for channel x. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_DID6</name>
									<description>Trigger DID interrupt for channel x. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_DID7</name>
									<description>Trigger DID interrupt for channel x. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_DID8</name>
									<description>Trigger DID interrupt for channel x. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_DID9</name>
									<description>Trigger DID interrupt for channel x. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_DID10</name>
									<description>Trigger DID interrupt for channel x. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_DID11</name>
									<description>Trigger DID interrupt for channel x. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>MODE</name>
							<description>BRC Interrupt Mode Configuration Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>12</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>IRQ_MODE</name>
									<description>IRQ mode selection. Note  The interrupt modes are described in CROSSREFERENCE .</description>
									<lsb>0</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
					</cluster>
				</cluster>
				<cluster>
					<name>ICM</name>
					<description>ICM</description>
					<addressOffset>1536</addressOffset>
					<cluster>
						<name>IRQG</name>
						<description>IRQG</description>
						<addressOffset>0</addressOffset>
						<register>
							<name>ICM_IRQG_0</name>
							<description>ICM Interrupt Group Register Covering Infrastructural and Safety Components ARU  BRC  AEI  PSM0  PSM1  MAP  CMP  SPE
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>ARU_NEW_DATA0_IRQ</name>
									<description>ARU NEW DATA0 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ARU_NEW_DATA1_IRQ</name>
									<description>ARU NEW DATA1 interrupt. Bit coding see bit 0.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ARU_ACC_ACK_IRQ</name>
									<description>ARU ACC ACK interrupt. Bit coding see bit 0.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>BRC_IRQ</name>
									<description>BRC shared sub module interrupt. Bit coding see bit 0.</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>AEI_IRQ</name>
									<description>AEI IRQ interrupt. Bit coding see bit 0. Set this bit represents an OR function of the seven interrupt sources AEI TO XPT   AEI USP ADDR   AEI IM ADDR   AEI USP BE   AEIM USP ADDR   AEIM IM ADDR or AEIM USP BE .</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CMP_IRQ</name>
									<description>CMP shared sub module interrupt. Bit coding see bit 0.</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>SPE0_IRQ</name>
									<description>SPE0 shared sub module interrupt. Bit coding see bit 0. Set this bit represents an OR function of the five interrupt sources SPE NIPD   SPE DCHG   SPE PERR   SPE BIS or SPE RCMP of SPE instance 0.</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>SPE1_IRQ</name>
									<description>SPE1 shared sub module interrupt. See bit 0 and bit 6.</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>SPE2_IRQ</name>
									<description>SPE2 shared sub module interrupt. See bit 0 and bit 6.</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>SPE3_IRQ</name>
									<description>SPE3 shared sub module interrupt. See bit 0 and bit 6.</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>SPE4_IRQ</name>
									<description>SPE4 shared sub module interrupt. See bit 0 and bit 6.</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>SPE5_IRQ</name>
									<description>SPE5 shared sub module interrupt. See bit 0 and bit 6.</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM0_CH0_IRQ</name>
									<description>PSM0 shared sub module channel 7 interrupt. See bit 0 and bit 6. Set this bit represents an OR function of the four interrupt sources FIFO EMPTY   FIFO FULL   FIFO LOWER WM or FIFO UPPER WM of FIFO instance 0 channel x.</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM0_CH1_IRQ</name>
									<description>PSM0 shared sub module channel 7 interrupt. See bit 0 and bit 6. Set this bit represents an OR function of the four interrupt sources FIFO EMPTY   FIFO FULL   FIFO LOWER WM or FIFO UPPER WM of FIFO instance 0 channel x.</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM0_CH2_IRQ</name>
									<description>PSM0 shared sub module channel 7 interrupt. See bit 0 and bit 6. Set this bit represents an OR function of the four interrupt sources FIFO EMPTY   FIFO FULL   FIFO LOWER WM or FIFO UPPER WM of FIFO instance 0 channel x.</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM0_CH3_IRQ</name>
									<description>PSM0 shared sub module channel 7 interrupt. See bit 0 and bit 6. Set this bit represents an OR function of the four interrupt sources FIFO EMPTY   FIFO FULL   FIFO LOWER WM or FIFO UPPER WM of FIFO instance 0 channel x.</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM0_CH4_IRQ</name>
									<description>PSM0 shared sub module channel 7 interrupt. See bit 0 and bit 6. Set this bit represents an OR function of the four interrupt sources FIFO EMPTY   FIFO FULL   FIFO LOWER WM or FIFO UPPER WM of FIFO instance 0 channel x.</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM0_CH5_IRQ</name>
									<description>PSM0 shared sub module channel 7 interrupt. See bit 0 and bit 6. Set this bit represents an OR function of the four interrupt sources FIFO EMPTY   FIFO FULL   FIFO LOWER WM or FIFO UPPER WM of FIFO instance 0 channel x.</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM0_CH6_IRQ</name>
									<description>PSM0 shared sub module channel 7 interrupt. See bit 0 and bit 6. Set this bit represents an OR function of the four interrupt sources FIFO EMPTY   FIFO FULL   FIFO LOWER WM or FIFO UPPER WM of FIFO instance 0 channel x.</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM0_CH7_IRQ</name>
									<description>PSM0 shared sub module channel 7 interrupt. See bit 0 and bit 6. Set this bit represents an OR function of the four interrupt sources FIFO EMPTY   FIFO FULL   FIFO LOWER WM or FIFO UPPER WM of FIFO instance 0 channel x.</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM1_CH0_IRQ</name>
									<description>PSM1 shared sub module channel 7 interrupt. See bit 0 and bit 6. Set this bit represents an OR function of the four interrupt sources FIFO EMPTY   FIFO FULL   FIFO LOWER WM or FIFO UPPER WM of FIFO instance 1 channel x.</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM1_CH1_IRQ</name>
									<description>PSM1 shared sub module channel 7 interrupt. See bit 0 and bit 6. Set this bit represents an OR function of the four interrupt sources FIFO EMPTY   FIFO FULL   FIFO LOWER WM or FIFO UPPER WM of FIFO instance 1 channel x.</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM1_CH2_IRQ</name>
									<description>PSM1 shared sub module channel 7 interrupt. See bit 0 and bit 6. Set this bit represents an OR function of the four interrupt sources FIFO EMPTY   FIFO FULL   FIFO LOWER WM or FIFO UPPER WM of FIFO instance 1 channel x.</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM1_CH3_IRQ</name>
									<description>PSM1 shared sub module channel 7 interrupt. See bit 0 and bit 6. Set this bit represents an OR function of the four interrupt sources FIFO EMPTY   FIFO FULL   FIFO LOWER WM or FIFO UPPER WM of FIFO instance 1 channel x.</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM1_CH4_IRQ</name>
									<description>PSM1 shared sub module channel 7 interrupt. See bit 0 and bit 6. Set this bit represents an OR function of the four interrupt sources FIFO EMPTY   FIFO FULL   FIFO LOWER WM or FIFO UPPER WM of FIFO instance 1 channel x.</description>
									<lsb>28</lsb>
									<msb>28</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM1_CH5_IRQ</name>
									<description>PSM1 shared sub module channel 7 interrupt. See bit 0 and bit 6. Set this bit represents an OR function of the four interrupt sources FIFO EMPTY   FIFO FULL   FIFO LOWER WM or FIFO UPPER WM of FIFO instance 1 channel x.</description>
									<lsb>29</lsb>
									<msb>29</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM1_CH6_IRQ</name>
									<description>PSM1 shared sub module channel 7 interrupt. See bit 0 and bit 6. Set this bit represents an OR function of the four interrupt sources FIFO EMPTY   FIFO FULL   FIFO LOWER WM or FIFO UPPER WM of FIFO instance 1 channel x.</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM1_CH7_IRQ</name>
									<description>PSM1 shared sub module channel 7 interrupt. See bit 0 and bit 6. Set this bit represents an OR function of the four interrupt sources FIFO EMPTY   FIFO FULL   FIFO LOWER WM or FIFO UPPER WM of FIFO instance 1 channel x.</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
						<register>
							<name>ICM_IRQG_1</name>
							<description>ICM Interrupt Group Register Covering DPLL
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>4</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>DPLL_DCGI_IRQ</name>
									<description>TRIGGER direction change detected. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_EDI_IRQ</name>
									<description>DPLL enable disable interrupt. Set this bit represents an OR function of the two interrupt sources DPLL PDI or DPLL PEI. Bit coding see bit 0.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_TINI_IRQ</name>
									<description>TRIGGER minimum hold time  THMI  violation detected interrupt. Bit coding see bit 0.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_TAXI_IRQ</name>
									<description>TRIGGER maximum hold time  THMA  violation detected interrupt. Bit coding see bit 0.</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_SISI_IRQ</name>
									<description>STATE inactive slope detected interrupt. Bit coding see bit 0.</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_TISI_IRQ</name>
									<description>TRIGGER inactive slope detected interrupt. Bit coding see bit 0.</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_MSI_IRQ</name>
									<description>Missing STATE interrupt. Bit coding see bit 0.</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_MTI_IRQ</name>
									<description>Missing TRIGGER interrupt. Bit coding see bit 0.</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_SASI_IRQ</name>
									<description>STATE active slope detected. Bit coding see bit 0.</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_TASI_IRQ</name>
									<description>TRIGGER active slope detected while NTI CNT is zero. Bit coding see bit 0.</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_PWI_IRQ</name>
									<description>Plausibility window  PVT  violation interrupt of TRIGGER. Bit coding see bit 0.</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_W2I_IRQ</name>
									<description>Write access to RAM region 2 interrupt. Bit coding see bit 0.</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_W1I_IRQ</name>
									<description>Write access to RAM region 1b or 1c interrupt. Bit coding see bit 0.</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_GL1I_IRQ</name>
									<description>Get of lock interrupt for SUB INC1. Bit coding see bit 0.</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_LL1I_IRQ</name>
									<description>Loss of lock interrupt for SUB INC1. Bit coding see bit 0.</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_EI_IRQ</name>
									<description>Error interrupt. Bit coding see bit 0.</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_GL2I_IRQ</name>
									<description>Get of lock interrupt for SUB INC2. Bit coding see bit 0.</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_LL2I_IRQ</name>
									<description>Loss of lock interrupt for SUB INC2. Bit coding see bit 0.</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_TE0I_IRQ</name>
									<description>TRIGGER event interrupt 0. Bit coding see bit 0.</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_TE1I_IRQ</name>
									<description>TRIGGER event interrupt 1. Bit coding see bit 0.</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_TE2I_IRQ</name>
									<description>TRIGGER event interrupt 2. Bit coding see bit 0.</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_TE3I_IRQ</name>
									<description>TRIGGER event interrupt 3. Bit coding see bit 0.</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_TE4I_IRQ</name>
									<description>TRIGGER event interrupt 4. Bit coding see bit 0.</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_CDTI_IRQ</name>
									<description>DPLL calculated duration interrupt for trigger. Bit coding see bit 0.</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_CDSI_IRQ</name>
									<description>DPLL calculated duration interrupt for state. Bit coding see bit 0.</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_TORI_IRQ</name>
									<description>DPLL calculated duration interrupt for state. Bit coding see bit 0.</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_SORI_IRQ</name>
									<description>DPLL calculated duration interrupt for state. Bit coding see bit 0.</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
