J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
						<register>
							<name>ICM_IRQG_2</name>
							<description>ICM Interrupt Group Register Covering TIM0  TIM1  TIM2  TIM3
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>8</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>TIM0_CH0_IRQ</name>
									<description>TIM0 shared interrupt channel 7. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 0 channel x.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM0_CH1_IRQ</name>
									<description>TIM0 shared interrupt channel 7. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 0 channel x.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM0_CH2_IRQ</name>
									<description>TIM0 shared interrupt channel 7. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 0 channel x.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM0_CH3_IRQ</name>
									<description>TIM0 shared interrupt channel 7. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 0 channel x.</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM0_CH4_IRQ</name>
									<description>TIM0 shared interrupt channel 7. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 0 channel x.</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM0_CH5_IRQ</name>
									<description>TIM0 shared interrupt channel 7. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 0 channel x.</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM0_CH6_IRQ</name>
									<description>TIM0 shared interrupt channel 7. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 0 channel x.</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM0_CH7_IRQ</name>
									<description>TIM0 shared interrupt channel 7. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 0 channel x.</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM1_CH0_IRQ</name>
									<description>TIM1 shared interrupt channel 7. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 1 channel x.</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM1_CH1_IRQ</name>
									<description>TIM1 shared interrupt channel 7. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 1 channel x.</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM1_CH2_IRQ</name>
									<description>TIM1 shared interrupt channel 7. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 1 channel x.</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM1_CH3_IRQ</name>
									<description>TIM1 shared interrupt channel 7. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 1 channel x.</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM1_CH4_IRQ</name>
									<description>TIM1 shared interrupt channel 7. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 1 channel x.</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM1_CH5_IRQ</name>
									<description>TIM1 shared interrupt channel 7. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 1 channel x.</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM1_CH6_IRQ</name>
									<description>TIM1 shared interrupt channel 7. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 1 channel x.</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM1_CH7_IRQ</name>
									<description>TIM1 shared interrupt channel 7. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 1 channel x.</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM2_CH0_IRQ</name>
									<description>TIM2 shared interrupt channel 7. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 2 channel x.</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM2_CH1_IRQ</name>
									<description>TIM2 shared interrupt channel 7. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 2 channel x.</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM2_CH2_IRQ</name>
									<description>TIM2 shared interrupt channel 7. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 2 channel x.</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM2_CH3_IRQ</name>
									<description>TIM2 shared interrupt channel 7. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 2 channel x.</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM2_CH4_IRQ</name>
									<description>TIM2 shared interrupt channel 7. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 2 channel x.</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM2_CH5_IRQ</name>
									<description>TIM2 shared interrupt channel 7. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 2 channel x.</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM2_CH6_IRQ</name>
									<description>TIM2 shared interrupt channel 7. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 2 channel x.</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM2_CH7_IRQ</name>
									<description>TIM2 shared interrupt channel 7. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 2 channel x.</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM3_CH0_IRQ</name>
									<description>TIM2 shared interrupt channel 7. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 3 channel x.</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM3_CH1_IRQ</name>
									<description>TIM2 shared interrupt channel 7. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 3 channel x.</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM3_CH2_IRQ</name>
									<description>TIM2 shared interrupt channel 7. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 3 channel x.</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM3_CH3_IRQ</name>
									<description>TIM2 shared interrupt channel 7. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 3 channel x.</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM3_CH4_IRQ</name>
									<description>TIM2 shared interrupt channel 7. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 3 channel x.</description>
									<lsb>28</lsb>
									<msb>28</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM3_CH5_IRQ</name>
									<description>TIM2 shared interrupt channel 7. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 3 channel x.</description>
									<lsb>29</lsb>
									<msb>29</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM3_CH6_IRQ</name>
									<description>TIM2 shared interrupt channel 7. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 3 channel x.</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM3_CH7_IRQ</name>
									<description>TIM2 shared interrupt channel 7. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the six interrupt sources NEWVALx IRQ   ECNTOFLx IRQ   CNTOFLx IRQ         GPRXOFLx IRQ   GLITCHDETx IRQ or TODETx IRQ of TIM instance 3 channel x.</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
