J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
						<register>
							<name>ICM_IRQG_5</name>
							<description>ICM Interrupt Group Register Covering MCS4 to MCS6 Sub Modules
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>20</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>MCS4_CH0_IRQ</name>
									<description>MCS4 channel 7 interrupt. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 4 channel x.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS4_CH1_IRQ</name>
									<description>MCS4 channel 7 interrupt. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 4 channel x.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS4_CH2_IRQ</name>
									<description>MCS4 channel 7 interrupt. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 4 channel x.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS4_CH3_IRQ</name>
									<description>MCS4 channel 7 interrupt. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 4 channel x.</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS4_CH4_IRQ</name>
									<description>MCS4 channel 7 interrupt. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 4 channel x.</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS4_CH5_IRQ</name>
									<description>MCS4 channel 7 interrupt. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 4 channel x.</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS4_CH6_IRQ</name>
									<description>MCS4 channel 7 interrupt. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 4 channel x.</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS4_CH7_IRQ</name>
									<description>MCS4 channel 7 interrupt. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 4 channel x.</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS5_CH0_IRQ</name>
									<description>MCS5 channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 5 channel x.</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS5_CH1_IRQ</name>
									<description>MCS5 channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 5 channel x.</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS5_CH2_IRQ</name>
									<description>MCS5 channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 5 channel x.</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS5_CH3_IRQ</name>
									<description>MCS5 channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 5 channel x.</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS5_CH4_IRQ</name>
									<description>MCS5 channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 5 channel x.</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS5_CH5_IRQ</name>
									<description>MCS5 channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 5 channel x.</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS5_CH6_IRQ</name>
									<description>MCS5 channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 5 channel x.</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS5_CH7_IRQ</name>
									<description>MCS5 channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 5 channel x.</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS6_CH0_IRQ</name>
									<description>MCS6 channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 6 channel x.</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS6_CH1_IRQ</name>
									<description>MCS6 channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 6 channel x.</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS6_CH2_IRQ</name>
									<description>MCS6 channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 6 channel x.</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS6_CH3_IRQ</name>
									<description>MCS6 channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 6 channel x.</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS6_CH4_IRQ</name>
									<description>MCS6 channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 6 channel x.</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS6_CH5_IRQ</name>
									<description>MCS6 channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 6 channel x.</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS6_CH6_IRQ</name>
									<description>MCS6 channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 6 channel x.</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS6_CH7_IRQ</name>
									<description>MCS6 channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 6 channel x.</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS7_CH0_IRQ</name>
									<description>MCS7 channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 7 channel x.</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS7_CH1_IRQ</name>
									<description>MCS7 channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 7 channel x.</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS7_CH2_IRQ</name>
									<description>MCS7 channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 7 channel x.</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS7_CH3_IRQ</name>
									<description>MCS7 channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 7 channel x.</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS7_CH4_IRQ</name>
									<description>MCS7 channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 7 channel x.</description>
									<lsb>28</lsb>
									<msb>28</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS7_CH5_IRQ</name>
									<description>MCS7 channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 7 channel x.</description>
									<lsb>29</lsb>
									<msb>29</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS7_CH6_IRQ</name>
									<description>MCS7 channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 7 channel x.</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS7_CH7_IRQ</name>
									<description>MCS7 channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the three interrupt sources MCS IRQ   STK ERR IRQ or ERR IRQ of MCS instance 7 channel x.</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
