J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
						<register>
							<name>ICM_IRQG_10</name>
							<description>ICM Interrupt Group Register Covering GTM Output Sub Modules ATOM4 to ATOM7
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>40</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>ATOM4_CH0_IRQ</name>
									<description>ATOM4 channel 7 shared interrupt. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 4 channel x.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM4_CH1_IRQ</name>
									<description>ATOM4 channel 7 shared interrupt. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 4 channel x.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM4_CH2_IRQ</name>
									<description>ATOM4 channel 7 shared interrupt. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 4 channel x.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM4_CH3_IRQ</name>
									<description>ATOM4 channel 7 shared interrupt. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 4 channel x.</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM4_CH4_IRQ</name>
									<description>ATOM4 channel 7 shared interrupt. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 4 channel x.</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM4_CH5_IRQ</name>
									<description>ATOM4 channel 7 shared interrupt. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 4 channel x.</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM4_CH6_IRQ</name>
									<description>ATOM4 channel 7 shared interrupt. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 4 channel x.</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM4_CH7_IRQ</name>
									<description>ATOM4 channel 7 shared interrupt. This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 4 channel x.</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM5_CH0_IRQ</name>
									<description>ATOM5 channel 7 shared interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 5 channel x.</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM5_CH1_IRQ</name>
									<description>ATOM5 channel 7 shared interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 5 channel x.</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM5_CH2_IRQ</name>
									<description>ATOM5 channel 7 shared interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 5 channel x.</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM5_CH3_IRQ</name>
									<description>ATOM5 channel 7 shared interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 5 channel x.</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM5_CH4_IRQ</name>
									<description>ATOM5 channel 7 shared interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 5 channel x.</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM5_CH5_IRQ</name>
									<description>ATOM5 channel 7 shared interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 5 channel x.</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM5_CH6_IRQ</name>
									<description>ATOM5 channel 7 shared interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 5 channel x.</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM5_CH7_IRQ</name>
									<description>ATOM5 channel 7 shared interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 5 channel x.</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM6_CH0_IRQ</name>
									<description>ATOM6 channel 7 shared interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 6 channel x.</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM6_CH1_IRQ</name>
									<description>ATOM6 channel 7 shared interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 6 channel x.</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM6_CH2_IRQ</name>
									<description>ATOM6 channel 7 shared interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 6 channel x.</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM6_CH3_IRQ</name>
									<description>ATOM6 channel 7 shared interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 6 channel x.</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM6_CH4_IRQ</name>
									<description>ATOM6 channel 7 shared interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 6 channel x.</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM6_CH5_IRQ</name>
									<description>ATOM6 channel 7 shared interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 6 channel x.</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM6_CH6_IRQ</name>
									<description>ATOM6 channel 7 shared interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 6 channel x.</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM6_CH7_IRQ</name>
									<description>ATOM6 channel 7 shared interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 6 channel x.</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM7_CH0_IRQ</name>
									<description>ATOM7 channel 7 shared interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 7 channel x.</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM7_CH1_IRQ</name>
									<description>ATOM7 channel 7 shared interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 7 channel x.</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM7_CH2_IRQ</name>
									<description>ATOM7 channel 7 shared interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 7 channel x.</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM7_CH3_IRQ</name>
									<description>ATOM7 channel 7 shared interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 7 channel x.</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM7_CH4_IRQ</name>
									<description>ATOM7 channel 7 shared interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 7 channel x.</description>
									<lsb>28</lsb>
									<msb>28</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM7_CH5_IRQ</name>
									<description>ATOM7 channel 7 shared interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 7 channel x.</description>
									<lsb>29</lsb>
									<msb>29</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM7_CH6_IRQ</name>
									<description>ATOM7 channel 7 shared interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 7 channel x.</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM7_CH7_IRQ</name>
									<description>ATOM7 channel 7 shared interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 7 channel x.</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
						<register>
							<name>MEI</name>
							<description>ICM Interrupt Group Register for Module Error Interrupt Information
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>48</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>GTM_EIRQ</name>
									<description>AEI Error interrupt request. This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module. Set this bit represents an OR function of the seven interrupt sources AEI TO XPT EIRQ   AEI USP ADDR EIRQ   AEI IM ADDR EIRQ   AEI USP BE EIRQ   AEIM USP ADDR EIRQ   AEIM IM ADDR EIRQ or AEIM USP BE EIRQ .</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>BRC_EIRQ</name>
									<description>BRC error interrupt. Bit coding see bit 0.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>FIFO0_EIRQ</name>
									<description>FIFO0 error interrupt. Bit coding see bit 0.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>FIFO1_EIRQ</name>
									<description>FIFO1 error interrupt. Bit coding see bit 0.</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM0_EIRQ</name>
									<description>TIM7 error interrupt. Bit coding see bit 0.</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM1_EIRQ</name>
									<description>TIM7 error interrupt. Bit coding see bit 0.</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM2_EIRQ</name>
									<description>TIM7 error interrupt. Bit coding see bit 0.</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM3_EIRQ</name>
									<description>TIM7 error interrupt. Bit coding see bit 0.</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM4_EIRQ</name>
									<description>TIM7 error interrupt. Bit coding see bit 0.</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM5_EIRQ</name>
									<description>TIM7 error interrupt. Bit coding see bit 0.</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM6_EIRQ</name>
									<description>TIM7 error interrupt. Bit coding see bit 0.</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM7_EIRQ</name>
									<description>TIM7 error interrupt. Bit coding see bit 0.</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS0_EIRQ</name>
									<description>MCS7 error interrupt. Bit coding see bit 0.</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS1_EIRQ</name>
									<description>MCS7 error interrupt. Bit coding see bit 0.</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS2_EIRQ</name>
									<description>MCS7 error interrupt. Bit coding see bit 0.</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS3_EIRQ</name>
									<description>MCS7 error interrupt. Bit coding see bit 0.</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS4_EIRQ</name>
									<description>MCS7 error interrupt. Bit coding see bit 0.</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS5_EIRQ</name>
									<description>MCS7 error interrupt. Bit coding see bit 0.</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS6_EIRQ</name>
									<description>MCS7 error interrupt. Bit coding see bit 0.</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS7_EIRQ</name>
									<description>MCS7 error interrupt. Bit coding see bit 0.</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>SPE0_EIRQ</name>
									<description>SPE3 error interrupt. Bit coding see bit 0.</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>SPE1_EIRQ</name>
									<description>SPE3 error interrupt. Bit coding see bit 0.</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>SPE2_EIRQ</name>
									<description>SPE3 error interrupt. Bit coding see bit 0.</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>SPE3_EIRQ</name>
									<description>SPE3 error interrupt. Bit coding see bit 0.</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CMP_EIRQ</name>
									<description>CMP error interrupt. Bit coding see bit 0.</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>DPLL_EIRQ</name>
									<description>DPLL error interrupt. Bit coding see bit 0.</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
