J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
						<register>
							<name>ICM_IRQG_PSM_k_CEI</name>
							<description>ICM Interrupt Group PSM 0 for Channel Error Interrupt information of FIFO0  FIFO1  FIFO2
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>164</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>PSM_M0_CH0_EIRQ</name>
									<description>PSM0 channel 7 error interrupt  m 4 0 0 . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM_M0_CH1_EIRQ</name>
									<description>PSM0 channel 7 error interrupt  m 4 0 0 . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM_M0_CH2_EIRQ</name>
									<description>PSM0 channel 7 error interrupt  m 4 0 0 . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM_M0_CH3_EIRQ</name>
									<description>PSM0 channel 7 error interrupt  m 4 0 0 . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM_M0_CH4_EIRQ</name>
									<description>PSM0 channel 7 error interrupt  m 4 0 0 . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM_M0_CH5_EIRQ</name>
									<description>PSM0 channel 7 error interrupt  m 4 0 0 . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM_M0_CH6_EIRQ</name>
									<description>PSM0 channel 7 error interrupt  m 4 0 0 . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM_M0_CH7_EIRQ</name>
									<description>PSM0 channel 7 error interrupt  m 4 0 0 . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM_M1_CH0_EIRQ</name>
									<description>PSM1 channel 7 error interrupt  m 4 0 0 . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM_M1_CH1_EIRQ</name>
									<description>PSM1 channel 7 error interrupt  m 4 0 0 . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM_M1_CH2_EIRQ</name>
									<description>PSM1 channel 7 error interrupt  m 4 0 0 . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM_M1_CH3_EIRQ</name>
									<description>PSM1 channel 7 error interrupt  m 4 0 0 . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM_M1_CH4_EIRQ</name>
									<description>PSM1 channel 7 error interrupt  m 4 0 0 . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM_M1_CH5_EIRQ</name>
									<description>PSM1 channel 7 error interrupt  m 4 0 0 . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM_M1_CH6_EIRQ</name>
									<description>PSM1 channel 7 error interrupt  m 4 0 0 . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM_M1_CH7_EIRQ</name>
									<description>PSM1 channel 7 error interrupt  m 4 0 0 . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM_M2_CH0_EIRQ</name>
									<description>PSM2 channel 7 error interrupt  m 4 0 0 . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM_M2_CH1_EIRQ</name>
									<description>PSM2 channel 7 error interrupt  m 4 0 0 . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM_M2_CH2_EIRQ</name>
									<description>PSM2 channel 7 error interrupt  m 4 0 0 . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM_M2_CH3_EIRQ</name>
									<description>PSM2 channel 7 error interrupt  m 4 0 0 . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM_M2_CH4_EIRQ</name>
									<description>PSM2 channel 7 error interrupt  m 4 0 0 . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM_M2_CH5_EIRQ</name>
									<description>PSM2 channel 7 error interrupt  m 4 0 0 . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM_M2_CH6_EIRQ</name>
									<description>PSM2 channel 7 error interrupt  m 4 0 0 . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>PSM_M2_CH7_EIRQ</name>
									<description>PSM2 channel 7 error interrupt  m 4 0 0 . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
						<register>
							<name>ICM_IRQG_SPE_CEI</name>
							<description>ICM Interrupt Group SPE for Module Error Interrupt Information
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>180</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>SPE0_EIRQ</name>
									<description>SPE channel 5 error interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>SPE1_EIRQ</name>
									<description>SPE channel 5 error interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>SPE2_EIRQ</name>
									<description>SPE channel 5 error interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>SPE3_EIRQ</name>
									<description>SPE channel 5 error interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module.</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>SPE4_EIRQ</name>
									<description>SPE channel 5 error interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module.</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>SPE5_EIRQ</name>
									<description>SPE channel 5 error interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module.</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
						<register>
							<dim>2</dim>
							<dimIncrement>4</dimIncrement>
							<name>ICM_IRQG_CLS_k_MEI[%s]</name>
							<description>ICM Interrupt Group k for Module Error Interrupt Information for each TIMm  MCSm  SPEm  FIFOm
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>272</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>TIM_M0_EIRQ</name>
									<description>Error interrupt TIMm EIRQ  m  4 0 3  . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS_M0_EIRQ</name>
									<description>Error interrupt MCSm EIRQ  m  4 0 3  . Coding see bit 0.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>SPE_M0_EIRQ</name>
									<description>Error interrupt SPEm EIRQ  m  4 0 3  . Coding see bit 0.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>FIFO_M0_EIRQ</name>
									<description>Error interrupt FIFOm EIRQ  m  4 0 3  . Coding see bit 0.</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM_M1_EIRQ</name>
									<description>Error interrupt TIMm EIRQ  m  4 0 3  . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS_M1_EIRQ</name>
									<description>Error interrupt MCSm EIRQ  m  4 0 3  . Coding see bit 0.</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>SPE_M1_EIRQ</name>
									<description>Error interrupt SPEm EIRQ  m  4 0 3  . Coding see bit 0.</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM_M2_EIRQ</name>
									<description>Error interrupt TIMm EIRQ  m  4 0 3  . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS_M2_EIRQ</name>
									<description>Error interrupt MCSm EIRQ  m  4 0 3  . Coding see bit 0.</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TIM_M3_EIRQ</name>
									<description>Error interrupt TIMm EIRQ  m  4 0 3  . This bit is only set when the error interrupt is enabled in the error        interrupt enable register of the corresponding sub module.</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS_M3_EIRQ</name>
									<description>Error interrupt MCSm EIRQ  m  4 0 3  . Coding see bit 0.</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
						<register>
							<dim>5</dim>
							<dimIncrement>4</dimIncrement>
							<name>ICM_IRQG_MCSi_CI[%s]</name>
							<description>ICM Interrupt Group MCS 0 for Channel Interrupt Information
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>288</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>MCS_CH0_IRQ</name>
									<description>MCS channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS_CH1_IRQ</name>
									<description>MCS channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS_CH2_IRQ</name>
									<description>MCS channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS_CH3_IRQ</name>
									<description>MCS channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module.</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS_CH4_IRQ</name>
									<description>MCS channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module.</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS_CH5_IRQ</name>
									<description>MCS channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module.</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS_CH6_IRQ</name>
									<description>MCS channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module.</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MCS_CH7_IRQ</name>
									<description>MCS channel 7 interrupt. This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module.</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
