J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
						<register>
							<dim>2</dim>
							<dimIncrement>4</dimIncrement>
							<name>ICM_IRQG_ATOM_k_CI[%s]</name>
							<description>ICM Interrupt Group ATOM 0 for Channel Interrupt Information of ATOMm
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>400</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>ATOM_M0_CH0_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 0  . This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 0 channel x.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M0_CH1_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 0  . This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 0 channel x.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M0_CH2_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 0  . This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 0 channel x.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M0_CH3_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 0  . This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 0 channel x.</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M0_CH4_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 0  . This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 0 channel x.</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M0_CH5_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 0  . This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 0 channel x.</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M0_CH6_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 0  . This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 0 channel x.</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M0_CH7_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 0  . This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 0 channel x.</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M1_CH0_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 1  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 1 channel x.</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M1_CH1_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 1  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 1 channel x.</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M1_CH2_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 1  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 1 channel x.</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M1_CH3_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 1  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 1 channel x.</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M1_CH4_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 1  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 1 channel x.</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M1_CH5_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 1  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 1 channel x.</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M1_CH6_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 1  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 1 channel x.</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M1_CH7_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 1  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 1 channel x.</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M2_CH0_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 2  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 2 channel x.</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M2_CH1_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 2  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 2 channel x.</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M2_CH2_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 2  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 2 channel x.</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M2_CH3_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 2  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 2 channel x.</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M2_CH4_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 2  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 2 channel x.</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M2_CH5_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 2  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 2 channel x.</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M2_CH6_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 2  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 2 channel x.</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M2_CH7_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 2  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 2 channel x.</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M3_CH0_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 3 . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 2 channel x.</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M3_CH1_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 3 . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 2 channel x.</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M3_CH2_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 3 . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 2 channel x.</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M3_CH3_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 3 . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 2 channel x.</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M3_CH4_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 3 . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 2 channel x.</description>
									<lsb>28</lsb>
									<msb>28</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M3_CH5_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 3 . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 2 channel x.</description>
									<lsb>29</lsb>
									<msb>29</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M3_CH6_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 3 . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 2 channel x.</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>ATOM_M3_CH7_IRQ</name>
									<description>ATOMm channel 7 interrupt  m  4 0 3 . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources CCU0TCx IRQ or CCU1TCx IRQ of ATOM instance 2 channel x.</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
