J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
						<register>
							<dim>2</dim>
							<dimIncrement>4</dimIncrement>
							<name>ICM_IRQG_TOM_k_CI[%s]</name>
							<description>ICM Interrupt Group TOM 0 for Channel Interrupt Information of TOMm
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>416</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>TOM_M0_CH0_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 0  . This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 0 channel x.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M0_CH1_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 0  . This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 0 channel x.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M0_CH2_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 0  . This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 0 channel x.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M0_CH3_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 0  . This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 0 channel x.</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M0_CH4_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 0  . This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 0 channel x.</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M0_CH5_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 0  . This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 0 channel x.</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M0_CH6_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 0  . This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 0 channel x.</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M0_CH7_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 0  . This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 0 channel x.</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M0_CH8_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 0  . This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 0 channel x.</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M0_CH9_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 0  . This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 0 channel x.</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M0_CH10_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 0  . This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 0 channel x.</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M0_CH11_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 0  . This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 0 channel x.</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M0_CH12_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 0  . This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 0 channel x.</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M0_CH13_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 0  . This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 0 channel x.</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M0_CH14_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 0  . This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 0 channel x.</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M0_CH15_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 0  . This bit is only set  when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 0 channel x.</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M1_CH0_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 1  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 1 channel x.</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M1_CH1_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 1  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 1 channel x.</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M1_CH2_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 1  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 1 channel x.</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M1_CH3_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 1  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 1 channel x.</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M1_CH4_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 1  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 1 channel x.</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M1_CH5_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 1  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 1 channel x.</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M1_CH6_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 1  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 1 channel x.</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M1_CH7_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 1  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 1 channel x.</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M1_CH8_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 1  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 1 channel x.</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M1_CH9_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 1  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 1 channel x.</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M1_CH10_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 1  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 1 channel x.</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M1_CH11_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 1  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 1 channel x.</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M1_CH12_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 1  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 1 channel x.</description>
									<lsb>28</lsb>
									<msb>28</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M1_CH13_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 1  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 1 channel x.</description>
									<lsb>29</lsb>
									<msb>29</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M1_CH14_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 1  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 1 channel x.</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TOM_M1_CH15_IRQ</name>
									<description>TOMm channel 15 interrupt  m  2 0 1  . This bit is only set when the interrupt is enabled in the interrupt        enable register of the corresponding sub module. Set this bit represents an OR function of the two interrupt sources TOM CCU0TCx IRQ or TOM CCU1TCx IRQ of TOM instance 1 channel x.</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
					</cluster>
				</cluster>
				<cluster>
					<dim>2</dim>
					<dimIncrement>128</dimIncrement>
					<name>SPE[%s]</name>
					<description>SPE</description>
					<addressOffset>2048</addressOffset>
					<register>
						<name>SPEi_CTRL_STAT</name>
						<description>SPE0 Control Status Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>EN</name>
								<description>SPE Submodule enable</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SIE0</name>
								<description>SPE Input enable for TIM CHx 48 . When the input is disabled  a 0 signal is sampled for this input.        However  the bit field NIP of this register shows the true value of the        input signal.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SIE1</name>
								<description>SPE Input enable for TIM CHy 48 . Coding see bit 1.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SIE2</name>
								<description>SPE Input enable for TIM CHz 48 . Coding see bit 1.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRIG_SEL</name>
								<description>Select trigger input signal. ETRIG SEL   0   ETRIG SEL   1  In case of ETRIG SEL 1  according to selected TOM CH x  TRIG CCU1          signal the configuration bits SPE TRIG and OSM of register          TOM CH x  CTRL have to be set in same TOM channel x to enable the          trigger signal generation in one shot mode.</description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TIM_SEL</name>
								<description>Select TIM input signal. The GTM supports up to 6 SPE modules.SPE0 </description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FSOM</name>
								<description>Fast Shutoff Mode</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SPE_PAT_PTR</name>
								<description>Pattern selector for TOM output signals. Actual index into the SPE i  OUT PAT x  register table. Each register        SPE i  OUT PAT x  is fixed assigned to one bit field IPx PAT of register        SPE i  PAT. Thus  the pointer SPE i  PAT PTR represents an index to the        selected SPE i  OUT PAT x  register as well as the actual detected input        pattern IPx PAT.</description>
								<lsb>8</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AIP</name>
								<description>Actual input pattern that was detected by a regular input pattern change</description>
								<lsb>12</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ADIR</name>
								<description>Actual rotation direction</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PIP</name>
								<description>Previous input pattern that was detected by a regular input pattern change</description>
								<lsb>16</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PDIR</name>
								<description>Previous rotation direction</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>NIP</name>
								<description>New input pattern that was detected. This bit field mirrors the new input pattern. SPE internal functionality        is triggered on each change of this bit field.</description>
								<lsb>20</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ETRIG_SEL</name>
								<description>Extended TRIG SEL. Extended trigger selection. Details described in TRIG SEL bit field. ETRIG SEL   0   ETRIG SEL   1  00   SPE i  NIPD selected   TOM CH6 TRIG CCU1 selected 01   TOM CH0 TRIG CCU0 selected   TOM CH7 TRIG CCU1 selected 10   TOM CH0 TRIG CCU1 selected   TOM CH8 TRIG CCU1 selected 11   TOM CH2 TRIG CCU1 selected   TOM CH9 TRIG CCU1 selected</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FSOL</name>
								<description>Fast Shutoff Level for TOM i  channel 0 to 7</description>
								<lsb>24</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
