J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>SPEi_PAT</name>
						<description>SPE0 Input Pattern Definition Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>IP0_VAL</name>
								<description>Input pattern 7 is a valid pattern</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IP0_PAT</name>
								<description>Input pattern 7   IP7 PAT. Bit field defines the input pattern z of the SPE input signals. Bit 1 defines the TIM i  CHx 48  input signal. Bit 2 defines the TIM i  CHy 48  input signal. Bit 3 defines the TIM i  CHz 48  input signal.</description>
								<lsb>1</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IP1_VAL</name>
								<description>Input pattern 7 is a valid pattern</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IP1_PAT</name>
								<description>Input pattern 7   IP7 PAT. Bit field defines the input pattern z of the SPE input signals. Bit 1 defines the TIM i  CHx 48  input signal. Bit 2 defines the TIM i  CHy 48  input signal. Bit 3 defines the TIM i  CHz 48  input signal.</description>
								<lsb>5</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IP2_VAL</name>
								<description>Input pattern 7 is a valid pattern</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IP2_PAT</name>
								<description>Input pattern 7   IP7 PAT. Bit field defines the input pattern z of the SPE input signals. Bit 1 defines the TIM i  CHx 48  input signal. Bit 2 defines the TIM i  CHy 48  input signal. Bit 3 defines the TIM i  CHz 48  input signal.</description>
								<lsb>9</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IP3_VAL</name>
								<description>Input pattern 7 is a valid pattern</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IP3_PAT</name>
								<description>Input pattern 7   IP7 PAT. Bit field defines the input pattern z of the SPE input signals. Bit 1 defines the TIM i  CHx 48  input signal. Bit 2 defines the TIM i  CHy 48  input signal. Bit 3 defines the TIM i  CHz 48  input signal.</description>
								<lsb>13</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IP4_VAL</name>
								<description>Input pattern 7 is a valid pattern</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IP4_PAT</name>
								<description>Input pattern 7   IP7 PAT. Bit field defines the input pattern z of the SPE input signals. Bit 1 defines the TIM i  CHx 48  input signal. Bit 2 defines the TIM i  CHy 48  input signal. Bit 3 defines the TIM i  CHz 48  input signal.</description>
								<lsb>17</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IP5_VAL</name>
								<description>Input pattern 7 is a valid pattern</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IP5_PAT</name>
								<description>Input pattern 7   IP7 PAT. Bit field defines the input pattern z of the SPE input signals. Bit 1 defines the TIM i  CHx 48  input signal. Bit 2 defines the TIM i  CHy 48  input signal. Bit 3 defines the TIM i  CHz 48  input signal.</description>
								<lsb>21</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IP6_VAL</name>
								<description>Input pattern 7 is a valid pattern</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IP6_PAT</name>
								<description>Input pattern 7   IP7 PAT. Bit field defines the input pattern z of the SPE input signals. Bit 1 defines the TIM i  CHx 48  input signal. Bit 2 defines the TIM i  CHy 48  input signal. Bit 3 defines the TIM i  CHz 48  input signal.</description>
								<lsb>25</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IP7_VAL</name>
								<description>Input pattern 7 is a valid pattern</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IP7_PAT</name>
								<description>Input pattern 7   IP7 PAT. Bit field defines the input pattern z of the SPE input signals. Bit 1 defines the TIM i  CHx 48  input signal. Bit 2 defines the TIM i  CHy 48  input signal. Bit 3 defines the TIM i  CHz 48  input signal.</description>
								<lsb>29</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>8</dim>
						<dimIncrement>4</dimIncrement>
						<name>OUT_PAT[%s]</name>
						<description>SPE0 Output Definition Register z
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SPE_OUT_PAT</name>
								<description>SPE output control value for TOM CH0 to TOM CH7. SPE OUT PAT n 1 n  defines output select signal of TOM i  CH n  with n 0...7 Current output control selection for SPE i  OUT 0..7 .</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>SPEi_OUT_CTRL</name>
						<description>SPE0 Output Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>40</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SPE_OUT_CTRL</name>
								<description>SPE output control value for TOM CH0 to TOM CH7. SPE OUT CTRL n 1 n  defines output select signal of TOM CHn. Current output control selection for SPE i  OUT 0..7 .</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>SPEi_EIRQ_EN</name>
						<description>SPE0 Error Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>60</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SPE_NIPD_EIRQ_EN</name>
								<description>SPE NIPD EIRQ interrupt enable</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SPE_DCHG_EIRQ_EN</name>
								<description>SPE DCHG EIRQ error interrupt enable. Coding see bit 0.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SPE_PERR_EIRQ_EN</name>
								<description>SPE PERR EIRQ error interrupt enable. Coding see bit 0.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SPE_BIS_EIRQ_EN</name>
								<description>SPE BIS EIRQ error interrupt enable. Coding see bit 0.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SPE_RCMP_EIRQ_EN</name>
								<description>SPE RCMP EIRQ error interrupt enable. Coding see bit 0.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>SPEi_REV_CNT</name>
						<description>SPE0 Input Revolution Counter
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>64</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>REV_CNT</name>
								<description>Input signal revolution counter. The counter is running if SPE module is enabled  bit SPE EN . REV CNT is incrementing if SPE PAT PTR is incrementing. REV CNT is decrementing if SPE PAT PTR is decrementing </description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>SPEi_REV_CMP</name>
						<description>SPE0 Revolution Counter Compare Value
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>68</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>REV_CMP</name>
								<description>Input signal revolution counter compare value. The interrupt SPE i  RCMP is raised when the SPE i  REV CNT value equals the        SPE i  REV CMP register. It should be noted that SPE i  RCMP is only raised if an incrementation or decrementation of        SPE i  REV CNT is applied  due to an input signal change. Any update of        SPE i  REV CNT or SPE i  REV CMP via AEI does not raise a SPE i  RCMP interrupt.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>SPEi_CTRL_STAT2</name>
						<description>SPE0 Control Status Register 2
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>72</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SPE_PAT_PTR_BWD</name>
								<description>Pattern selector for TOM output signals in case of SPE CTRL CMD   0b01  e.g. backward direction . Index into the SPE i  OUT PAT z  register table in case of SPE CTRL CMD          0b01 which may be used for backward direction. Each register SPE i  OUT PAT x  is fixed assigned to one bit field        IPx PAT of register SPE i  PAT. Thus  the pointer SPE i  PAT PTR BWD        represents an index to the selected SPE i  OUT PAT x  register as well        as the actual detected input pattern IPx PAT. The index pointer SPE PAT PTR BWD is used if SPE CTRL CMD  160   0b01. The index pointer SPE PAT PTR is used if SPE CTRL CMD  160    160 0b00  by        default .</description>
								<lsb>8</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>SPEi_CMD</name>
						<description>SPE0 Command register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>76</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SPE_CTRL_CMD</name>
								<description>SPE control command</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SPE_UPD_TRIG</name>
								<description>SPE updater trigger. 1   trigger update of SPE OUT CTRL with register selected by CTR CMD        multiplexer. This bit is automatically reset to 0.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<cluster>
						<name>IRQ</name>
						<description>IRQ</description>
						<addressOffset>44</addressOffset>
						<register>
							<name>SPEi_IRQ_NOTIFY</name>
							<description>SPE0 Interrupt Notification Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>SPE_NIPD</name>
									<description>New input pattern interrupt occurred. This bit will be cleared on a CPU write access of value 1.  As the bit is rw  otherwise no clear.  A read access leaves the bit unchanged.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SPE_DCHG</name>
									<description>SPE DIR bit changed on behalf of new input pattern. Coding see bit 0.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SPE_PERR</name>
									<description>Wrong or invalid pattern detected at input. Coding see bit 0.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SPE_BIS</name>
									<description>Bouncing input signal detected. Coding see bit 0.</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SPE_RCMP</name>
									<description>SPE revolution counter match event. Coding see bit 0.</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>SPEi_IRQ_EN</name>
							<description>SPE0 Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>4</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>SPE_NIPD_IRQ_EN</name>
									<description>SPE NIPD IRQ interrupt enable</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SPE_DCHG_IRQ_EN</name>
									<description>SPE DCHG IRQ interrupt enable. Coding see bit 0.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SPE_PERR_IRQ_EN</name>
									<description>SPE PERR IRQ interrupt enable. Coding see bit 0.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SPE_BIS_IRQ_EN</name>
									<description>SPE BIS IRQ interrupt enable. Coding see bit 0.</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SPE_RCMP_IRQ_EN</name>
									<description>SPE RCMP IRQ interrupt enable. Coding see bit 0.</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>SPEi_IRQ_FORCINT</name>
							<description>SPE0 Interrupt Generation by Software
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>8</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>TRG_SPE_NIPD</name>
									<description>Force interrupt of SPE NIPD. This bit is cleared automatically after interrupt is released. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_SPE_DCHG</name>
									<description>Force interrupt of SPE DCHG. Coding see bit 0.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_SPE_PERR</name>
									<description>Force interrupt of SPE PERR. Coding see bit 0.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_SPE_BIS</name>
									<description>Force interrupt of SPE BIS. Coding see bit 0.</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_SPE_RCMP</name>
									<description>Force interrupt of SPE RCMP. Coding see bit 0.</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>SPEi_IRQ_MODE</name>
							<description>SPE0 Interrupt Mode Configuration Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>12</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>IRQ_MODE</name>
									<description>IRQ mode selection. The interrupt modes are described in CROSSREFERENCE .</description>
									<lsb>0</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
					</cluster>
				</cluster>
				<cluster>
					<dim>6</dim>
					<dimIncrement>2048</dimIncrement>
					<name>TIM[%s]</name>
					<description>TIM</description>
					<addressOffset>4096</addressOffset>
					<register>
						<name>CH0_GPR0</name>
						<description>TIM0 Channel 7 General Purpose 0 Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>GPR0</name>
								<description>Input signal characteristic parameter 0. The content of this register has different meaning for the TIM channels        modes. The content directly depends on the bit fields EGPR0 SEL   GPR0 SEL of register TIM i  CH x  CTRL . Note  The content of this register can only        be written in TIM channel mode TSSM.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECNT</name>
								<description>Edge counter. The ECNT counts every incoming filtered        edge  rising and falling . The counter value is uneven in case of        detected rising  and even in case of detected falling edge. Thus  the        input signal level is part of the counter and can be obtained by bit 0        of ECNT .</description>
								<lsb>24</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH0_GPR1</name>
						<description>TIM0 Channel 7 General Purpose 1 Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>GPR1</name>
								<description>Input signal characteristic parameter 1. The content of this register has different meaning for the TIM channels        modes. The content directly depends on the bit fields EGPR1 SEL   GPR1 SEL of register TIM i  CH x  CTRL . In TBCM mode if EGPR1 SEL 1  GPR1 SEL 01 then TIM INP VAL is used as        input in all other cases TIM Filter F OUT is used as input and Bits        GPR1 23 8    0 The content of this register can only be written in TIM channel mode        TGPS and TSSM.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECNT</name>
								<description>Edge counter. The ECNT counts every incoming filtered        edge  rising and falling . The counter value is uneven in case of        detected rising  and even in case of detected falling edge. Thus  the        input signal level is part of the counter and can be obtained by bit 0        of ECNT .</description>
								<lsb>24</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH0_CNT</name>
						<description>TIM0 Channel 7 SMU Counter Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CNT</name>
								<description>Actual SMU counter value. The meaning of this value depends on the configured mode  TPWM   actual duration of PWM signal.TPIM   actual duration of all        pulses  sum of pulses .TIEM   actual number of received edges.TIPM          actual number of received edges.TGPS   elapsed time for periodic        sampling.TSSM   shift data.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH0_ECNT</name>
						<description>TIM0 Channel 7 SMU Edge Counter Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>12</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ECNT</name>
								<description>Edge counter. If TIM channel is disabled the content of ECNT gets frozen. A read will        auto clear the bits  15 1 . Further read accesses to ECNT will show on        Bit 0 the actual input signal value of the channel.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH0_CNTS</name>
						<description>TIM0 Channel 7 SMU Shadow Counter Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>16</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CNTS</name>
								<description>Counter shadow register. The content of this register has different meaning for the TIM channels        modes. The content depends directly on the bit field CNTS SEL of register TIM i  CH x  CTRL . The register TIM i  CH x  CNTS is only        writable in TIPM TBCM  TGPS and TSSM mode.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECNT</name>
								<description>Edge counter   ECNT. The ECNT counts every incoming filtered        edge  rising and falling . The counter value is uneven in case of        detected rising  and even in case of detected falling edge. Thus  the        input signal level is part of the counter and can be obtained by bit 0        of ECNT .</description>
								<lsb>24</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
