J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>CH2_CTRL</name>
						<description>TIM0 Channel 7 Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>292</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TIM_EN</name>
								<description>TIM channel x enable. Enabling of the channel resets the registers ECNT         TIM i  CH x  CNT  TIM i  CH x  GPR0  and TIM i  CH x  GPR1 to their reset values. After finishing the action in one shot mode the TIM EN bit is cleared automatically. Otherwise  the bit must be cleared        manually.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TIM_MODE</name>
								<description>TIM channel x mode. If an undefined value is written to the TIM MODE register  the hardware        switches automatically to TIM MODE   0b000  TPWM mode . The TIM MODE register should not be changed while the TIM channel is        enabled. If the TIM channel is enabled and operating in TPWM or TPIM mode after        the first valid edge defined by DSL has occurred  a reconfiguration of        DSL ISL TIM MODE will not change the channel behavior. Reading these bit        fields after reconfiguration will show the newly configured settings but        the initial channel behavior will not change. Only a disabling of the        TIM channel by setting TIM EN  0 and reenabling with TIM EN  1 will        change the channel operation mode.</description>
								<lsb>1</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OSM</name>
								<description>One shot mode. After finishing the action in one shot mode the TIM EN bit is cleared automatically.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ARU_EN</name>
								<description>GPR0 and GPR1 register values routed to ARU</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CICTRL</name>
								<description>Channel Input Control</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBU0_SEL</name>
								<description>TBU TS0 bits input select for TIM0 CH x  GPRz  z  0  1 . This bit is only applicable for TIM0.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GPR0_SEL</name>
								<description>Selection for GPR0 register. If EGPR0 SEL  0   EGPR0 SEL  1   If a reserved value is written to the EGPR0 SEL  GPR0 SEL bit fields         the hardware will use TBU TS0 input.</description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GPR1_SEL</name>
								<description>Selection for GPR1 register. If EGPR1 SEL  0   EGPR1 SEL  1  If a reserved value is written to the EGPR1 SEL  GPR1 SEL bit fields         the hardware will use TBU TS0 input. Note  In TBCM mode  EGPR1 SEL 1         GPR1 SEL 01 selects TIM INP VAL as input  in all other cases  TIM Filter        F OUT is used.</description>
								<lsb>10</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CNTS_SEL</name>
								<description>Selection for CNTS register. The functionality of the CNTS SEL is        disabled in the modes TIPM TGPS and TBCM. CNTS SEL in TSSM mode selects the source        signal for registered or latched shift out operation. 0 B   160   160   160   160   160 use F OUTx 1 B   160   160   160   160   160 use TIM INx</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DSL</name>
								<description>Signal level control. In TIM MODE 0b110  TSSM   the bit field DSL defines the shift direction. 0 B   160   160   160   160   160 Shift left 1 B   160   160   160   160   160 Shift right</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ISL</name>
								<description>Ignore signal level. This bit is mode dependent and will have different meanings  see details        in the TIM Channel mode description .</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECNT_RESET</name>
								<description>Enables resetting of counter in certain modes. If TIM MODE 0b101  TGPS    TIM MODE 0b000  TPWM  else ECNT counter operating in wrap around mode  In TIM MODE 0b110  TSSM   the bit field ECNT RESET defines the initial        polarity for the shift register.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FLT_EN</name>
								<description>Filter enable for channel x. If the filter is disabled  all filter related units  including CSU  are        bypassed  which means that the signal F IN is directly routed to signal F OUT .</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FLT_CNT_FRQ</name>
								<description>Filter counter frequency select</description>
								<lsb>17</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EXT_CAP_EN</name>
								<description>Enables external capture mode. The selected TIM mode is only sensitive to external capture pulses the        input event changes are ignored.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FLT_MODE_RE</name>
								<description>Filter mode for rising edge. Coding see CROSSREFERENCE . Coding see Family Spec.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FLT_CTR_RE</name>
								<description>Filter counter mode for rising edge. Coding see CROSSREFERENCE . Coding see Family Spec.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FLT_MODE_FE</name>
								<description>Filter mode for falling edge. Coding see CROSSREFERENCE . Coding see Family Spec.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FLT_CTR_FE</name>
								<description>Filter counter mode for falling edge. Coding see CROSSREFERENCE . Coding see Family Spec.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK_SEL</name>
								<description>CMU clock source select for channel. If ECLK SEL  0   ECLK SEL  1 </description>
								<lsb>24</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FR_ECNT_OFL</name>
								<description>Extended Edge counter overflow behavior</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EGPR0_SEL</name>
								<description>Extension of GPR0 SEL bit field. Details described in GPR0 SEL bit field.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EGPR1_SEL</name>
								<description>Extension of GPR1 SEL bit field. Details described in GPR1 SEL bit field.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TOCTRL</name>
								<description>Timeout control. It has to be mentioned that writing of TOCTRL  0 will every time stop        the TDU  independent of the previous state of TOCTRL.</description>
								<lsb>30</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH2_ECTRL</name>
						<description>TIM0 Channel 7 Extended Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>296</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>EXT_CAP_SRC</name>
								<description>Defines selected source for triggering the EXT CAPTURE functionality</description>
								<lsb>0</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>USE_PREV_TDU_IN</name>
								<description>Select input data source for TDU</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TODET_IRQ_SRC</name>
								<description>selection of source for TODET IRQ. With TODET IRQ SRC 0b00 the ACB bit 2 will be driven by signal        tdu timeout evt  if TODET IRQ SRC  0b00 ACB2 will be 0.</description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TDU_START</name>
								<description>Defines condition which will start the TDU unit. In mode SLICING 0b11 every start restart will load the TO CNT with value        TOV2. Note  tdu start 000 event is defined as  Each writing of TOCTRL           0  independent of current TOCTRL  while TDU START 0b000 and TDU is        stopped  initially or stopped by TDU STOP event . This event will last 1        system clock cycle.</description>
								<lsb>8</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TDU_STOP</name>
								<description>Defines condition which will stop the TDU unit. Note  tdu toctrl 0 event is defined as  Each writing of TOCTRL   0         independent of current TOCTRL  while TDU is started. This event will        last 1 system clock cycle.</description>
								<lsb>12</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TDU_RESYNC</name>
								<description>Defines condition which will resynchronize the TDU unit. Encoding see Table  160 14 and Table  160 15 .</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>USE_LUT</name>
								<description>Generate Filter input by lookup table</description>
								<lsb>22</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EFLT_CTR_RE</name>
								<description>Extension of bit field FLT CTR RE. Details described in FLT CTR RE bit field of register TIM i  CH x  CTRL.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EFLT_CTR_FE</name>
								<description>Extension of bit field FLT CTR FE. Details described in FLT CTR FE bit field of register TIM i  CH x  CTRL.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SWAP_CAPTURE</name>
								<description>Swap point of time of capturing CNTS and GPR1. This bit is only applicable in TPWM and TPIM mode. Set to 0 in all other        modes.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IMM_START</name>
								<description>Start immediately the measurement. This bit is only applicable in TPWM and TPIM mode. Set to 0 in all other        modes.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECLK_SEL</name>
								<description>Extension of bit field CLK SEL. Details described in CLK SEL bit field of register TIM i  CH x  CTRL.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>USE_PREV_CH_IN</name>
								<description>Select input data source for TIM channel</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH2_IRQ_NOTIFY</name>
						<description>TIM0 Channel 7 Interrupt Notification Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>300</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>NEWVAL</name>
								<description>New measurement value detected by in channel x. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECNTOFL</name>
								<description>counter overflow of channel x. See bit 0.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CNTOFL</name>
								<description>SMU CNT counter overflow of channel x. See bit 0.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GPROFL</name>
								<description>GPR0 and GPR1 data overflow. Old data not read out before new data has arrived at input pin. See bit        0.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TODET</name>
								<description>Timeout reached for input signal of channel x. See bit 0.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GLITCHDET</name>
								<description>Glitch detected on channel x   x 0...m 1 . This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH2_IRQ_EN</name>
						<description>TIM0 Channel 7 Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>304</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>NEWVAL_IRQ_EN</name>
								<description>TIM NEWVALx IRQ interrupt enable</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECNTOFL_IRQ_EN</name>
								<description>TIM ECNTOFLx IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CNTOFL_IRQ_EN</name>
								<description>TIM CNTOFLx IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GPROFL_IRQ_EN</name>
								<description>TIM GPROFL IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TODET_IRQ_EN</name>
								<description>TIM TODETx IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GLITCHDET_IRQ_EN</name>
								<description>TIM GLITCHDETx IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH2_IRQ_FORCINT</name>
						<description>TIM0 Channel 7 Force Interrupt Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>308</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TRG_NEWVAL</name>
								<description>Trigger NEWVAL bit in TIM CHx IRQ NOTIFY register by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_ECNTOFL</name>
								<description>Trigger ECNTOFL bit in TIM CHx IRQ NOTIFY register by software. Coding see bit 0.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_CNTOFL</name>
								<description>Trigger CNTOFL bit in TIM CHx IRQ NOTIFY register by software. Coding see bit 0.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_GPROFL</name>
								<description>Trigger GPROFL bit in TIM CHx IRQ NOTIFY register by software. Coding see bit 0.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_TODET</name>
								<description>Trigger TODET bit in TIM CHx IRQ NOTIFY register by software. Coding see bit 0.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_GLITCHDET</name>
								<description>Trigger GLITCHDET bit in TIM CHx IRQ NOTIFY register by software. Coding see bit 0.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH2_IRQ_MODE</name>
						<description>TIM0 Channel 7 Interrupt Mode Configuration Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>312</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>IRQ_MODE</name>
								<description>IRQ mode selection. The interrupt modes are described in CROSSREFERENCE .</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH2_EIRQ_EN</name>
						<description>TIM0 Channel 7 Error Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>316</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>NEWVAL_EIRQ_EN</name>
								<description>TIM NEWVALx EIRQ error interrupt enable</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECNTOFL_EIRQ_EN</name>
								<description>TIM ECNTOFLx IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CNTOFL_EIRQ_EN</name>
								<description>TIM CNTOFLx IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GPROFL_EIRQ_EN</name>
								<description>TIM GPROFL IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TODET_EIRQ_EN</name>
								<description>TIM TODETx IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GLITCHDET_EIRQ_EN</name>
								<description>TIM GLITCHDETx IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH3_GPR0</name>
						<description>TIM0 Channel 7 General Purpose 0 Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>384</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>GPR0</name>
								<description>Input signal characteristic parameter 0. The content of this register has different meaning for the TIM channels        modes. The content directly depends on the bit fields EGPR0 SEL   GPR0 SEL of register TIM i  CH x  CTRL . Note  The content of this register can only        be written in TIM channel mode TSSM.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECNT</name>
								<description>Edge counter. The ECNT counts every incoming filtered        edge  rising and falling . The counter value is uneven in case of        detected rising  and even in case of detected falling edge. Thus  the        input signal level is part of the counter and can be obtained by bit 0        of ECNT .</description>
								<lsb>24</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH3_GPR1</name>
						<description>TIM0 Channel 7 General Purpose 1 Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>388</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>GPR1</name>
								<description>Input signal characteristic parameter 1. The content of this register has different meaning for the TIM channels        modes. The content directly depends on the bit fields EGPR1 SEL   GPR1 SEL of register TIM i  CH x  CTRL . In TBCM mode if EGPR1 SEL 1  GPR1 SEL 01 then TIM INP VAL is used as        input in all other cases TIM Filter F OUT is used as input and Bits        GPR1 23 8    0 The content of this register can only be written in TIM channel mode        TGPS and TSSM.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECNT</name>
								<description>Edge counter. The ECNT counts every incoming filtered        edge  rising and falling . The counter value is uneven in case of        detected rising  and even in case of detected falling edge. Thus  the        input signal level is part of the counter and can be obtained by bit 0        of ECNT .</description>
								<lsb>24</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
