J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>CH4_ECTRL</name>
						<description>TIM0 Channel 7 Extended Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>552</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>EXT_CAP_SRC</name>
								<description>Defines selected source for triggering the EXT CAPTURE functionality</description>
								<lsb>0</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>USE_PREV_TDU_IN</name>
								<description>Select input data source for TDU</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TODET_IRQ_SRC</name>
								<description>selection of source for TODET IRQ. With TODET IRQ SRC 0b00 the ACB bit 2 will be driven by signal        tdu timeout evt  if TODET IRQ SRC  0b00 ACB2 will be 0.</description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TDU_START</name>
								<description>Defines condition which will start the TDU unit. In mode SLICING 0b11 every start restart will load the TO CNT with value        TOV2. Note  tdu start 000 event is defined as  Each writing of TOCTRL           0  independent of current TOCTRL  while TDU START 0b000 and TDU is        stopped  initially or stopped by TDU STOP event . This event will last 1        system clock cycle.</description>
								<lsb>8</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TDU_STOP</name>
								<description>Defines condition which will stop the TDU unit. Note  tdu toctrl 0 event is defined as  Each writing of TOCTRL   0         independent of current TOCTRL  while TDU is started. This event will        last 1 system clock cycle.</description>
								<lsb>12</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TDU_RESYNC</name>
								<description>Defines condition which will resynchronize the TDU unit. Encoding see Table  160 14 and Table  160 15 .</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>USE_LUT</name>
								<description>Generate Filter input by lookup table</description>
								<lsb>22</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EFLT_CTR_RE</name>
								<description>Extension of bit field FLT CTR RE. Details described in FLT CTR RE bit field of register TIM i  CH x  CTRL.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EFLT_CTR_FE</name>
								<description>Extension of bit field FLT CTR FE. Details described in FLT CTR FE bit field of register TIM i  CH x  CTRL.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SWAP_CAPTURE</name>
								<description>Swap point of time of capturing CNTS and GPR1. This bit is only applicable in TPWM and TPIM mode. Set to 0 in all other        modes.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IMM_START</name>
								<description>Start immediately the measurement. This bit is only applicable in TPWM and TPIM mode. Set to 0 in all other        modes.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECLK_SEL</name>
								<description>Extension of bit field CLK SEL. Details described in CLK SEL bit field of register TIM i  CH x  CTRL.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>USE_PREV_CH_IN</name>
								<description>Select input data source for TIM channel</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH4_IRQ_NOTIFY</name>
						<description>TIM0 Channel 7 Interrupt Notification Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>556</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>NEWVAL</name>
								<description>New measurement value detected by in channel x. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECNTOFL</name>
								<description>counter overflow of channel x. See bit 0.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CNTOFL</name>
								<description>SMU CNT counter overflow of channel x. See bit 0.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GPROFL</name>
								<description>GPR0 and GPR1 data overflow. Old data not read out before new data has arrived at input pin. See bit        0.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TODET</name>
								<description>Timeout reached for input signal of channel x. See bit 0.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GLITCHDET</name>
								<description>Glitch detected on channel x   x 0...m 1 . This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH4_IRQ_EN</name>
						<description>TIM0 Channel 7 Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>560</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>NEWVAL_IRQ_EN</name>
								<description>TIM NEWVALx IRQ interrupt enable</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECNTOFL_IRQ_EN</name>
								<description>TIM ECNTOFLx IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CNTOFL_IRQ_EN</name>
								<description>TIM CNTOFLx IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GPROFL_IRQ_EN</name>
								<description>TIM GPROFL IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TODET_IRQ_EN</name>
								<description>TIM TODETx IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GLITCHDET_IRQ_EN</name>
								<description>TIM GLITCHDETx IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH4_IRQ_FORCINT</name>
						<description>TIM0 Channel 7 Force Interrupt Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>564</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TRG_NEWVAL</name>
								<description>Trigger NEWVAL bit in TIM CHx IRQ NOTIFY register by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_ECNTOFL</name>
								<description>Trigger ECNTOFL bit in TIM CHx IRQ NOTIFY register by software. Coding see bit 0.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_CNTOFL</name>
								<description>Trigger CNTOFL bit in TIM CHx IRQ NOTIFY register by software. Coding see bit 0.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_GPROFL</name>
								<description>Trigger GPROFL bit in TIM CHx IRQ NOTIFY register by software. Coding see bit 0.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_TODET</name>
								<description>Trigger TODET bit in TIM CHx IRQ NOTIFY register by software. Coding see bit 0.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_GLITCHDET</name>
								<description>Trigger GLITCHDET bit in TIM CHx IRQ NOTIFY register by software. Coding see bit 0.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH4_IRQ_MODE</name>
						<description>TIM0 Channel 7 Interrupt Mode Configuration Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>568</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>IRQ_MODE</name>
								<description>IRQ mode selection. The interrupt modes are described in CROSSREFERENCE .</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH4_EIRQ_EN</name>
						<description>TIM0 Channel 7 Error Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>572</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>NEWVAL_EIRQ_EN</name>
								<description>TIM NEWVALx EIRQ error interrupt enable</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECNTOFL_EIRQ_EN</name>
								<description>TIM ECNTOFLx IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CNTOFL_EIRQ_EN</name>
								<description>TIM CNTOFLx IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GPROFL_EIRQ_EN</name>
								<description>TIM GPROFL IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TODET_EIRQ_EN</name>
								<description>TIM TODETx IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GLITCHDET_EIRQ_EN</name>
								<description>TIM GLITCHDETx IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH5_GPR0</name>
						<description>TIM0 Channel 7 General Purpose 0 Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>640</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>GPR0</name>
								<description>Input signal characteristic parameter 0. The content of this register has different meaning for the TIM channels        modes. The content directly depends on the bit fields EGPR0 SEL   GPR0 SEL of register TIM i  CH x  CTRL . Note  The content of this register can only        be written in TIM channel mode TSSM.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECNT</name>
								<description>Edge counter. The ECNT counts every incoming filtered        edge  rising and falling . The counter value is uneven in case of        detected rising  and even in case of detected falling edge. Thus  the        input signal level is part of the counter and can be obtained by bit 0        of ECNT .</description>
								<lsb>24</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH5_GPR1</name>
						<description>TIM0 Channel 7 General Purpose 1 Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>644</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>GPR1</name>
								<description>Input signal characteristic parameter 1. The content of this register has different meaning for the TIM channels        modes. The content directly depends on the bit fields EGPR1 SEL   GPR1 SEL of register TIM i  CH x  CTRL . In TBCM mode if EGPR1 SEL 1  GPR1 SEL 01 then TIM INP VAL is used as        input in all other cases TIM Filter F OUT is used as input and Bits        GPR1 23 8    0 The content of this register can only be written in TIM channel mode        TGPS and TSSM.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECNT</name>
								<description>Edge counter. The ECNT counts every incoming filtered        edge  rising and falling . The counter value is uneven in case of        detected rising  and even in case of detected falling edge. Thus  the        input signal level is part of the counter and can be obtained by bit 0        of ECNT .</description>
								<lsb>24</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH5_CNT</name>
						<description>TIM0 Channel 7 SMU Counter Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>648</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CNT</name>
								<description>Actual SMU counter value. The meaning of this value depends on the configured mode  TPWM   actual duration of PWM signal.TPIM   actual duration of all        pulses  sum of pulses .TIEM   actual number of received edges.TIPM          actual number of received edges.TGPS   elapsed time for periodic        sampling.TSSM   shift data.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH5_ECNT</name>
						<description>TIM0 Channel 7 SMU Edge Counter Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>652</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ECNT</name>
								<description>Edge counter. If TIM channel is disabled the content of ECNT gets frozen. A read will        auto clear the bits  15 1 . Further read accesses to ECNT will show on        Bit 0 the actual input signal value of the channel.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH5_CNTS</name>
						<description>TIM0 Channel 7 SMU Shadow Counter Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>656</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CNTS</name>
								<description>Counter shadow register. The content of this register has different meaning for the TIM channels        modes. The content depends directly on the bit field CNTS SEL of register TIM i  CH x  CTRL . The register TIM i  CH x  CNTS is only        writable in TIPM TBCM  TGPS and TSSM mode.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECNT</name>
								<description>Edge counter   ECNT. The ECNT counts every incoming filtered        edge  rising and falling . The counter value is uneven in case of        detected rising  and even in case of detected falling edge. Thus  the        input signal level is part of the counter and can be obtained by bit 0        of ECNT .</description>
								<lsb>24</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH5_TDUC</name>
						<description>TIM0 Channel 7 TDU Counter Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>660</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TO_CNT</name>
								<description>Current Timeout value slice0 for channel x. SLICING    0b11  counter will be reset to 0X0 on TDU RESYNC condition. SLICING   0b11   counter will be loaded with TOV2 on TDU RESYNC        condition.</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TO_CNT1</name>
								<description>Current Timeout value slice1 for channel x. Counter will be reset to 0x0 on TDU RESYNC condition.</description>
								<lsb>8</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TO_CNT2</name>
								<description>Current Timeout value slice2 for channel x. Counter will be reset to 0x0 on TDU RESYNC condition.</description>
								<lsb>16</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH5_TDUV</name>
						<description>TIM0 Channel 7 TDU Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>664</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TOV</name>
								<description>Time out compare value slice0 for channel x. Compare value for TO CNT.</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TOV1</name>
								<description>Time out compare value slice1 for channel x. Compare value for TO CNT1.</description>
								<lsb>8</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TOV2</name>
								<description>Time out compare value slice2 for channel x. SLICING  0b11  Compare value for TO CNT2. SLICING  0b11  TOV2 operate as a shadow register for TO CNT.</description>
								<lsb>16</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SLICING</name>
								<description>Cascading of counter slices. If USE LUT 0b00   USE LUT   0b00</description>
								<lsb>24</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TCS_USE_SAMPLE_EVT</name>
								<description>Use tdu sample evt as Timeout Clock</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TDU_SAME_CNT_CLK</name>
								<description>Define clocking of TO CNT  TO CNT1</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TCS</name>
								<description>Timeout Clock selection</description>
								<lsb>28</lsb>
								<msb>30</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH5_FLT_RE</name>
						<description>TIM0 Channel 7 Filter Parameter 0 Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>668</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>FLT_RE</name>
								<description>Filter parameter for rising edge. FLT RE has different meanings in the various filter modes.Immediate edge        propagation mode   acceptance time for rising edgeIndividual deglitch        time mode   deglitch time for rising edge.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH5_FLT_FE</name>
						<description>TIM0 Channel 7 Filter Parameter 1 Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>672</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>FLT_FE</name>
								<description>Filter parameter for falling edge. FLT FE has different meanings in the various filter modes.Immediate edge propagation mode   acceptance time for falling edge Individual deglitch time mode   deglitch time for falling edge.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
