J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>CH6_IRQ_FORCINT</name>
						<description>TIM0 Channel 7 Force Interrupt Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>820</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TRG_NEWVAL</name>
								<description>Trigger NEWVAL bit in TIM CHx IRQ NOTIFY register by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_ECNTOFL</name>
								<description>Trigger ECNTOFL bit in TIM CHx IRQ NOTIFY register by software. Coding see bit 0.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_CNTOFL</name>
								<description>Trigger CNTOFL bit in TIM CHx IRQ NOTIFY register by software. Coding see bit 0.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_GPROFL</name>
								<description>Trigger GPROFL bit in TIM CHx IRQ NOTIFY register by software. Coding see bit 0.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_TODET</name>
								<description>Trigger TODET bit in TIM CHx IRQ NOTIFY register by software. Coding see bit 0.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_GLITCHDET</name>
								<description>Trigger GLITCHDET bit in TIM CHx IRQ NOTIFY register by software. Coding see bit 0.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH6_IRQ_MODE</name>
						<description>TIM0 Channel 7 Interrupt Mode Configuration Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>824</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>IRQ_MODE</name>
								<description>IRQ mode selection. The interrupt modes are described in CROSSREFERENCE .</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH6_EIRQ_EN</name>
						<description>TIM0 Channel 7 Error Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>828</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>NEWVAL_EIRQ_EN</name>
								<description>TIM NEWVALx EIRQ error interrupt enable</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECNTOFL_EIRQ_EN</name>
								<description>TIM ECNTOFLx IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CNTOFL_EIRQ_EN</name>
								<description>TIM CNTOFLx IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GPROFL_EIRQ_EN</name>
								<description>TIM GPROFL IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TODET_EIRQ_EN</name>
								<description>TIM TODETx IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GLITCHDET_EIRQ_EN</name>
								<description>TIM GLITCHDETx IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH7_GPR0</name>
						<description>TIM0 Channel 7 General Purpose 0 Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>896</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>GPR0</name>
								<description>Input signal characteristic parameter 0. The content of this register has different meaning for the TIM channels        modes. The content directly depends on the bit fields EGPR0 SEL   GPR0 SEL of register TIM i  CH x  CTRL . Note  The content of this register can only        be written in TIM channel mode TSSM.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECNT</name>
								<description>Edge counter. The ECNT counts every incoming filtered        edge  rising and falling . The counter value is uneven in case of        detected rising  and even in case of detected falling edge. Thus  the        input signal level is part of the counter and can be obtained by bit 0        of ECNT .</description>
								<lsb>24</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH7_GPR1</name>
						<description>TIM0 Channel 7 General Purpose 1 Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>900</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>GPR1</name>
								<description>Input signal characteristic parameter 1. The content of this register has different meaning for the TIM channels        modes. The content directly depends on the bit fields EGPR1 SEL   GPR1 SEL of register TIM i  CH x  CTRL . In TBCM mode if EGPR1 SEL 1  GPR1 SEL 01 then TIM INP VAL is used as        input in all other cases TIM Filter F OUT is used as input and Bits        GPR1 23 8    0 The content of this register can only be written in TIM channel mode        TGPS and TSSM.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECNT</name>
								<description>Edge counter. The ECNT counts every incoming filtered        edge  rising and falling . The counter value is uneven in case of        detected rising  and even in case of detected falling edge. Thus  the        input signal level is part of the counter and can be obtained by bit 0        of ECNT .</description>
								<lsb>24</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH7_CNT</name>
						<description>TIM0 Channel 7 SMU Counter Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>904</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CNT</name>
								<description>Actual SMU counter value. The meaning of this value depends on the configured mode  TPWM   actual duration of PWM signal.TPIM   actual duration of all        pulses  sum of pulses .TIEM   actual number of received edges.TIPM          actual number of received edges.TGPS   elapsed time for periodic        sampling.TSSM   shift data.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH7_ECNT</name>
						<description>TIM0 Channel 7 SMU Edge Counter Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>908</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ECNT</name>
								<description>Edge counter. If TIM channel is disabled the content of ECNT gets frozen. A read will        auto clear the bits  15 1 . Further read accesses to ECNT will show on        Bit 0 the actual input signal value of the channel.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH7_CNTS</name>
						<description>TIM0 Channel 7 SMU Shadow Counter Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>912</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CNTS</name>
								<description>Counter shadow register. The content of this register has different meaning for the TIM channels        modes. The content depends directly on the bit field CNTS SEL of register TIM i  CH x  CTRL . The register TIM i  CH x  CNTS is only        writable in TIPM TBCM  TGPS and TSSM mode.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECNT</name>
								<description>Edge counter   ECNT. The ECNT counts every incoming filtered        edge  rising and falling . The counter value is uneven in case of        detected rising  and even in case of detected falling edge. Thus  the        input signal level is part of the counter and can be obtained by bit 0        of ECNT .</description>
								<lsb>24</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH7_TDUC</name>
						<description>TIM0 Channel 7 TDU Counter Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>916</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TO_CNT</name>
								<description>Current Timeout value slice0 for channel x. SLICING    0b11  counter will be reset to 0X0 on TDU RESYNC condition. SLICING   0b11   counter will be loaded with TOV2 on TDU RESYNC        condition.</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TO_CNT1</name>
								<description>Current Timeout value slice1 for channel x. Counter will be reset to 0x0 on TDU RESYNC condition.</description>
								<lsb>8</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TO_CNT2</name>
								<description>Current Timeout value slice2 for channel x. Counter will be reset to 0x0 on TDU RESYNC condition.</description>
								<lsb>16</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH7_TDUV</name>
						<description>TIM0 Channel 7 TDU Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>920</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TOV</name>
								<description>Time out compare value slice0 for channel x. Compare value for TO CNT.</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TOV1</name>
								<description>Time out compare value slice1 for channel x. Compare value for TO CNT1.</description>
								<lsb>8</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TOV2</name>
								<description>Time out compare value slice2 for channel x. SLICING  0b11  Compare value for TO CNT2. SLICING  0b11  TOV2 operate as a shadow register for TO CNT.</description>
								<lsb>16</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SLICING</name>
								<description>Cascading of counter slices. If USE LUT 0b00   USE LUT   0b00</description>
								<lsb>24</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TCS_USE_SAMPLE_EVT</name>
								<description>Use tdu sample evt as Timeout Clock</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TDU_SAME_CNT_CLK</name>
								<description>Define clocking of TO CNT  TO CNT1</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TCS</name>
								<description>Timeout Clock selection</description>
								<lsb>28</lsb>
								<msb>30</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH7_FLT_RE</name>
						<description>TIM0 Channel 7 Filter Parameter 0 Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>924</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>FLT_RE</name>
								<description>Filter parameter for rising edge. FLT RE has different meanings in the various filter modes.Immediate edge        propagation mode   acceptance time for rising edgeIndividual deglitch        time mode   deglitch time for rising edge.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH7_FLT_FE</name>
						<description>TIM0 Channel 7 Filter Parameter 1 Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>928</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>FLT_FE</name>
								<description>Filter parameter for falling edge. FLT FE has different meanings in the various filter modes.Immediate edge propagation mode   acceptance time for falling edge Individual deglitch time mode   deglitch time for falling edge.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH7_CTRL</name>
						<description>TIM0 Channel 7 Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>932</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TIM_EN</name>
								<description>TIM channel x enable. Enabling of the channel resets the registers ECNT         TIM i  CH x  CNT  TIM i  CH x  GPR0  and TIM i  CH x  GPR1 to their reset values. After finishing the action in one shot mode the TIM EN bit is cleared automatically. Otherwise  the bit must be cleared        manually.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TIM_MODE</name>
								<description>TIM channel x mode. If an undefined value is written to the TIM MODE register  the hardware        switches automatically to TIM MODE   0b000  TPWM mode . The TIM MODE register should not be changed while the TIM channel is        enabled. If the TIM channel is enabled and operating in TPWM or TPIM mode after        the first valid edge defined by DSL has occurred  a reconfiguration of        DSL ISL TIM MODE will not change the channel behavior. Reading these bit        fields after reconfiguration will show the newly configured settings but        the initial channel behavior will not change. Only a disabling of the        TIM channel by setting TIM EN  0 and reenabling with TIM EN  1 will        change the channel operation mode.</description>
								<lsb>1</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OSM</name>
								<description>One shot mode. After finishing the action in one shot mode the TIM EN bit is cleared automatically.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ARU_EN</name>
								<description>GPR0 and GPR1 register values routed to ARU</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CICTRL</name>
								<description>Channel Input Control</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBU0_SEL</name>
								<description>TBU TS0 bits input select for TIM0 CH x  GPRz  z  0  1 . This bit is only applicable for TIM0.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GPR0_SEL</name>
								<description>Selection for GPR0 register. If EGPR0 SEL  0   EGPR0 SEL  1   If a reserved value is written to the EGPR0 SEL  GPR0 SEL bit fields         the hardware will use TBU TS0 input.</description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GPR1_SEL</name>
								<description>Selection for GPR1 register. If EGPR1 SEL  0   EGPR1 SEL  1  If a reserved value is written to the EGPR1 SEL  GPR1 SEL bit fields         the hardware will use TBU TS0 input. Note  In TBCM mode  EGPR1 SEL 1         GPR1 SEL 01 selects TIM INP VAL as input  in all other cases  TIM Filter        F OUT is used.</description>
								<lsb>10</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CNTS_SEL</name>
								<description>Selection for CNTS register. The functionality of the CNTS SEL is        disabled in the modes TIPM TGPS and TBCM. CNTS SEL in TSSM mode selects the source        signal for registered or latched shift out operation. 0 B   160   160   160   160   160 use F OUTx 1 B   160   160   160   160   160 use TIM INx</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DSL</name>
								<description>Signal level control. In TIM MODE 0b110  TSSM   the bit field DSL defines the shift direction. 0 B   160   160   160   160   160 Shift left 1 B   160   160   160   160   160 Shift right</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ISL</name>
								<description>Ignore signal level. This bit is mode dependent and will have different meanings  see details        in the TIM Channel mode description .</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECNT_RESET</name>
								<description>Enables resetting of counter in certain modes. If TIM MODE 0b101  TGPS    TIM MODE 0b000  TPWM  else ECNT counter operating in wrap around mode  In TIM MODE 0b110  TSSM   the bit field ECNT RESET defines the initial        polarity for the shift register.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FLT_EN</name>
								<description>Filter enable for channel x. If the filter is disabled  all filter related units  including CSU  are        bypassed  which means that the signal F IN is directly routed to signal F OUT .</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FLT_CNT_FRQ</name>
								<description>Filter counter frequency select</description>
								<lsb>17</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EXT_CAP_EN</name>
								<description>Enables external capture mode. The selected TIM mode is only sensitive to external capture pulses the        input event changes are ignored.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FLT_MODE_RE</name>
								<description>Filter mode for rising edge. Coding see CROSSREFERENCE . Coding see Family Spec.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FLT_CTR_RE</name>
								<description>Filter counter mode for rising edge. Coding see CROSSREFERENCE . Coding see Family Spec.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FLT_MODE_FE</name>
								<description>Filter mode for falling edge. Coding see CROSSREFERENCE . Coding see Family Spec.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FLT_CTR_FE</name>
								<description>Filter counter mode for falling edge. Coding see CROSSREFERENCE . Coding see Family Spec.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK_SEL</name>
								<description>CMU clock source select for channel. If ECLK SEL  0   ECLK SEL  1 </description>
								<lsb>24</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FR_ECNT_OFL</name>
								<description>Extended Edge counter overflow behavior</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EGPR0_SEL</name>
								<description>Extension of GPR0 SEL bit field. Details described in GPR0 SEL bit field.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EGPR1_SEL</name>
								<description>Extension of GPR1 SEL bit field. Details described in GPR1 SEL bit field.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TOCTRL</name>
								<description>Timeout control. It has to be mentioned that writing of TOCTRL  0 will every time stop        the TDU  independent of the previous state of TOCTRL.</description>
								<lsb>30</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
