J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>TIMi_IN_SRC</name>
						<description>TIM0 AUX IN Source Selection Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>120</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>VAL_0</name>
								<description>Value to be fed to Channel 7. Multicore encoding in use   VAL x 1  defines        the state of the signal . Function depends on the combination of VAL x 1  and MODE x 1  see MODE 0        description. Any read access to a VAL x bit field will        always result in a value 00 or 11 indicating current state. A        modification of the state is only performed with the values 01 and 10.        Writing the values 00 and 11 is always ignored.</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MODE_0</name>
								<description>Input source to Channel 7. Multicore encoding in use   MODE x 1  defines the state of the signal . Function table  MODE x 1  0   VAL x 1   0           160   160   160   160 The input signal defined by bit field CICTRL of the TIM channel is used   160   160   160   160 as input source. MODE x 1  0   VAL x 1   1    160   160   160   160 The signal TIM AUX IN of the TIM channel is used as input source. MODE x 1  1     160   160   160   160 The state VAL x 1  defines the input level for the TIM channel. Any read access to a MODE x bit field will        always result in a value 00 or 11 indicating current state. A        modification of the state is only performed with the values 01 and 10.        Writing the values 00 and 11 is always ignored.</description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VAL_1</name>
								<description>Value to be fed to Channel 7. Multicore encoding in use   VAL x 1  defines        the state of the signal . Function depends on the combination of VAL x 1  and MODE x 1  see MODE 0        description. Any read access to a VAL x bit field will        always result in a value 00 or 11 indicating current state. A        modification of the state is only performed with the values 01 and 10.        Writing the values 00 and 11 is always ignored.</description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MODE_1</name>
								<description>Input source to Channel 7. Multicore encoding in use   MODE x 1  defines the state of the signal . Function table  MODE x 1  0   VAL x 1   0           160   160   160   160 The input signal defined by bit field CICTRL of the TIM channel is used   160   160   160   160 as input source. MODE x 1  0   VAL x 1   1    160   160   160   160 The signal TIM AUX IN of the TIM channel is used as input source. MODE x 1  1     160   160   160   160 The state VAL x 1  defines the input level for the TIM channel. Any read access to a MODE x bit field will        always result in a value 00 or 11 indicating current state. A        modification of the state is only performed with the values 01 and 10.        Writing the values 00 and 11 is always ignored.</description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VAL_2</name>
								<description>Value to be fed to Channel 7. Multicore encoding in use   VAL x 1  defines        the state of the signal . Function depends on the combination of VAL x 1  and MODE x 1  see MODE 0        description. Any read access to a VAL x bit field will        always result in a value 00 or 11 indicating current state. A        modification of the state is only performed with the values 01 and 10.        Writing the values 00 and 11 is always ignored.</description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MODE_2</name>
								<description>Input source to Channel 7. Multicore encoding in use   MODE x 1  defines the state of the signal . Function table  MODE x 1  0   VAL x 1   0           160   160   160   160 The input signal defined by bit field CICTRL of the TIM channel is used   160   160   160   160 as input source. MODE x 1  0   VAL x 1   1    160   160   160   160 The signal TIM AUX IN of the TIM channel is used as input source. MODE x 1  1     160   160   160   160 The state VAL x 1  defines the input level for the TIM channel. Any read access to a MODE x bit field will        always result in a value 00 or 11 indicating current state. A        modification of the state is only performed with the values 01 and 10.        Writing the values 00 and 11 is always ignored.</description>
								<lsb>10</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VAL_3</name>
								<description>Value to be fed to Channel 7. Multicore encoding in use   VAL x 1  defines        the state of the signal . Function depends on the combination of VAL x 1  and MODE x 1  see MODE 0        description. Any read access to a VAL x bit field will        always result in a value 00 or 11 indicating current state. A        modification of the state is only performed with the values 01 and 10.        Writing the values 00 and 11 is always ignored.</description>
								<lsb>12</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MODE_3</name>
								<description>Input source to Channel 7. Multicore encoding in use   MODE x 1  defines the state of the signal . Function table  MODE x 1  0   VAL x 1   0           160   160   160   160 The input signal defined by bit field CICTRL of the TIM channel is used   160   160   160   160 as input source. MODE x 1  0   VAL x 1   1    160   160   160   160 The signal TIM AUX IN of the TIM channel is used as input source. MODE x 1  1     160   160   160   160 The state VAL x 1  defines the input level for the TIM channel. Any read access to a MODE x bit field will        always result in a value 00 or 11 indicating current state. A        modification of the state is only performed with the values 01 and 10.        Writing the values 00 and 11 is always ignored.</description>
								<lsb>14</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VAL_4</name>
								<description>Value to be fed to Channel 7. Multicore encoding in use   VAL x 1  defines        the state of the signal . Function depends on the combination of VAL x 1  and MODE x 1  see MODE 0        description. Any read access to a VAL x bit field will        always result in a value 00 or 11 indicating current state. A        modification of the state is only performed with the values 01 and 10.        Writing the values 00 and 11 is always ignored.</description>
								<lsb>16</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MODE_4</name>
								<description>Input source to Channel 7. Multicore encoding in use   MODE x 1  defines the state of the signal . Function table  MODE x 1  0   VAL x 1   0           160   160   160   160 The input signal defined by bit field CICTRL of the TIM channel is used   160   160   160   160 as input source. MODE x 1  0   VAL x 1   1    160   160   160   160 The signal TIM AUX IN of the TIM channel is used as input source. MODE x 1  1     160   160   160   160 The state VAL x 1  defines the input level for the TIM channel. Any read access to a MODE x bit field will        always result in a value 00 or 11 indicating current state. A        modification of the state is only performed with the values 01 and 10.        Writing the values 00 and 11 is always ignored.</description>
								<lsb>18</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VAL_5</name>
								<description>Value to be fed to Channel 7. Multicore encoding in use   VAL x 1  defines        the state of the signal . Function depends on the combination of VAL x 1  and MODE x 1  see MODE 0        description. Any read access to a VAL x bit field will        always result in a value 00 or 11 indicating current state. A        modification of the state is only performed with the values 01 and 10.        Writing the values 00 and 11 is always ignored.</description>
								<lsb>20</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MODE_5</name>
								<description>Input source to Channel 7. Multicore encoding in use   MODE x 1  defines the state of the signal . Function table  MODE x 1  0   VAL x 1   0           160   160   160   160 The input signal defined by bit field CICTRL of the TIM channel is used   160   160   160   160 as input source. MODE x 1  0   VAL x 1   1    160   160   160   160 The signal TIM AUX IN of the TIM channel is used as input source. MODE x 1  1     160   160   160   160 The state VAL x 1  defines the input level for the TIM channel. Any read access to a MODE x bit field will        always result in a value 00 or 11 indicating current state. A        modification of the state is only performed with the values 01 and 10.        Writing the values 00 and 11 is always ignored.</description>
								<lsb>22</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VAL_6</name>
								<description>Value to be fed to Channel 7. Multicore encoding in use   VAL x 1  defines        the state of the signal . Function depends on the combination of VAL x 1  and MODE x 1  see MODE 0        description. Any read access to a VAL x bit field will        always result in a value 00 or 11 indicating current state. A        modification of the state is only performed with the values 01 and 10.        Writing the values 00 and 11 is always ignored.</description>
								<lsb>24</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MODE_6</name>
								<description>Input source to Channel 7. Multicore encoding in use   MODE x 1  defines the state of the signal . Function table  MODE x 1  0   VAL x 1   0           160   160   160   160 The input signal defined by bit field CICTRL of the TIM channel is used   160   160   160   160 as input source. MODE x 1  0   VAL x 1   1    160   160   160   160 The signal TIM AUX IN of the TIM channel is used as input source. MODE x 1  1     160   160   160   160 The state VAL x 1  defines the input level for the TIM channel. Any read access to a MODE x bit field will        always result in a value 00 or 11 indicating current state. A        modification of the state is only performed with the values 01 and 10.        Writing the values 00 and 11 is always ignored.</description>
								<lsb>26</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VAL_7</name>
								<description>Value to be fed to Channel 7. Multicore encoding in use   VAL x 1  defines        the state of the signal . Function depends on the combination of VAL x 1  and MODE x 1  see MODE 0        description. Any read access to a VAL x bit field will        always result in a value 00 or 11 indicating current state. A        modification of the state is only performed with the values 01 and 10.        Writing the values 00 and 11 is always ignored.</description>
								<lsb>28</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MODE_7</name>
								<description>Input source to Channel 7. Multicore encoding in use   MODE x 1  defines the state of the signal . Function table  MODE x 1  0   VAL x 1   0           160   160   160   160 The input signal defined by bit field CICTRL of the TIM channel is used   160   160   160   160 as input source. MODE x 1  0   VAL x 1   1    160   160   160   160 The signal TIM AUX IN of the TIM channel is used as input source. MODE x 1  1     160   160   160   160 The state VAL x 1  defines the input level for the TIM channel. Any read access to a MODE x bit field will        always result in a value 00 or 11 indicating current state. A        modification of the state is only performed with the values 01 and 10.        Writing the values 00 and 11 is always ignored.</description>
								<lsb>30</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TIMi_RST</name>
						<description>TIM0 Global Software Reset Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>124</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RST_CH0</name>
								<description>Software reset of channel 7. This bit is cleared automatically after write by CPU. The channel        registers are set to their reset values and channel operation is stopped        immediately. Please note  that the RST field width of this register depends on the        number of implemented channels m within this sub module. This register        description represents a register layout for m   8.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RST_CH1</name>
								<description>Software reset of channel 7. This bit is cleared automatically after write by CPU. The channel        registers are set to their reset values and channel operation is stopped        immediately. Please note  that the RST field width of this register depends on the        number of implemented channels m within this sub module. This register        description represents a register layout for m   8.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RST_CH2</name>
								<description>Software reset of channel 7. This bit is cleared automatically after write by CPU. The channel        registers are set to their reset values and channel operation is stopped        immediately. Please note  that the RST field width of this register depends on the        number of implemented channels m within this sub module. This register        description represents a register layout for m   8.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RST_CH3</name>
								<description>Software reset of channel 7. This bit is cleared automatically after write by CPU. The channel        registers are set to their reset values and channel operation is stopped        immediately. Please note  that the RST field width of this register depends on the        number of implemented channels m within this sub module. This register        description represents a register layout for m   8.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RST_CH4</name>
								<description>Software reset of channel 7. This bit is cleared automatically after write by CPU. The channel        registers are set to their reset values and channel operation is stopped        immediately. Please note  that the RST field width of this register depends on the        number of implemented channels m within this sub module. This register        description represents a register layout for m   8.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RST_CH5</name>
								<description>Software reset of channel 7. This bit is cleared automatically after write by CPU. The channel        registers are set to their reset values and channel operation is stopped        immediately. Please note  that the RST field width of this register depends on the        number of implemented channels m within this sub module. This register        description represents a register layout for m   8.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RST_CH6</name>
								<description>Software reset of channel 7. This bit is cleared automatically after write by CPU. The channel        registers are set to their reset values and channel operation is stopped        immediately. Please note  that the RST field width of this register depends on the        number of implemented channels m within this sub module. This register        description represents a register layout for m   8.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RST_CH7</name>
								<description>Software reset of channel 7. This bit is cleared automatically after write by CPU. The channel        registers are set to their reset values and channel operation is stopped        immediately. Please note  that the RST field width of this register depends on the        number of implemented channels m within this sub module. This register        description represents a register layout for m   8.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
