J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>CH12_CTRL</name>
						<description>TOM0 Channel 15 Control Register
 resetvalue={Application Reset:0x0800}</description>
						<addressOffset>768</addressOffset>
						<size>32</size>
						<resetValue>2048</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SR0_TRIG</name>
								<description>SR0 is used to generate a trigger on output TOM i  CH x  OUT T if equal to CN0. Note  This bit should only be set if RST CCU0 of this channel is 0.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SL</name>
								<description>Signal level for duty cycle. If the output is disabled  the output TOM OUT x  is set to the inverse        value of SL. Reset value depends on the hardware configuration chosen by silicon        vendor.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK_SRC_SR</name>
								<description>Clock source select for channel. The register CLK SRC is updated with the value of CLK SRC SR together        with the update of register CM0 and CM1. The input of the FX clock divider depends on the value of FXCLK SEL  see        CMU . This register is a shadow register for the register CLK SRC. Thus  if          the CMU CLK source for PWM generation should be changed during          operation  the old CMU CLK has to operate until the update of the ATOM          channels internal CLK SRC register by the CLK SRC SR content is done          either by an end of a period or a forced update. If clock of channel is stopped  i.e. ECLK SRC 0 and CLK SRC  101   110   111             the channel can only be restarted by resetting CLK SRC SR to a value          of 000 to 100 and forcing an update via the force update mechanism. If ECLK SRC 0   ECLK SRC 1 </description>
								<lsb>12</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECLK_SRC</name>
								<description>Extend CLK SRC</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRIG_PULSE</name>
								<description>Trigger output pulse length of one SYS CLK period</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>UDMODE</name>
								<description>Up down counter mode</description>
								<lsb>18</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RST_CCU0</name>
								<description>Reset source of CCU0. On TOM channel 2  SPEM 1 has special meaning. If SPEM   1  the signal          SPE NIPD triggers the reset of CN0 independent of RST CN0. This bit should only be set if bit OSM 0  i.e. in continuous mode .</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OSM_TRIG</name>
								<description>Enable trigger of one shot pulse by trigger signal OSM TRIG. Note  This bit should only be set if bit OSM 1 and bit RST CCU0 0.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EXT_TRIG</name>
								<description>Select TIM EXT CAPTURE x  as trigger signal</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EXTTRIGOUT</name>
								<description>TIM EXT CAPTURE x  as potential output signal TRIG  x </description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRIGOUT</name>
								<description>Trigger output selection  output signal TRIG  x   of module TOM CH x </description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SPE_TRIG</name>
								<description>SPE trigger to reset CN0. For TOM channel 2  6 and 7  this bit defines  in combination with bit        SPEM  the source of output pin TOM i  CH x  OUT  and if CN0 can be reset        by TOM input signal SPE i  NIPD. For TOM channel 8 and 9  this bit defines only if CN0 reset is defined          by input signal SPE i  NIPD or by configuration of RST CCU0. The          output TOM i  CH x  OUT is not affected. The configuration bit SPEM is          not available for these channels  and thus assumed to be 0. If a configuration of SPEM   SPE TRIG   0   1 or 1   0 is chosen  i.e.          CN0 is reset by signal SPE i  NIPD   the one shot mode in          corresponding TOM channel should also be enabled by setting bit OSM 1          to generate one PWM pulse in case of trigger SPE i  NIPD. In SPE module  one of the trigger signals TOM i  CH2 TRIG CCU1           TOM i  CH6 TRIG CCU1  TOM i  CH7 TRIG CCU1  TOM i  CH8 TRIG CCU1  or          TOM i  CH9 TRIG CCU1 can be used to trigger the update of register          SPE i  OUT CTRL. If SPEM 0   SPEM 1 </description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OSM</name>
								<description>One shot mode. In this mode  the counter CN0 counts for only one period. The length of        period is defined by CM0. A write access to the register CN0 triggers        the start of counting.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BITREV</name>
								<description>Bit reversing of output of counter register CN0. Note  This bit enables the PCM mode of channel 15.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SPEM</name>
								<description>SPE output mode enable for channel. Note  The SPE output mode is only implemented for TOM instances connected to an SPE module  and only for TOM channels 0 to 7. Note  For TOM channel 2  6 and 7  this bit defines  in combination with bit SPE TRIG  the source of output pin TOM i  CH x  OUT  and if CN0 can be reset by TOM input signal SPE i  NIPD .</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GCM</name>
								<description>Gated Counter Mode enable. The Gated Counter mode is only available for TOM instances connected to        an SPE module  and only for channels 0 to 7.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FREEZE</name>
								<description>FREEZE</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH12_SR0</name>
						<description>TOM0 Channel 15 CCU0 Compare Shadow Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>772</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SR0</name>
								<description>TOM channel x shadow register SR0 for update of compare register CM0</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH12_SR1</name>
						<description>TOM0 Channel 15 CCU1 Compare Shadow Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>776</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SR1</name>
								<description>TOM channel x shadow register SR1 for update of compare register CM1</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH12_CM0</name>
						<description>TOM0 Channel 15 CCU0 Compare Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>780</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CM0</name>
								<description>TOM CCU0 compare register. Setting CM0  lt  CM1 configures a duty cycle of 100 .</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH12_CM1</name>
						<description>TOM0 Channel 15 CCU1 Compare Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>784</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CM1</name>
								<description>TOM CCU1 compare register. Setting CM1   0 configures a duty cycle of 0   independent of the        configured value of CM0.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH12_CN0</name>
						<description>TOM0 Channel 15 CCU0 Counter Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>788</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CN0</name>
								<description>TOM CCU0 counter register. This counter is stopped if the TOM channel is disabled and not reset on        an enable event of TOM channel.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH12_STAT</name>
						<description>TOM0 Channel 15 Status Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>792</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>OL</name>
								<description>Output level of output TOM OUT x . Reset value is the inverted value of SL bit  which depends on the        hardware configuration chosen by silicon vendor.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH12_IRQ_NOTIFY</name>
						<description>TOM0 Channel 15 Interrupt Notification Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>796</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CCU0TC</name>
								<description>CCU0 Trigger condition interrupt for channel x. The notification of the interrupt is only triggered one time after        reaching the condition CN0  gt   CM0. To enable re trigger of the        notification  first the condition CN0  lt  CM1 has to be reached. Note  This bit will be cleared on a CPU write access of value 1. A        read access leaves the bit unchanged. Note  This        description differs to the description in the Bosch spec.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CCU1TC</name>
								<description>CCU1 Trigger condition interrupt for channel x. The notification of the interrupt is only triggered one time after        reaching the condition CN0  gt   CM1. To enable re trigger of the        notification  first the condition CN0  lt  CM1 has to be reached. Note  This bit will be cleared on a CPU write access of value 1. A        read access leaves the bit unchanged. Note  This        description differs to the description in the Bosch spec.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH12_IRQ_EN</name>
						<description>TOM0 Channel 15 Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>800</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CCU0TC_IRQ_EN</name>
								<description>TOM CCU0TC IRQ interrupt enable</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CCU1TC_IRQ_EN</name>
								<description>TOM CCU1TC IRQ interrupt enable. Coding see bit 0.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH12_IRQ_FORCINT</name>
						<description>TOM0 Channel 15 Force Interrupt Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>804</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TRG_CCU0TC0</name>
								<description>Trigger TOM CCU0TC0 IRQ interrupt by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_CCU1TC0</name>
								<description>Trigger TOM CCU1TC0 IRQ interrupt by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH12_IRQ_MODE</name>
						<description>TOM0 Channel 15 Interrupt Mode Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>808</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>IRQ_MODE</name>
								<description>IRQ mode selection. The interrupt modes are described in CROSSREFERENCE .</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH13_CTRL</name>
						<description>TOM0 Channel 15 Control Register
 resetvalue={Application Reset:0x0800}</description>
						<addressOffset>832</addressOffset>
						<size>32</size>
						<resetValue>2048</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SR0_TRIG</name>
								<description>SR0 is used to generate a trigger on output TOM i  CH x  OUT T if equal to CN0. Note  This bit should only be set if RST CCU0 of this channel is 0.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SL</name>
								<description>Signal level for duty cycle. If the output is disabled  the output TOM OUT x  is set to the inverse        value of SL. Reset value depends on the hardware configuration chosen by silicon        vendor.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK_SRC_SR</name>
								<description>Clock source select for channel. The register CLK SRC is updated with the value of CLK SRC SR together        with the update of register CM0 and CM1. The input of the FX clock divider depends on the value of FXCLK SEL  see        CMU . This register is a shadow register for the register CLK SRC. Thus  if          the CMU CLK source for PWM generation should be changed during          operation  the old CMU CLK has to operate until the update of the ATOM          channels internal CLK SRC register by the CLK SRC SR content is done          either by an end of a period or a forced update. If clock of channel is stopped  i.e. ECLK SRC 0 and CLK SRC  101   110   111             the channel can only be restarted by resetting CLK SRC SR to a value          of 000 to 100 and forcing an update via the force update mechanism. If ECLK SRC 0   ECLK SRC 1 </description>
								<lsb>12</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECLK_SRC</name>
								<description>Extend CLK SRC</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRIG_PULSE</name>
								<description>Trigger output pulse length of one SYS CLK period</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>UDMODE</name>
								<description>Up down counter mode</description>
								<lsb>18</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RST_CCU0</name>
								<description>Reset source of CCU0. On TOM channel 2  SPEM 1 has special meaning. If SPEM   1  the signal          SPE NIPD triggers the reset of CN0 independent of RST CN0. This bit should only be set if bit OSM 0  i.e. in continuous mode .</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OSM_TRIG</name>
								<description>Enable trigger of one shot pulse by trigger signal OSM TRIG. Note  This bit should only be set if bit OSM 1 and bit RST CCU0 0.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EXT_TRIG</name>
								<description>Select TIM EXT CAPTURE x  as trigger signal</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EXTTRIGOUT</name>
								<description>TIM EXT CAPTURE x  as potential output signal TRIG  x </description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRIGOUT</name>
								<description>Trigger output selection  output signal TRIG  x   of module TOM CH x </description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SPE_TRIG</name>
								<description>SPE trigger to reset CN0. For TOM channel 2  6 and 7  this bit defines  in combination with bit        SPEM  the source of output pin TOM i  CH x  OUT  and if CN0 can be reset        by TOM input signal SPE i  NIPD. For TOM channel 8 and 9  this bit defines only if CN0 reset is defined          by input signal SPE i  NIPD or by configuration of RST CCU0. The          output TOM i  CH x  OUT is not affected. The configuration bit SPEM is          not available for these channels  and thus assumed to be 0. If a configuration of SPEM   SPE TRIG   0   1 or 1   0 is chosen  i.e.          CN0 is reset by signal SPE i  NIPD   the one shot mode in          corresponding TOM channel should also be enabled by setting bit OSM 1          to generate one PWM pulse in case of trigger SPE i  NIPD. In SPE module  one of the trigger signals TOM i  CH2 TRIG CCU1           TOM i  CH6 TRIG CCU1  TOM i  CH7 TRIG CCU1  TOM i  CH8 TRIG CCU1  or          TOM i  CH9 TRIG CCU1 can be used to trigger the update of register          SPE i  OUT CTRL. If SPEM 0   SPEM 1 </description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OSM</name>
								<description>One shot mode. In this mode  the counter CN0 counts for only one period. The length of        period is defined by CM0. A write access to the register CN0 triggers        the start of counting.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BITREV</name>
								<description>Bit reversing of output of counter register CN0. Note  This bit enables the PCM mode of channel 15.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SPEM</name>
								<description>SPE output mode enable for channel. Note  The SPE output mode is only implemented for TOM instances connected to an SPE module  and only for TOM channels 0 to 7. Note  For TOM channel 2  6 and 7  this bit defines  in combination with bit SPE TRIG  the source of output pin TOM i  CH x  OUT  and if CN0 can be reset by TOM input signal SPE i  NIPD .</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GCM</name>
								<description>Gated Counter Mode enable. The Gated Counter mode is only available for TOM instances connected to        an SPE module  and only for channels 0 to 7.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FREEZE</name>
								<description>FREEZE</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH13_SR0</name>
						<description>TOM0 Channel 15 CCU0 Compare Shadow Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>836</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SR0</name>
								<description>TOM channel x shadow register SR0 for update of compare register CM0</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH13_SR1</name>
						<description>TOM0 Channel 15 CCU1 Compare Shadow Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>840</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SR1</name>
								<description>TOM channel x shadow register SR1 for update of compare register CM1</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH13_CM0</name>
						<description>TOM0 Channel 15 CCU0 Compare Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>844</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CM0</name>
								<description>TOM CCU0 compare register. Setting CM0  lt  CM1 configures a duty cycle of 100 .</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
