J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>TGC0_FUPD_CTRL</name>
						<description>TOM0 TGC0 Force Update Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>56</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>FUPD_CTRL0</name>
								<description>Force update of TOM channel 7 operation registers. If enabled  force update of register CM0  CM1 and CLK SRC triggered by        HOST TRIG  ACT TB compare match  or internal trigger. Write   Read  The force update request is stored and executed synchronized to the        selected FXCLK.</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FUPD_CTRL1</name>
								<description>Force update of TOM channel 7 operation registers. If enabled  force update of register CM0  CM1 and CLK SRC triggered by        HOST TRIG  ACT TB compare match  or internal trigger. Write   Read  The force update request is stored and executed synchronized to the        selected FXCLK.</description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FUPD_CTRL2</name>
								<description>Force update of TOM channel 7 operation registers. If enabled  force update of register CM0  CM1 and CLK SRC triggered by        HOST TRIG  ACT TB compare match  or internal trigger. Write   Read  The force update request is stored and executed synchronized to the        selected FXCLK.</description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FUPD_CTRL3</name>
								<description>Force update of TOM channel 7 operation registers. If enabled  force update of register CM0  CM1 and CLK SRC triggered by        HOST TRIG  ACT TB compare match  or internal trigger. Write   Read  The force update request is stored and executed synchronized to the        selected FXCLK.</description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FUPD_CTRL4</name>
								<description>Force update of TOM channel 7 operation registers. If enabled  force update of register CM0  CM1 and CLK SRC triggered by        HOST TRIG  ACT TB compare match  or internal trigger. Write   Read  The force update request is stored and executed synchronized to the        selected FXCLK.</description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FUPD_CTRL5</name>
								<description>Force update of TOM channel 7 operation registers. If enabled  force update of register CM0  CM1 and CLK SRC triggered by        HOST TRIG  ACT TB compare match  or internal trigger. Write   Read  The force update request is stored and executed synchronized to the        selected FXCLK.</description>
								<lsb>10</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FUPD_CTRL6</name>
								<description>Force update of TOM channel 7 operation registers. If enabled  force update of register CM0  CM1 and CLK SRC triggered by        HOST TRIG  ACT TB compare match  or internal trigger. Write   Read  The force update request is stored and executed synchronized to the        selected FXCLK.</description>
								<lsb>12</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FUPD_CTRL7</name>
								<description>Force update of TOM channel 7 operation registers. If enabled  force update of register CM0  CM1 and CLK SRC triggered by        HOST TRIG  ACT TB compare match  or internal trigger. Write   Read  The force update request is stored and executed synchronized to the        selected FXCLK.</description>
								<lsb>14</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSTCN0_CH0</name>
								<description>Reset CN0 of channel 7 on force update event. If enabled  reset CN0 triggered by HOST TRIG  ACT TB compare match  or        internal trigger. Write   Read </description>
								<lsb>16</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSTCN0_CH1</name>
								<description>Reset CN0 of channel 7 on force update event. If enabled  reset CN0 triggered by HOST TRIG  ACT TB compare match  or        internal trigger. Write   Read </description>
								<lsb>18</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSTCN0_CH2</name>
								<description>Reset CN0 of channel 7 on force update event. If enabled  reset CN0 triggered by HOST TRIG  ACT TB compare match  or        internal trigger. Write   Read </description>
								<lsb>20</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSTCN0_CH3</name>
								<description>Reset CN0 of channel 7 on force update event. If enabled  reset CN0 triggered by HOST TRIG  ACT TB compare match  or        internal trigger. Write   Read </description>
								<lsb>22</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSTCN0_CH4</name>
								<description>Reset CN0 of channel 7 on force update event. If enabled  reset CN0 triggered by HOST TRIG  ACT TB compare match  or        internal trigger. Write   Read </description>
								<lsb>24</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSTCN0_CH5</name>
								<description>Reset CN0 of channel 7 on force update event. If enabled  reset CN0 triggered by HOST TRIG  ACT TB compare match  or        internal trigger. Write   Read </description>
								<lsb>26</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSTCN0_CH6</name>
								<description>Reset CN0 of channel 7 on force update event. If enabled  reset CN0 triggered by HOST TRIG  ACT TB compare match  or        internal trigger. Write   Read </description>
								<lsb>28</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSTCN0_CH7</name>
								<description>Reset CN0 of channel 7 on force update event. If enabled  reset CN0 triggered by HOST TRIG  ACT TB compare match  or        internal trigger. Write   Read </description>
								<lsb>30</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TGC0_INT_TRIG</name>
						<description>TOM0 TGC0 Internal Trigger Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>60</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>INT_TRIG0</name>
								<description>Select input signal TRIG 7 as a trigger source. Write   Read </description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INT_TRIG1</name>
								<description>Select input signal TRIG 7 as a trigger source. Write   Read </description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INT_TRIG2</name>
								<description>Select input signal TRIG 7 as a trigger source. Write   Read </description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INT_TRIG3</name>
								<description>Select input signal TRIG 7 as a trigger source. Write   Read </description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INT_TRIG4</name>
								<description>Select input signal TRIG 7 as a trigger source. Write   Read </description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INT_TRIG5</name>
								<description>Select input signal TRIG 7 as a trigger source. Write   Read </description>
								<lsb>10</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INT_TRIG6</name>
								<description>Select input signal TRIG 7 as a trigger source. Write   Read </description>
								<lsb>12</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INT_TRIG7</name>
								<description>Select input signal TRIG 7 as a trigger source. Write   Read </description>
								<lsb>14</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TGC0_ENDIS_CTRL</name>
						<description>TOM0 TGC0 Enable Disable Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>112</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ENDIS_CTRL0</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible  If the output is disabled  OUTEN 0  0   the TOM channel 0 output        TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_CTRL1</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible  If the output is disabled  OUTEN 0  0   the TOM channel 0 output        TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_CTRL2</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible  If the output is disabled  OUTEN 0  0   the TOM channel 0 output        TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_CTRL3</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible  If the output is disabled  OUTEN 0  0   the TOM channel 0 output        TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_CTRL4</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible  If the output is disabled  OUTEN 0  0   the TOM channel 0 output        TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_CTRL5</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible  If the output is disabled  OUTEN 0  0   the TOM channel 0 output        TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>10</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_CTRL6</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible  If the output is disabled  OUTEN 0  0   the TOM channel 0 output        TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>12</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_CTRL7</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible  If the output is disabled  OUTEN 0  0   the TOM channel 0 output        TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>14</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TGC0_ENDIS_STAT</name>
						<description>TOM0 TGC0 Enable Disable Status Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>116</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ENDIS_STAT0</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible </description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_STAT1</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible </description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_STAT2</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible </description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_STAT3</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible </description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_STAT4</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible </description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_STAT5</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible </description>
								<lsb>10</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_STAT6</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible </description>
								<lsb>12</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_STAT7</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible </description>
								<lsb>14</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
