J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>TGC0_OUTEN_CTRL</name>
						<description>TOM0 TGC0 Output Enable Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>120</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>OUTEN_CTRL0</name>
								<description>Output TOM i  CH7 OUT enable disable update value. Write of following double bit values is possible  If the channel is disabled  ENDIS 0  0  or the output is disabled         OUTEN 0  0   the TOM channel 0 output TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_CTRL1</name>
								<description>Output TOM i  CH7 OUT enable disable update value. Write of following double bit values is possible  If the channel is disabled  ENDIS 0  0  or the output is disabled         OUTEN 0  0   the TOM channel 0 output TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_CTRL2</name>
								<description>Output TOM i  CH7 OUT enable disable update value. Write of following double bit values is possible  If the channel is disabled  ENDIS 0  0  or the output is disabled         OUTEN 0  0   the TOM channel 0 output TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_CTRL3</name>
								<description>Output TOM i  CH7 OUT enable disable update value. Write of following double bit values is possible  If the channel is disabled  ENDIS 0  0  or the output is disabled         OUTEN 0  0   the TOM channel 0 output TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_CTRL4</name>
								<description>Output TOM i  CH7 OUT enable disable update value. Write of following double bit values is possible  If the channel is disabled  ENDIS 0  0  or the output is disabled         OUTEN 0  0   the TOM channel 0 output TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_CTRL5</name>
								<description>Output TOM i  CH7 OUT enable disable update value. Write of following double bit values is possible  If the channel is disabled  ENDIS 0  0  or the output is disabled         OUTEN 0  0   the TOM channel 0 output TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>10</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_CTRL6</name>
								<description>Output TOM i  CH7 OUT enable disable update value. Write of following double bit values is possible  If the channel is disabled  ENDIS 0  0  or the output is disabled         OUTEN 0  0   the TOM channel 0 output TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>12</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_CTRL7</name>
								<description>Output TOM i  CH7 OUT enable disable update value. Write of following double bit values is possible  If the channel is disabled  ENDIS 0  0  or the output is disabled         OUTEN 0  0   the TOM channel 0 output TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>14</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TGC0_OUTEN_STAT</name>
						<description>TOM0 TGC0 Output Enable Status Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>124</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>OUTEN_STAT0</name>
								<description>Control status of output TOM i  CH7 OUT. Write of following double bit values is possible </description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_STAT1</name>
								<description>Control status of output TOM i  CH7 OUT. Write of following double bit values is possible </description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_STAT2</name>
								<description>Control status of output TOM i  CH7 OUT. Write of following double bit values is possible </description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_STAT3</name>
								<description>Control status of output TOM i  CH7 OUT. Write of following double bit values is possible </description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_STAT4</name>
								<description>Control status of output TOM i  CH7 OUT. Write of following double bit values is possible </description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_STAT5</name>
								<description>Control status of output TOM i  CH7 OUT. Write of following double bit values is possible </description>
								<lsb>10</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_STAT6</name>
								<description>Control status of output TOM i  CH7 OUT. Write of following double bit values is possible </description>
								<lsb>12</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_STAT7</name>
								<description>Control status of output TOM i  CH7 OUT. Write of following double bit values is possible </description>
								<lsb>14</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TGC1_GLB_CTRL</name>
						<description>TOM0 TGC1 Global Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>560</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>HOST_TRIG</name>
								<description>Trigger request signal  see TGC0  TGC1  to update the register ENDIS STAT and OUTEN STAT. This flag is reset automatically after triggering the update.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RST_CH0</name>
								<description>Software reset of channel 7. This bit is cleared automatically after write by CPU. The channel        register are set to their reset values and channel x operation is        stopped immediately. The SR flip flop SOUR is set to  1 .</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RST_CH1</name>
								<description>Software reset of channel 7. This bit is cleared automatically after write by CPU. The channel        register are set to their reset values and channel x operation is        stopped immediately. The SR flip flop SOUR is set to  1 .</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RST_CH2</name>
								<description>Software reset of channel 7. This bit is cleared automatically after write by CPU. The channel        register are set to their reset values and channel x operation is        stopped immediately. The SR flip flop SOUR is set to  1 .</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RST_CH3</name>
								<description>Software reset of channel 7. This bit is cleared automatically after write by CPU. The channel        register are set to their reset values and channel x operation is        stopped immediately. The SR flip flop SOUR is set to  1 .</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RST_CH4</name>
								<description>Software reset of channel 7. This bit is cleared automatically after write by CPU. The channel        register are set to their reset values and channel x operation is        stopped immediately. The SR flip flop SOUR is set to  1 .</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RST_CH5</name>
								<description>Software reset of channel 7. This bit is cleared automatically after write by CPU. The channel        register are set to their reset values and channel x operation is        stopped immediately. The SR flip flop SOUR is set to  1 .</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RST_CH6</name>
								<description>Software reset of channel 7. This bit is cleared automatically after write by CPU. The channel        register are set to their reset values and channel x operation is        stopped immediately. The SR flip flop SOUR is set to  1 .</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RST_CH7</name>
								<description>Software reset of channel 7. This bit is cleared automatically after write by CPU. The channel        register are set to their reset values and channel x operation is        stopped immediately. The SR flip flop SOUR is set to  1 .</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>UPEN_CTRL0</name>
								<description>TOM channel 7 enable update of register CM0  CM1 and CLK SRC from SR0  SR1 and CLK SRC SR. Write   Read  </description>
								<lsb>16</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>UPEN_CTRL1</name>
								<description>TOM channel 7 enable update of register CM0  CM1 and CLK SRC from SR0  SR1 and CLK SRC SR. Write   Read  </description>
								<lsb>18</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>UPEN_CTRL2</name>
								<description>TOM channel 7 enable update of register CM0  CM1 and CLK SRC from SR0  SR1 and CLK SRC SR. Write   Read  </description>
								<lsb>20</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>UPEN_CTRL3</name>
								<description>TOM channel 7 enable update of register CM0  CM1 and CLK SRC from SR0  SR1 and CLK SRC SR. Write   Read  </description>
								<lsb>22</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>UPEN_CTRL4</name>
								<description>TOM channel 7 enable update of register CM0  CM1 and CLK SRC from SR0  SR1 and CLK SRC SR. Write   Read  </description>
								<lsb>24</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>UPEN_CTRL5</name>
								<description>TOM channel 7 enable update of register CM0  CM1 and CLK SRC from SR0  SR1 and CLK SRC SR. Write   Read  </description>
								<lsb>26</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>UPEN_CTRL6</name>
								<description>TOM channel 7 enable update of register CM0  CM1 and CLK SRC from SR0  SR1 and CLK SRC SR. Write   Read  </description>
								<lsb>28</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>UPEN_CTRL7</name>
								<description>TOM channel 7 enable update of register CM0  CM1 and CLK SRC from SR0  SR1 and CLK SRC SR. Write   Read  </description>
								<lsb>30</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TGC1_ACT_TB</name>
						<description>TOM0 TGC1 Action Time Base Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>564</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ACT_TB</name>
								<description>Time base value. Specifies the signed compare value with selected signal TBU TS x          x 0..2 If selected TBU TS x  value is in the interval   ACT TB   007FFFFFh  ACT TB    the event is in        the past  and the trigger is generated immediately. Otherwise  the event        is in the future  and the trigger is generated if selected TBU TS x  is        equal to ACT TB .</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TB_TRIG</name>
								<description>Set trigger request. This flag is reset automatically if the selected time base unit   TBU TS0 or TBU TS1 or TBU TS2  if        present  has reached the value ACT TB and the update of the register was        triggered.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBU_SEL</name>
								<description>Selection of time base used for comparison. The bit combination 0b10 is only applicable if the TBU of the device        contains three time base channels. Otherwise  this bit combination is        also reserved. Please refer to GTM Architecture block diagram on page 3        to determine the number of channels for TBU of this device.</description>
								<lsb>25</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TGC1_FUPD_CTRL</name>
						<description>TOM0 TGC1 Force Update Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>568</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>FUPD_CTRL0</name>
								<description>Force update of TOM channel 7 operation registers. If enabled  force update of register CM0  CM1 and CLK SRC triggered by        HOST TRIG  ACT TB compare match  or internal trigger. Write   Read  The force update request is stored and executed synchronized to the        selected FXCLK.</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FUPD_CTRL1</name>
								<description>Force update of TOM channel 7 operation registers. If enabled  force update of register CM0  CM1 and CLK SRC triggered by        HOST TRIG  ACT TB compare match  or internal trigger. Write   Read  The force update request is stored and executed synchronized to the        selected FXCLK.</description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FUPD_CTRL2</name>
								<description>Force update of TOM channel 7 operation registers. If enabled  force update of register CM0  CM1 and CLK SRC triggered by        HOST TRIG  ACT TB compare match  or internal trigger. Write   Read  The force update request is stored and executed synchronized to the        selected FXCLK.</description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FUPD_CTRL3</name>
								<description>Force update of TOM channel 7 operation registers. If enabled  force update of register CM0  CM1 and CLK SRC triggered by        HOST TRIG  ACT TB compare match  or internal trigger. Write   Read  The force update request is stored and executed synchronized to the        selected FXCLK.</description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FUPD_CTRL4</name>
								<description>Force update of TOM channel 7 operation registers. If enabled  force update of register CM0  CM1 and CLK SRC triggered by        HOST TRIG  ACT TB compare match  or internal trigger. Write   Read  The force update request is stored and executed synchronized to the        selected FXCLK.</description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FUPD_CTRL5</name>
								<description>Force update of TOM channel 7 operation registers. If enabled  force update of register CM0  CM1 and CLK SRC triggered by        HOST TRIG  ACT TB compare match  or internal trigger. Write   Read  The force update request is stored and executed synchronized to the        selected FXCLK.</description>
								<lsb>10</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FUPD_CTRL6</name>
								<description>Force update of TOM channel 7 operation registers. If enabled  force update of register CM0  CM1 and CLK SRC triggered by        HOST TRIG  ACT TB compare match  or internal trigger. Write   Read  The force update request is stored and executed synchronized to the        selected FXCLK.</description>
								<lsb>12</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FUPD_CTRL7</name>
								<description>Force update of TOM channel 7 operation registers. If enabled  force update of register CM0  CM1 and CLK SRC triggered by        HOST TRIG  ACT TB compare match  or internal trigger. Write   Read  The force update request is stored and executed synchronized to the        selected FXCLK.</description>
								<lsb>14</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSTCN0_CH0</name>
								<description>Reset CN0 of channel 7 on force update event. If enabled  reset CN0 triggered by HOST TRIG  ACT TB compare match  or        internal trigger. Write   Read </description>
								<lsb>16</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSTCN0_CH1</name>
								<description>Reset CN0 of channel 7 on force update event. If enabled  reset CN0 triggered by HOST TRIG  ACT TB compare match  or        internal trigger. Write   Read </description>
								<lsb>18</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSTCN0_CH2</name>
								<description>Reset CN0 of channel 7 on force update event. If enabled  reset CN0 triggered by HOST TRIG  ACT TB compare match  or        internal trigger. Write   Read </description>
								<lsb>20</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSTCN0_CH3</name>
								<description>Reset CN0 of channel 7 on force update event. If enabled  reset CN0 triggered by HOST TRIG  ACT TB compare match  or        internal trigger. Write   Read </description>
								<lsb>22</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSTCN0_CH4</name>
								<description>Reset CN0 of channel 7 on force update event. If enabled  reset CN0 triggered by HOST TRIG  ACT TB compare match  or        internal trigger. Write   Read </description>
								<lsb>24</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSTCN0_CH5</name>
								<description>Reset CN0 of channel 7 on force update event. If enabled  reset CN0 triggered by HOST TRIG  ACT TB compare match  or        internal trigger. Write   Read </description>
								<lsb>26</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSTCN0_CH6</name>
								<description>Reset CN0 of channel 7 on force update event. If enabled  reset CN0 triggered by HOST TRIG  ACT TB compare match  or        internal trigger. Write   Read </description>
								<lsb>28</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSTCN0_CH7</name>
								<description>Reset CN0 of channel 7 on force update event. If enabled  reset CN0 triggered by HOST TRIG  ACT TB compare match  or        internal trigger. Write   Read </description>
								<lsb>30</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TGC1_INT_TRIG</name>
						<description>TOM0 TGC1 Internal Trigger Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>572</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>INT_TRIG0</name>
								<description>Select input signal TRIG 7 as a trigger source. Write   Read </description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INT_TRIG1</name>
								<description>Select input signal TRIG 7 as a trigger source. Write   Read </description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INT_TRIG2</name>
								<description>Select input signal TRIG 7 as a trigger source. Write   Read </description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INT_TRIG3</name>
								<description>Select input signal TRIG 7 as a trigger source. Write   Read </description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INT_TRIG4</name>
								<description>Select input signal TRIG 7 as a trigger source. Write   Read </description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INT_TRIG5</name>
								<description>Select input signal TRIG 7 as a trigger source. Write   Read </description>
								<lsb>10</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INT_TRIG6</name>
								<description>Select input signal TRIG 7 as a trigger source. Write   Read </description>
								<lsb>12</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INT_TRIG7</name>
								<description>Select input signal TRIG 7 as a trigger source. Write   Read </description>
								<lsb>14</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
