J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>TGC1_ENDIS_CTRL</name>
						<description>TOM0 TGC1 Enable Disable Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>624</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ENDIS_CTRL0</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible  If the output is disabled  OUTEN 0  0   the TOM channel 0 output        TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_CTRL1</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible  If the output is disabled  OUTEN 0  0   the TOM channel 0 output        TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_CTRL2</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible  If the output is disabled  OUTEN 0  0   the TOM channel 0 output        TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_CTRL3</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible  If the output is disabled  OUTEN 0  0   the TOM channel 0 output        TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_CTRL4</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible  If the output is disabled  OUTEN 0  0   the TOM channel 0 output        TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_CTRL5</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible  If the output is disabled  OUTEN 0  0   the TOM channel 0 output        TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>10</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_CTRL6</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible  If the output is disabled  OUTEN 0  0   the TOM channel 0 output        TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>12</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_CTRL7</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible  If the output is disabled  OUTEN 0  0   the TOM channel 0 output        TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>14</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TGC1_ENDIS_STAT</name>
						<description>TOM0 TGC1 Enable Disable Status Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>628</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ENDIS_STAT0</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible </description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_STAT1</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible </description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_STAT2</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible </description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_STAT3</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible </description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_STAT4</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible </description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_STAT5</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible </description>
								<lsb>10</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_STAT6</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible </description>
								<lsb>12</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_STAT7</name>
								<description>TOM channel 7 enable disable update value. If FREEZE   0  If a TOM channel is disabled  the counter CN0 is stopped and the output        register of SOU unit is set to the inverse value of control bit SL. On        an enable event  the counter CN0 starts counting from its current value. If FREEZE   1  If a TOM channel is disabled  the counter CN0 is stopped. On an enable        event  the counter CN0 starts counting from its current value. Write of following double bit values is possible </description>
								<lsb>14</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TGC1_OUTEN_CTRL</name>
						<description>TOM0 TGC1 Output Enable Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>632</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>OUTEN_CTRL0</name>
								<description>Output TOM i  CH7 OUT enable disable update value. Write of following double bit values is possible  If the channel is disabled  ENDIS 0  0  or the output is disabled         OUTEN 0  0   the TOM channel 0 output TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_CTRL1</name>
								<description>Output TOM i  CH7 OUT enable disable update value. Write of following double bit values is possible  If the channel is disabled  ENDIS 0  0  or the output is disabled         OUTEN 0  0   the TOM channel 0 output TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_CTRL2</name>
								<description>Output TOM i  CH7 OUT enable disable update value. Write of following double bit values is possible  If the channel is disabled  ENDIS 0  0  or the output is disabled         OUTEN 0  0   the TOM channel 0 output TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_CTRL3</name>
								<description>Output TOM i  CH7 OUT enable disable update value. Write of following double bit values is possible  If the channel is disabled  ENDIS 0  0  or the output is disabled         OUTEN 0  0   the TOM channel 0 output TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_CTRL4</name>
								<description>Output TOM i  CH7 OUT enable disable update value. Write of following double bit values is possible  If the channel is disabled  ENDIS 0  0  or the output is disabled         OUTEN 0  0   the TOM channel 0 output TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_CTRL5</name>
								<description>Output TOM i  CH7 OUT enable disable update value. Write of following double bit values is possible  If the channel is disabled  ENDIS 0  0  or the output is disabled         OUTEN 0  0   the TOM channel 0 output TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>10</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_CTRL6</name>
								<description>Output TOM i  CH7 OUT enable disable update value. Write of following double bit values is possible  If the channel is disabled  ENDIS 0  0  or the output is disabled         OUTEN 0  0   the TOM channel 0 output TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>12</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_CTRL7</name>
								<description>Output TOM i  CH7 OUT enable disable update value. Write of following double bit values is possible  If the channel is disabled  ENDIS 0  0  or the output is disabled         OUTEN 0  0   the TOM channel 0 output TOM i  CH0 OUT is the inverted value of bit SL.</description>
								<lsb>14</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TGC1_OUTEN_STAT</name>
						<description>TOM0 TGC1 Output Enable Status Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>636</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>OUTEN_STAT0</name>
								<description>Control status of output TOM i  CH7 OUT. Write of following double bit values is possible </description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_STAT1</name>
								<description>Control status of output TOM i  CH7 OUT. Write of following double bit values is possible </description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_STAT2</name>
								<description>Control status of output TOM i  CH7 OUT. Write of following double bit values is possible </description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_STAT3</name>
								<description>Control status of output TOM i  CH7 OUT. Write of following double bit values is possible </description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_STAT4</name>
								<description>Control status of output TOM i  CH7 OUT. Write of following double bit values is possible </description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_STAT5</name>
								<description>Control status of output TOM i  CH7 OUT. Write of following double bit values is possible </description>
								<lsb>10</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_STAT6</name>
								<description>Control status of output TOM i  CH7 OUT. Write of following double bit values is possible </description>
								<lsb>12</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_STAT7</name>
								<description>Control status of output TOM i  CH7 OUT. Write of following double bit values is possible </description>
								<lsb>14</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<dim>1</dim>
					<dimIncrement>16384</dimIncrement>
					<name>PSM[%s]</name>
					<description>PSM</description>
					<addressOffset>98304</addressOffset>
					<cluster>
						<name>F2A</name>
						<description>F2A</description>
						<addressOffset>0</addressOffset>
						<register>
							<name>F2Ai_ENABLE</name>
							<description>F2A0 Stream Activation Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>64</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>STR0_EN</name>
									<description>Enable disable stream 7. Write of following double bit values is possible </description>
									<lsb>0</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>STR1_EN</name>
									<description>Enable disable stream 7. Write of following double bit values is possible </description>
									<lsb>2</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>STR2_EN</name>
									<description>Enable disable stream 7. Write of following double bit values is possible </description>
									<lsb>4</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>STR3_EN</name>
									<description>Enable disable stream 7. Write of following double bit values is possible </description>
									<lsb>6</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>STR4_EN</name>
									<description>Enable disable stream 7. Write of following double bit values is possible </description>
									<lsb>8</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>STR5_EN</name>
									<description>Enable disable stream 7. Write of following double bit values is possible </description>
									<lsb>10</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>STR6_EN</name>
									<description>Enable disable stream 7. Write of following double bit values is possible </description>
									<lsb>12</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>STR7_EN</name>
									<description>Enable disable stream 7. Write of following double bit values is possible </description>
									<lsb>14</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>F2Ai_CTRL</name>
							<description>F2A0 Stream Control Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>68</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>STR4_CONF</name>
									<description>Reconfiguration of stream 4 to FIFO channel 0. Write of following double bit values is possible  The write protected bits of register F2A i  CTRL are only writable if the corresponding enable bit STR0 EN and STR4 EN of        register F2A ENABLE is cleared.</description>
									<lsb>0</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>STR5_CONF</name>
									<description>Reconfiguration of stream 5 to FIFO channel 1. Write of following double bit values is possible  The write protected bits of register F2A i  CTRL are only writable if the corresponding enable bit STR1 EN and STR5 EN of        register F2A ENABLE is cleared.</description>
									<lsb>2</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>STR6_CONF</name>
									<description>Reconfiguration of stream 6 to FIFO channel 2. Write of following double bit values is possible  The write protected bits of register F2A i  CTRL are only writable if the corresponding enable bit STR2 EN and STR6 EN of        register F2A ENABLE is cleared.</description>
									<lsb>4</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>STR7_CONF</name>
									<description>Reconfiguration of stream 7 to FIFO channel 3. Write of following double bit values is possible  The write protected bits of register F2A i  CTRL are only writable if the corresponding enable bit STR3 EN and STR7 EN of        register F2A ENABLE is cleared.</description>
									<lsb>6</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
