J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
						<cluster>
							<dim>8</dim>
							<dimIncrement>4</dimIncrement>
							<name>RD_CH[%s]</name>
							<description>RD CH</description>
							<addressOffset>0</addressOffset>
							<register>
								<name>F2Ai_CHz_ARU_RD_FIFO</name>
								<description>F2A0 Stream 0 Read Address Register
 resetvalue={Application Reset:0x1FE}</description>
								<addressOffset>0</addressOffset>
								<size>32</size>
								<resetValue>510</resetValue>
								<resetMask>4294967295</resetMask>
								<fields>
									<field>
										<name>ADDR</name>
										<description>ARU Read address. This bit field is only writable if channel is disabled.</description>
										<lsb>0</lsb>
										<msb>8</msb>
										<access>read-write</access>
									</field>
								</fields>
							</register>
						</cluster>
						<cluster>
							<dim>8</dim>
							<dimIncrement>4</dimIncrement>
							<name>STR_CH[%s]</name>
							<description>STR CH</description>
							<addressOffset>32</addressOffset>
							<register>
								<name>F2Ai_CHz_STR_CFG</name>
								<description>F2A0 Stream 0 Configuration Register
 resetvalue={Application Reset:0x0}</description>
								<addressOffset>0</addressOffset>
								<size>32</size>
								<resetValue>0</resetValue>
								<resetMask>4294967295</resetMask>
								<fields>
									<field>
										<name>TMODE</name>
										<description>Transfer mode for 53 bit ARU data from to FIFO</description>
										<lsb>16</lsb>
										<msb>17</msb>
										<access>read-write</access>
									</field>
									<field>
										<name>DIR</name>
										<description>Data transfer direction</description>
										<lsb>18</lsb>
										<msb>18</msb>
										<access>read-write</access>
									</field>
								</fields>
							</register>
						</cluster>
					</cluster>
					<cluster>
						<name>AFD</name>
						<description>AFD</description>
						<addressOffset>128</addressOffset>
						<cluster>
							<dim>8</dim>
							<dimIncrement>16</dimIncrement>
							<name>CH[%s]</name>
							<description>CH</description>
							<addressOffset>0</addressOffset>
							<register>
								<name>AFDi_CHx_BUF_ACC</name>
								<description>AFD 0 FIFO 0 Buffer Access Register
 resetvalue={Application Reset:0x0}</description>
								<addressOffset>0</addressOffset>
								<size>32</size>
								<resetValue>0</resetValue>
								<resetMask>4294967295</resetMask>
								<fields>
									<field>
										<name>DATA</name>
										<description>Read write data from to FIFO</description>
										<lsb>0</lsb>
										<msb>28</msb>
										<access>read-write</access>
									</field>
								</fields>
							</register>
						</cluster>
					</cluster>
					<cluster>
						<name>FIFO</name>
						<description>FIFO</description>
						<addressOffset>1024</addressOffset>
						<cluster>
							<dim>8</dim>
							<dimIncrement>64</dimIncrement>
							<name>CH[%s]</name>
							<description>CH</description>
							<addressOffset>0</addressOffset>
							<register>
								<name>FIFOi_CHz_CTRL</name>
								<description>FIFO0 Channel 0 Control Register
 resetvalue={Application Reset:0x0}</description>
								<addressOffset>0</addressOffset>
								<size>32</size>
								<resetValue>0</resetValue>
								<resetMask>4294967295</resetMask>
								<fields>
									<field>
										<name>RBM</name>
										<description>Ring buffer mode enable</description>
										<lsb>0</lsb>
										<msb>0</msb>
										<access>read-write</access>
									</field>
									<field>
										<name>RAP</name>
										<description>RAM access priority. RAP bit is only functional in register FIFO 0 CTRL. The priority is        defined for all FIFO channels there.</description>
										<lsb>1</lsb>
										<msb>1</msb>
										<access>read-write</access>
									</field>
									<field>
										<name>FLUSH</name>
										<description>FIFO Flush control. A FIFO Flush operation resets the FIFO i  CH z  FILL LEVEL   FIFO i  CH z  WR PTR and FIFO i  CH z  RD PTR registers to their initial values.</description>
										<lsb>2</lsb>
										<msb>2</msb>
										<access>read-write</access>
									</field>
									<field>
										<name>WULOCK</name>
										<description>RAM write unlock. Enable disable direct RAM write access to the memory mapped FIFO region. Only the bit WULOCK of register FIFO i  CH0 CTRL enables disables the        direct RAM write access for all FIFO channel  whole FIFO RAM . The        WULOCK bits of the other channels are writeable but have no effect.</description>
										<lsb>3</lsb>
										<msb>3</msb>
										<access>read-write</access>
									</field>
								</fields>
							</register>
							<register>
								<name>FIFOi_CHz_END_ADDR</name>
								<description>FIFO0 Channel 0 End Address Register
 resetvalue={Application Reset:0x7F}</description>
								<addressOffset>4</addressOffset>
								<size>32</size>
								<resetValue>127</resetValue>
								<resetMask>4294967295</resetMask>
								<fields>
									<field>
										<name>ADDR</name>
										<description>End address for FIFO channel z. value for ADDR is calculated as ADDR   128  x 1  1 A write access will flush the regarding channel</description>
										<lsb>0</lsb>
										<msb>9</msb>
										<access>read-write</access>
									</field>
								</fields>
							</register>
							<register>
								<name>FIFOi_CHz_START_ADDR</name>
								<description>FIFO0 Channel 0 Start Address Register
 resetvalue={Application Reset:0x0}</description>
								<addressOffset>8</addressOffset>
								<size>32</size>
								<resetValue>0</resetValue>
								<resetMask>4294967295</resetMask>
								<fields>
									<field>
										<name>ADDR</name>
										<description>Start address for FIFO channel z. Initial value for ADDR is calculated as ADDR   128 z. A write access will flush the regarding channel.</description>
										<lsb>0</lsb>
										<msb>9</msb>
										<access>read-write</access>
									</field>
								</fields>
							</register>
							<register>
								<name>FIFOi_CHz_UPPER_WM</name>
								<description>FIFO0 Channel 0 Upper Watermark Register
 resetvalue={Application Reset:0x60}</description>
								<addressOffset>12</addressOffset>
								<size>32</size>
								<resetValue>96</resetValue>
								<resetMask>4294967295</resetMask>
								<fields>
									<field>
										<name>ADDR</name>
										<description>Upper watermark address for channel z. The upper watermark is configured as a relative fill level of the FIFO.        ADDR must be in range  0  lt   ADDR  lt   FIFO i  CH x  END ADDR   FIFO i  CH x  START ADDR . Initial value for ADDR is defined as ADDR   0x60.</description>
										<lsb>0</lsb>
										<msb>9</msb>
										<access>read-write</access>
									</field>
								</fields>
							</register>
							<register>
								<name>FIFOi_CHz_LOWER_WM</name>
								<description>FIFO0 Channel 0 Lower Watermark Register
 resetvalue={Application Reset:0x20}</description>
								<addressOffset>16</addressOffset>
								<size>32</size>
								<resetValue>32</resetValue>
								<resetMask>4294967295</resetMask>
								<fields>
									<field>
										<name>ADDR</name>
										<description>Lower watermark address for channel z. The lower watermark is configured as a relative fill level of the FIFO.        ADDR must be in range  0  lt   ADDR  lt   FIFO i  CH z  END ADDR   FIFO i  CH z  START ADDR . Initial value for ADDR is defined as ADDR   0x20.</description>
										<lsb>0</lsb>
										<msb>9</msb>
										<access>read-write</access>
									</field>
								</fields>
							</register>
							<register>
								<name>FIFOi_CHz_STATUS</name>
								<description>FIFO0 Channel 0 Status Register
 resetvalue={Application Reset:0x5}</description>
								<addressOffset>20</addressOffset>
								<size>32</size>
								<resetValue>5</resetValue>
								<resetMask>4294967295</resetMask>
								<fields>
									<field>
										<name>EMPTY</name>
										<description>FIFO is empty. Bit only applicable in normal mode.</description>
										<lsb>0</lsb>
										<msb>0</msb>
										<access>read-only</access>
									</field>
									<field>
										<name>FULL</name>
										<description>FIFO is full. Bit only applicable in normal mode.</description>
										<lsb>1</lsb>
										<msb>1</msb>
										<access>read-only</access>
									</field>
									<field>
										<name>LOW_WM</name>
										<description>Lower watermark reached. Bit only applicable in normal mode.</description>
										<lsb>2</lsb>
										<msb>2</msb>
										<access>read-only</access>
									</field>
									<field>
										<name>UP_WM</name>
										<description>Upper watermark reached. Bit only applicable in normal mode.</description>
										<lsb>3</lsb>
										<msb>3</msb>
										<access>read-only</access>
									</field>
								</fields>
							</register>
							<register>
								<name>FIFOi_CHz_FILL_LEVEL</name>
								<description>FIFO0 Channel 0 Fill Level Register
 resetvalue={Application Reset:0x0}</description>
								<addressOffset>24</addressOffset>
								<size>32</size>
								<resetValue>0</resetValue>
								<resetMask>4294967295</resetMask>
								<fields>
									<field>
										<name>LEVEL</name>
										<description>Fill level of the current FIFO. LEVEL is in range  0   8804  LEVEL   8804  FIFO i  CH z  END ADDR   8722  FIFO i  CH z  START ADDR   1 Register content is compared to the upper and lower watermark values for        this channel to detect watermark over  and underflow.</description>
										<lsb>0</lsb>
										<msb>10</msb>
										<access>read-only</access>
									</field>
								</fields>
							</register>
							<register>
								<name>FIFOi_CHz_WR_PTR</name>
								<description>FIFO0 Channel 0 Write Pointer Register
 resetvalue={Application Reset:0x0}</description>
								<addressOffset>28</addressOffset>
								<size>32</size>
								<resetValue>0</resetValue>
								<resetMask>4294967295</resetMask>
								<fields>
									<field>
										<name>ADDR</name>
										<description>Position of the write pointer. ADDR must be in range 0  lt   ADDR  lt   1023. Initial value for ADDR is        defined as ADDR   FIFO i  CH z  START ADDR</description>
										<lsb>0</lsb>
										<msb>9</msb>
										<access>read-only</access>
									</field>
								</fields>
							</register>
							<register>
								<name>FIFOi_CHz_RD_PTR</name>
								<description>FIFO0 Channel 0 Read Pointer Register
 resetvalue={Application Reset:0x0}</description>
								<addressOffset>32</addressOffset>
								<size>32</size>
								<resetValue>0</resetValue>
								<resetMask>4294967295</resetMask>
								<fields>
									<field>
										<name>ADDR</name>
										<description>Position of the read pointer. ADDR must be in range 0   8804  ADDR   8804  1023. Initial value for ADDR is defined        as ADDR   FIFO i  CH z  START ADDR</description>
										<lsb>0</lsb>
										<msb>9</msb>
										<access>read-only</access>
									</field>
								</fields>
							</register>
							<register>
								<name>FIFOi_CHz_EIRQ_EN</name>
								<description>FIFO0 Channel 0 Error Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
								<addressOffset>52</addressOffset>
								<size>32</size>
								<resetValue>0</resetValue>
								<resetMask>4294967295</resetMask>
								<fields>
									<field>
										<name>FIFO_EMPTY_EIRQ_EN</name>
										<description>FIFO Empty error interrupt enable</description>
										<lsb>0</lsb>
										<msb>0</msb>
										<access>read-write</access>
									</field>
									<field>
										<name>FIFO_FULL_EIRQ_EN</name>
										<description>FIFO Full error interrupt enable</description>
										<lsb>1</lsb>
										<msb>1</msb>
										<access>read-write</access>
									</field>
									<field>
										<name>FIFO_LWM_EIRQ_EN</name>
										<description>FIFO Lower Watermark error interrupt enable</description>
										<lsb>2</lsb>
										<msb>2</msb>
										<access>read-write</access>
									</field>
									<field>
										<name>FIFO_UWM_EIRQ_EN</name>
										<description>FIFO Upper Watermark error interrupt enable</description>
										<lsb>3</lsb>
										<msb>3</msb>
										<access>read-write</access>
									</field>
								</fields>
							</register>
							<cluster>
								<name>IRQ</name>
								<description>IRQ</description>
								<addressOffset>36</addressOffset>
								<register>
									<name>FIFOi_CHz_IRQ_NOTIFY</name>
									<description>FIFO0 Channel 0 Interrupt Notification Register
 resetvalue={Application Reset:0x5}</description>
									<addressOffset>0</addressOffset>
									<size>32</size>
									<resetValue>5</resetValue>
									<resetMask>4294967295</resetMask>
									<fields>
										<field>
											<name>FIFO_EMPTY</name>
											<description>FIFO is empty. This bit will be cleared on a CPU write access of value  1 . A read        access leaves the bit unchanged.</description>
											<lsb>0</lsb>
											<msb>0</msb>
											<access>read-write</access>
										</field>
										<field>
											<name>FIFO_FULL</name>
											<description>FIFO is full. See bit 0.</description>
											<lsb>1</lsb>
											<msb>1</msb>
											<access>read-write</access>
										</field>
										<field>
											<name>FIFO_LWM</name>
											<description>FIFO lower watermark was under run. See bit 0.</description>
											<lsb>2</lsb>
											<msb>2</msb>
											<access>read-write</access>
										</field>
										<field>
											<name>FIFO_UWM</name>
											<description>FIFO upper watermark was over run. See bit 0.</description>
											<lsb>3</lsb>
											<msb>3</msb>
											<access>read-write</access>
										</field>
									</fields>
								</register>
								<register>
									<name>FIFOi_CHz_IRQ_EN</name>
									<description>FIFO0 Channel 0 Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
									<addressOffset>4</addressOffset>
									<size>32</size>
									<resetValue>0</resetValue>
									<resetMask>4294967295</resetMask>
									<fields>
										<field>
											<name>FIFO_EMPTY_IRQ_EN</name>
											<description>FIFO Empty interrupt enable</description>
											<lsb>0</lsb>
											<msb>0</msb>
											<access>read-write</access>
										</field>
										<field>
											<name>FIFO_FULL_IRQ_EN</name>
											<description>FIFO Full interrupt enable</description>
											<lsb>1</lsb>
											<msb>1</msb>
											<access>read-write</access>
										</field>
										<field>
											<name>FIFO_LWM_IRQ_EN</name>
											<description>FIFO Lower Watermark interrupt enable</description>
											<lsb>2</lsb>
											<msb>2</msb>
											<access>read-write</access>
										</field>
										<field>
											<name>FIFO_UWM_IRQ_EN</name>
											<description>FIFO Upper Watermark interrupt enable</description>
											<lsb>3</lsb>
											<msb>3</msb>
											<access>read-write</access>
										</field>
									</fields>
								</register>
								<register>
									<name>FIFOi_CHz_IRQ_FORCINT</name>
									<description>FIFO0 Channel 0 Force Interrupt Register
 resetvalue={Application Reset:0x0}</description>
									<addressOffset>8</addressOffset>
									<size>32</size>
									<resetValue>0</resetValue>
									<resetMask>4294967295</resetMask>
									<fields>
										<field>
											<name>TRG_FIFO_EMPTY</name>
											<description>Force interrupt of FIFO Empty status. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL</description>
											<lsb>0</lsb>
											<msb>0</msb>
											<access>read-write</access>
										</field>
										<field>
											<name>TRG_FIFO_FULL</name>
											<description>Force interrupt of FIFO Full status. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
											<lsb>1</lsb>
											<msb>1</msb>
											<access>read-write</access>
										</field>
										<field>
											<name>TRG_FIFO_LWM</name>
											<description>Force interrupt of Lower Watermark. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
											<lsb>2</lsb>
											<msb>2</msb>
											<access>read-write</access>
										</field>
										<field>
											<name>TRG_FIFO_UWM</name>
											<description>Force interrupt of Upper Watermark. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
											<lsb>3</lsb>
											<msb>3</msb>
											<access>read-write</access>
										</field>
									</fields>
								</register>
								<register>
									<name>FIFOi_CHz_IRQ_MODE</name>
									<description>FIFO0 Channel 0 Interrupt Mode Control Register
 resetvalue={Application Reset:0x0}</description>
									<addressOffset>12</addressOffset>
									<size>32</size>
									<resetValue>0</resetValue>
									<resetMask>4294967295</resetMask>
									<fields>
										<field>
											<name>IRQ_MODE</name>
											<description>IRQ mode selection. The interrupt modes are described in CROSSREFERENCE .</description>
											<lsb>0</lsb>
											<msb>1</msb>
											<access>read-write</access>
										</field>
										<field>
											<name>DMA_HYSTERESIS</name>
											<description>Enable DMA hysteresis mode</description>
											<lsb>2</lsb>
											<msb>2</msb>
											<access>read-write</access>
										</field>
										<field>
											<name>DMA_HYST_DIR</name>
											<description>DMA direction in hysteresis mode. In the case of DMA writing data to a FIFO  the DMA requests must be        generated by the lower watermark. If the DMA hysteresis is enabled  the        FIFO does not generate a new DMA request until the upper watermark is        reached. In the case of DMA reading data from FIFO  the DMA requests must be        generated by the upper watermark. If the DMA hysteresis is enabled  the        FIFO does not generate a new DMA request until the lower watermark is        reached.</description>
											<lsb>3</lsb>
											<msb>3</msb>
											<access>read-write</access>
										</field>
									</fields>
								</register>
							</cluster>
						</cluster>
					</cluster>
				</cluster>
