J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<cluster>
					<name>DPLL</name>
					<description>DPLL</description>
					<addressOffset>163840</addressOffset>
					<register>
						<name>CTRL_0</name>
						<description>DPLL Control Register 0
 resetvalue={Application Reset:0x3BBA57}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>3914327</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>MLT</name>
								<description>Multiplier for TRIGGER. stored in an independent shadow register for an active TRIGGER event and for DEN   1. MLT 1 is number of SUB INC1 pulses between two TRIGGER events in normal mode  1...1024   Note  For emergency mode the number of SUB INC1 pulses between two STATE events is calculated by the CPU using the formula MLS1  MLT 1    TNU 1     SNU 1  in order to get the same number of SUB INC1 pulses for FULL SCALE. This value is stored in RAM at 0x05C0. Change of MLT by the CPU must result in the corresponding change of MLS1 by the CPU for SMC 0. Note  The number of MLT events is the binary value plus 1. The value MLT 1 is replaced by MLS1 in the case of SMC 1  see DPLL CTRL 1 register  for all relevant calculations.</description>
								<lsb>0</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IFP</name>
								<description>Input filter position. CROSSREFERENCE stored      in an independent shadow register for an active STATE event and for DEN        1. T he time between two active STATE or      TRIGGER events must be always greater then 23.4   181 s  in addition  the      TS CLK and the resolution must be chosen such that for each nominal      increment  the time stamps at the beginning and the end of the increment      differ at least in the value of 257. Value contains position or time related information.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SNU</name>
								<description>STATE number. For IFP 1  the time between two        active TRIGGER or STATE events must be always greater then 2.34 ms  and        the value x of MLT  MLS1 or MLS2 must be chosen such that the number of        time stamp pulses between two SUB INC events must be less than 65536.        This is fulfilled when x is greater than 256. SNU 1 is number of nominal STATE events in HALF SCALE  1...32 . The number of nominal STATE events is the decimal value plus 1. This          value can only be written when  RMO 0 and SMC 0  or DEN 0. To make          sure that this signal is not changed during a mode change  RMO 0 means          that the status of RMO 0 must be given before and during writing to          the register. Set SSL 00 before changing this value and set RMO 1          only after FULL SCALE with SSL gt 0. This register can only be written when DPLL CTRL 11.STATE EXT is not          set. If DPLL CTRL 11.STATE EXT is set  the signal cannot be written           the read value is zero.</description>
								<lsb>11</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TNU</name>
								<description>TRIGGER number. CROSSREFERENCE TNU 1 is number of nominal TRIGGER events in HALF SCALE  1...512 . Note  The number of nominal TRIGGER events is the decimal value plus 1.This value can only be written when  RMO 1 and SMC 0  or DEN 0. To make sure that this signal is not changed during a mode change RMO 0 means that the status of RMO 0 must be given before and during writing to the register. Set TSL 00 before changing this value and set RMO 0 only after FULL SCALE with TSL gt 0.</description>
								<lsb>16</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AMS</name>
								<description>Adapt mode STATE. CROSSREFERENCE Use of adaptation information of STATE.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AMT</name>
								<description>Adapt mode TRIGGER. CROSSREFERENCE Use of adaptation information of TRIGGER.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IDS</name>
								<description>Input delay STATE. CROSSREFERENCE Use of input delay information transmitted in FT part of the STATE        signal.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IDT</name>
								<description>Input delay TRIGGER. CROSSREFERENCE Use of input delay information transmitted in FT part of the TRIGGER        signal.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEN</name>
								<description>STATE enable</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TEN</name>
								<description>TRIGGER enable</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RMO</name>
								<description>Reference mode. CROSSREFERENCE CROSSREFERENCE Selection of the relevant input signal for generation of SUB INC1. Double synchronous mode for SMC 1  Signal TRIGGER is used to generate the SUB INC1 signals  and STATE is used to generate the SUB INC2 signals. Note  For SMC 0  TRIGGER and STATE are prepared to calculate SUB INC1. The RMO bit gives a decision only  which of them is used. For changing from normal mode to emergency mode at the following TRIGGER slope  according to the RMO value in the shadow register  CROSSREFERENCE   the PSSC value is calculated by PSSC   PSSM   correction value  forward direction  or PSSC   PSSM   correction value  backward direction  with the correction value   inc cnt1   nmb t. For changing from emergency mode to normal mode at the following STATE slope  according to the RMO value in the shadow register  CROSSREFERENCE   the PSTC value is calculated by PSTC   PSTM   correction value  forward direction  or PSTC   PSTM   correction value  backward direction  with the correction value   inc cnt1   nmb s. In case no further TRIGGER or STATE events the CPU has to perform the above corrections.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CTRL_1</name>
						<description>DPLL Control Register 1
 resetvalue={Application Reset:0x0B0000000}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>2952790016</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DMO</name>
								<description>DPLL mode select. Stored in an independent shadow      register for a valid TRIGGER event and for DEN   1. Stored      in an independent shadow register for a valid STATE event and for DEN   1.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DEN</name>
								<description>DPLL enable. Note   The bits 31 down to 0 of the DPLL STATUS register are cleared  when the DPLL is disabled. Some bits of the control registers can be set only when DEN 0. The protected bits in the DPLL CTRL 1 register cannot be written when simultaneously DEN is set to 1.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IDDS</name>
								<description>Input direction detection strategy in the case of SMC 0. Note   This bit can only be written when the DPLL is disabled and fixed to zero  when not needed for an implementation. Independent of the value of IDDS is the direction information for TRIGGER in the case SMC 0 always considered at the moment when the inactive slope appears.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>COA</name>
								<description>Correction strategy in automatic end mode  DMO 0 . CROSSREFERENCE CROSSREFERENCE For SMC RMO 1  COA is used for SUB INC1 and SUB INC2.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PIT</name>
								<description>Plausibility value PVT to next active TRIGGER is time related. CROSSREFERENCE</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SGE1</name>
								<description>SUB INC1 generator enable. CROSSREFERENCE CROSSREFERENCE</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DLM1</name>
								<description>Direct Load Mode for SUB INC1 generation. CROSSREFERENCE CROSSREFERENCE</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PCM1</name>
								<description>Pulse Correction Mode for SUB INC1 generation. CROSSREFERENCE CROSSREFERENCE Bit      is cleared  when transmitted to shadow register.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SGE2</name>
								<description>SUB INC2 generator enable. CROSSREFERENCE</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DLM2</name>
								<description>Direct Load Mode for SUB INC2 generation. CROSSREFERENCE</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PCM2</name>
								<description>Pulse Correction Mode for SUB INC2 generation. CROSSREFERENCE CROSSREFERENCE</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SYN_NS</name>
								<description>Synchronization number of STATE. Summarized number of virtual increments in HALF SCALE. Sum of all systematic missing STATE events in HALF SCALE  for SYSF 0  or FULL SCALE  for SYSF 1    the        SYN NS missing STATES can be divided up        to an arbitrary number of blocks. The pattern of events and missing        events in FULL SCALE is shown in RAM region 1c3 as value NS in addition        to the adapted values. The number of stored increments in FULL SCALE        must be equal to 2  SNU 1 SYN NS  for SYSF 0 or 2  SNU 1  SYN NS for        SYSF 1 . This pattern is written by the CPU beginning from a fixed        reference point  maybe beginning of the FULL SCALE region . The relation        to the actual increment is established by setting of the profile RAM        pointer APS 1C3 in an appropriate relation to the RAM pointer APS of the        actual increment by the CPU. This value can only be written when  RMO 0 and SMC 0  or DEN 0. Set        SSL 00 before changing this value and set RMO 1 only after FULL SCALE        with SSL gt 0. To make shure that this signal is not changed during a mode        change SMC 0 means that the status of SMC 0 must be given before and        during writing to the register. This register can only be written when DPLL CTRL 11.STATE EXT is not        set. If DPLL CTRL 11.STATE EXT is set  the signal cannot be written  the        read value is zero.</description>
								<lsb>11</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SYN_NT</name>
								<description>Synchronization numberof TRIGGER. Summarized number of virtual increments in HALF SCALE. Sum of all systematic missing TRIGGER events in HALF SCALE  the SYN NT missing TRIGGER can be divided up to an arbitrary number of blocks. The pattern of        events and missing events in FULL SCALE is shown in RAM region 2c as        value NT in addition to the adapted values. The number of stored        increments in FULL SCALE must be equal to 2  TNU SYN NT . This pattern        is written by the CPU beginning from a fixed reference point  maybe        beginning of the FULL SCALE region . The relation to the actual        increment is established by setting of the profile RAM pointer APT 2C in        an appropriate relation to the RAM pointer APT of the actual increment        by the CPU. This value can only be written when  RMO 1 and SMC 0  or DEN 0. Set        TSL 00 before changing this value and set RMO 0 only after FULL SCALE        with TSL gt 0. To make shure that this signal is not changed during a mode        change SMC 0 means that the status of SMC 0 must be given before and        during writing to the register.</description>
								<lsb>16</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>LCD</name>
								<description>Locking condition definition. This bit can only be written when the DPLL is disabled and fixed to        zero  when not needed for an implementation.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SWR</name>
								<description>Software reset. Resets all register and internal states of the DPLL. Setting the SWR bit results only in a software reset when the DPLL is        not enabled  DEN 0 .</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SYSF</name>
								<description>SYN NS for FULL SCALE. The value SYN NS does mean the sum of all systematic missing STATE events in HALF SCALE  for SYSF 0  or FULL SCALE  for SYSF 1 . This value can only be written when  RMO 0 and SMC 0  or DEN 0. Set        SSL 00 before changing this value  and set RMO 1 only after FULL SCALE        with SSL gt 0. To make sure that this signal is not changed during a mode        change  SMC 0 means that the status of SMC 0 must be given before and        during writing to the register.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TS0_HRS</name>
								<description>Time stamp high resolution STATE. This bit can only be written when the DPLL is disabled.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TS0_HRT</name>
								<description>Time stamp high resolution TRIGGER. This bit can only be written when the DPLL is disabled.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SMC</name>
								<description>Synchronous Motor Control. This bit can only be written when the DPLL is disabled.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SSL</name>
								<description>STATE slope select. Definition of active slope for signal STATE  each active slope is an        event defined by SNU. Set by DEN 0 only. If DPLL STATUS.FSD    1   Slope sensitive after detection of first STATE        input signal. If DPLL STATUS.FSD    0  8217   Level sensitive for first STATE input signal        edge. This value can only be written when  RMO 0 and SMC 0  or DEN 0. To          make sure that this signal is not changed during a mode change  SMC 0          means that the status of SMC 0 must be given before and during writing          to the register.</description>
								<lsb>28</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TSL</name>
								<description>TRIGGER slope select. Definition of active slope for signal TRIGGER each active slope is an event defined by TNU. Set by DEN 0 only. If DPLL STATUS.FTD    1   slope sensitive after detection of first TRIGGER input signal  If DPLL STATUS.FTD    0   level sensitive for first TRIGGER input signal edge  Note   This value can only be written when  RMO 1 and SMC 0  or DEN 0. To make sure that this signal is not changed during a mode change  SMC 0 means that the status of SMC 0 must be given before and during writing to the register.</description>
								<lsb>30</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
