J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>CTRL_2</name>
						<description>DPLL Control Register 2
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>AEN0</name>
								<description>ACTION 7 enable. This bit can be written only if the correspondent WADx bit is set in          the same access. It can be set for debug purposes by CPU also  when          DPLL is disabled. The enable bit becomes active only when the DPLL is          in operation  DEN 1 . For WADi  1  only the corresponding AENi bits are writable. The AENi          bits remain unchanged when the corresponding WADi 0.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN1</name>
								<description>ACTION 7 enable. This bit can be written only if the correspondent WADx bit is set in          the same access. It can be set for debug purposes by CPU also  when          DPLL is disabled. The enable bit becomes active only when the DPLL is          in operation  DEN 1 . For WADi  1  only the corresponding AENi bits are writable. The AENi          bits remain unchanged when the corresponding WADi 0.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN2</name>
								<description>ACTION 7 enable. This bit can be written only if the correspondent WADx bit is set in          the same access. It can be set for debug purposes by CPU also  when          DPLL is disabled. The enable bit becomes active only when the DPLL is          in operation  DEN 1 . For WADi  1  only the corresponding AENi bits are writable. The AENi          bits remain unchanged when the corresponding WADi 0.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN3</name>
								<description>ACTION 7 enable. This bit can be written only if the correspondent WADx bit is set in          the same access. It can be set for debug purposes by CPU also  when          DPLL is disabled. The enable bit becomes active only when the DPLL is          in operation  DEN 1 . For WADi  1  only the corresponding AENi bits are writable. The AENi          bits remain unchanged when the corresponding WADi 0.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN4</name>
								<description>ACTION 7 enable. This bit can be written only if the correspondent WADx bit is set in          the same access. It can be set for debug purposes by CPU also  when          DPLL is disabled. The enable bit becomes active only when the DPLL is          in operation  DEN 1 . For WADi  1  only the corresponding AENi bits are writable. The AENi          bits remain unchanged when the corresponding WADi 0.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN5</name>
								<description>ACTION 7 enable. This bit can be written only if the correspondent WADx bit is set in          the same access. It can be set for debug purposes by CPU also  when          DPLL is disabled. The enable bit becomes active only when the DPLL is          in operation  DEN 1 . For WADi  1  only the corresponding AENi bits are writable. The AENi          bits remain unchanged when the corresponding WADi 0.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN6</name>
								<description>ACTION 7 enable. This bit can be written only if the correspondent WADx bit is set in          the same access. It can be set for debug purposes by CPU also  when          DPLL is disabled. The enable bit becomes active only when the DPLL is          in operation  DEN 1 . For WADi  1  only the corresponding AENi bits are writable. The AENi          bits remain unchanged when the corresponding WADi 0.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN7</name>
								<description>ACTION 7 enable. This bit can be written only if the correspondent WADx bit is set in          the same access. It can be set for debug purposes by CPU also  when          DPLL is disabled. The enable bit becomes active only when the DPLL is          in operation  DEN 1 . For WADi  1  only the corresponding AENi bits are writable. The AENi          bits remain unchanged when the corresponding WADi 0.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD0</name>
								<description>Write control bit of Action 7. For WADx  1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx 0.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD1</name>
								<description>Write control bit of Action 7. For WADx  1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx 0.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD2</name>
								<description>Write control bit of Action 7. For WADx  1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx 0.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD3</name>
								<description>Write control bit of Action 7. For WADx  1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx 0.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD4</name>
								<description>Write control bit of Action 7. For WADx  1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx 0.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD5</name>
								<description>Write control bit of Action 7. For WADx  1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx 0.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD6</name>
								<description>Write control bit of Action 7. For WADx  1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx 0.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD7</name>
								<description>Write control bit of Action 7. For WADx  1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx 0.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CTRL_3</name>
						<description>DPLL Control Register 3
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>12</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>AEN8</name>
								<description>ACTION 15 enable. This bit can be written only if the correspondent WADx bit is set in the        same access. It can be set for debug purposes by CPU also  when DPLL is        disabled. The enable bit becomes active only when the DPLL is in        operation  DEN 1 .</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN9</name>
								<description>ACTION 15 enable. This bit can be written only if the correspondent WADx bit is set in the        same access. It can be set for debug purposes by CPU also  when DPLL is        disabled. The enable bit becomes active only when the DPLL is in        operation  DEN 1 .</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN10</name>
								<description>ACTION 15 enable. This bit can be written only if the correspondent WADx bit is set in the        same access. It can be set for debug purposes by CPU also  when DPLL is        disabled. The enable bit becomes active only when the DPLL is in        operation  DEN 1 .</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN11</name>
								<description>ACTION 15 enable. This bit can be written only if the correspondent WADx bit is set in the        same access. It can be set for debug purposes by CPU also  when DPLL is        disabled. The enable bit becomes active only when the DPLL is in        operation  DEN 1 .</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN12</name>
								<description>ACTION 15 enable. This bit can be written only if the correspondent WADx bit is set in the        same access. It can be set for debug purposes by CPU also  when DPLL is        disabled. The enable bit becomes active only when the DPLL is in        operation  DEN 1 .</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN13</name>
								<description>ACTION 15 enable. This bit can be written only if the correspondent WADx bit is set in the        same access. It can be set for debug purposes by CPU also  when DPLL is        disabled. The enable bit becomes active only when the DPLL is in        operation  DEN 1 .</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN14</name>
								<description>ACTION 15 enable. This bit can be written only if the correspondent WADx bit is set in the        same access. It can be set for debug purposes by CPU also  when DPLL is        disabled. The enable bit becomes active only when the DPLL is in        operation  DEN 1 .</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN15</name>
								<description>ACTION 15 enable. This bit can be written only if the correspondent WADx bit is set in the        same access. It can be set for debug purposes by CPU also  when DPLL is        disabled. The enable bit becomes active only when the DPLL is in        operation  DEN 1 .</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD8</name>
								<description>Write control bit of Action 15. For WADx   1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx   0.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD9</name>
								<description>Write control bit of Action 15. For WADx   1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx   0.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD10</name>
								<description>Write control bit of Action 15. For WADx   1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx   0.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD11</name>
								<description>Write control bit of Action 15. For WADx   1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx   0.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD12</name>
								<description>Write control bit of Action 15. For WADx   1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx   0.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD13</name>
								<description>Write control bit of Action 15. For WADx   1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx   0.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD14</name>
								<description>Write control bit of Action 15. For WADx   1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx   0.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD15</name>
								<description>Write control bit of Action 15. For WADx   1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx   0.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CTRL_4</name>
						<description>DPLL Control Register 4
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>16</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>AEN16</name>
								<description>ACTION 23 enable. This bit can be written only if the correspondent WADx bit is set in the        same access. It can be set for debug purposes by CPU also  when DPLL is        disabled. The enable bit becomes active only when the DPLL is in        operation  DEN 1 .</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN17</name>
								<description>ACTION 23 enable. This bit can be written only if the correspondent WADx bit is set in the        same access. It can be set for debug purposes by CPU also  when DPLL is        disabled. The enable bit becomes active only when the DPLL is in        operation  DEN 1 .</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN18</name>
								<description>ACTION 23 enable. This bit can be written only if the correspondent WADx bit is set in the        same access. It can be set for debug purposes by CPU also  when DPLL is        disabled. The enable bit becomes active only when the DPLL is in        operation  DEN 1 .</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN19</name>
								<description>ACTION 23 enable. This bit can be written only if the correspondent WADx bit is set in the        same access. It can be set for debug purposes by CPU also  when DPLL is        disabled. The enable bit becomes active only when the DPLL is in        operation  DEN 1 .</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN20</name>
								<description>ACTION 23 enable. This bit can be written only if the correspondent WADx bit is set in the        same access. It can be set for debug purposes by CPU also  when DPLL is        disabled. The enable bit becomes active only when the DPLL is in        operation  DEN 1 .</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN21</name>
								<description>ACTION 23 enable. This bit can be written only if the correspondent WADx bit is set in the        same access. It can be set for debug purposes by CPU also  when DPLL is        disabled. The enable bit becomes active only when the DPLL is in        operation  DEN 1 .</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN22</name>
								<description>ACTION 23 enable. This bit can be written only if the correspondent WADx bit is set in the        same access. It can be set for debug purposes by CPU also  when DPLL is        disabled. The enable bit becomes active only when the DPLL is in        operation  DEN 1 .</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN23</name>
								<description>ACTION 23 enable. This bit can be written only if the correspondent WADx bit is set in the        same access. It can be set for debug purposes by CPU also  when DPLL is        disabled. The enable bit becomes active only when the DPLL is in        operation  DEN 1 .</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD16</name>
								<description>Write control bit of Action 23. For WADx   1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx   0.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD17</name>
								<description>Write control bit of Action 23. For WADx   1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx   0.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD18</name>
								<description>Write control bit of Action 23. For WADx   1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx   0.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD19</name>
								<description>Write control bit of Action 23. For WADx   1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx   0.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD20</name>
								<description>Write control bit of Action 23. For WADx   1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx   0.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD21</name>
								<description>Write control bit of Action 23. For WADx   1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx   0.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD22</name>
								<description>Write control bit of Action 23. For WADx   1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx   0.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD23</name>
								<description>Write control bit of Action 23. For WADx   1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx   0.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
