J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>CTRL_5</name>
						<description>DPLL Control Register 5
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>20</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>AEN24</name>
								<description>ACTION 31 enable. This bit can be written only if the correspondent WADx bit is set in the        same access. It can be set for debug purposes by CPU also  when DPLL is        disabled. The enable bit becomes active only when the DPLL is in        operation  DEN 1 .</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN25</name>
								<description>ACTION 31 enable. This bit can be written only if the correspondent WADx bit is set in the        same access. It can be set for debug purposes by CPU also  when DPLL is        disabled. The enable bit becomes active only when the DPLL is in        operation  DEN 1 .</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN26</name>
								<description>ACTION 31 enable. This bit can be written only if the correspondent WADx bit is set in the        same access. It can be set for debug purposes by CPU also  when DPLL is        disabled. The enable bit becomes active only when the DPLL is in        operation  DEN 1 .</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN27</name>
								<description>ACTION 31 enable. This bit can be written only if the correspondent WADx bit is set in the        same access. It can be set for debug purposes by CPU also  when DPLL is        disabled. The enable bit becomes active only when the DPLL is in        operation  DEN 1 .</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN28</name>
								<description>ACTION 31 enable. This bit can be written only if the correspondent WADx bit is set in the        same access. It can be set for debug purposes by CPU also  when DPLL is        disabled. The enable bit becomes active only when the DPLL is in        operation  DEN 1 .</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN29</name>
								<description>ACTION 31 enable. This bit can be written only if the correspondent WADx bit is set in the        same access. It can be set for debug purposes by CPU also  when DPLL is        disabled. The enable bit becomes active only when the DPLL is in        operation  DEN 1 .</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN30</name>
								<description>ACTION 31 enable. This bit can be written only if the correspondent WADx bit is set in the        same access. It can be set for debug purposes by CPU also  when DPLL is        disabled. The enable bit becomes active only when the DPLL is in        operation  DEN 1 .</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEN31</name>
								<description>ACTION 31 enable. This bit can be written only if the correspondent WADx bit is set in the        same access. It can be set for debug purposes by CPU also  when DPLL is        disabled. The enable bit becomes active only when the DPLL is in        operation  DEN 1 .</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD24</name>
								<description>Write control bit of Action 31. For WADx   1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx   0.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD25</name>
								<description>Write control bit of Action 31. For WADx   1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx   0.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD26</name>
								<description>Write control bit of Action 31. For WADx   1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx   0.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD27</name>
								<description>Write control bit of Action 31. For WADx   1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx   0.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD28</name>
								<description>Write control bit of Action 31. For WADx   1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx   0.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD29</name>
								<description>Write control bit of Action 31. For WADx   1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx   0.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD30</name>
								<description>Write control bit of Action 31. For WADx   1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx   0.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAD31</name>
								<description>Write control bit of Action 31. For WADx   1  only the corresponding AENx bits are writable. The AENx        bits remain unchanged when the corresponding WADx   0.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ACT_STA</name>
						<description>DPLL ACTION Status Register with Connected Shadow Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>24</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ACT_N</name>
								<description>New output data values concerning to action i provided   ACT N. ACT N i  is  Set  for AENi 1 and a new valid PMTR   that means when new action data          are to be calculated for the correspondent action. After each          calculation of the new actions values  the ACT N i  bit updates the          corresponding bit in the connected shadow register. The status of the          ACT N i  bits in the shadow register is reflected by the corresponding          DPLL output signal ACT V  valid bit . Reset together with the corresponding shadow register bit for AENi 0. Reset without the corresponding shadow register bit when the          calculated event is in the past  the shadow register bit is set  when          it was not set before in that case . The corresponding shadow register bit is reset  when new PMTR data are          written or when the provided action data are read  blocking read . Writeable for debugging purposes together with the corresponding          shadow register when DEN 0. These bits can only be written for test purposes when the DPLL is          disabled.</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>OSW</name>
						<description>DPLL Offset and Switch Old New Address Register
 resetvalue={Application Reset:0x200}</description>
						<addressOffset>28</addressOffset>
						<size>32</size>
						<resetValue>512</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SWON_S</name>
								<description>Switch of new STATE. Switch bit for LSB address of STATE. This bit is changed for each write access to TS S TS S OLD. Using this        unchanged address bit SWON S for any access to TS S results always in an        access to TS S OLD. For writing to this address the former old         TS S OLD old  value is overwritten by the new one while the SWON S bit        changes. Thus the former new one is now the old one and the next access        is after changing SWON S directed to this place. Therefore write to TS S        first and after that immediately to FTV S and PSSM  always before a new        TS S value is to be written. After writing TS S  FTV S and PSSM in this order the address pointer AP        with LSB AP  SWON S shows for the corresponding address to TS S OLD         FTV S and PSSM while LSB AP   SWON S results in an access to TS S         FTV S old and PSSM OLD respectively. The value can be read only. This        bit is reset when disabling the DPLL  DEN 0 .</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SWON_T</name>
								<description>Switch of new TRIGGER. Switch bit for LSB address of TRIGGER. This bit is changed for each write access to TS T TS T OLD. Using this        unchanged address bit SWON T for any access to TS T results always in an        access to TS T OLD. For writing to this address the former old         TS T OLD old  value is overwritten by the new one while the SWON T bit        changes. Thus the former new one is now the old one and the next access        is after changing SWON T directed to this place. Therefore write to TS T        first and after that immediately to FTV T and PSTM  always before a new        TS T value is to be written. After writing TS T  FTV T and PSTM in this order the address pointer AP        with LSB AP  SWON T shows for the corresponding address to TS T OLD         FTV T and PSTM while LSB AP   SWON T results in an access to TS T         FTV T old and PSTM OLD respectively. The value can be read only. This        bit is reset when disabling the DPLL  DEN 0 .</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>OSS</name>
								<description>Offset size of RAM region 2. At least 128 and at most 1024 values can be stored in each of the RAM 2        regions a to d accordingly. The value can be set only for DEN 0. The        change of the OSS value results in an automatic change of the offset        values in the DPLL AOSV 2 register. This value can only be written when the DPLL is disabled.</description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>AOSV_2</name>
						<description>DPLL Address Offset Register of RAM 2 Regions
 resetvalue={Application Reset:0x18100800}</description>
						<addressOffset>32</addressOffset>
						<size>32</size>
						<resetValue>403703808</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>AOSV_2A</name>
								<description>Address offset value of the RAM 2A region. The value in this field is to be multiplied by 256  shift left 8 Bits         and added with the start address of the RAM in order to get the start        address of RAM region 2a. When the APT value is added to this start        address  the current RAM cell RDT Tx is addressed. Value is set automatically when OSS in the PPLL OSW register is set  OSS 0x0  AOSV 2A  0x00 OSS 0x1  AOSV 2A  0x00 OSS 0x2  AOSV 2A  0x00 OSS 0x3  AOSV 2A  0x00</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>AOSV_2B</name>
								<description>Address offset value of the RAM 2B region. The value in this field is to be multiplied by 256  shift left 8 Bits         and added with the start address of the RAM in order to get the start        address of RAM region 2b. When the APT value is added to this start        address  the current RAM cell TSF Tx is addressed. Value is set automatically when OSS in the PPLL OSW register is set  OSS 0x0  AOSV 2B  0x02 OSS 0x1  AOSV 2B  0x04 OSS 0x2  AOSV 2B  0x08 OSS 0x3  AOSV 2B  0x10</description>
								<lsb>8</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>AOSV_2C</name>
								<description>Address offset value of the RAM 2C region. The value in this field is to be multiplied by 256  shift left 8 Bits         and added with the start address of the RAM in order to get the start        address of RAM region 2c. When the APT value is added to this start        address  the current RAM cell ADT Tx is addressed. Value is set automatically when OSS in the PPLL OSW register is set  OSS 0x0  AOSV 2C  0x04 OSS 0x1  AOSV 2C  0x08 OSS 0x2  AOSV 2C  0x10 OSS 0x3  AOSV 2C  0x20</description>
								<lsb>16</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>AOSV_2D</name>
								<description>Address offset value of the RAM 2D region   AOSV 2D. The value in this field is to be multiplied by 256  shift left 8 Bits         and added with the start address of the RAM in order to get the start        address of RAM region 2d. When the APT value is added to this start        address  the current RAM cell DT Tx is addressed. Value is set automatically when OSS in the PPLL OSW register is set  OSS 0x0  AOSV 2D  0x06 OSS 0x1  AOSV 2D  0x0C OSS 0x2  AOSV 2D  0x18 OSS 0x3  AOSV 2D  0x30 The offset values are needed to support a scalable RAM size of region 2        from 1 5 Kbytes to 12 Kbytes. The values above must be in correlation        with the offset size defined in the OSW register. All offset values are        set automatically in accordance to the OSS value in the DPLL OSW        register. This value can be set only for DEN 0.</description>
								<lsb>24</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>APT</name>
						<description>DPLL Actual RAM Pointer Address for TRIGGER
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>36</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>WAPT</name>
								<description>Write bit for address pointer APT. Read as zero.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>APT</name>
								<description>Address pointer TRIGGER. Actual RAM pointer address value offset for DT T i  and RDT T i  in        FULL SCALE for 2  TNU 1 SYN NT  TRIGGER events. This pointer is used for the RAM region 2 subsections 2a and 2d. The        pointer APT is incremented for each active TRIGGER event  simultaneously with APT 2B  APT 2C  for DIR1 0. For DIR1 1 the        APT is decremented. The APT offset value is added in the above shown bit position with the        subsection address offset of the corresponding RAM region The APT pointer value is directed to the RAM position  in which the data        values are to be written  which corresponds to the last increment. The        APT value is not to be changed  when the direction  shown by DIR1         changes  because it points always to a storage place after the        considered increment. Changing of DIR1 takes place always after an        active TRIGGER event and the resulting        increment decrement. This value can only be written when the WAPT bit is set.</description>
								<lsb>2</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAPT_2B</name>
								<description>Write bit for address pointer APT 2B. Read as zero.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>APT_2B</name>
								<description>Address pointer TRIGGER for RAM region 2b. Actual RAM pointer address value for TSF T i  Actual RAM pointer address of TRIGGER events in FULL SCALE for 2  TNU 1  TRIGGER periods  this pointer is used for the RAM region 2b. The RAM pointer is        initially set to zero. For SYT 1   The pointer APT 2B is incremented by SYN T OLD for each active TRIGGER event  simultaneously with APT and APT 2C  for DIR1 0 when an active TRIGGER input appears. For DIR1 1  backwards  the APT is decremented by        SYN T OLD. For SYT 0   APT 2B is incremented or decremented by 1. In addition when the APT 2C value is written by the CPU   in order to        synchronize the DPLL  with the next active TRIGGER event the APT 2B EXT value is added subtracted  while APT 2B STATUS is        one  see DPLL APT SYNC register at CROSSREFERENCE  . This value can only be written when the WAPT 2B bit is set.</description>
								<lsb>14</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>APS</name>
						<description>DPLL Actual RAM Pointer Address for STATE
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>40</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>WAPS</name>
								<description>Write bit for address pointer APS. Read as zero</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>APS</name>
								<description>Address pointer STATE. Actual RAM pointer address value for DT S i  and RDT S i  Actual RAM pointer and synchronization position value of STATE events in FULL SCALE for up to 64 STATE events but limited to 2  SNU 1 SYN NS  in normal and emergency mode for        SYSF 0 or to 2  SNU 1  SYN NS for SYSF 1 respectively  this pointer is        used for the RAM region 1c1 and 1c4. APS is incremented  decremented  by one for each active STATE event and DIR2 0 DIR2 1 . The APS offset value is added in the above        shown bit position with the subsection offset of the RAM region. The APS pointer value is directed to the RAM position  in which the data        values are to be written  which correspond to the last increment. The        APS value is not to be changed  when the direction  shown by DIR2         changes  because it points always to a storage place after the        considered increment. Changing of DIR2 takes place always after an        active STATE event and the resulting        increment decrement. This value can only be written when the WAPS bit is set.</description>
								<lsb>2</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAPS_1C2</name>
								<description>Write bit for address pointer APS 1C2. Read as zero</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>APS_1C2</name>
								<description>Address pointer STATE for RAM region 1c2. Actual RAM pointer address value for TSF S i . Initial value  zero  0x00 . Actual RAM pointer and synchronization        position value of STATE events in        FULL SCALE for up to 64 STATE events but        limited to 2  SNU 1  in normal and emergency mode  this pointer is used        for the RAM region 1c2. For SYS 1   APS 1C2 is incremented  decremented  by SYN S OLD for each active STATE event and DIR2 0  DIR2 1 . For SYS 0   APT 1c2 is incremented or decremented by 1 respectively. The APS 1C2 offset value is added in the above shown bit position with        the subsection offset of the RAM region. In addition when the APS 1C3 value is written by the CPU   in order to        synchronize the DPLL  with the next active STATE event the APS 1C2 EXT value is added subtracted  while APS 1C2 STATUS is        one  see DPLL APT SYNC register at CROSSREFERENCE  . This value can only be written when the WAPS 1C2 bit is set</description>
								<lsb>14</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>APT_2C</name>
						<description>DPLL Actual RAM Pointer for Region 2C
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>44</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>APT_2C</name>
								<description>Address pointer TRIGGER for RAM region 2c and Actual RAM pointer address value for ADT T i . Actual RAM pointer address value of TRIGGER adapt events in FULL SCALE        for 2  TNU 1 SYN NT  TRIGGER periods depending on the size of the used        RAM 2  this pointer is used for the RAM region 2 for the subsection 2c        only. The RAM pointer is initially set to zero. The APT 2C value is set        by the CPU when the synchronization condition was detected. Within the        RAM region 2c initially the conditions for synchronization gaps and        adapted values are stored by the CPU.</description>
								<lsb>2</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>APS_1C3</name>
						<description>DPLL Actual RAM Pointer for RAM Region 1C3
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>48</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>APS_1C3</name>
								<description>Address pointer STATE for RAM region 1c3. Actual RAM pointer address value for ADT S i . Initial value  zero  0x00 . Actual RAM pointer and synchronization        position value of STATE events in        FULL SCALE for up to 64 STATE events but        limited to 2  SNU 1 SYN NS  in normal and emergency mode for SYSF 0 or        to 2  SNU 1  SYN NS for SYSF 1 respectively  this pointer is used for        the RAM region 1c3. The RAM pointer is set by the CPU accordingly  when        the synchronization condition was detected.</description>
								<lsb>2</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
