J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>NUTC</name>
						<description>DPLL Number of Recent TRIGGER Events Used for Calculations
 resetvalue={Application Reset:0x12001}</description>
						<addressOffset>52</addressOffset>
						<size>32</size>
						<resetValue>73729</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>NUTE</name>
								<description>Number of recent TRIGGER events used for SUB INC1 and action calculations modulo 2  TNUmax 1 . Number of recent TRIGGER events used for SUB INC1 and action calculations modulo 2  TNUmax 1 . NUTE  number of last nominal increments to be considered for the calculations. No gap is considered in that case for this value  but in the VTN value  see below   This value is set by the CPU  but reset automatically to  1  by a change of direction or loss of LOCK. Each other value can be set by the CPU  maybe Full SCALE  HALF SCALE or parts of them. For FULL SCALE set NUTE  2  TNU  1  and for HALF SCALE NUTE  TNU  1. The relation values QDT Tx are calculated using NUTE values in the past with its maximum value of 2  TNU  1 . The value zero  in combination with the value FST 1  does mean 2 11 values in the past. Note  To prevent that inconsistencies between internal pointer in which NUTE is used and the case decision of different prediction method s for prediction of the next event and PMT position minus time  occur  the NUTE value is stored internally at that point of time when the internal pointers are calculated for the next event cycle. Note  This value can only be written when the WNUT bit is set.</description>
								<lsb>0</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FST</name>
								<description>FULL SCALE of TRIGGER. This value is to be set  when NUTE is set to FULL SCALE. This value can only be written when the WNUT bit is set.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SYN_T</name>
								<description>Number of real and virtual events to be considered for the current increment. This value reflects the NT value of the last valid increment  stored in        ADT T i   to be updated after all calculations in step 17 of CROSSREFERENCE . This value can only be written when the WSYN bit in this register is set.</description>
								<lsb>13</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SYN_T_OLD</name>
								<description>Number of real and virtual events to be considered for the last increment. This value reflects the NT value of the last but one valid increment         stored in ADT T i   is updated automatically when writing SYN T. This value is updated by the SYN T value when the WSYN bit in this        register is set.</description>
								<lsb>16</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VTN</name>
								<description>Virtual TRIGGER number. Number of virtual increments in the current NUTE region This value reflects the number of virtual increments in the current NUTE        region  for NUTE 1 this value is zero  when the CPU sets NUTE to a value         gt  1   it must also set VTN to the correspondent value  for NUTE is set        to FULL SCALE including NUTE zero  2 11 modulo 2 11   the VTN is to be set to        2  SYN NT. The VTN value is subtracted from the NUTE value in order to get the        corresponding APT value for the past  the VTN value is not used for the        APT 2B pointer. VTN is to be updated by the CPU when a new gap is to be considered for        NUTE or a gap is leaving the NUTE region  for this purpose the TINT        values in the profile can be used to generate an interrupt for the CPU        at the corresponding positions  no further update of VTN is necessary        when NUTE is set to FULL SCALE This value can only be written when the WVTN bit is set.</description>
								<lsb>19</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WNUT</name>
								<description>Write control bit for NUTE and FST. Read as zero</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WSYN</name>
								<description>Write control bit for SYN T and SYN T OLD. Read as zero</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WVTN</name>
								<description>Write control bit for VTN. Read as zero</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>NUSC</name>
						<description>DPLL Number of Recent STATE Events Used for Calculations
 resetvalue={Application Reset:0x2081}</description>
						<addressOffset>56</addressOffset>
						<size>32</size>
						<resetValue>8321</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>NUSE</name>
								<description>Number of recent STATE events used for SUB INCx calculations modulo 2  SNUmax 1 . No gap is considered in that case for this value  but in the VSN value  see below   This register is set by the CPU but reset automatically to   x201c 1  x201d  by a change of direction or loss of LOCK. Each other value can be set by the CPU  maybe Full SCALE  HALF SCALE or parts of them. The relation values QDT Sx are calculated using NUSE values in the past with its maximum value of 2 SNU 1. This value can only be written when the WNUS bit is set. Note  To prevent that inconsistencies between internal pointer in which NUSE is used and the case decision of different prediction method s for prediction of the next event and PMT position minus time  occur  the NUSE value is stored internally at that point of time when the internal pointers are calculated for the next event cycle.</description>
								<lsb>0</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FSS</name>
								<description>FULL SCALE of STATE. This value is to be set  when NUSE is set to FULL SCALE. This value is set by the CPU  but reset automatically to  0  by a change of direction or loss of LOCK. Note  This value can only be written when the WNUS bit is set.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SYN_S</name>
								<description>Number of real and virtual events to be considered for the current increment. This value reflects the NS value of the last valid increment  stored in        ADT S i   to be updated after all calculations in step 37 of CROSSREFERENCE . This value can only be written when the WSYN bit in this register is set.</description>
								<lsb>7</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SYN_S_OLD</name>
								<description>Number of real and virtual events to be considered for the last increment. This value reflects the NS value of the last but one valid increment         stored in ADT S i   is updated automatically when writing SYN S. This value is updated by the SYN S value when the WSYN bit in this        register is set.</description>
								<lsb>13</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VSN</name>
								<description>Virtual STATE number. Number of virtual state increments in the current NUSE region. This value reflects the number of virtual increments in the current NUSE region  for NUSE 1 this value is zero  when the CPU sets NUSE to a value  gt  1 or zero 2 7 modulo 2 7     it must also set VSN to the correspondent value  the VSN value is subtracted from the NUSE value in order to get the corresponding APS value for the past  the VSN value is not used for the APS 1C2 pointer. VSN is to be updated by the CPU when a new gap is to be considered for NUSE or a gap is leaving the NUSE region  for this purpose the SASI interrupt can be used  no further update of VSN is necessary when NUSE is set to FULL SCALE This value can only be written when the WVSN bit is set.</description>
								<lsb>19</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WNUS</name>
								<description>Write control bit for NUSE. Read as zero. 0  the NUSE value is not writeable 1  the NUSE value is writeable</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WSYN</name>
								<description>Write control bit for SYN S and SYN S OLD. Read as zero 0  the SYN S value is not writeable 1  the SYN S value is writeable</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WVSN</name>
								<description>Write control bit for VS   WVSN. Read as zero</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>NTI_CNT</name>
						<description>DPLL Number of Active TRIGGER Events to Interrupt
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>60</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>NTI_CNT</name>
								<description>Number of TRIGGERs to interrupt. Number of active TRIGGER events to the next DPLL CDTI interrupt. This value shows the remaining TRIGGER events until an active TRIGGER slope results in a DPLL CDTI interrupt         the value is to be count down for each active TRIGGER event.</description>
								<lsb>0</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>EIRQ_EN</name>
						<description>DPLL Error Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>80</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>PDI_EIRQ_EN</name>
								<description>DPLL disable interrupt enable  when switch off of the DEN bit</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PEI_EIRQ_EN</name>
								<description>DPLL enable interrupt enable  when switch on of the DEN bit</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TINI_EIRQ_EN</name>
								<description>TRIGGER minimum hold time violation interrupt enable bit</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TAXI_EIRQ_EN</name>
								<description>TRIGGER maximum hold time violation interrupt enable bit</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SISI_EIRQ_EN</name>
								<description>STATE inactive slope interrupt enable bit</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TISI_EIRQ_EN</name>
								<description>TRIGGER inactive slope interrupt enable bit</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MSI_EIRQ_EN</name>
								<description>Missing STATE interrupt enable</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MTI_EIRQ_EN</name>
								<description>Missing TRIGGER interrupt enable</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SASI_EIRQ_EN</name>
								<description>STATE active slope interrupt enable</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TASI_EIRQ_EN</name>
								<description>TRIGGER active slope interrupt enable</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PWI_EIRQ_EN</name>
								<description>Plausibility window  PVT  violation interrupt of TRIGGER enable</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>W2I_EIRQ_EN</name>
								<description>RAM write access to RAM region 2 interrupt enable</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>W1I_EIRQ_EN</name>
								<description>Write access to RAM region 1b or 1c interrupt</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GL1I_EIRQ_EN</name>
								<description>Get of lock interrupt enable  when lock arises</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>LL1I_EIRQ_EN</name>
								<description>Loss of lock interrupt enable</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EI_EIRQ_EN</name>
								<description>Error interrupt enable  see status register </description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GL2I_EIRQ_EN</name>
								<description>Get of lock interrupt enable for SUB INC2</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>LL2I_EIRQ_EN</name>
								<description>Loss of lock interrupt enable for SUB INC2</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TE0I_EIRQ_EN</name>
								<description>TRIGGER event interrupt 0 enable</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TE1I_EIRQ_EN</name>
								<description>TRIGGER event interrupt 1 enable</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TE2I_EIRQ_EN</name>
								<description>TRIGGER event interrupt 2 enable</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TE3I_EIRQ_EN</name>
								<description>TRIGGER event interrupt 3 enable</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TE4I_EIRQ_EN</name>
								<description>TRIGGER event interrupt 4 enable</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CDTI_EIRQ_EN</name>
								<description>Enable interrupt when calculation of TRIGGER duration done</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CDSI_EIRQ_EN</name>
								<description>Enable interrupt when calculation of TRIGGER duration done</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TORI_EIRQ_EN</name>
								<description>TRIGGER out of range interrupt</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SORI_EIRQ_EN</name>
								<description>STATE out of range</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DCGI_EIRQ_EN</name>
								<description>Direction change interrupt</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>INC_CNT1</name>
						<description>DPLL Counter for Pulses for TBU CH1 BASE to be Sent in Automatic End Mode
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>176</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>INC_CNT1</name>
								<description>Actual number of pulses to be still sent out at the current increment until the next active input signal in automatic end mode. Automatic addition of the number of demanded pulses MLT MLS1 when        getting an active TRIGGER   STATE input in normal or emergency mode respectively when        SGE1 1  writeable only for test purposes when DEN 0. In the case of a change of the direction the wrong number of pulses are        corrected twice  Add the difference between NMB T and INC CNT1 twice to INC CNT1 before        sending out the correction pulses. This value can only be written when the DPLL is disabled.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>INC_CNT2</name>
						<description>DPLL Counter for Pulses for TBU TS2 to be Sent in Automatic End Mode
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>180</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>INC_CNT2</name>
								<description>Actual number of pulses to be still sent out at the current increment until the next active input signal in automatic end mode. Automatic addition of the number of demanded pulses MLS2 when getting an        active TRIGGER   STATE input in normal or emergency mode respectively when        SGE2 1   writeable only for test purposes when DEN 0  In the case of a change of the direction the wrong number of pulses are        corrected twice  Add the difference between NMB S and INC CNT2 twice to INC CNT2 before        sending out the correction pulses. This value can only be written when the DPLL is disabled.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>APT_SYNC</name>
						<description>DPLL Old RAM Pointer and Offset Value for TRIGGER
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>184</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>APT_2B_EXT</name>
								<description>Address pointer 2b extension. This offset value determines  by which value the APT 2B is changed at        the synchronization time  set by CPU before the synchronization is        performed. This offset value is the number of virtual increments to be inserted in        the TSF for an imminent intended synchronization  the CPU sets its value        dependent on the gaps until the synchronization time taking into account        the considered NUTE value to be set and including the next future        increment  when SYN T OLD is still 1 . When the synchronization takes        place  this value is to be added to the APT 2B address pointer  for        forward direction  DIR1 0  and the APT 2B STATUS bit is cleared after        it. For backward direction subtract APT 2B EXT accordingly. This        correction is done after updating the RAM TSF with the last TS T value. When the synchronization is intended and the NUTE value is to be set to        FULL SCALE after it  the APT 2B EXT value must be set to 2 SYN NT in        order to be able to fill all gaps in the extended TSF T with the        corresponding values by the CPU. When still not all values for FULL SCALE are available  the APT 2B EXT        value considers only a share according to the corresponding NUTE value        to be set after the synchronization.</description>
								<lsb>0</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>APT_2B_STATUS</name>
								<description>Address pointer 2b status. Set by CPU before the synchronization is performed. The value is cleared        when the APT 2B OLD value is written.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>APT_2B_OLD</name>
								<description>Address pointer TRIGGER for RAM region 2b at synchronization time. This value is set by the current APT 2B value when the synchronization        takes place for the first active TRIGGER event after writing APT 2C but        before adding the offset value APT 2B EXT  that means  when        APT 2B STATUS 1 . Address pointer APT 2B value at the moment of synchronization  before        the offset value is added  that means the pointer with this value points        to the last value before the additional inserted gap.</description>
								<lsb>14</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
