J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>APS_SYNC</name>
						<description>DPLL Old RAM Pointer and Offset Value for STATE
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>188</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>APS_1C2_EXT</name>
								<description>Address pointer 1c2 extension. This offset value determines  by which value the APS 1C2 is changed at        the synchronization time  set by CPU before the synchronization is        performed. This offset value is the number of virtual increments to be inserted in        the TSF for an imminent intended synchronization  the CPU sets its value        dependent on the gaps until the synchronization time taking into account        the considered NUSE value to be set and including the next future        increment  when SYN S OLD is still 1 . When the synchronization takes        place  this value is to be added to the APS 1C2 address pointer  for        forward direction  DIR2 0  and the APT 1c2 status bit is cleared after        it. For backward direction subtract APS 1C2 EXT accordingly. When the synchronization is intended and the NUSE value is to be set to        FULL SCALE after it  the APS 1C2 EXT value must be set to SYN NS  for        SYSF 1  or 2 SYN NS  for SYSF 0  in order to be able to fill all gaps in        the extended TSF S with the corresponding values by the CPU. When still not all values for FULL SCALE are available  the APS 1C2 EXT        value considers only a share according to the NUSE value to be set after        the synchronization.</description>
								<lsb>0</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>APS_1C2_STATUS</name>
								<description>Address pointer 1c2 status. Set by CPU before the synchronization is performed. The value is cleared        automatically when the APS 1C2 OLD value is written.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>APS_1C2_OLD</name>
								<description>Address pointer STATE for RAM region 1c2 at synchronization time. This value is set by the current APS 1C2 value when the synchronization        takes place for the first active STATE event after writing APS 1C3 but        before adding the offset value APS 1C2 EXT  that means  when        APS 1C2 STATUS 1 . Address pointer APS 1C2 value at the moment of synchronization  before        the offset value is added  that means the pointer with this value points        to the last value before the additional inserted gap.</description>
								<lsb>14</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TBU_TS0_T</name>
						<description>DPLL TBU TS0 Value at Last TRIGGER Event
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>192</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TBU_TS0_T</name>
								<description>Value of TBU TS0 at the last TRIGGER event. For each T valid the value of TBU TS0 is stored in this register  the        register is writeable only for test purposes when DEN 0. This value can only be written when the DPLL is disabled.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TBU_TS0_S</name>
						<description>DPLL TBU TS0 Value at Last STATE Event
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>196</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TBU_TS0_S</name>
								<description>Value of TBU TS0 at the last STATE event. For each S VALID the value of TBU TS0 is stored in this register the        register is writeable only for test purposes when DEN 0. This value can only be written when the DPLL is disabled.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ADD_IN_LD1</name>
						<description>DPLL Direct Load Input Value for SUB INC1
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>200</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ADD_IN_LD1</name>
								<description>Input value for SUB INC1 generation. Given by CPU. This value can be used in normal und emergency mode         SMC 0  as well as for SMC 1. For DLM1   1  The value is loaded by the        CPU but used by the DPLL only for DLM1 1  see DPLL CTRL 1 register .        When switching DLM1 to 1  the value in the register is used for the        SUB INC1 generation beginning from the next active TRIGGER or STATE event respectively        independently if new values are written by the CPU or not. When a new value is written the output frequency changes according to        the given value beginning immediately from the moment of writing. Do not        wait for performing step 10 in the state machine for ADD IN calculations. If the ADD IN LD1 value is zero all pulses are sent with the highest        possible frequency. For DLM1   0  The value loaded by the CPU        is stored directly in the internal add in register which is used to        control the sub increment pulse generator directly  see DPLL CTRL 1        register  DLM1   0 . When a new ADD IN LD1 value is written the output frequency is        immediately changed from the moment of writing. The ADD IN values        calculated internally of the DPLL are written to the internal ADD IN        register as well. In the moment when the internal calculation of the        ADD IN values is writing the results into the internal ADD IN register        of the pulse generator the internally calculated ADD IN values does        always have higher priority compared to the values written via the        ADD IN LD1 register. If the ADD IN LD1 value is zero all pulses are sent with the highest        possible frequency.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ADD_IN_LD2</name>
						<description>DPLL Direct Load Input Value for SUB INC2
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>204</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ADD_IN_LD2</name>
								<description>Input value for SUB INC2 generation. Given by CPU. This value can be used for SMC 1 while RMO 1. For DLM2   1  The value is loaded by the        CPU but used by the DPLL only for DLM2 1  see DPLL CTRL 1 register .        When switching DLM2 to 1  the value in the register is used for the        SUB INC2 generation beginning from the next STATE event respectively independently if new values are written by the CPU or        not. When a new value is written the output frequency changes according to        the given value beginning immediately from the moment of writing. Do not        wait for performing step 30 in the state machine for ADD IN        calculations. If the ADD IN LD2 value is zero all pulses are sent with        the highest possible frequency. For DLM2   0  The value loaded by the CPU        is stored directly in the internal add in register which is used to        control the sub increment pulse generator directly  see DPLL CTRL 1        register  DLM2   0 . When a new ADD IN LD2 value is written the output frequency is        immediately changed from the moment of writing. The ADD IN values        calculated internally of the DPLL are written to the internal ADD IN        register as well. In the moment when the internal calculation of the        ADD IN values is writing the results into the internal ADD IN register        of the pulse generator the internally calculated ADD IN values does        always have higher priority compared to the values written via the        ADD IN LD2 register. If the ADD IN LD2 value is zero all pulses are sent with the highest        possible frequency.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>STATUS</name>
						<description>DPLL Status Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>252</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>FPCE</name>
								<description>Fast pulse correction error</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CSO</name>
								<description>Calculated STATE duration overflow. Bit is set when equations DPLL 10a or DPLL 10b lead to an overflow.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CTO</name>
								<description>Calculated TRIGGER duration overflow. Bit is set when equations DPLL 5a or DPLL 5b lead to an overflow. When one of the above bits is set the corresponding register contains        the maximum value 0xFFFFFF.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CRO</name>
								<description>Calculated Reciprocal value overflow. Bit is set when the calculation of RDT T ACT or RDT S ACT leads to an        overflow. An overflow in calculation of reciprocal values can occur  when the        condition of Note 3  to the        DPLL CTRL 0 register is violated  see CROSSREFERENCE  .        Such an overflow can occur according to the calculations in equations         DPLL 1c  or  DPLL 6c . The overflow is detected when after the calculation and shifting left 32        bits at least one of the bits 31 to 24 is not zero. In that case the        corresponding register is set to 0xFFFFFF.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RCS</name>
								<description>Resolution conflict STATE</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RCT</name>
								<description>Resolution conflict TRIGGER</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>PSE</name>
								<description>Prediction space configuration error</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SOR</name>
								<description>STATE out of range. The SOR bit is set  when the time to the next active STATE slope exceeds the value of the last nominal STATE duration multiplied with the value of the SLR register  see CROSSREFERENCE          and is reset  when at the current or last active input event a direction        change was detected. The SYS bit is not influenced by setting the SOR        bit.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MS</name>
								<description>Missing STATE detected according to SOV</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TOR</name>
								<description>TRIGGER out of range. The TOR bit is set  when the time to the next active TRIGGER slope exceeds the value of the last nominal TRIGGER duration multiplied with the value of the TLR register  see CROSSREFERENCE          and is reset  when at the current or last active input event a direction        change was detected. The SYT bit is not influenced by setting the TOR        bit.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MT</name>
								<description>Missing TRIGGER detected according to TOV</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RAM2_ERR</name>
								<description>DPLL internal access to not configured RAM2 memory space</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>LOW_RES</name>
								<description>Low resolution of TBU TS0 is used for DPLL input. This value reflects the input signal LOW RES.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CSVS</name>
								<description>Current signal value STATE</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CSVT</name>
								<description>Current signal value TRIGGER</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CAIP2</name>
								<description>Calculation of upper half actions in progress</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CAIP1</name>
								<description>Calculation of lower half actionsin progress</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ISN</name>
								<description>Increment number of STATE is not plausible</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ITN</name>
								<description>Increment number of TRIGGER is not plausible. Bit is set when the number of TRIGGERS is different to profile.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>BWD2</name>
								<description>Backwards drive of SUB INC2</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>BWD1</name>
								<description>Backwards drive of SUB INC1</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>LOCK2</name>
								<description>DPLL Lock status concerning SUB INC2. Locking of SUB INC2 appears for RMO SMC 1  Bit is set  when SYS is set        and the number of events between two missing STATE s        is as expected by the SYN S values. LOCK2 is set for SMC RMO 1  for an active STATE event when SYS is set and SYN NS 0or when SYS is set        and the profile stored in the ADT Si field matches once between two gaps. LOCK2 is reset  for SMC RMO 1 when a missing STATE event occurs while SYN S 1. This does mean an        unexpected missing STATE. when the corresponding input signal STATE is out of locking range SLR</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SYS</name>
								<description>Synchronization condition of STATE fixed. This bit is set when the CPU writes to the APS 1C3 address pointer.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SYT</name>
								<description>Synchronization condition of TRIGGER fixed. This bit is set when the CPU writes to the APT 2C address pointer.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>FSD</name>
								<description>First STATE detected. No change of FSD for switching from normal to emergency mode or vice        versa.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>FTD</name>
								<description>First TRIGGER detected. No change of FTD for switching from normal to emergency mode or vice        versa.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>LOCK1</name>
								<description>DPLL Lock status concerning SUB INC1. LOCK1 is set  in normal mode  for RMO SMC 0  LCD 0   Bit is set for an active          TRIGGER event when SYT is set and the number of events between two          gaps is as expected by the profile  NT values in the ADT T i  field           or when SYN NT 0 and SYT 1. in normal mode  for RMO SMC 0  LCD 1   Bit is set for an active          TRIGGER event when SYT is set and the number of events between two          increments without missing TRIGGER  no gap  is as expected by the          profile  NT values in the ADT T i  field  in emergency mode  for RMO 1 and SMC 0   Bit is set for an active          STATE event  when SYS is set and the received events are in          correspondence to the profile  NS values in the ADT S i  field  for at          least two  four in case of direction change  expected missing STATE          events or when SYN NS 0. for SMC 1  Bit is set for an active TRIGGER even when SYT is set and          SYN NT 0 or when SYT is set and the profile stored in the ADT T i           field matches once between two gaps. LOCK1 is reset for RMO SMC 0  when a corresponding missing TRIGGER event occurs while SYN T 1. This          does mean an unexpected missing TRIGGER. when the corresponding input signal TRIGGER is out of locking range          TLR  when a corresponding direction change is detected  for RMO 1 and SMC 0  when a corresponding missing STATE event occurs while SYN S 1. This          does mean an unexpected missing STATE. when the corresponding input signal STATE is out of locking range TLR for SMC 1  when a corresponding missing TRIGGER event occurs while SYN T 1. This          does mean an unexpected missing TRIGGER. when the corresponding input signal TRIGGER is out of locking range          TLR  when a corresponding direction change is detected</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ERR</name>
								<description>Error during configuration or operation resulting in unexpected values</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>32</dim>
						<dimIncrement>4</dimIncrement>
						<name>DPLL_ID_PMTR_z[%s]</name>
						<description>DPLL ID Information for Input Signal PMT 0 Register
 resetvalue={Application Reset:0x1FE}</description>
						<addressOffset>256</addressOffset>
						<size>32</size>
						<resetValue>510</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ID_PMTR_X</name>
								<description>ID information to the input signal PMTR z  from the ARU. This value can only be written when the action  z  is disabled by the        correspondent bit AENz 0 of the registers DPLL CTRL 2  ...5         respectively  or when the DPLL is disabled  DEN 0 .</description>
								<lsb>0</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CTRL_0_SHADOW_TRIGGER</name>
						<description>DPLL Control 0 Shadow Trigger Register
 resetvalue={Application Reset:0x257}</description>
						<addressOffset>480</addressOffset>
						<size>32</size>
						<resetValue>599</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>MLT</name>
								<description>Multiplier for TRIGGER. Only the values characterized by 1       are stored for an active TRIGGER slope. All other values remain 0. When      DEN 0 the relevant bit values of the original register DPLL CTRL 0 are      transferred without any input event at the next system clock. This results      in the above reset value. MLT 1 is number of SUB INC1 pulses between two TRIGGER events in normal        mode  1  8230 1024 .</description>
								<lsb>0</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>IFP</name>
								<description>Input filter position. CROSSREFERENCE Value contains position or time related information.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>AMT</name>
								<description>Adapt mode TRIGGER. CROSSREFERENCE Use of adaptation information of TRIGGER.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>IDT</name>
								<description>Input delay TRIGGER. CROSSREFERENCE Use of input delay information transmitted in FT part of the TRIGGER        signal.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RMO</name>
								<description>Reference mode. CROSSREFERENCE Selection of the relevant the input signal for generation of SUB INC1.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CTRL_0_SHADOW_STATE</name>
						<description>DPLL Control 0 Shadow STATE Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>484</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>IFP</name>
								<description>Input filter position. Only the values characterized by 1       are stored for an active STATE slope. All other values remain 0. When      DEN 0 the relevant bit values of the original register DPLL CTRL 0 are      transferred without any input event at the next system clock. Value contains position or time related information.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>AMS</name>
								<description>Adapt mode STATE. CROSSREFERENCE Use of adaptation information of STATE.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>IDS</name>
								<description>Input delay STATE. CROSSREFERENCE Use of input delay information transmitted in FT part of the STATE        signal.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RMO</name>
								<description>Reference mode. CROSSREFERENCE Selection of the relevant the input signal for generation of SUB INC1.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
