J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>CTRL_1_SHADOW_TRIGGER</name>
						<description>DPLL Control 1 Shadow TRIGGER Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>488</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DMO</name>
								<description>DPLL mode select. Only the values characterized by 1       are stored for an active TRIGGER slope. All other values remain 0. When      DEN 0 the relevant bit values of the original register DPLL CTRL 1 are      transferred without any input event at the next system clock.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>COA</name>
								<description>Correction strategy in automatic end mode  DMO 0 . CROSSREFERENCE</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>PIT</name>
								<description>Plausibility value PVT to next valid TRIGGER is time related. CROSSREFERENCE</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SGE1</name>
								<description>SUB INC1 generator enable. CROSSREFERENCE</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>DLM1</name>
								<description>Direct Load Mode for SUB INC1 generation. CROSSREFERENCE</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>PCM1</name>
								<description>Pulse Correction Mode for SUB INC1 generation. CROSSREFERENCE</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CTRL_1_SHADOW_STATE</name>
						<description>DPLL Control 1 Shadow STATE Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>492</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DMO</name>
								<description>DPLL mode select. Only the values characterized by 1       are stored for an active STATE slope. All other values remain 0. When      DEN 0 the relevant bit values of the original register DPLL CTRL 1 are      transferred without any input event at the next system clock.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>COA</name>
								<description>Correction strategy in automatic end mode  DMO 0 . CROSSREFERENCE</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SGE1</name>
								<description>SUB INC1 generator enable. CROSSREFERENCE</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>DLM1</name>
								<description>Direct Load Mode for SUB INC1 generation. CROSSREFERENCE</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>PCM1</name>
								<description>Pulse Correction Mode for SUB INC1 generation. CROSSREFERENCE</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SGE2</name>
								<description>SUB INC2 generator enable. CROSSREFERENCE</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>DLM2</name>
								<description>Direct Load Mode for SUB INC2 generation. CROSSREFERENCE</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>PCM2</name>
								<description>Pulse Correction Mode for SUB INC2 generation. CROSSREFERENCE</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>RAM_INI</name>
						<description>DPLL RAM Initialization Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>508</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>INIT_1A</name>
								<description>RAM region 1a initialization in progress</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>INIT_1BC</name>
								<description>RAM region 1b and 1c initialization in progress. Coding see bit 0.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>INIT_2</name>
								<description>RAM region 2 initialization in progress. Coding see bit 0.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>INIT_RAM</name>
								<description>RAM regions 1a  1b and 2 are to be initialized. Setting the INIT RAM bit results only in a RAM reset when the DPLL is        not enabled  DEN 0 . Depending on the vendor configuration  the connected RAM regions are        initialized to zero in the case of a module HW reset or for setting the        RST bit in the GTM RST register. In the case of no RAM initialization  it must be ensured that all        relevant parameters are configured correctly. Otherwise  there is no        guarantee to get a predictable behavior.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>32</dim>
						<dimIncrement>4</dimIncrement>
						<name>DPLL_PSAi[%s]</name>
						<description>DPLL ACTION 0 Position Value Request
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1A:0x0}</description>
						<addressOffset>512</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>PSA</name>
								<description>Position information of a desired action i. This value can only be written when the DPLL is disabled. The PSA values for actions 24...31 are not available for all devices but        depends on specific product configuration.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>32</dim>
						<dimIncrement>4</dimIncrement>
						<name>DPLL_DLAi[%s]</name>
						<description>DPLL ACTION 0 Time to React before PSAi
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1A:0x0}</description>
						<addressOffset>640</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>DLA</name>
								<description>Time to react before the corresponding position value of a desired action i is reached. In the case of LOW RES 1  see CROSSREFERENCE       this delay value must be also given as low resolution value. This value can only be written when the DPLL is disabled.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>32</dim>
						<dimIncrement>4</dimIncrement>
						<name>DPLL_NAi[%s]</name>
						<description>DPLL Calculated Number of TRIGGER STATE Increments to ACTION 0
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1A:0x0}</description>
						<addressOffset>768</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>DB</name>
								<description>Number of events to Action i  fractional part . The NA values for actions 24...31 are only available for device 4 or 5. This value can only be written when the DPLL is disabled.</description>
								<lsb>0</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DW</name>
								<description>Number of events to Action i  integer part . Use the maximum value for NA DW 0x3FF in the case of a calculated value    which exceeds the represent able value. This value can only be written when the DPLL is disabled.</description>
								<lsb>10</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>32</dim>
						<dimIncrement>4</dimIncrement>
						<name>DPLL_DTAi[%s]</name>
						<description>DPLL Calculated Relative TIME to ACTION 0
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1A:0x0}</description>
						<addressOffset>896</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>DTA</name>
								<description>Calculated relative time to ACTION i. This value can only be written when the DPLL is disabled. The DTA value    is a positive integer value. When calculations using equations DPLL 12    or DPLL 14 result in a negative value  it is replaced by zero.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TS_T</name>
						<description>DPLL Actual TRIGGER Time Stamp Value
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1024</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>TRIGGER_TS</name>
								<description>Time stamp value of the last active TRIGGER input. Measured TRIGGER time stamp. The LSB address is determined using the SWON T value in the OSW register         see CROSSREFERENCE  .</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TS_T_OLD</name>
						<description>DPLL Previous TRIGGER Time Stamp Value
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1028</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>TRIGGER_TS_OLD</name>
								<description>Time stamp value of the last but one active TRIGGER input. Previous measured TRIGGER time stamp. The LSB address is determined using the SWON T value in the OSW register         see CROSSREFERENCE  .</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>FTV_T</name>
						<description>DPLL Actual TRIGGER Filter Value
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1032</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>TRIGGER_FT</name>
								<description>Filter value of the last active TRIGGER input. Transmitted filter value. The LSB address is determined using the SWON T value in the OSW register         see CROSSREFERENCE  .</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TS_S</name>
						<description>DPLL Actual STATE Time Stamp
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1040</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>STATE_TS</name>
								<description>Time stamp value of the last active STATE input. The LSB address is determined using the SWON S value in the OSW register         see CROSSREFERENCE  .</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TS_S_OLD</name>
						<description>DPLL Previous STATE Time Stamp
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1044</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>STATE_TS_OLD</name>
								<description>Time stamp value of the last active STATE input. The LSB address is determined using the SWON S value in the OSW register         see CROSSREFERENCE  .</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>FTV_S</name>
						<description>DPLL Actual STATE Filter Value
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1048</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>STATE_FT</name>
								<description>Filter value of the last active STATE input. transmitted filter value The LSB address is determined using the SWON S value in the OSW register         see CROSSREFERENCE  .</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>THMI</name>
						<description>DPLL TRIGGER Hold Time Minimum Value
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1056</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>THMI</name>
								<description>Minimal time between active and inactive TRIGGER slope  uint16 . The time value corresponds to the time stamp clock counts  this does mean the clock selected for the TBU CH0 BASE  see TBU CH0 CTRL        register  set min. value  generate the TINI interrupt in the case of a violation        for THMI gt 0. Typical retention time values after an active slope can be e.g. between        45   181 s  forwards  and 90   181 s  backwards . When THMI is zero  consider        always a THMI violation  forwards .</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>THMA</name>
						<description>DPLL TRIGGER Hold Time Maximum Value
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1060</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>THMA</name>
								<description>Maximal time between active and inactive TRIGGER slope  uint16 . The time value corresponds to the time stamp clock counts  This does mean the clock selected for the TBU CH0 BASE  see TBU CH0 CTRL        register  Max. value to be set  generate the TAX interrupt in the case of a        violation for THMA gt 0.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>THVAL</name>
						<description>DPLL Measured TRIGGER Hold Time Value
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1064</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>THVAL</name>
								<description>Measured time from the last active slope to the next inactive TRIGGER slope in time stamp clock counts  this does mean the clock selected for the TBU CH0 BASE  uint16 . The measured value considers all input slope filter delays. From the        received input the corresponding filter delays are subtracted before the        time stamp difference of active and inactive slope is calculated.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TOV</name>
						<description>DPLL Time Out Value of Active TRIGGER Slope
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1072</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>TOV_DB</name>
								<description>Decision value  fractional part  for missing TRIGGER interrupt</description>
								<lsb>0</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TOV_DW</name>
								<description>Decision value  integer part  for missing TRIGGER interrupt. TOV 15 0  is to be multiplied with the duration of the last increment        and divided by 1024 in order to get the time out time value for a        missing TRIGGER event. For the case of LOW RES 1  see DPLL STATUS register  consider for the        calculation of the time out value the following cases  LOW RES 1 and DPLL CTRL 1 TS0 HRT 1    160   160   160 multiply the TBU TS0 value by 8 LOW RES 1 and DPLL CTRL 1 TS0 HRT 0    160   160   160 multiply the TBU TS0 value by 8   160   160   160 multiply the estimated time point value  using TS T  dt t ACT and          160   160   160 TOV  by 8 LOW RES 0 and DPLL CTRL 1 TS0 HRT 0    160   160   160 use TBU TS0 and the estimated time point value unchanged.</description>
								<lsb>10</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TOV_S</name>
						<description>DPLL Time Out Value of Active STATE Slope
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1076</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>DB</name>
								<description>Decision value  fractional part  for missing STATE interrupt</description>
								<lsb>0</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DW</name>
								<description>Decision value  integer part  for missing STATE interrupt. TOV S  15 0  is to be multiplied with the duration of the last increment        and divided by 1024 in order to get the time out time value for a        missing STATE event. For the case of LOW RES 1  see DPLL STATUS register  consider for the        calculation of the time out value the following cases  LOW RES 1 and DPLL CTRL 1 TS0 HRS 1    160   160   160 multiply the TBU TS0 value by 8 LOW RES 1 and DPLL CTRL 1 TS0 HRS 0    160   160   160 multiply the TBU TS0 value by 8   160   160   160 multiply the estimated time point value  using TS T  dt s ACT and          160   160   160 SOV  by 8 LOW RES 0 and DPLL CTRL 1 TS0 HRS 0    160   160   160 use TBU TS0 and the estimated time point value unchanged.</description>
								<lsb>10</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ADD_IN_CAL1</name>
						<description>DPLL Calculated ADD IN Value for SUB INC1 Generation
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1080</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>ADD_IN_CAL1</name>
								<description>Calculated input value for SUB INC1 generation  calculated by the DPLL. Calculated value. The update of the ADD IN value by the new calculated value ADD IN CAL1        is suppressed for one increment when an unexpected missing TRIGGER         SMC 1 or RMO 0  or an unexpected STATE  RMO 1 and SMC 0  is detected.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ADD_IN_CAL2</name>
						<description>DPLL Calculated ADD IN Value for SUB INC2 Generation
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1084</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>ADD_IN_CAL2</name>
								<description>Input value for SUB INC2 generation  calculated by the DPLL for SMC RMO 1. Calculated value. The update of the ADD IN value by the calculated value ADD IN CAL2 is        suppressed for one increment when an unexpected missing STATE         RMO SMC 1  is detected.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MPVAL1</name>
						<description>DPLL Missing Pulses to be Added or Subtracted Directly 1
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1088</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>MPVAL1</name>
								<description>Missing pulses for direct correction of SUB INC1 pulses by the CPU  sint16 . Used only for RMO 0 or SMC 1 for the case PCM1 1. Add MPVAL1 once to        INC CNT1 and reset PCM1 after applying once.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SIX1</name>
								<description>Sign extension for MPVAL1. All bits must be written to either all zeros or all ones.</description>
								<lsb>16</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MPVAL2</name>
						<description>DPLL Missing Pulses to be Added or Subtracted Directly 2
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1092</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>MPVAL2</name>
								<description>Missing pulses for direct correction of SUB INC2 pulses by the CPU  sint16 . Used only for SMC RMO 1 for the case PCM2 1. Add MPVAL2 once to        INC CNT2  and reset PCM2 after applying once. Do not provide negative values which exceed the amount of MLS2  when        considered negative PD S values  the sum of both should not exceed the        amount of MLS2.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SIX2</name>
								<description>Sign extension for MPVAL2. All bits must be written to either all zeros or all ones.</description>
								<lsb>16</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
