J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>NMB_T_TAR</name>
						<description>DPLL Target Number of Pulses to be Sent in Normal Mode
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1096</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>NMB_T_TAR</name>
								<description>Target Number of pulses for TRIGGER. Calculated number of pulses in normal mode for the current TRIGGER increment without missing pulses. Calculated target pulse number. The LSB address is determined using the SWON T value in the OSW register         see CROSSREFERENCE  .</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>NMB_T_TAR_OLD</name>
						<description>DPLL Last but One Target Number of Pulses to be Sent in Normal Mode
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1100</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>NMB_T_TAR_OLD</name>
								<description>Target Number of pulses for TRIGGER. Calculated number of pulses in normal mode for the current TRIGGER increment without missing pulses. Calculated target pulse number. The LSB address is determined using the SWON T value in the OSW register         see CROSSREFERENCE  .</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>NMB_S_TAR</name>
						<description>DPLL Target Number of Pulses to be Sent in Emergency Mode
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1104</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>NMB_S_TAR</name>
								<description>Target Number of pulses for STATE. Calculated number of pulses in emergency mode for the current STATE increment without missing pulses. Calculated target pulse number. The LSB address is determined using the SWON S value in the OSW register         see CROSSREFERENCE  .</description>
								<lsb>0</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>NMB_S_TAR_OLD</name>
						<description>DPLL Last but One Target Number of Pulses to be Sent in Emergency Mode
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1108</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>NMB_S_TAR_OLD</name>
								<description>Target Number of pulses for STATE. Calculated number of pulses in emergency mode for the current STATE increment without missing pulses. Calculated target pulse number. The LSB address is determined using the SWON S value in the OSW register         see CROSSREFERENCE  .</description>
								<lsb>0</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>RCDT_TX</name>
						<description>DPLL Reciprocal Value of the Expected Increment Duration of TRIGGER
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1120</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>RCDT_TX</name>
								<description>Reciprocal value of expected increment duration  2 32 while only the lower 24 bits are used. Calculated value  when an overflow occurs in the calculation  the value        is set to 0xFFFFFF.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>RCDT_SX</name>
						<description>DPLL Reciprocal Value of the Expected Increment Duration of STATE
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1124</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>RCDT_SX</name>
								<description>Reciprocal value of expected increment duration  2 32 while only the lower 24 bits are used. Calculated value  when an overflow occurs in the calculation  the value        is set to 0xFFFFFF.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>RCDT_TX_NOM</name>
						<description>DPLL Reciprocal Value of the Expected Nominal Increment Duration of TRIGGER
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1128</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>RCDT_TX_NOM</name>
								<description>Reciprocal value of nominal increment duration  2 32 while only the lower 24 bits are used. Calculated value  when an overflow occurs in the calculation  the value        is set to 0xFFFFFF.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>RCDT_SX_NOM</name>
						<description>DPLL Reciprocal Value of the Expected Nominal Increment Duration of STATE
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1132</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>RCDT_SX_NOM</name>
								<description>Reciprocal value of nominal increment duration  2 32 while only the lower 24 bits are used. Calculated value  when an overflow occurs in the calculation  the value        is set to 0xFFFFFF.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>RDT_T_ACT</name>
						<description>DPLL Reciprocal Value of the Last Increment of TRIGGER
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1136</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>RDT_T_ACT</name>
								<description>Reciprocal value of last TRIGGER increment  2 32  only the lower 24 bits are used. The LSB is rounded up when the next truncated bit is 1. Calculated value  when an overflow occurs in the calculation  the value        is set to 0xFFFFFF and the CRO bit in the DPLL STATUS register is set         see CROSSREFERENCE  .</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>RDT_S_ACT</name>
						<description>DPLL Reciprocal Value of the Last Increment of STATE
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1140</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>RDT_S_ACT</name>
								<description>Reciprocal value of last STATE increment  2 32  only the lower 24 bits are used. The LSB is rounded up when the next truncated bit is 1. Calculated value  when an overflow occurs in the calculation  the value        is set to 0xFFFFFF and the CRO bit in the DPLL STATUS register is set         see CROSSREFERENCE  .</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DT_T_ACT</name>
						<description>DPLL Duration of the Last TRIGGER Increment
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1144</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>DT_T_ACT</name>
								<description>Calculated duration of the last TRIGGER increment. Calculated duration of the last increment  Value will be written into        the corresponding RAM field  when all calculations for the considered        increment are done and APT is valid.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DT_S_ACT</name>
						<description>DPLL Duration of the Last STATE Increment
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1148</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>DT_S_ACT</name>
								<description>Calculated duration of the last STATE increment. Calculated increment duration. Value will be written into the        corresponding RAM field  when all calculations for the considered        increment are done and APS is valid.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>EDT_T</name>
						<description>DPLL Difference of Prediction to Actual Value of the Last TRIGGER Increment
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1152</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>EDT_T</name>
								<description>Signed difference between actual value and a simple prediction of the last TRIGGER increment  sint24. Calculated error value.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MEDT_T</name>
						<description>DPLL Weighted Difference of Prediction Errors of TRIGGER
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1156</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>MEDT_T</name>
								<description>Signed middle weighted difference between actual value and prediction of the last TRIGGER increments  sint24. Only calculated for SYT 1. Calculated medium error value  see CROSSREFERENCE . The value is calculated only after synchronization  SYT 1   and the        update is suppressed for one increment when an unexpected missing        TRIGGER is detected.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>EDT_S</name>
						<description>DPLL Difference of Prediction to Actual Value of the Last STATE Increment
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1160</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>EDT_S</name>
								<description>Signed difference between actual value and prediction of the last STATE increment  sint24. Calculated error value  see CROSSREFERENCE .</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MEDT_S</name>
						<description>DPLL Weighted Difference of Prediction Errors of STATE
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1164</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>MEDT_S</name>
								<description>Signed middle weighted difference between actual value and prediction of the last STATE increments  sint24  only calculated for SYS 1. Calculated medium error value  see CROSSREFERENCE . The value is calculated only after synchronization  SYS 1   and the        update is suppressed for one increment when an unexpected missing STATE        is detected.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CDT_TX</name>
						<description>DPLL Prediction of the Actual TRIGGER Increment Duration
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1168</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>CDT_TX</name>
								<description>Calculated duration of the current TRIGGER increment. Calculated value.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CDT_SX</name>
						<description>DPLL Prediction of the Actual STATE Increment Duration
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1172</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>CDT_SX</name>
								<description>Calculated duration of the current STATE increment. Calculated value.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CDT_TX_NOM</name>
						<description>DPLL Prediction of the Nominal TRIGGER Increment Duration
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1176</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>CDT_TX_NOM</name>
								<description>Calculated duration of the current nominal TRIGGER event. Calculated value.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CDT_SX_NOM</name>
						<description>DPLL Prediction of the Nominal STATE Increment Duration
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1180</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>CDT_SX_NOM</name>
								<description>Calculated duration of the current nominal STATE event. Calculated value.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TLR</name>
						<description>DPLL TRIGGER Locking Range
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1184</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>TLR</name>
								<description>Value is to be multiplied with the last nominal TRIGGER duration in order to get the range for the next TRIGGER event without setting TOR in the DPLL STATUS register. Multiply value with the last nominal increment duration and check        violation  when TLR 0 don t perform the check.</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>SLR</name>
						<description>DPLL STATE Locking Range
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1188</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>SLR</name>
								<description>Value is to be multiplied with the last nominal STATE duration in order to get the range for the next STATE event without setting SOR in the DPLL STATUS register. Multiply value with the last nominal increment duration and check        violation  when SLR 0 don t perform the check.</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>32</dim>
						<dimIncrement>4</dimIncrement>
						<name>DPLL_PDT_z[%s]</name>
						<description>DPLL Projected Increment Sum Relations for Action 0
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1280</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>DB</name>
								<description>Fractional part of relation between TRIGGER or STATE increments</description>
								<lsb>0</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DW</name>
								<description>Integer part of relation between TRIGGER or STATE increments. Definition of relation values between TRIGGER or STATE increments PDT i  according to        Equations DPLL 11 or DPLL 13  i   0 31 . . The        PDT z  values for actions i 24...31 are not available for all devices. The PDT i  values for actions i 24...31 are only available for device 4        or 5.</description>
								<lsb>14</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MLS1</name>
						<description>DPLL Calculated Number of Sub Pulses between two Nominal STATE Events for SMC   0
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1472</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>MLS1</name>
								<description>Number of pulses between two STATE events. For SMC 0 the value of MLS1 is calculated once by the CPU for fixed        values in the DPLL CTRL 0 register by the formula MLS1            MLT 1   TNU 1   SNU 1   and set accordingly. For SMC 1 the value of MLS1 represents the number of pulses between two        nominal TRIGGER events  to be set and        updated by the CPU .</description>
								<lsb>0</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MLS2</name>
						<description>DPLL Calculated Number of Sub Pulses between two Nominal STATE Events for SMC   1 and RMO   1
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1476</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>MLS2</name>
								<description>Number of pulses between two STATE events  to be set and updated by the CPU . Using adapt information and the missing STATE event information SYN S  this value can be corrected for each increment        automatically.</description>
								<lsb>0</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CNT_NUM_1</name>
						<description>DPLL Number of Sub Pulses of SUB INC1 in Continuous Mode
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1480</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>CNT_NUM_1</name>
								<description>Counter for number of SUB INC1 pulses. Number of pulses in continuous mode for a nominal increment in normal        and emergency mode for SUB INC1  given and updated by CPU only. Count value for continuous mode.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CNT_NUM_2</name>
						<description>DPLL Number of Sub Pulses of SUB INC2 in Continuous Mode
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1484</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>CNT_NUM_2</name>
								<description>Counter for number of SUB INC2 pulses. Number of pulses in continuous mode for a nominal increment in normal        and emergency mode for SUB INC2  given and updated by CPU only. Count value for continuous mode.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>PVT</name>
						<description>DPLL Plausibility Value of Next TRIGGER Slope
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1488</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>PVT</name>
								<description>Plausibility value of next active TRIGGER slope. The meaning of the value depends on the value of the PIT value in the DPLL CTRL 1 register. For PIT 0  the number of SUB INC1 pulses to be waited for until a next active TRIGGER event is accepted. For PIT 1  PVT is to be multiplied with the last nominal increment time DT T ACT and divided by 1024 and reduced to a 24 bit value in order to get the time to be waited for until the next active TRIGGER event is accepted. The wait time must be exceeded for an active slope. Note  When an active TRIGGER slope is detected while the wait condition is not fulfilled the interrupt PWI is generated. Please note  that the SGE1 must be set  when PIT 0 in order to provide the necessary SUB INC1 pulses for checking. After an unexpected missing TRIGGER the plausibility check is suppressed for the following increment. In case of direction change the PVT value is automatically set to zero in order to deactivate the check .</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>PSTC</name>
						<description>DPLL Actual Calculated Position Stamp of TRIGGER
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1504</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>PSTC</name>
								<description>Calculated position stamp of last TRIGGER input. Value is set by the DPLL and can be updated by the CPU when filter values are to be considered for the exact position  see DPLL STATUS and DPLL CTRL registers for explanation of the status and control bits used . For each active slope of TRIGGER in normal mode. When FTD 0  PSTC is set from actual position value  for the first active TRIGGER event  no filter delay considered  the CPU must update the value once  taking into account the filter value. When FTD 1  PSTC is incremented at each TRIGGER event by   xa0   xa0   xa0  SMC 0   MLT 1   SYN T   PD  while PD 0 for AMT 0   xa0   xa0   xa0 SMC 1   MLS1   SYN T   PD   xa0   xa0   xa0 while PD 0 for AMT 0</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
