J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>PSSC</name>
						<description>DPLL Actual Calculated Position Stamp of STATE
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1508</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>PSSC</name>
								<description>Calculated position stamp for the last STATE input. First value is set by the DPLL and can be updated by the CPU when the        filter delay is to be considered. For each active slope of STATE in emergency mode. When FSD 0  PSSC is set from actual position value no filter delay        considered   the CPU must update the value once  taking into account the        filter value When FSD 1  at each active slope of STATE  PD S store 0 for AMS 0     160   160   160 SMC 0  add MLS1  SYN S    PD S store    160   160   160 SMC 1  add MLS2  SYN S    PD S store </description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>PSTM</name>
						<description>DPLL Measured Position Stamp at Last TRIGGER Input
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1512</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>PSTM</name>
								<description>Position stamp of TRIGGER  measured. Measured position stamp of last active TRIGGER input. Store the value TBU TS1 when an active TRIGGER event occurs. The value        of PSTM is invalid for  RMO 1 and SMC 0 .</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>PSTM_OLD</name>
						<description>DPLL Measured Position Stamp at Last but One TRIGGER Input
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1516</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>PSTM_OLD</name>
								<description>Last but one position stamp of TRIGGER  measured. Measured position stamp of last but one active TRIGGER input. Last PSTM value  see explanation of PSTM.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>PSSM</name>
						<description>DPLL Measured Position Stamp at Last STATE Input
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1520</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>PSSM</name>
								<description>Position stamp of STATE  measured. Measured position stamp of last active STATE input. Store the value TBU TS1 or TBU TS2  respectively  at the moment when an        active STATE event occurs. The value of PSSM is invalid for  RMO 0 and        SMC 0 .</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>PSSM_OLD</name>
						<description>DPLL Measured Position Stamp at Last but One STATE Input
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1524</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>PSSM_OLD</name>
								<description>Last but one position stamp of STATE  measured. Measured position stamp of last but one active STATE input. Last PSSM value  see explanation of PSSM.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>NMB_T</name>
						<description>DPLL Number of Pulses to be Sent in Normal Mode
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1528</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>NMB_T</name>
								<description>Number of pulses for TRIGGER. Calculated number of pulses in normal mode for the current TRIGGER        increment. Calculated pulse number.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>NMB_S</name>
						<description>DPLL Number of Pulses to be Sent in Emergency Mode
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1532</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>NMB_S</name>
								<description>Number of pulses for STATE. Calculated number of pulses in emergency mode for the current STATE        increment. Calculated pulse number.</description>
								<lsb>0</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>64</dim>
						<dimIncrement>4</dimIncrement>
						<name>DPLL_RDT_Si[%s]</name>
						<description>DPLL Reciprocal Values of the Nominal STATE 0 Increment Duration in FULL SCALE
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1536</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>RDT_S</name>
								<description>Reciprocal difference time of STATE. Nominal reciprocal value of the number of time stamp clocks measured in        the corresponding increment  2 32 while only the lower 24 bits are used  no gap considered. The LSB is        rounded up when the next truncated bit is 1. There are 2  SNU 1 SYN NS  entries for SYSF 0 or 2  SNU 1  SYN NS        entries for SYSF 1 respectively.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>64</dim>
						<dimIncrement>4</dimIncrement>
						<name>DPLL_TSF_Si[%s]</name>
						<description>DPLL Time Stamp Values of the Nominal STATE 0 Events in FULL SCALE
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>1792</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>TSF_S</name>
								<description>Time stamp field of STATE. Time stamp value of each active STATE event. There are 2   SNU 1  entries.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>64</dim>
						<dimIncrement>4</dimIncrement>
						<name>DPLL_ADT_Si[%s]</name>
						<description>DPLL Adapt and Profile Values of the STATE 0 Increments in FULL SCALE
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>2048</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>PD_S</name>
								<description>Physical deviation of STATE. Adapt values for each STATE increment in        FULL SCALE  sint16   This value represents the number of pulses to be added to the        correspondent nominal increment. The absolute value of a negative PD S        must not exceed MLS1 or MLS2 respectively. The PD value does mean the        number of SUB INC1 pulses per nominal tooth to be added to        NS   MLS1 2 1    PD S  </description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>NS</name>
								<description>Number of STATEs. Number of nominal STATE parts in the corresponding increment. There are 2  SNU 1 SYN NS  entries for SYSF 0 or 2  SNU 1  SYN NS        entries for SYSF 1 respectively.</description>
								<lsb>16</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>64</dim>
						<dimIncrement>4</dimIncrement>
						<name>DPLL_DT_Si[%s]</name>
						<description>DPLL Nominal STATE 0 Increment Duration in FULL SCALE
 resetvalue={PowerOn Reset:0x0,DPLL_RAM_INI.INIT_1BC:0x0}</description>
						<addressOffset>2304</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>DT_S</name>
								<description>Difference time of STATE. Nominal increment duration values for each STATE increment in FULL SCALE  considering no gap . There are 2  SNU 1 SYN NS  entries for SYSF 0 or 2  SNU 1  SYN NS        entries for SYSF 1 respectively.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>32</dim>
						<dimIncrement>4</dimIncrement>
						<name>DPLL_TSACz[%s]</name>
						<description>DPLL Calculated Time Value to start Action 0 Register
 resetvalue={Application Reset:0x7FFFFF}</description>
						<addressOffset>3584</addressOffset>
						<size>32</size>
						<resetValue>8388607</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TSAC</name>
								<description>Calculated time stamp for ACTION z. This value can only be written when the DPLL is disabled.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>32</dim>
						<dimIncrement>4</dimIncrement>
						<name>DPLL_PSACz[%s]</name>
						<description>DPLL ACTION Position Value Action 0 Request Register
 resetvalue={Application Reset:0x7FFFFF}</description>
						<addressOffset>3712</addressOffset>
						<size>32</size>
						<resetValue>8388607</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>PSAC</name>
								<description>Calculated position value for the start of ACTION z in normal or emergency mode according to equations DPLL 17 or DPLL 20  respectively. This value can only be written when the DPLL is disabled.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>8</dim>
						<dimIncrement>4</dimIncrement>
						<name>DPLL_ACB_z[%s]</name>
						<description>DPLL Control Bits Register 0 for up to 32 Actions
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>3840</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ACB_0</name>
								<description>Action Control Bits of ACTION z. Reflects ACT D i  52 48   i 4 z. When DPLL CTRL 11.ACBU    0   ACB 0 4 0  are taken as received by ARU        interface and are transmitted unchanged as result of action  PMT         calculation. When DPLL CTRL 11.ACBU    1   ACB 0 4 2  are taken as received by ARU        interface and are transmitted unchanged as result of action  PMT         calculation. ACB 0 1    1  is used as input signal to control if  quot action in past quot         shall be checked based on position information. ACB 0 1  is written to         1  if action channel has reached  quot action in past quot  condition after        action has been calculated  written to  0  if action has not reached         quot past quot  so far. ACB 0 0  is used as input signal to control if  quot action in past quot  shall be        checked based on time information. ACB 0 0  is written to  1  if action        channel has reached  quot action in past quot  condition after action has been        calculated  written to  0  if action has not reached  quot past quot  so far. This value can only be written via AEI interface when the DPLL is        disabled.</description>
								<lsb>0</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACB_1</name>
								<description>Action Control Bits of ACTION  i   1 . Reflects ACT D i 1  52 48   i 4 z. When DPLL CTRL 11.ACBU    0   ACB 1 4 0  are taken as received by ARU        interface and are transmitted unchanged as result of action  PMT         calculation. When DPLL CTRL 11.ACBU    1   ACB 1 4 2  are taken as received by ARU        interface and are transmitted unchanged as result of action  PMT         calculation.ACB 1 1    1  is used as input signal to control if  quot action        in past quot  shall be checked based on position information. ACB 1 1  is        written to  1  if action channel has reached  quot action in past quot  condition        after action has been calculated  written to  0  if action has not        reached  quot past quot  so far.ACB 1 0  is used as input signal to control if         quot action in past quot  shall be checked based on time information. ACB 1 0  is        written to  1  if action channel has reached  quot action in past quot  condition        after action has been calculated  written to  0  if action has not        reached  quot past quot  so far.This value can only be written via AEI interface        when the DPLL is disabled.</description>
								<lsb>8</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACB_2</name>
								<description>Action Control Bits of ACTION  i   2 . Reflects ACT D i 2  52 48   i 4 z. When DPLL CTRL 11.ACBU    0   ACB 2 4 0  are taken as received by ARU        interface and are transmitted unchanged as result of action  PMT         calculation. When DPLL CTRL 11.ACBU    1   ACB 2 4 2  are taken as received by ARU        interface and are transmitted unchanged as result of action  PMT         calculation. ACB 2 1    1  is used as input signal to control if  quot action in past quot         shall be checked based on position information. ACB 2 1  is written to         1  if action channel has reached  quot action in past quot  condition after        action has been calculated  written to  0  if action has not reached         quot past quot  so far. ACB 2 0  is used as input signal to control if  quot action in past quot  shall be        checked based on time information. ACB 2 0  is written to  1  if action        channel has reached  quot action in past quot  condition after action has been        calculated  written to  0  if action has not reached  quot past quot  so far. This value can only be written via AEI interface when the DPLL is        disabled.</description>
								<lsb>16</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACB_3</name>
								<description>Action Control Bits of ACTION  i   3 . Reflects ACT D i 3  52 48   i 4 z. When DPLL CTRL 11.ACBU    0   ACB 3 4 0  are taken as received by ARU        interface and are transmitted unchanged as result of action  PMT         calculation. When DPLL CTRL 11.ACBU    1   ACB 3 4 2  are taken as received by ARU        interface and are transmitted unchanged as result of action  PMT         calculation. ACB 3 1    1  is used as input signal to control if  quot action in past quot         shall be checked based on position information. ACB 3 1  is written to         1  if action channel has reached  quot action in past quot  condition after        action has been calculated  written to  0  if action has not reached         quot past quot  so far. ACB 3 0  is used as input signal to control if  quot action in past quot  shall be        checked based on time information. ACB 3 0  is written to  1  if action        channel has reached  quot action in past quot  condition after action has been        calculated  written to  0  if action has not reached  quot past quot  so far. This value can only be written via AEI interface when the DPLL is        disabled.</description>
								<lsb>24</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
