J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>CTRL_11</name>
						<description>DPLL Control Register 11
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>3872</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SIP1</name>
								<description>Simplified increment prediction in normal mode and for the first engine in the case SMC 1. For the first increment after setting SIP1 from 0 to 1  the value of        DT T ACT is replaced by the value of the DT T START register. This        results in a CDT TX value which is equal to DT T START. Please notice        that this DT T Start value must be always  gt  256. The value of SIP1 influences only the increment prediction CDT TX and          when NUTE VTN 1. The calculation of QDT T itself is not influenced by          the SIP1 bit. The value of SIP1 can be only be written when WSIP1 1. When SIP1 1 is set  the first pulses of the subincrement generator are          not generated with highest frequency for the first increment           DPLL STATUS.FTD   0  DPLL CTRL 1.SGE1 1 .</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ERZ1</name>
								<description>Error is assumed as zero in normal mode and for the first engine for SMC 1. The calculation of EDT T and MEDT T is performed independently from the        ERZ1 value in all modes without any influence to the MEDT T value        itself. The ERZ1 value influences the use of MEDT T in normal mode and        for SMC 1. The value of ERZ1 can be only written when WERZ1 1.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PCMF1</name>
								<description>Pulse correction mode fast for INC CNT1. The fast pulse generation is performed immediately within the current        increment. MPVAL1 must be positive integers for the fast pulse correction mode   in        the case of negative values  the correction is suppressed  and the FPCE         fast pulse correction error  bit in the DPLL STATUS register is set         causing the EI  error interrupt  when enabled. The setting of PCMF1 prevents the transfer of control bits PCM1 to the        corresponding shadow registers with an active input event  and prevents        therefore the distribution of the MPVAL1 values over the current or next        increment. The MPVAL1 pulses are sent with the fast clock CMU CLK0 by        the rapid pulse generator RPCUx  see chapter 18.8.3.6 of specification        v3.0  triggered in the state 6 26 or 18 38 of the state machines  see CROSSREFERENCE           respectively. The INC CNT1 is incremented by MPVAL1  respectively. When taken the MPVAL1 value to RPCUx and INC CNT1  the PCM1 bit is reset        immediately  and after that  also the PCMF1 bit. The value of PCMF1 can        be only written when WPCMF1 1. Be careful when using the fast pulse correction during a direction        change. Because of sending the correction pulses before  during or after        the direction change recognition  the result is typically unpredictable.        No automatic correction of the fast correction pulses is provided. The        necessary corrections must be performed on responsibility of the user.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FSYL1</name>
								<description>Force Synchronization Loss of LOCK1. The synchronization loss resets SYT SYS and prevents the use of        profiles  respectively. The above described effect for FSYL1 1 is only        active when WFSYL1 1 simultaneously.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INCF1</name>
								<description>INC CNT1 fast correction. The calculation of ADD IN for the SUB INC generation is performed        without adding the 0.5 value to NMB T S in equations DPLL 25 ff. The signal RESET SIGx of the pulse generator is activated for each new        active input slope  in order to reset the register values. The INCF1 value can be only written when WINCF1 1. The INCF1 bit should only be written when DPLL CTRL 1.DEN    0   DPLL          disabled  to prevent generation of wrong number of sub increments.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PCMF1_INCCNT_B</name>
								<description>No increment of INC CNT1 when PCMF1 active  automatic end mode . The PCMF1 INCCNT B value can be only written when WPCMF1 INCCNT B  1.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ADT</name>
								<description>Correction of DT T ACTUAL CDT TX nom corr by PD T</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ADS</name>
								<description>Correction of DT S ACTUAL  CDT SX nom corr by PD S</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SIP2</name>
								<description>Simplified increment prediction in emergency mode and for the second engine in the case RMO 1. For the first increment after setting SIP2 from 0 to 1  the value of        DT S ACT is replaced by the value of the DT S START register. This        results in a CDT SX value which is equal to DT S START. Please notice        that this DT S START value must be always  gt  256. The value of SIP2 influences only the increment prediction and error        accumulation when NUSE VSN 1. The calculation of QDT S itself is not        influenced by the SIP2 bit. The value of SIP2 can be only written when        WSIP2 1.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ERZ2</name>
								<description>Error is assumed as zero in emergency mode and for the second engine for SMC 1. The calculation of EDT S and MEDT S is performed independently from the        ERZ2 value in all modes  without any influence to the MEDT S value        itself. The ERZ2 value influences the use of MEDT S in emergency mode        and for SMC 1 with RMO 1. The value of ERZ2 can be only written when        WERZ2 1.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PCMF2</name>
								<description>Pulse correction mode fast for INC CNT2. The fast pulse generation is performed immediately within the current        increment. MPVAL2 must be positive integers for the fast pulse correction mode   in        the case of negative values  the correction is suppressed  and the FPCE         fast pulse correction error  bit in the DPLL STATUS register is set         causing the EI  error interrupt  when enabled. The setting of PCMF2 prevents the transfer of control bits PCM2 to the        corresponding shadow registers with an active input event  and therefore        prevents the distribution of the MPVAL1 values over the current or next        increment. The MPVAL2 pulses are sent with the fast clock CMU CLK0 by        the rapid pulse generator RPCUx  of specification v3.0  triggered in the        state 6 26 or 18 38 of the state machines. The INC CNT2 is incremented        by MPVAL2  respectively. When taken the MPVAL2 value to RPCUx and INC CNT2  the PCM2 bit is reset        immediately  and after that also the PCMF2 bit. The value of PCMF2 can be only written when WPCMF2 1. Be careful when using the fast pulse correction during a direction        change. Because of sending the correction pulses before  during or after        the direction change recognition  the result is typically unpredictable.        No automatic correction of the fast correction pulses is provided. The        necessary corrections must be performed on responsibility of the user.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FSYL2</name>
								<description>Force Synchronization Loss of LOCK2. The synchronization loss resets SYS and prevents the use of profiles        respectively. The above described effect for FSYL2 1 is only active when        WFSYL2 1 simultaneously.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INCF2</name>
								<description>INC CNT2 fast. The INCF2 value can be only written when WINCF2 1.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PCMF2_INCCNT_B</name>
								<description>No increment of INC CNT2 when PCMF2 active  automatic end mode . The PCMF2 INCCNT B value can be only written when WPCMF2 INCCNT B 1.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>STATE_EXT</name>
								<description>Use of STATE engine extension. The STATE EXT value can be only written when WSTATE EXT 1 and the DPLL        is disabled. See 18.10 for a further explanation. If this bit shall be        modified during operation  a software reset of the DPLL module is        strongly recommended. A RAM initialisation should also be considered        depending on the given application case.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACBU</name>
								<description>ACB use  the ACB values of PMTR are used to decide if an action is in the past. Return ACB values together with actions as zero  when the actions are in        the future  Set ACB 1  1  when calculated position value is in the past and the        ACB 1  of PMTR was 1. Set ACB 0  1  when calculated time value is in the past and the ACB 0         of PMTR was 1. The value of ACBU can be only written when WACBU 1.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WSIP1</name>
								<description>Write enable for simplified increment prediction 1. Enable writing.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WERZ1</name>
								<description>Write enable for error zero 1. Enable writing.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WPCMF1</name>
								<description>Write enable for pulse correction mode fast 1. Enable writing.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WFSYL1</name>
								<description>Write enable for force synchronization loss 1. Enable writing.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WINCF1</name>
								<description>Write enable for INC CNT1 fast. Enable writing.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WPCMF1_INCCNT_B</name>
								<description>Write enable of PCMF1 INCCNT B. Enable writing.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WADT</name>
								<description>Write enable of ADT. Enable writing.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>WADS</name>
								<description>Write enable of ADS. Enable writing.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>WSIP2</name>
								<description>Write enable for simplified increment prediction 2. Enable writing.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WERZ2</name>
								<description>Write enable for error zero 2. Enable writing.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WPCMF2</name>
								<description>Write enable for pulse correction mode fast 2. Enable writing.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WFSYL2</name>
								<description>Write enable for force synchronization loss 2. Enable writing.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WINCF2</name>
								<description>Write enable for INC CNT2 fast. Enable writing.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WPCMF2_INCCNT_B</name>
								<description>Write enable of PCMF2 INCCNT B</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WSTATE_EXT</name>
								<description>Write enable of STATE EXT</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WACBU</name>
								<description>Write enable for ACB use. The ACB values of PMTR are used to decide whether an action is in the        past. Enable writing.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>THVAL2</name>
						<description>DPLL Immediate THVAL Value Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>3876</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>THVAL</name>
								<description>Measured last pulse time from active to inactive slope of TRIGGER after correction of input slope filter delays. This value is available immediately after the inactive slope of TRIGGER.        The measured value considers all input slope filter delays. From the        received input the corresponding filter delays are subtracted before the        time stamp difference of active and inactive slope is calculated.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TIDEL</name>
						<description>DPLL Additional TRIGGER Input Delay Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>3880</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TIDEL</name>
								<description>TRIGGER input delay. Transmit this value with each active TRIGGER slope into a shadow        register. Subtract this shadow register value from each TRIGGER time        stamp  active and inactive slope . This feature is always active and        cannot be disabled by a control bit.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>SIDEL</name>
						<description>DPLL Additional STATE Input Delay Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>3884</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SIDEL</name>
								<description>STATE input delay. Transmit this value with each active STATE slope into a shadow register.        Subtract this shadow register value from each STATE time stamp  active        and inactive slope . This feature is always active and cannot be        disabled by a control bit.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>APS_SYNC_EXT</name>
						<description>DPLL Extension Register for DPLL APS SYNC
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>3888</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>APS_1C2_EXT</name>
								<description>Address pointer 1c2 extension. This offset value determines  by which value the APS 1C2 is changed at        the synchronization time  set by CPU before the synchronization is        performed. This offset value is the number of virtual increments to be inserted in        the TSF for an imminent intended synchronization  the CPU sets its value        dependent on the gaps until the synchronization time taking into account        the considered NUSE value to be set and including the next future        increment  when SYN S OLD is still 1 . When the synchronization takes        place  this value is to be added to the APS 1C2 address pointer  for        forward direction  DIR2 0  and the APT 1c2 status bit is cleared after        it. For backward direction subtract APS 1C2 EXT accordingly. When the synchronization is intended and the NUSE value is to be set to        FULL SCALE after it  the APS 1C2 EXT value must be set to SYN NS  for        SYSF 1  or 2 SYN NS  for SYSF 0  in order to be able to fill all gaps in        the extended TSF S with the corresponding values by the CPU. When still not all values for FULL SCALE are available  the APS 1C2 EXT        value considers only a share according to the NUSE value to be set after        the synchronization.</description>
								<lsb>0</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>APS_1C2_STATUS</name>
								<description>Address pointer 1c2 status. Set by CPU before the synchronization is performed. The value is cleared        automatically when the APS 1C2 OLD value is written.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>APS_1C2_OLD</name>
								<description>Address pointer STATE for RAM region 1c2 at synchronization time. This value is set by the current APS 1C2 value when the synchronization        takes place for the first active STATE event after writing APS 1C3 but        before adding the offset value APS 1C2 EXT  that means  when        APS 1C2 STATUS 1 . Address pointer APS 1C2 value at the moment of synchronization  before        the offset value is added  that means the pointer with this value points        to the last value before the additional inserted gap.</description>
								<lsb>16</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CTRL_EXT</name>
						<description>DPLL Extension Register for DPLL CTRL
 resetvalue={Application Reset:0x17}</description>
						<addressOffset>3892</addressOffset>
						<size>32</size>
						<resetValue>23</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SNU</name>
								<description>STATE number. This bit can only be written when the DPLL is disabled. The number of nominal STATE events is the decimal value plus 1. This        value can only be written when  RMO 0 and SMC 0  or DEN 0. Set SSL 00        before changing this value and set RMO 1 only after FULL SCALE with        SSL gt 0.</description>
								<lsb>0</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SYN_NS</name>
								<description>Synchronization number of STATE. Summarized number of virtual increments in HALF SCALE. Sum of all systematic missing STATE events in HALF SCALE  for SYSF 0  or FULL SCALE  for SYSF 1    the        SYN NS missing STATES can be divided up to an arbitrary number of blocks. The pattern of        events and missing events in FULL SCALE is shown in RAM region 1c3 as        value NS in addition to the adapted values. The number of stored        increments in FULL SCALE must be equal to 2  SNU 1 SYN NS  for SYSF 0 or        2  SNU 1  SYN NS for SYSF 1 . This pattern is written by the CPU        beginning from a fixed reference point  maybe beginning of the        FULL SCALE region . The relation to the actual increment is established        by setting of the profile RAM pointer APS 1C3 in an appropriate relation        to the RAM pointer APS of the actual increment by the CPU. This value can only be written when the DPLL is disabled. This value can only be written when  RMO 0 and SMC 0  or DEN 0. Set        SSL 00 before changing this value and set RMO 1 only after FULL SCALE        with SSL gt 0.</description>
								<lsb>16</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
