J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>APS_EXT</name>
						<description>DPLL Extension Register for DPLL APS
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>3896</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>WAPS</name>
								<description>Write bit for address pointer APS. Read as zero.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>APS</name>
								<description>Actual RAM pointer address value for DT S i  and RDT S i . Actual RAM pointer and synchronization position value of STATE events in FULL SCALE for up to 128 STATE events but limited to 2  SNU 1 SYN NS  in normal and emergency mode for        SYSF 0 or to 2  SNU 1  SYN NS for SYSF 1 respectively  See CROSSREFERENCE . APS is incremented  decremented  by one for each active STATE event and DIR2 0 DIR2 1 . The APS offset value is added in the above        shown bit position with the subsection offset of the RAM region. The APS pointer value is directed to the RAM position  in which the data        values are to be written  which correspond to the last increment. The        APS value is not to be changed  when the direction  shown by DIR2         changes  because it points always to a storage place after the        considered increment. Changing of DIR2 takes place always after an        active STATE event and the resulting increment decrement. This value can only be written when the WAPS bit is set.</description>
								<lsb>2</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WAPS_1C2</name>
								<description>Write bit for address pointer APS 1C2. Read as zero.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>APS_1C2</name>
								<description>Actual RAM pointer address value for TSF S i . Initial value  zero  0x00 . Actual RAM pointer and synchronization        position value of STATE events in FULL SCALE for up to 64 STATE events but limited to 2  SNU 1  in normal and emergency mode  this        pointer is used for the RAM region 1c2. For SYS 1  APS 1C2 is incremented  decremented  by SYN S OLD for each        active STATE event and DIR2 0  DIR2 1 . For SYS 0  APT 1c2 is incremented or decremented by 1 respectively. The APS 1C2 offset value is added in the above shown bit position with        the subsection offset of the RAM region. In addition when the APS 1C3 value is written by the CPU   in order to        synchronize the DPLL  with the next active STATE event the APS 1C2 EXT value is added subtracted  while APS 1C2 STATUS is        one  see DPLL APT SYNC register at CROSSREFERENCE  . This value can only be written when the WAPS 1C2 bit is set</description>
								<lsb>14</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>APS_1C3_EXT</name>
						<description>DPLL Extension Register for DPLL APS 1C3
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>3900</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>APS_1C3</name>
								<description>Actual RAM pointer address value for ADT S i . Initial value  zero  0x00 . Actual RAM pointer and synchronization position value of STATE events in FULL SCALE for up to 128 STATE events but limited to 2  SNU 1 SYN NS  in normal and emergency mode for        SYSF 0 or to 2  SNU 1  SYN NS for SYSF 1 respectively  this pointer is        used for the RAM region 1c3. See CROSSREFERENCE . The RAM pointer is set by the CPU accordingly  when the synchronization        condition was detected. The APS 1C3 pointer value is directed to the RAM position of the profile        element in RAM region 1c2  which corresponds to the current increment.        When changing the direction DIR1 or DIR2 respectively  this is always        known before an active STATE event is processed. This is because of the pattern recognition in SPE         for PMSM  or because of the direction change recognition by TRIGGER.        This direction change results in an automatic increment  forwards  or        decrement  backwards  when the input event occurs in addition with a 2        times correction. The APS 1C3 x offset value is added in the above shown bit position with        the subsection address offset of the corresponding RAM region.</description>
								<lsb>2</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>STA</name>
						<description>DPLL Status of the State Machine States Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>3904</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>STA_T</name>
								<description>Status of TRIGGER state machine  state binary coded. This bit field reflects the status of the TRIGGER state machine. The decimal step number 1 to 20 of the state machine is binary coded from 0x01 to 0x14 respectively using the upper 5 bits  8 4 . The lower 4 bits  3 0  show substates of the corresponding state machine. When the DPLL is disabled  this field is 0x000. Table STA T</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CNT_T</name>
								<description>Count TRIGGER. This reflects the count of active TRIGGER slopes  mod8 . This value shows the number of active TRIGGER slopes  mod8 . This value allows distinguishing if the above state machine status is        consistent to other status values read before or after it.</description>
								<lsb>9</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>STA_S</name>
								<description>Status of STATE state machine. State binary coded. This bit field reflects the status of the STATE state machine. The decimal step number 21 to 40 of the state machine is binary coded from 0x01 to 0x14 respectively using the upper 5 bits  20 16  after subtraction of 20 to the decimal value. The lower 4 bits  15 12  show substates of the corresponding state machine. When the DPLL is disabled  this field is 0x000. Table STA S</description>
								<lsb>12</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CNT_S</name>
								<description>Count STATE. This reflects the count of active STATE slopes  mod8 . This value shows the number of active STATE slopes  mod8 . This value allows distinguishing if the above state machine status is        consistent to other status values read before or after it.</description>
								<lsb>21</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>INCF1_OFFSET</name>
						<description>DPLL Start Value of the ADD IN ADDER1 Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>3908</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DPLL_INCF1_OFFSET</name>
								<description>Start value of the ADD IN ADDER1. In the case of set DPLL CTRL 11 INCF1 the ADD IN ADDER1 starts always        after an active new input event  TRIGGER in normal mode or STATE in        emergency mode respectively  with this offset value. In the case of        choosing DPLL INCF1 OFFSET  0xFFFFFF the generation of the first        SUB INC1 pulse is performed with the next TS CLK. In the case of        DPLL INCF1 OFFSET  0x000000 the first pulse is delayed by a full        SUB INC1 period and in the case of DPLL INCF1 OFFSET  0x7FFFFF the first        pulse is delayed by a half SUB INC1 period. Any other value is possible.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>INCF2_OFFSET</name>
						<description>DPLL Start Value of the ADD IN ADDER2 Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>3912</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DPLL_INCF2_OFFSET</name>
								<description>Start value of the ADD IN ADDER2. In the case of set DPLL CTRL 11 INCF2 the ADD IN ADDER2 starts always        after an active new input event  STATE  with this offset value. In the        case of choosing DPLL INCF2 OFFSET  0xFFFFFF the generation of the first        SUB INC2 pulse is performed with the next TS CLK. In the case of        DPLL INCF2 OFFSET  0x000000 the first pulse is delayed by a full        SUB INC2 period and in the case of DPLL INCF2 OFFSET  0x7FFFFF the first        pulse is delayed by a half SUB INC2 period. Any other value is possible.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DT_T_START</name>
						<description>DPLL Start Value of DPLL DT T ACT for the First Increment after SIP1 is Set to 1
 resetvalue={Application Reset:0x101}</description>
						<addressOffset>3916</addressOffset>
						<size>32</size>
						<resetValue>257</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DPLL_DT_T_START</name>
								<description>Start value of DPLL DT T ACT for the first increment after SIP1 is set to 1. For the first increment after setting SIP1 from 0 to 1  the value of        DPLL DT T START is taken instead of the calculated DPLL DT T ACT for the        current increment duration. This value should be always  gt  256 in order        to avoid an overflow during the calculation of DPLL RDT T ACT.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DT_S_START</name>
						<description>DPLL Start Value of DPLL DT S ACT for the First Increment after SIP2 is Set to 1
 resetvalue={Application Reset:0x101}</description>
						<addressOffset>3920</addressOffset>
						<size>32</size>
						<resetValue>257</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DPLL_DT_S_START</name>
								<description>Start value of DPLL DT S ACT for the first increment after SIP2 is set to 1. For the first increment after setting SIP2 from 0 to 1  the value of        DPLL DT S START is taken instead of the calculated DPLL DT S ACT for the        current increment duration. This value should be always  gt  256 in order        to avoid an overflow during the calculation of DPLL RDT S ACT.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>STA_MASK</name>
						<description>DPLL Trigger Masks for Signals DPLL STA T and DPLL STA S
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>3924</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>STA_NOTIFY_T</name>
								<description>Notify value for STA T of register DPLL STA. The STA NOTIFY T is representing a trigger mask of DPLL STA.STA T. When        DPLL STA.STA T reaches the value of STA NOTIFY T the flag        DPLL STA FLAG.STA FLAG T is set to  1  when DPLL STA.STA T is leaving        the state STA NOTIFY T.The signal is visible to MCS0 sub module as part        of the special function register.</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>STA_NOTIFY_S</name>
								<description>Notify value for STA S of register DPLL STA. The STA NOTIFY S is representing a trigger mask of DPLL STA.STA S. When        DPLL STA.STA S reaches the value of STA NOTIFY S the flag        DPLL STA FLAG.STA FLAG S is set to  1  when DPLL STA.STA S is leaving        the state STA NOTIFY S.</description>
								<lsb>8</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>STA_FLAG</name>
						<description>DPLL STA Flag Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>3928</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>STA_FLAG_T</name>
								<description>Flag according to DPLL MASK.STA NOTIFY T. The STA FLAG T is set to  1  indicating that the signal DPLL STA.STA T        has left the state defined by the trigger mask of        DPLL STA MASK.STA NOTIFY T. The Flag is reset when this bit of the register is written to  1 . The signal is visible to MCS0 sub module as part of the special function        register.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>STA_FLAG_S</name>
								<description>Flag according to DPLL STA MASK.STA NOTIFY S. The STA FLAG S is set to  1  indicating that the signal DPLL STA.STA S        has left the state defined by the trigger mask of        DPLL STA MASK.STA NOTIFY S. The Flag is reset when this bit of the register is written to  1 . The signal is visible to MCS0 sub module as part of the special function        register.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INC_CNT1_FLAG</name>
								<description>Flag according to DPLL INC CNT1 MASK.INC CNT1 NOTIFY. The INC CNT1 FLAG is set to  1  indicating that the signal        DPLL INC CNT1.INC CNT1 has left the state defined by the trigger mask of        DPLL INC CNT1 MASK.INC CNT1 NOTIFY. The Flag is reset when this bit of the register is written to  1 . The signal is visible to MCS0 sub module as part of the special function        register.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INC_CNT2_FLAG</name>
								<description>Flag according to DPLL INC CNT2 MASK.INC CNT2 NOTIFY. The INC CNT2 FLAG is set to  1  indicating that the signal        DPLL INC CNT2.INC CNT2 has left the state defined by the trigger mask of        DPLL INC CNT2 MASK.INC CNT2 NOTIFY. The Flag is reset when this bit of the register is written to  1 . The signal is visible to MCS0 sub module as part of the special function        register.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>INC_CNT1_MASK</name>
						<description>DPLL INC CNT1 Trigger Mask
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>3932</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>INC_CNT1_NOTIFY</name>
								<description>Notify value for INC CNT1 of register DPLL INC CNT1. The INC CNT1 NOTIFY is representing a trigger mask of        DPLL INC CNT1.INC CNT1. When DPLL INC CNT1.INC CNT1 reaches the value of        INC CNT1 NOTIFY the flag DPLL STA FLAG.INC CNT1 FLAG is set to  1  when        DPLL INC CNT1.INC CNT1 is leaving the state INC CNT1 NOTIFY.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>INC_CNT2_MASK</name>
						<description>DPLL INC CNT2 Trigger Mask
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>3936</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>INC_CNT2_NOTIFY</name>
								<description>Notify value for INC CNT2 of register DPLL INC CNT2. The INC CNT2 NOTIFY is representing a trigger mask of        DPLL INC CNT2.INC CNT2. When DPLL INC CNT2.INC CNT2 reaches the value of        INC CNT2 NOTIFY the flag DPLL STA FLAG.INC CNT2 FLAG is set to  1  when        DPLL INC CNT2.INC CNT2 is leaving the state INC CNT2 NOTIFY.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>NUSC_EXT1</name>
						<description>DPLL Extension Register Number 1 for DPLL NUSC 4
 resetvalue={Application Reset:0x10001}</description>
						<addressOffset>3940</addressOffset>
						<size>32</size>
						<resetValue>65537</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SYN_S</name>
								<description>Number of real and virtual events to be considered for the current increment. This value reflects the NS value of the last valid increment  stored in        ADT S i   to be updated after all calculations in step 37 of Table CROSSREFERENCE . This value can only be written when the WSYN bit in this register is set.</description>
								<lsb>0</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SYN_S_OLD</name>
								<description>Number of real and virtual events to be considered for the last increment. This value reflects the NS value of the last but one valid increment         stored in ADT S i   is updated automatically when writing SYN S. This value is updated by the SYN S value when the WSYN bit in this        register is set.</description>
								<lsb>16</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WSYN</name>
								<description>Write control bit for SYN S and SYN S OLD. Read as zero.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>NUSC_EXT2</name>
						<description>DPLL Extension Register Number 2 for DPLL NUSC 4
 resetvalue={Application Reset:0x1}</description>
						<addressOffset>3944</addressOffset>
						<size>32</size>
						<resetValue>1</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>NUSE</name>
								<description>Number of recent STATE events used for SUB INCx calculations modulo 2  SNUmax 1 . No gap is considered in that case for this value  but in the VSN value         see below   This register is set by the        CPU but reset automatically to   8220 1  8221  by a change of direction or loss of        LOCK. Each other value can be set by the CPU  maybe Full SCALE         HALF SCALE or parts of them. The relation values QDT Sx are calculated        using NUSE values in the past with its maximum value of 2 SNU 1. This value can only be written when the WNUS bit is set.</description>
								<lsb>0</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FSS</name>
								<description>This value is to be set  when NUSE is set to FULL SCALE. This value is set by the CPU  but reset automatically to  0  by a change        of direction or loss of LOCK. This value can only be written when the WNUS bit is set.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VSN</name>
								<description>Number of virtual state increments in the current NUSE region. This value reflects the number of virtual increments in the current NUSE        region  for NUSE 1 this value is zero  when the CPU sets NUSE to a value         gt  1 or zero 2 7 modulo 2 7            it must also set VSN to the correspondent value the VSN value is        subtracted from the NUSE value in order to get the corresponding APS        value for the past  the VSN value is not used for the APS 1C2 pointer. VSN is to be updated by the CPU when a new gap is to be considered for        NUSE or a gap is leaving the NUSE region  for this purpose the SASI        interrupt can be used  no further update of VSN is necessary when NUSE        is set to FULL SCALE. This value can only be written when the WVSN bit is set.</description>
								<lsb>16</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WNUS</name>
								<description>Write control bit for NUSE. Read as zero.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WVSN</name>
								<description>Write control bit for VSN. Read as zero.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CTN_MIN</name>
						<description>DPLL Minimum CDT T Nominal Value Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>3948</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CTN_MIN</name>
								<description>CDT T NOM min value. Use this register value as CDT T NOM value when the calculated value for        the nominal increment prediction of TRIGGER is less than the register        value.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CTN_MAX</name>
						<description>DPLL Maximum CDT T Nominal Value Register
 resetvalue={Application Reset:0x0FFFFFF}</description>
						<addressOffset>3952</addressOffset>
						<size>32</size>
						<resetValue>16777215</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CTN_MAX</name>
								<description>CDT T NOM max value. Use this register value as CDT T NOM value when the calculated value for        the nominal increment prediction of TRIGGER is greater than the register        value.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CSN_MIN</name>
						<description>DPLL Minimum CDT S Nominal Value Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>3956</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CSN_MIN</name>
								<description>CDT SX NOM min value . Use this register value as CDT SX NOM value when the calculated value        for the nominal increment prediction of STATE is less than the register        value.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
