J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>CSN_MAX</name>
						<description>DPLL Maximum CDT S Nominal Value Register
 resetvalue={Application Reset:0x0FFFFFF}</description>
						<addressOffset>3960</addressOffset>
						<size>32</size>
						<resetValue>16777215</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CSN_MAX</name>
								<description>CDT SX NOM max value. Use this register value as CDT SX NOM value when the calculated value        for the nominal increment prediction of STATE is greater than the        register value.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<cluster>
						<name>IRQ</name>
						<description>IRQ</description>
						<addressOffset>64</addressOffset>
						<register>
							<name>NOTIFY</name>
							<description>DPLL Interrupt Notification Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>PDI</name>
									<description>DPLL disable interrupt  announces the switch off of the DEN bit. This event is combined with the PEI interrupt to the common PDI   PEI        interrupt line number 1.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>PEI</name>
									<description>DPLL enable interrupt. Announces the switch on of the DEN bit. This event is combined with the PDI interrupt to the common PDI   PEI        interrupt line number 1.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TINI</name>
									<description>TRIGGER minimum hold time violation interrupt  dt    THMI   0 </description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TAXI</name>
									<description>TRIGGER maximum hold time violation interrupt  dt   THMA   0 </description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SISI</name>
									<description>STATE inactive slope interrupt</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TISI</name>
									<description>TRIGGER inactive slope interrupt. The TISI bit is only set for an inactive slope when the preceding active        slope was accepted. In the case of suppression of the last active slope        by the plausibility check the next inactive slope is to be ignored. No        set of TISI is performed in this case.</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MSI</name>
									<description>Missing STATE interrupt</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MTI</name>
									<description>Missing TRIGGER interrupt</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SASI</name>
									<description>STATE active slope interrupt</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TASI</name>
									<description>TRIGGER active slope interrupt</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>PWI</name>
									<description>Plausibility window  PVT  violation interrupt of TRIGGER</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>W2I</name>
									<description>RAM write access to RAM region 2 interrupt</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>W1I</name>
									<description>Write access to RAM region 1b or 1c interrupt</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>GL1I</name>
									<description>Get of lock interrupt  for SUB INC1</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>LL1I</name>
									<description>Loss of lock interrupt for SUB INC1</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EI</name>
									<description>Error interrupt  see status register bit 31 </description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>GL2I</name>
									<description>Get of lock interrupt  for SUB INC2</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>LL2I</name>
									<description>Loss of lock interrupt for SUB INC2</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TE0I</name>
									<description>TRIGGER event interrupt 0</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TE1I</name>
									<description>TRIGGER event interrupt 1</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TE2I</name>
									<description>TRIGGER event interrupt 2</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TE3I</name>
									<description>TRIGGER event interrupt 3</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TE4I</name>
									<description>TRIGGER event interrupt 4</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CDTI</name>
									<description>Calculation of TRIGGER duration done  only while NTI CNT is zero</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CDSI</name>
									<description>Calculation of STATE duration done</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TORI</name>
									<description>TRIGGER out of range interrupt</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SORI</name>
									<description>STATE out of range. The interrupt occurs at line number 0.</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DCGI</name>
									<description>Direction change interrupt</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>EN</name>
							<description>DPLL Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>4</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>PDI_IRQ_EN</name>
									<description>DPLL disable interrupt enable  when switch off of the DEN bit</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>PEI_IRQ_EN</name>
									<description>DPLL enable interrupt enable  when switch on of the DEN bit</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TINI_IRQ_EN</name>
									<description>TRIGGER minimum hold time violation interrupt enable</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TAXI_IRQ_EN</name>
									<description>TRIGGER maximum hold time violation interrupt enable</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SISI_IRQ_EN</name>
									<description>STATE inactive slope interrupt enable</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TISI_IRQ_EN</name>
									<description>TRIGGER inactive slope interrupt enable</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MSI_IRQ_EN</name>
									<description>Missing STATE interrupt enable</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MTI_IRQ_EN</name>
									<description>Missing TRIGGER interrupt enable</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SASI_IRQ_EN</name>
									<description>STATE active slope interrupt enable</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TASI_IRQ_EN</name>
									<description>TRIGGER active slope interrupt enable</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>PWI_IRQ_EN</name>
									<description>Plausibility window  PVT  violation of TRIGGER interrupt enable</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>W2I_IRQ_EN</name>
									<description>RAM write access to RAM region 2 interrupt enable</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>W1I_IRQ_EN</name>
									<description>Write access to RAM region 1b or 1c interrupt enable</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>GL1I_IRQ_EN</name>
									<description>Get of lock interrupt enable  when lock arises</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>LL1I_IRQ_EN</name>
									<description>Loss of lock interrupt enable</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EI_IRQ_EN</name>
									<description>Error interrupt enable  see status register </description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>GL2I_IRQ_EN</name>
									<description>Get of lock interrupt enable for SUB INC2</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>LL2I_IRQ_EN</name>
									<description>Loss of lock interrupt enable for SUB INC2</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TE0I_IRQ_EN</name>
									<description>TRIGGER event interrupt 0 enable</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TE1I_IRQ_EN</name>
									<description>TRIGGER event interrupt 1 enable</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TE2I_IRQ_EN</name>
									<description>TRIGGER event interrupt 2 enable</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TE3I_IRQ_EN</name>
									<description>TRIGGER event interrupt 3 enable</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TE4I_IRQ_EN</name>
									<description>TRIGGER event interrupt 4 enable</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CDTI_IRQ_EN</name>
									<description>Interrupt enable for calculation of TRIGGER duration done</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CDSI_IRQ_EN</name>
									<description>Interrupt enable for calculation of STATE duration done</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TORI_IRQ_EN</name>
									<description>TRIGGER out of range interrupt enable</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SORI_IRQ_EN</name>
									<description>STATE out of range interrupt enable</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DCGI_IRQ_EN</name>
									<description>Direction change interrupt enable</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>FORCINT</name>
							<description>DPLL Interrupt Force Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>8</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>TRG_PDI</name>
									<description>Force Interrupt PDI. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_PEI</name>
									<description>Force Interrupt PEI. Coding see bit 0.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_TINI</name>
									<description>Force Interrupt TINI. Coding see bit 0.</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_TAXI</name>
									<description>Force Interrupt TAXI. Coding see bit 0.</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_SISI</name>
									<description>Force Interrupt SISI. Coding see bit 0.</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_TISI</name>
									<description>Force Interrupt TISI. Coding see bit 0.</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_MSI</name>
									<description>Force Interrupt MSI. Coding see bit 0.</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_MTI</name>
									<description>Force Interrupt MTI. Coding see bit 0.</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_SASI</name>
									<description>Force Interrupt SASI. Coding see bit 0.</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_TASI</name>
									<description>Force Interrupt TASI. Coding see bit 0.</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_PWI</name>
									<description>Force Interrupt PWI. Coding see bit 0.</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_W2I</name>
									<description>Force Interrupt W2I. Coding see bit 0.</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_W1I</name>
									<description>Force Interrupt W1I. Coding see bit 0.</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_GL1I</name>
									<description>Force Interrupt GL1I. Coding see bit 0.</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_LL1I</name>
									<description>Force Interrupt LL1I. Coding see bit 0.</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_EI</name>
									<description>Force Interrupt EI. Coding see bit 0.</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_GL2I</name>
									<description>Force Interrupt GL2I. Coding see bit 0.</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_LL2I</name>
									<description>Force Interrupt LL2I. Coding see bit 0.</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_TE0I</name>
									<description>Force Interrupt TE0I. Coding see bit 0.</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_TE1I</name>
									<description>Force Interrupt TE1I. Coding see bit 0.</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_TE2I</name>
									<description>Force Interrupt TE2I. Coding see bit 0.</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_TE3I</name>
									<description>Force Interrupt TE3I. Coding see bit 0.</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_TE4I</name>
									<description>Force Interrupt TE4I. Coding see bit 0.</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_CDTI</name>
									<description>Force Interrupt CDTI. Coding see bit 0.</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_CDSI</name>
									<description>Force Interrupt CDSI. Coding see bit 0.</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_TORI</name>
									<description>Force Interrupt TORI. Coding see bit 0.</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_SORI</name>
									<description>Force Interrupt SORI. Coding see bit 0.</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRG_DCGI</name>
									<description>Force interrupt DCGI. Coding see bit 0.</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>MODE</name>
							<description>DPLL Interrupt Mode Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>12</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>IRQ_MODE</name>
									<description>IRQ mode selection. The interrupt modes are described in CROSSREFERENCE .</description>
									<lsb>0</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
					</cluster>
				</cluster>
				<cluster>
					<dim>6</dim>
					<dimIncrement>512</dimIncrement>
					<name>CCM[%s]</name>
					<description>CCM</description>
					<addressOffset>925696</addressOffset>
					<register>
						<name>AEIM_STA</name>
						<description>CCM0 MCS Bus Master Status Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>472</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>AEIM_XPT_ADDR</name>
								<description>Exception Address. Invalid bus master  AEIM  address of MCS module.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AEIM_XPT_STA</name>
								<description>AEIM exception status</description>
								<lsb>24</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
