J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>CCMi_HW_CONF</name>
						<description>CCM0 Hardware Configuration Register
 resetvalue={Application Reset:0x084F022E}</description>
						<addressOffset>476</addressOffset>
						<size>32</size>
						<resetValue>139395630</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>GRSTEN</name>
								<description>Global Reset Enable</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>BRIDGE_MODE_RST</name>
								<description>Bridge mode after reset</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SYNC_INPUT_REG</name>
								<description>Additional pipelined stage in synchronous bridge mode. Note  this register is only relevant  if existing  for synchronous bridge mode</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CFG_CLOCK_RATE</name>
								<description>Clocks per ARU transfer. This value defines also the availability of configuration bits in          register GTM CLS CLK CFG. If CFG CLOCK RATE 0  only the values 00 and 01 are valid for bit fields        CLS x x CLK DIV. If CFG CLOCK RATE 1  only the values 00   01 and 10 are valid for bit fields        CLS x x CLK DIV.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ATOM_OUT_RST</name>
								<description>ATOM OUT reset level. This value represents the ATOM output level after reset. The inverse          value of this bit is the reset value of bit SL in all ATOM channels.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ATOM_TRIG_CHAIN</name>
								<description>ATOM trigger chain length without synchronization register. It defines after which ATOM instance count a synchronization register is        introduced into trigger chain  after ATOM TRIG  lt i gt  output if instance i        and ATOM TRIG  lt i 1 gt  input of instance i 1 . Valid values are 1 to 7. 1 means that after each instance  a        synchronization register is placed.</description>
								<lsb>5</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TOM_OUT_RST</name>
								<description>TOM OUT reset level. This value represents the TOM output level after reset. The inverse          value of this bit is the reset value of bit SL in all TOM channels.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TOM_TRIG_CHAIN</name>
								<description>TOM trigger chain length without synchronization register. It defines after which TOM instance count a synchronization register is        introduced into trigger chain  after TOM TRIG  lt i gt  output if instance i        and TOM TRIG  lt i 1 gt  input of instance i 1 . Valid values are 1 to 7. 1 means that after each instance  a        synchronization register is placed.</description>
								<lsb>9</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RAM_INIT_RST</name>
								<description>RAM initialization from reset</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ERM</name>
								<description>Enable RAM1 MSB for available MCS modules. Note  The bit reflects the state of the configuration parameter ERM mentioned in the specification of MCFG .</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ARU_CONNECT_CONFIG</name>
								<description>Defines number of parallel ARU ports</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>IRQ_MODE_LEVEL</name>
								<description>IRQ MODE LEVEL</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>IRQ_MODE_PULSE</name>
								<description>IRQ MODE PULSE</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>IRQ_MODE_PULSE_NOTIFY</name>
								<description>IRQ MODE PULSE NOTIFY</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>IRQ_MODE_SINGLE_PULSE</name>
								<description>IRQ MODE SINGLE PULSE</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ATOM_TRIG_INTCHAIN</name>
								<description>ATOM internal trigger chain length without synchronization register. ATOM internal trigger chain length without synchronization register It defines after which ATOM channel count a synchronization register is introduced into trigger chain. Valid values are 1 to 8. 4 means that in channel 4 of the atom instances a synchronization register is placed.</description>
								<lsb>20</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TOM_TRIG_INTCHAIN</name>
								<description>TOM internal trigger chain length without synchronization register. It defines after which TOM channel count a synchronization register is        introduced into trigger chain. Valid values are 1 to 16. 8 means that in channel 8 of the TOM        instances  a synchronization register is placed.</description>
								<lsb>24</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>INT_CLK_EN_GEN</name>
								<description>Internal clock enable generation</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TIM_AUX_IN_SRC</name>
						<description>CCM0 TIM Module AUX IN Source Selection Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>480</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SRC_CH0</name>
								<description>Defines AUX IN source of TIM i  channel 7. SRC CH7  Defines AUX IN source of TIM 7  channel 7 SEL OUT N CH7   0   SEL OUT N CH7   1 </description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SRC_CH1</name>
								<description>Defines AUX IN source of TIM i  channel 7. SRC CH7  Defines AUX IN source of TIM 7  channel 7 SEL OUT N CH7   0   SEL OUT N CH7   1 </description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SRC_CH2</name>
								<description>Defines AUX IN source of TIM i  channel 7. SRC CH7  Defines AUX IN source of TIM 7  channel 7 SEL OUT N CH7   0   SEL OUT N CH7   1 </description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SRC_CH3</name>
								<description>Defines AUX IN source of TIM i  channel 7. SRC CH7  Defines AUX IN source of TIM 7  channel 7 SEL OUT N CH7   0   SEL OUT N CH7   1 </description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SRC_CH4</name>
								<description>Defines AUX IN source of TIM i  channel 7. SRC CH7  Defines AUX IN source of TIM 7  channel 7 SEL OUT N CH7   0   SEL OUT N CH7   1 </description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SRC_CH5</name>
								<description>Defines AUX IN source of TIM i  channel 7. SRC CH7  Defines AUX IN source of TIM 7  channel 7 SEL OUT N CH7   0   SEL OUT N CH7   1 </description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SRC_CH6</name>
								<description>Defines AUX IN source of TIM i  channel 7. SRC CH7  Defines AUX IN source of TIM 7  channel 7 SEL OUT N CH7   0   SEL OUT N CH7   1 </description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SRC_CH7</name>
								<description>Defines AUX IN source of TIM i  channel 7. SRC CH7  Defines AUX IN source of TIM 7  channel 7 SEL OUT N CH7   0   SEL OUT N CH7   1 </description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL_OUT_N_CH0</name>
								<description>Use DTM OUT or DTM OUT N signals as AUX IN source of TIM i  channel 7. SEL OUT N CH7  Use DTM OUT or DTM OUT N signals as AUX IN       source of TIM 0  channel 7</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL_OUT_N_CH1</name>
								<description>Use DTM OUT or DTM OUT N signals as AUX IN source of TIM i  channel 7. SEL OUT N CH7  Use DTM OUT or DTM OUT N signals as AUX IN       source of TIM 0  channel 7</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL_OUT_N_CH2</name>
								<description>Use DTM OUT or DTM OUT N signals as AUX IN source of TIM i  channel 7. SEL OUT N CH7  Use DTM OUT or DTM OUT N signals as AUX IN       source of TIM 0  channel 7</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL_OUT_N_CH3</name>
								<description>Use DTM OUT or DTM OUT N signals as AUX IN source of TIM i  channel 7. SEL OUT N CH7  Use DTM OUT or DTM OUT N signals as AUX IN       source of TIM 0  channel 7</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL_OUT_N_CH4</name>
								<description>Use DTM OUT or DTM OUT N signals as AUX IN source of TIM i  channel 7. SEL OUT N CH7  Use DTM OUT or DTM OUT N signals as AUX IN       source of TIM 0  channel 7</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL_OUT_N_CH5</name>
								<description>Use DTM OUT or DTM OUT N signals as AUX IN source of TIM i  channel 7. SEL OUT N CH7  Use DTM OUT or DTM OUT N signals as AUX IN       source of TIM 0  channel 7</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL_OUT_N_CH6</name>
								<description>Use DTM OUT or DTM OUT N signals as AUX IN source of TIM i  channel 7. SEL OUT N CH7  Use DTM OUT or DTM OUT N signals as AUX IN       source of TIM 0  channel 7</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL_OUT_N_CH7</name>
								<description>Use DTM OUT or DTM OUT N signals as AUX IN source of TIM i  channel 7. SEL OUT N CH7  Use DTM OUT or DTM OUT N signals as AUX IN       source of TIM 0  channel 7</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>EXT_CAP_EN</name>
						<description>CCM0 External Capture Trigger Enable Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>484</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TIM_I_EXT_CAP_EN</name>
								<description>TIM i  EXT CAPTURE signal forwarding enable. Note  The trigger event forwarding is possible from TIM i  and TIM i 1         to MCS i .</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TIM_IP1_EXT_CAP_EN</name>
								<description>TIM i 1  EXT CAPTURE signal forwarding enable</description>
								<lsb>8</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TOM_OUT</name>
						<description>CCM0 TOM Output Level Register
 resetvalue={Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0}</description>
						<addressOffset>488</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>TOM_OUT</name>
								<description>Output level snapshot of TOM i  OUT all channels</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TOM_OUT_N</name>
								<description>Output level snapshot of TOM i  OUT N all channels</description>
								<lsb>16</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CCMi_ATOM_OUT</name>
						<description>CCM0 ATOM Output Level Register
 resetvalue={Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0}</description>
						<addressOffset>492</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ATOM_I_OUT</name>
								<description>Output level snapshot of ATOM i  OUT all channels</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ATOM_I_OUT_N</name>
								<description>Output level snapshot of ATOM i  OUT N all channels</description>
								<lsb>8</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ATOM_IP1_OUT</name>
								<description>Output level snapshot of ATOM i 1  OUT all channels</description>
								<lsb>16</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ATOM_IP1_OUT_N</name>
								<description>Output level snapshot of ATOM i 1  OUT N all channels</description>
								<lsb>24</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CCMi_CMU_CLK_CFG</name>
						<description>CCM0 CMU Clock Configuration Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>496</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CLK0_SRC</name>
								<description>Clock 7 source signal selector</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK1_SRC</name>
								<description>Clock 7 source signal selector</description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK2_SRC</name>
								<description>Clock 7 source signal selector</description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK3_SRC</name>
								<description>Clock 7 source signal selector</description>
								<lsb>12</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK4_SRC</name>
								<description>Clock 7 source signal selector</description>
								<lsb>16</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK5_SRC</name>
								<description>Clock 7 source signal selector</description>
								<lsb>20</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK6_SRC</name>
								<description>Clock 7 source signal selector</description>
								<lsb>24</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK7_SRC</name>
								<description>Clock 7 source signal selector</description>
								<lsb>28</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CCMi_CMU_FXCLK_CFG</name>
						<description>CCM0 CMU Fixed Clock Configuration Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>500</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>FXCLK0_SRC</name>
								<description>Fixed clock 0 source signal selector. Bit field values that are not mentioned above are reserved. These bits are only writable if bit field CLS PROT of register CCM i  PROT is cleared.</description>
								<lsb>0</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CCMi_CFG</name>
						<description>CCM0 Configuration Register
 resetvalue={Application Reset:0x2007F,Application Reset:0x2008F,Application Reset:0x2000F,Application Reset:0x2000D,Application Reset:0x2000D,Application Reset:0x20005,Application Reset:0x2000D,Application Reset:0x2000D,Application Reset:0x2000C,Application Reset:0x2000C,Application Reset:0x20004,Application Reset:0x20004,Application Reset:0x0}</description>
						<addressOffset>504</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>0</resetMask>
						<fields>
							<field>
								<name>EN_TIM</name>
								<description>Enable TIM. This bit is only writable if bit field CLS PROT of        register CCM i  PROT is cleared.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN_TOM_SPE_TDTM</name>
								<description>Enable TOM  SPE and TDTM. This bit is only writable if bit field CLS PROT of        register CCM i  PROT is cleared.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN_ATOM_ADTM</name>
								<description>Enable ATOM and ADTM. This bit is only writable if bit field CLS PROT of        register CCM i  PROT is cleared.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN_MCS</name>
								<description>Enable MCS. This bit is only writable if bit field CLS PROT of        register CCM i  PROT is cleared.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN_DPLL_MAP</name>
								<description>Enable DPLL and MAP. This bit is only writable if bit field CLS PROT of        register CCM i  PROT is cleared.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN_BRC</name>
								<description>Enable BRC. This bit is only writable if bit field CLS PROT of        register CCM i  PROT is cleared.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN_PSM</name>
								<description>Enable PSM. This bit is only writable if bit field CLS PROT of        register CCM i  PROT is cleared.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN_CMP_MON</name>
								<description>Enable CMP and MON. This bit is only writable if bit field CLS PROT of        register CCM i  PROT is cleared.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLS_CLK_DIV</name>
								<description>Cluster Clock Divider. The value of this bit field mirrors the bit field CLS i  CLK DIV of register GTM CLS CLK CFG   whereas i equals the cluster index.</description>
								<lsb>16</lsb>
								<msb>17</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TBU_DIR1</name>
								<description>DIR1 input signal of module TBU</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TBU_DIR2</name>
								<description>DIR2 input signal of module TBU</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CCMi_PROT</name>
						<description>CCM0 Protection Register
 resetvalue={Application Reset:0x1}</description>
						<addressOffset>508</addressOffset>
						<size>32</size>
						<resetValue>1</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CLS_PROT</name>
								<description>Cluster Protection</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
