J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<cluster>
						<dim>10</dim>
						<dimIncrement>8</dimIncrement>
						<name>ARP[%s]</name>
						<description>ARP</description>
						<addressOffset>0</addressOffset>
						<register>
							<name>CTRL</name>
							<description>CCM0 Address Range Protector 0 Control Register
 resetvalue={Application Reset:0x30000}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>196608</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>ADDR</name>
									<description>ARP base address. Base address for address range protector z. Only the bits 5 to AAW 1 of this bit field are implemented as registers.        The bits AAW to 15 are reserved bits and always read and written as        zeros. The bits 0 and 1 are functionally used for the definition of an        ARP but they are always read and written as zeros. The actual base address for a protected address range is only defined by        the upper AAW   SIZE  2  bits  bit position 2  SIZE to bit position AAW 1  of bit field ADDR .        The lower SIZE  2 bits  bit 0 to SIZE  1         are ignored for the address calculation and assumed as zeros. This bit field is only writable if bit field CLS PROT of register CCM i  PROT is cleared.</description>
									<lsb>0</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SIZE</name>
									<description>Size of ARP. Size of memory range protector z. The actual size of a protected memory range is defined as 2 SIZE address locations  whereas the bit field SIZE is interpreted as an unsigned integer number. This bit field is only writable if bit field CLS PROT of register CCM i  PROT is cleared.</description>
									<lsb>16</lsb>
									<msb>19</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DIS_PROT</name>
									<description>Disable ARP protection. This bit field is only writable if bit field CLS PROT of register CCM i  PROT is cleared.</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>WPROT_AEI</name>
									<description>AEI slave write protection. The address range interval that is protected by this ARP can be        calculated as    ADDR AND NOT 4  2 SIZE  1             ADDR AND NOT 4  2 SIZE  1            4  2 SIZE  1    assuming a byte wise        addressing  an unsigned integer representation for the bit fields SIZE and ADDR . NOT and AND are bitwise        logical operators. The incrementation interval for neighboring memory        locations is always 4. This bit field is only writable if bit field CLS PROT of register CCM i  PROT is cleared.</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>PROT</name>
							<description>CCM0 Address Range Protector 0 Protection Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>4</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>WPROT0</name>
									<description>Write Protection MCS channel 7</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>WPROT1</name>
									<description>Write Protection MCS channel 7</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>WPROT2</name>
									<description>Write Protection MCS channel 7</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>WPROT3</name>
									<description>Write Protection MCS channel 7</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>WPROT4</name>
									<description>Write Protection MCS channel 7</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>WPROT5</name>
									<description>Write Protection MCS channel 7</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>WPROT6</name>
									<description>Write Protection MCS channel 7</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>WPROT7</name>
									<description>Write Protection MCS channel 7</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
					</cluster>
				</cluster>
				<cluster>
					<dim>5</dim>
					<dimIncrement>1024</dimIncrement>
					<name>CDTM[%s]</name>
					<description>CDTM</description>
					<addressOffset>933888</addressOffset>
					<cluster>
						<dim>6</dim>
						<dimIncrement>64</dimIncrement>
						<name>DTM[%s]</name>
						<description>DTM</description>
						<addressOffset>0</addressOffset>
						<register>
							<name>CTRL</name>
							<description>CDTM0 DTM0 Global Configuration and Control Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>CLK_SEL</name>
									<description>Clock source select</description>
									<lsb>0</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DTM_SEL</name>
									<description>Select DTM update and SHUT OFF reset signal. 0X B   160   160   160 Shut off by signal TIM CH IN0   TIM CH IN1 or DTM AUX IN 1X B   160   160   160 Shut off by signal DTM i 1  PSU IN</description>
									<lsb>2</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>UPD_MODE</name>
									<description>Update mode. Note  If an INx edge is not implemented  the value is unused. A write with this unused value returns 0b10 on status.</description>
									<lsb>4</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SR_UPD_EN</name>
									<description>Shadow register update enable</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SHUT_OFF_RST</name>
									<description>Shut off reset. Writing a 1 releases shut off  resets signal SHUT OFF SYNC if selected by UPD MODE 2 0  0b001 </description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>CH_CTRL1</name>
							<description>CDTM0 DTM0 Channel Control Register 1
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>4</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>O1SEL_0</name>
									<description>Output 1 select channel 0</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>I1SEL_0</name>
									<description>Input 1 select channel 0. Note  If i is even  I1SEL 0 is not implemented. Then the bit is read as zero and shall be written as zero.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SWAP_0</name>
									<description>Swap outputs DTM i  CH 0  OUT0 and DTM i  CH 0  OUT1  before final output register </description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>O1F_0</name>
									<description>Output 1 function channel 0</description>
									<lsb>4</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>XDT_EN_0_1</name>
									<description>Cross dead time enable on channels 0 and 1. Note  TSEL0  x  and SH EN 1 must be  0  for using cross dead time to avoid wrong input signals.  x 0 1 </description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>O1SEL_1</name>
									<description>Output 1 select channel 1</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>I1SEL_1</name>
									<description>Input 1 select channel 1</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SH_EN_1</name>
									<description>Shift enable channel 1</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SWAP_1</name>
									<description>Swap outputs DTM i  CH 1  OUT0 and DTM i  CH 1  OUT1  before final output register </description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>O1F_1</name>
									<description>Output 1 function channel 1</description>
									<lsb>12</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>O1SEL_2</name>
									<description>Output 1 select channel 2</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>I1SEL_2</name>
									<description>Input 1 select channel 2</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SH_EN_2</name>
									<description>Shift enable channel 2</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SWAP_2</name>
									<description>Swap outputs DTM i  CH 2  OUT0 and DTM i  CH 2  OUT1  before final output register </description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>O1F_2</name>
									<description>Output 1 function channel 2</description>
									<lsb>20</lsb>
									<msb>21</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>XDT_EN_2_3</name>
									<description>Cross dead time enable on channels 0 and 1. Note  TSEL0  x  and SH EN  x  must be  0  for using cross dead time to avoid wrong input signals.  x 2 3 </description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>O1SEL_3</name>
									<description>Output 1 select channel 3</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>I1SEL_3</name>
									<description>Input 1 select channel 3</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SH_EN_3</name>
									<description>Shift enable channel 3</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SWAP_3</name>
									<description>Swap outputs DTM i  CH 3  OUT0 and DTM i  CH 3  OUT1  before final output register </description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>O1F_3</name>
									<description>Output 1 function channel 3</description>
									<lsb>28</lsb>
									<msb>29</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>CH_CTRL2</name>
							<description>CDTM0 DTM0 Channel Control Register 2
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>8</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>POL0_0</name>
									<description>Polarity on output 0 channel 0</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>OC0_0</name>
									<description>Output 0 control channel 0</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SL0_0</name>
									<description>Signal level on output 0 channel 0</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DT0_0</name>
									<description>Dead time path enable on output 0 channel 0</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>POL1_0</name>
									<description>Polarity on output 1 channel 0</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>OC1_0</name>
									<description>Output 1 control channel 0</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SL1_0</name>
									<description>Signal level on output 1 channel 0</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DT1_0</name>
									<description>Dead time path enable on output 1 channel 0</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>POL0_1</name>
									<description>Polarity on output 0 channel 1</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>OC0_1</name>
									<description>Output 0 control channel 1</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SL0_1</name>
									<description>Signal level on output 0 channel 1</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DT0_1</name>
									<description>Dead time path enable on output 0 channel 1</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>POL1_1</name>
									<description>Polarity on output 1 channel 1</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>OC1_1</name>
									<description>Output 1 control channel 1</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SL1_1</name>
									<description>Signal level on output 1 channel 1</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DT1_1</name>
									<description>Dead time path enable on output 1 channel 1</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>POL0_2</name>
									<description>Polarity on output 0 channel 2</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>OC0_2</name>
									<description>Output 0 control channel 2</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SL0_2</name>
									<description>Signal level on output 0 channel 2</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DT0_2</name>
									<description>Dead time path enable on output 0 channel 2</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>POL1_2</name>
									<description>Polarity on output 1 channel 2</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>OC1_2</name>
									<description>Output 1 control channel 2</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SL1_2</name>
									<description>Signal level on output 1 channel 2</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DT1_2</name>
									<description>Dead time path enable on output 1 channel 2</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>POL0_3</name>
									<description>Polarity on output 0 channel 3</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>OC0_3</name>
									<description>Output 0 control channel 3</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SL0_3</name>
									<description>Signal level on output 0 channel 3</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DT0_3</name>
									<description>Dead time path enable on output 0 channel 3</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>POL1_3</name>
									<description>Polarity on output 1 channel 3</description>
									<lsb>28</lsb>
									<msb>28</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>OC1_3</name>
									<description>Output 1 control channel 3</description>
									<lsb>29</lsb>
									<msb>29</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SL1_3</name>
									<description>Signal level on output 1 channel 3</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DT1_3</name>
									<description>Dead time path enable on output 1 channel 3</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
