J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
						<register>
							<name>CH_CTRL2_SR</name>
							<description>CDTM0 DTM0 Channel Control Register 2 Shadow
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>12</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>POL0_0_SR</name>
									<description>Polarity on output 0 channel 0 shadow register</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>OC0_0_SR</name>
									<description>Output 0 control channel 0 shadow register</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SL0_0_SR</name>
									<description>Signal level on output 0 channel 0 shadow register</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DT0_0_SR</name>
									<description>Dead time path enable on output 0 channel 0 shadow register</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>POL1_0_SR</name>
									<description>Polarity on output 1 channel 0 shadow register</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>OC1_0_SR</name>
									<description>Output 1 control channel 0 shadow register</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SL1_0_SR</name>
									<description>Signal level on output 1 channel 0 shadow register</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DT1_0_SR</name>
									<description>Dead time path enable on output 1 channel 0 shadow register</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>POL0_1_SR</name>
									<description>Polarity on output 0 channel 1 shadow register</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>OC0_1_SR</name>
									<description>Output 0 control channel 1 shadow register</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SL0_1_SR</name>
									<description>Signal level on output 0 channel 1 shadow register</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DT0_1_SR</name>
									<description>Dead time path enable on output 0 channel 1 shadow register</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>POL1_1_SR</name>
									<description>Polarity on output 1 channel 1 shadow register</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>OC1_1_SR</name>
									<description>Output 1 control channel 1 shadow register</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SL1_1_SR</name>
									<description>Signal level on output 1 channel 1 shadow register</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DT1_1_SR</name>
									<description>Dead time path enable on output 1 channel 1 shadow register</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>POL0_2_SR</name>
									<description>Polarity on output 0 channel 2 shadow register</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>OC0_2_SR</name>
									<description>Output 0 control channel 2 shadow register</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SL0_2_SR</name>
									<description>Signal level on output 0 channel 2 shadow register</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DT0_2_SR</name>
									<description>Dead time path enable on output 0 channel 2 shadow register</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>POL1_2_SR</name>
									<description>Polarity on output 1 channel 2 shadow register</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>OC1_2_SR</name>
									<description>Output 1 control channel 2 shadow register</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SL1_2_SR</name>
									<description>Signal level on output 1 channel 2 shadow register</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DT1_2_SR</name>
									<description>Dead time path enable on output 1 channel 2 shadow register</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>POL0_3_SR</name>
									<description>Polarity on output 0 channel 3 shadow register</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>OC0_3_SR</name>
									<description>Output 0 control channel 3 shadow register</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SL0_3_SR</name>
									<description>Signal level on output 0 channel 3 shadow register</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DT0_3_SR</name>
									<description>Dead time path enable on output 0 channel 3 shadow register</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>POL1_3_SR</name>
									<description>Polarity on output 1 channel 3 shadow register</description>
									<lsb>28</lsb>
									<msb>28</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>OC1_3_SR</name>
									<description>Output 1 control channel 3 shadow register</description>
									<lsb>29</lsb>
									<msb>29</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SL1_3_SR</name>
									<description>Signal level on output 1 channel 3 shadow register</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DT1_3_SR</name>
									<description>Dead time path enable on output 1 channel 3 shadow register</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>PS_CTRL</name>
							<description>CDTM0 DTM0 Phase Shift Unit Configuration and Control Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>16</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>RELBLK</name>
									<description>Reload value blanking window. A value of 0x000 resets counter BLK DOWN CNT.</description>
									<lsb>0</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>PSU_IN_SEL</name>
									<description>PSU input selection</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>IN_POL</name>
									<description>Input polarity</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIM_SEL</name>
									<description>TIM input selection</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SHIFT_SEL</name>
									<description>Shift select. Note   If a channel is not implemented  the value is unused. A write with this unused value returns 0b10 on status.</description>
									<lsb>20</lsb>
									<msb>21</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>CH_SR</name>
							<description>CDTM0 DTM0 Channel Shadow Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>36</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>SL0_0_SR_SR</name>
									<description>Shadow register for bit SL0 0 SR of register DTM i  CH CTRL2 SR</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SL1_0_SR_SR</name>
									<description>Shadow register for bit SL1 0 SR of register DTM i  CH CTRL2 SR</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SL0_1_SR_SR</name>
									<description>Shadow register for bit SL0 1 SR of register DTM i  CH CTRL2 SR</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SL1_1_SR_SR</name>
									<description>Shadow register for bit SL1 1 SR of register DTM i  CH CTRL2 SR</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SL0_2_SR_SR</name>
									<description>Shadow register for bit SL0 2 SR of register DTM i  CH CTRL2 SR</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SL1_2_SR_SR</name>
									<description>Shadow register for bit SL1 2 SR of register DTM i  CH CTRL2 SR</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SL0_3_SR_SR</name>
									<description>Shadow register for bit SL0 3 SR of register DTM i  CH CTRL2 SR</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SL1_3_SR_SR</name>
									<description>Shadow register for bit SL1 3 SR of register DTM i  CH CTRL2 SR</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>CH_CTRL3</name>
							<description>CDTM0 DTM0 Channel Control Register 3
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>40</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>CII0</name>
									<description>Combinational input invert channel 0</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CIS0</name>
									<description>Combinational input select channel 0</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TSEL0_0</name>
									<description>Input selection for dead time   edge trigger generation</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TSEL1_0</name>
									<description>Input selection combinational logic path</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CII1</name>
									<description>Combinational input invert channel 1</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CIS1</name>
									<description>Combinational input select channel 1</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TSEL0_1</name>
									<description>Input selection for dead time   edge trigger generation</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TSEL1_1</name>
									<description>Input selection combinational logic path</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CII2</name>
									<description>Combinational input invert channel 2</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CIS2</name>
									<description>Combinational input select channel 2</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TSEL0_2</name>
									<description>Input selection for dead time   edge trigger generation</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TSEL1_2</name>
									<description>Input selection combinational logic path</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CII3</name>
									<description>Combinational input invert channel 3</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CIS3</name>
									<description>Combinational input select channel 3</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TSEL0_3</name>
									<description>Input selection for dead time   edge trigger generation</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TSEL1_3</name>
									<description>Input selection combinational logic path</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<cluster>
							<dim>4</dim>
							<dimIncrement>4</dimIncrement>
							<name>CH[%s]</name>
							<description>CH</description>
							<addressOffset>20</addressOffset>
							<register>
								<name>DTV</name>
								<description>CDTM0 DTM0 Channel 0 Dead Time Reload Values
 resetvalue={Application Reset:0x0}</description>
								<addressOffset>0</addressOffset>
								<size>32</size>
								<resetValue>0</resetValue>
								<resetMask>4294967295</resetMask>
								<fields>
									<field>
										<name>RELRISE</name>
										<description>Reload value for rising edge dead time</description>
										<lsb>0</lsb>
										<msb>9</msb>
										<access>read-write</access>
									</field>
									<field>
										<name>RELFALL</name>
										<description>Reload value for falling edge dead time</description>
										<lsb>16</lsb>
										<msb>25</msb>
										<access>read-write</access>
									</field>
								</fields>
							</register>
						</cluster>
					</cluster>
				</cluster>
				<cluster>
					<dim>6</dim>
					<dimIncrement>2048</dimIncrement>
					<name>ATOM[%s]</name>
					<description>ATOM</description>
					<addressOffset>950272</addressOffset>
					<register>
						<name>CH0_RDADDR</name>
						<description>ATOM0 Channel 7 ARU read address Register
 resetvalue={Application Reset:0x1FE01FE}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>33423870</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RDADDR0</name>
								<description>ARU Read address 0. Note  This read address is used by the ATOM channel to receive data from ARU immediately after the channel and ARU access is enabled  see ATOM i  CH x  CTRL register for details . Note  This bit field is only writable if channel is disabled.</description>
								<lsb>0</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RDADDR1</name>
								<description>ARU Read address 1. Note  The ATOM channel switches to this read address  when requested in the ARU control bits 52 to 48 with the pattern  111   . The channel switches back to the RDADDR0 after one ARU data package was received on RDADDR1 and the compare match event is occurred. Note  This read address is only applicable in SOMC mode. Note  This bit field is only writable if channel is disabled.</description>
								<lsb>16</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
