J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>CH5_CTRL</name>
						<description>ATOM0 Channel 7 Control Register
 resetvalue={Application Reset:0x0800,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0}</description>
						<addressOffset>644</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294965247</resetMask>
						<fields>
							<field>
								<name>MODE</name>
								<description>ATOM channel mode select</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TB12_SEL</name>
								<description>Select time base value TBU TS1 or TBU TS2. Note   This bit is only applicable in SOMC mode.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ARU_EN</name>
								<description>ARU input stream enable</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACB</name>
								<description>ATOM Mode control bits. These bits have different meaning in the different ATOM channel modes.        Please refer to the mode description sections. SOMI   CROSSREFERENCE and CROSSREFERENCE for register description. SOMC   CROSSREFERENCE and CROSSREFERENCE for register description. SOMP   CROSSREFERENCE and CROSSREFERENCE for register description. SOMS   CROSSREFERENCE and CROSSREFERENCE for register description. SOMB   CROSSREFERENCE and CROSSREFERENCE for register description.</description>
								<lsb>4</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CMP_CTRL</name>
								<description>CCUx compare strategy select. Note   This bit is only applicable in SOMC mode.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EUPM</name>
								<description>Extended update mode. If EUPM 1  a write access to CM0 or CM1 never causes an AEI write          status 10 . This bit is only applicable in SOMC and SOMB mode.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SL</name>
								<description>Initial signal level. Reset value depends on the hardware configuration chosen by silicon          vendor. If the output is disabled  the output ATOM OUT x  is set to inverse          SL  independent of the ATOM channel mode. If FREEZE 0  following notes are valid  In SOMP  SOMI  SOMS mode  if the channel is disabled  the internal        register SOUR inside ATOM sub unit SOU is set to inverse value of SL. By        enabling the channel  the register SOUR is not changed. Thus  if the        output is enabled afterwards  the output ATOM OUT x  is the inverse        value of SL. In SOMC mode  if the channel is disabled  the internal register SOUR        inside ATOM sub unit SOU is set to value of SL. By enabling the channel         the register SOUR is not changed. Thus  if the output is enabled and the        channel is disabled  the output ATOM OUT x  is the value of SL. If FREEZE 1  the following notes are valid  If the channel is disabled  the output register of SOU unit is not        changed  and output ATOM OUT x  is not changed.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK_SRC_SR</name>
								<description>Actual CMU clock source  SOMS   shadow register for CMU clock source  SOMP . If ECLK SRC 0   ECLK SRC 1  This register is a shadow register for the register CLK SRC. Thus  if          the CMU CLK source for PWM generation should be changed during          operation  the old CMU CLK has to operate until the update of the ATOM          channels internal CLK SRC register by the CLK SRC SR content is done           either by an end of a period or a forced update. After  channel  reset  the selected CLK SRC value is the SYS CLK           input of Global Clock Divider . To use in SOMP mode one of the          CMU CLKx  it is recommended to perform a forced update of CLK SRC with          the value of CLK SRC SR value before with enabling the channel. In case of ECLK SRC 1 and CLK SRC SR   011   100   101   110            a force update leads to an immediate update of CM0  CM1 and CLK SRC.</description>
								<lsb>12</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECLK_SRC</name>
								<description>Extend CLK SRC. Note  This bit is only applicable in SOMP and SOMS mode. See bit CLK SRC SR description for details.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WR_REQ</name>
								<description>CPU Write request bit for late compare register update. Note  The CPU can disable subsequent ARU read requests by the channel and can update the shadow registers with new compare values  while the compare units operate on old compare values received by former ARU accesses  if occurred. Note  On a compare match event  the WR REQ bit will be reset by hardware. Note  At the point of the force update  only the shadow registers SR0 and SR1 are transferred into the CM0  CM1 registers. The output action is still defined by the ACBI bit field described by the ARU together with the old compare values for CM0 CM1. Note   This bit is only applicable in SOMC and SOMB mode.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRIG_PULSE</name>
								<description>Trigger output pulse length of one SYS CLK period</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>UDMODE</name>
								<description>Up down counter mode. Note  This mode is only applicable in SOMP mode.</description>
								<lsb>18</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RST_CCU0</name>
								<description>Reset source of CCU0. If RST CCU0 1 and UPEN CTRLx 1 are set  TRIG  x 1  or          TIM EXT CAPTURE x  triggers also the update of work register  CM0  CM1          and CLK SRC . This bit is only applicable in SOMP mode. This bit should only be set if bit OSM 0  i.e. in continuous mode .</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OSM_TRIG</name>
								<description>Enable trigger of one shot pulse by trigger signal OSM TRIG. Note  This bit should only be set if bit OSM 1 and bit RST CCU0 0.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EXT_TRIG</name>
								<description>Select TIM EXT CAPTURE x  as trigger signal</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EXTTRIGOUT</name>
								<description>Select TIM EXT CAPTURE x  as potential output signal TRIG  x </description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRIGOUT</name>
								<description>Trigger output selection  output signal TRIG CHx  of module ATOM CHx</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SLA</name>
								<description>Serve last ARU communication strategy. This bit is only applicable in SOMC mode. Please note  that setting of this bit has only effect  when ACBI 4 2           is configured for serve last compare strategy   100   101   or 110  . When this bit is not set  the captured time stamps in the shadow          registers SRx are only provided after the CCU1 match occurred. The          ACBO 4 3  bits always return 10 in          that case. By setting this bit  the ATOM channel also provides the captured time          stamps after the CCU0 match event to the ARU. The ACBO 4 3  bits are          set to 01 in that case. After the CCU1          match event  the time stamps are captured again in the SRx registers          and provided to the ARU. The ACBO 4 3  bits are set to 10 .          When the data in the shadow registers after the CCU0 match was not          consumed by an ARU destination and the CCU1 match occurs  the data in          the shadow registers is overwritten by the new captured time stamps.          The ATOM channel does not request new data from the ARU when the CCU0          match values are read from an ARU destination.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OSM</name>
								<description>One shot mode. Note   This bit is only applicable in SOMP and SOMS modes.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABM</name>
								<description>ARU blocking mode. Note  This bit is only applicable in SOMC and SOMB mode.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EXT_FUPD</name>
								<description>External forced update. Note   This bit is only applicable in SOMP and SOMS mode.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SOMB</name>
								<description>SOMB mode</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FREEZE</name>
								<description>FREEZE. Note  if channel is disabled and ouptut is enabled  in SOMP mode with UDMODE  0b00 the output is dependng directly on SL bit  independent on FREEZE mode.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH5_SOMB</name>
						<description>ATOM0 Channel 7 Control Register in SOMB Mode
 resetvalue={Application Reset:0x0800,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0}</description>
						<addressOffset>644</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294965247</resetMask>
						<fields>
							<field>
								<name>MODE</name>
								<description>ATOM channel mode select. Not used in ATOM SOMB mode.</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TB12_SEL</name>
								<description>Select time base value TBU TS1 or TBU TS2. This bit is only applicable if three time bases are present in the GTM.        Otherwise  this bit is reserved.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ARU_EN</name>
								<description>ARU Input stream enable</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACB_1_0</name>
								<description>Signal level control bits. Note  These bits are only applicable if ARU EN   0.</description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACB_4_3_2</name>
								<description>ATOM SOMB compare strategy. These bits are only applicable if ARU EN   0.</description>
								<lsb>6</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CMP_CTRL</name>
								<description>CCUx compare strategy select. The compare unit CCU0 or CCU1 that compares against TBU TS0  depending        on CCUx control mode defined by ACB CM 4 2   always performs a        greater equal comparison  independent of the CMP CTRL bit.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EUPM</name>
								<description>Extended update mode. If EUPM 1 and after a CCU0 compare match  if ARU EN 0  written CM0 value not stored. if ARU EN 1  ARU read request is continued and CM1 is updated until CCU1        compare match. Received CM0 is not stored. This bit is only applicable in SOMC and SOMB mode.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SL</name>
								<description>Initial signal level after channel enable. Reset value depends on the hardware configuration chosen by silicon        vendor. If the output is disabled  the output ATOM OUT x  is set to inverse        value of SL. If FREEZE 0  the following note is valid  If the channel is disabled  the output register of SOU unit is set to        value of SL. If FREEZE 1  the following note is valid  If the channel is disabled  the output register of SOU unit is not        changed  and output ATOM OUT x  is not changed.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WR_REQ</name>
								<description>CPU Write request bit for late compare register update. The CPU can disable subsequent ARU read requests by the channel and can        update the shadow registers with new compare values  while the compare        units operate on old compare values received by former ARU accesses  if        occurred. On a compare match event  the WR REQ bit will be reset by hardware. At the point of the force update  only the shadow registers SR0 and SR1        are transferred into the CM0  CM1 registers. The output action is still        defined by the ACBI bit field described by the ARU together with the old        compare values for CM0 CM1.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EXTTRIGOUT</name>
								<description>TIM EXT CAPTURE x  as potential output signal TRIG  x </description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRIGOUT</name>
								<description>Trigger output selection  output signal TRIG CHx  of module ATOM CHx</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABM</name>
								<description>ARU blocking mode</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SOMB</name>
								<description>SOMB  SOMB mode</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FREEZE</name>
								<description>FREEZE</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH5_SOMC</name>
						<description>ATOM0 Channel 7 Control Register in SOMC Mode
 resetvalue={Application Reset:0x0800,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0}</description>
						<addressOffset>644</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294965247</resetMask>
						<fields>
							<field>
								<name>MODE</name>
								<description>ATOM channel mode select</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TB12_SEL</name>
								<description>Select time base value TBU TS1 or TBU TS2. This bit is only applicable if three time bases are present in the GTM.        Otherwise  this bit is reserved.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ARU_EN</name>
								<description>ARU Input stream enable</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACB_1_0</name>
								<description>Signal level control bits. These bits are only applicable if ARU EN   0.</description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACB_4_3_2</name>
								<description>ATOM control bits ACB 4   ACB 3   ACB 2 . Independent of ARU EN  a writing of 0b111 cancels any pending CCU0 or        CCU1 compare. Note  These bits are defining the compare strategy only if        ARU EN   0.</description>
								<lsb>6</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CMP_CTRL</name>
								<description>CCUx compare strategy select. The compare unit CCU0 or CCU1 that compares against TBU TS0  depending        on CCUx control mode defined by ACBI 4 2  or ACB42  always performs a        greater equal comparison  independent on CMP CTRL bit.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EUPM</name>
								<description>Extended Update Mode. If EUPM 1 and after a CCU0 compare match  If ARU EN 0  written CM0 value not stored. If ARU EN 1  ARU read request is continued and CM1 is updated until CCU1        compare match. Received CM0 values are not stored. This bit is only applicable in SOMC and SOMB mode.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SL</name>
								<description>Initial signal level after channel enable. Reset value depends on the hardware configuration chosen by silicon        vendor. If the output is disabled  the output ATOM OUT x  is set to inverse        value of SL. If FREEZE 0  following note is valid  If the channel is disabled  the output register of SOU unit is set to        value of SL. If FREEZE 1  following note is valid  If the channel is disabled  the output register of SOU unit is not        changed  and output ATOM OUT x  is not changed.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WR_REQ</name>
								<description>CPU write request bit. The CPU can disable subsequent ARU read requests by the channel and can        update the shadow registers with new compare values  while the compare        units operate on old compare values received by former ARU accesses  if        occurred. On a compare match event  the WR REQ bit will be reset by hardware. At the point of the force update  only the shadow registers SR0 and SR1        are transferred into the CM0  CM1 registers. The output action is still        defined by the ACBI bit field described by the ARU together with the old        compare values for CM0 CM1.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EXTTRIGOUT</name>
								<description>Select TIM EXT CAPTURE x  as potential output signal TRIG  x </description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRIGOUT</name>
								<description>TRIGOUT  Trigger output selection  output signal TRIG CHx  of module ATOM CHx</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SLA</name>
								<description>Serve last ARU communication strategy. Please note  that setting of this bit has only effect  when ACBI 4 2  is        configured for serve last compare strategy   quot 100 quot    quot 101 quot   or  quot 110 quot  . When this bit is not set  the captured time stamps in the shadow        registers SRx are only provided after the CCU1 match occurred. The        ACBO 4 3  bits always return  quot 10 quot  in that case. By setting this bit  the ATOM channel also provides the captured time        stamps after the CCU0 match event to the ARU. The ACBO 4 3  bits are set        to   8220 01  8221  in that case. After the CCU1 match event  the time stamps are        captured again in the SRx registers and provided to the ARU. The        ACBO 4 3  bits are set to   8220 10  8221 . When the data in the shadow registers        after the CCU0 match was not consumed by an ARU destination and the CCU1        match occurs  the data in the shadow registers is overwritten by the new        captured time stamps. The ATOM channel does not request new data from        the ARU when the CCU0 match values are read from an ARU destination.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABM</name>
								<description>ARU blocking mode</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FREEZE</name>
								<description>FREEZE</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH5_SOMI</name>
						<description>ATOM0 Channel 7 Control Register in SOMI Mode
 resetvalue={Application Reset:0x0800,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0}</description>
						<addressOffset>644</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294965247</resetMask>
						<fields>
							<field>
								<name>MODE</name>
								<description>ATOM channel mode select</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ARU_EN</name>
								<description>ARU Input stream enable</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACB0</name>
								<description>ACB bit 0 . Note  Bosch name ACB 0 .</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SL</name>
								<description>Initial signal level after channel is enabled. Note   Reset value depends on the hardware configuration chosen by silicon vendor. Note  If the output is disabled  the output ATOM OUT x  is set to inverse value of SL. If FREEZE 0  following note is valid   If the channel is disabled  the output register of SOU unit is set to inverse value of SL. If FREEZE 1  following note is valid   If the channel is disabled  the output register of SOU unit is not changed  and output ATOM OUT x  is not changed.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FREEZE</name>
								<description>FREEZE</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
