J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>CH6_SOMP</name>
						<description>ATOM0 Channel 7 Control Register in SOMP Mode
 resetvalue={Application Reset:0x0800,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0}</description>
						<addressOffset>772</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294965247</resetMask>
						<fields>
							<field>
								<name>MODE</name>
								<description>ATOM channel mode select</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ARU_EN</name>
								<description>ARU Input stream enable</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ADL</name>
								<description>ARU data select for SOMP. This bit field is only relevant in SOMP mode to select the ARU data        source.</description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BITREV</name>
								<description>Bit reversing of output of counter register CN0. This bit enables the PCM mode. It is device specific  in which channel the PCM mode is available.        Please refer to device specific CROSSREFERENCE for this information.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SR0_TRIG</name>
								<description>SR0 is used to generate a trigger on output ATOM i  CH x  OUT T if equal to CN0. This bit is only relevant in SOMP mode. This bit should only be set if RST CCU0 of this channel is 0.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SL</name>
								<description>Signal level for pulse of PWM. Reset value depends on the hardware configuration chosen by silicon        vendor. If the output is disabled  the output ATOM OUT x  is set to inverse        value of SL FREEZE 0  the following note is valid  If the channel is disabled  the output register of SOU unit is set to        inverse value of SL. If FREEZE 1  the following note is valid  If the channel is disabled  the output register of SOU unit is not        changed  and output ATOM OUT x  is not changed.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK_SRC_SR</name>
								<description>Shadow register for CMU clock source register CLK SRC. If ECLK SRC 0   ECLK SRC 1  This register is a shadow register for the register CLK SRC. Thus  if        the CMU CLK source for PWM generation should be changed during        operation  the old CMU CLK has to operate until the update of the ATOM        channels internal CLK SRC register by the CLK SRC SR content is done        either by an end of a period or a FORCE UPDATE. After  channel  reset  the selected CLK SRC value is the SYS CLK  input        of Global Clock Divider . To use in SOMP mode one of the CMU CLKx  it is        recommended to perform a forced update of CLK SRC with the value of        CLK SRC SR value before with enabling the channel.</description>
								<lsb>12</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECLK_SRC</name>
								<description>Extend CLK SRC. See bit CLK SRC SR description for details.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRIG_PULSE</name>
								<description>Trigger output pulse length of one SYS CLK period</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>UDMODE</name>
								<description>Up down counter mode. This mode is only applicable in SOMP mode.</description>
								<lsb>18</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RST_CCU0</name>
								<description>Reset source of CCU0. If RST CCU0 1 and UPEN CTRLx 1 are set  TRIG  x 1  or TIM  EXT CAPTURE x  triggers        also the update of work register  CM0  CM1 and CLK SRC .</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OSM_TRIG</name>
								<description>Enable trigger of one shot pulse by trigger signal OSM TRIG. This bit should only be set if bit OSM 1 and bit RST CCU0 0.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EXT_TRIG</name>
								<description>Select TIM EXT CAPTURE x  as trigger signal</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EXTTRIGOUT</name>
								<description>Select TIM EXT CAPTURE x  as potential output signal TRIG  x </description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRIGOUT</name>
								<description>Trigger output selection  output signal TRIG CHx  of module ATOM CHx</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OSM</name>
								<description>One shot mode</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EXT_FUPD</name>
								<description>External forced update. This bit is only applicable in SOMP and SOMS mode.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FREEZE</name>
								<description>FREEZE</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH6_SOMS</name>
						<description>ATOM0 Channel 7 Control Register in SOMS Mode
 resetvalue={Application Reset:0x0800,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0,Application Reset:0x0}</description>
						<addressOffset>772</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294965247</resetMask>
						<fields>
							<field>
								<name>MODE</name>
								<description>ATOM channel mode select</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ARU_EN</name>
								<description>ARU Input stream enable</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACB0</name>
								<description>Shift direction for CM1 register. The data that has to be shifted out has to be aligned inside the CM1        register according to the defined shift direction. This bit is only applicable if ARU EN   0. If the direction  ACB0  is changed  the output ATOM OUT x  switches        immediately to the other  first  bit of CM1  bit 0 if ACB0   0  bit 23        if ACB0  160    160 1 .</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DSO</name>
								<description>Double Shift Output. Note  If DSO 1  only shift right is possible.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SL</name>
								<description>Defines signal level when channel and output is disabling. Reset value depends on the hardware configuration chosen by silicon          vendor. If the output is enabled  the output ATOM OUT x  is set to bit 0 or 23          of CM1 register. If the output is disabled  the output ATOM OUT x  is set to inverse          value of SL. An enable or disable of the channel x has no effect on ATOM OUT x . The inverse value of SL is shifted into the CM1 register. If FREEZE 0  the following note is valid  If the channel is disabled  the output register of SOU unit is set to          inverse value of SL. If FREEZE 1  the following note is valid  If the channel is disabled  the output register of SOU unit is not          changed  and output ATOM OUT x  is not changed.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CLK_SRC_SR</name>
								<description>Shift frequency select for channel. If ECLK SRC 0   ECLK SRC 1  This register is a shadow register for the register CLK SRC. Thus  if        the CMU CLK source for PWM generation should be changed during        operation  the old CMU CLK has to operate until the update of the ATOM        channels internal CLK SRC register by the CLK SRC SR content is done        either by an end of a period or a FORCE UPDATE. After  channel  reset  the selected CLK SRC value is the SYS CLK  input        of Global Clock Divider . To use in SOMP mode one of the CMU CLKx  it is        recommended to perform a forced update of CLK SRC with the value of        CLK SRC SR value before with enabling the channel.</description>
								<lsb>12</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECLK_SRC</name>
								<description>Extend CLK SRC. See bit CLK SRC SR description for details.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OSM</name>
								<description>One shot mode</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EXT_FUPD</name>
								<description>External forced update. This bit is only applicable in SOMP and SOMS mode.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FREEZE</name>
								<description>FREEZE</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH6_SR0</name>
						<description>ATOM0 Channel 7 CCU0 Compare Shadow Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>776</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SR0</name>
								<description>ATOM channel x shadow register SR0. Note  The SR0 register is used as shadow register for CM0 in SOMP and SOMS modes  and is used as capture register for time base TBU TS0 in SOMC mode.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH6_SR1</name>
						<description>ATOM0 Channel 7 CCU1 Compare Shadow Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>780</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SR1</name>
								<description>ATOM channel x shadow register SR1. Note  The SR1 register is used as shadow register for CM1 in SOMP and SOMS modes  and is used as capture register for time base TBU TS1 or TBU TS2  when selected in ATOM i  CH x  CTRL register  in SOMC mode.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH6_CM0</name>
						<description>ATOM0 Channel 7 CCU0 Compare Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>784</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CM0</name>
								<description>ATOM CCU0 compare register</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH6_CM1</name>
						<description>ATOM0 Channel 7 CCU1 Compare Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>788</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CM1</name>
								<description>ATOM CCU1 compare register</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH6_CN0</name>
						<description>ATOM0 Channel 7 CCU0 Counter Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>792</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CN0</name>
								<description>ATOM CCU0 counter register</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH6_STAT</name>
						<description>ATOM0 Channel 7 Status Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>796</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>OL</name>
								<description>Actual output signal level of ATOM CHx OUT. Note   Reset value is the inverted value of bit SL  which depends on the hardware configuration chosen by silicon vendor.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ACBI</name>
								<description>ATOM Mode control bits. Note  For ATOM SOMI  SOMC  SOMP and SOMS mode  this register serves as a mirror for the five ARU control bits received through the ARU interface. The bits are valid when the DV bit is set. Note  For SOMB mode  this bit field serves as the work register of the compare strategy. It can be updated with the value of bit field ACB of register ATOM i  CH x  CTRL  or the value of internal shadow register ACB SR.</description>
								<lsb>16</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>DV</name>
								<description>Valid ARU Data stored in compare registers. Note  This bit is only applicable in SOMC and SOMB mode. The CPU can determine the status of the ARU transfers with this bit. After the compare event occurred  the bit is reset by hardware .</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>WRF</name>
								<description>Write request of CPU failed for late update. Note  This bit is only applicable in SOMC and SOMB mode. Bit WRF can be reset by writing a 1 to it.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DR</name>
								<description>ARU data rejected flag. Note  The flag is cleared if valid data is received and stored via ARU.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ACBO</name>
								<description>ATOM Internal status bits. ACBO 3    1  CCU0 Compare match occurred. ACBO 4    1  CCU1 Compare match occurred. Note  These bits are only set in SOMC mode. Note  ACBO is reset to 0b00000 on an update of register CM0 or CM1  via ARU or CPU . Note  In SOMC mode  these bits are sent as ARU control bits 52..48.</description>
								<lsb>24</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH6_IRQ_NOTIFY</name>
						<description>ATOM0 Channel 7 Interrupt Notification Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>800</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CCU0TC</name>
								<description>CCU0 Trigger condition interrupt for channel x. The notification of the interrupt is only triggered one time after        reaching the condition CN0  gt   CM0. To enable re trigger of the        notification  first the condition CN0  lt  CM1 has to be reached. Note  This bit will be cleared on a CPU write access of value 1. A        read access leaves the bit unchanged. Note  This        description differs to the description in the Bosch spec.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CCU1TC</name>
								<description>CCU1TC  CCU1 Trigger condition interrupt for channel x. The notification of the interrupt is only triggered one time after        reaching the condition CN0  gt   CM1. To enable re trigger of the        notification  first the condition CN0  lt  CM1 has to be reached. Note  This bit will be cleared on a CPU write access of value 1. A        read access leaves the bit unchanged. Note  This        description differs to the description in the Bosch spec. Note  If bit SR0 TRIG is set to 1  only valid in SOMP mode   this        interrupt notify flag is set in case of SR0 is equal to CN0 and not set        in case of CM1  gt    lt   CN0.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH6_IRQ_EN</name>
						<description>ATOM0 Channel 7 Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>804</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CCU0TC_IRQ_EN</name>
								<description>ATOM CCU0TC IRQ interrupt enable</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CCU1TC_IRQ_EN</name>
								<description>ATOM CCU1TC IRQ interrupt enable. See bit 0.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH6_IRQ_FORCINT</name>
						<description>ATOM0 Channel 7 Software Interrupt Generation Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>808</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TRG_CCU0TC</name>
								<description>Trigger ATOM CCU0TC IRQ interrupt by software. Note  This bit is cleared automatically after write. Note  This bit is write protected by bit RF PROT of register GTM CTRL</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_CCU1TC</name>
								<description>Trigger ATOM CCU1TC IRQ interrupt by software. Note  This bit is cleared automatically after write. Note  This bit is write protected by bit RF PROT of register GTM CTRL</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH6_IRQ_MODE</name>
						<description>ATOM0 Channel 7 Interrupt Mode Configuration Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>812</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>IRQ_MODE</name>
								<description>IRQ mode selection. Note  The interrupt modes are described in CROSSREFERENCE .</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH7_RDADDR</name>
						<description>ATOM0 Channel 7 ARU read address Register
 resetvalue={Application Reset:0x1FE01FE}</description>
						<addressOffset>896</addressOffset>
						<size>32</size>
						<resetValue>33423870</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RDADDR0</name>
								<description>ARU Read address 0. Note  This read address is used by the ATOM channel to receive data from ARU immediately after the channel and ARU access is enabled  see ATOM i  CH x  CTRL register for details . Note  This bit field is only writable if channel is disabled.</description>
								<lsb>0</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RDADDR1</name>
								<description>ARU Read address 1. Note  The ATOM channel switches to this read address  when requested in the ARU control bits 52 to 48 with the pattern  111   . The channel switches back to the RDADDR0 after one ARU data package was received on RDADDR1 and the compare match event is occurred. Note  This read address is only applicable in SOMC mode. Note  This bit field is only writable if channel is disabled.</description>
								<lsb>16</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
