J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>ATOM0_AGC_GLB_CTRL</name>
						<description>ATOM0 AGC Global Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>64</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>HOST_TRIG</name>
								<description>Trigger request signal  see AGC  to update the register ENDIS STAT and OUTEN STAT. Note  this flag is reset automatically after triggering the update</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RST_CH0</name>
								<description>Software reset of channel 7. Note   This bit is cleared automatically after write by CPU. The channel registers are set to their reset values and channel operation is stopped immediately. The output register of SOU unit is reset to inverse reset value of SL bit.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RST_CH1</name>
								<description>Software reset of channel 7. Note   This bit is cleared automatically after write by CPU. The channel registers are set to their reset values and channel operation is stopped immediately. The output register of SOU unit is reset to inverse reset value of SL bit.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RST_CH2</name>
								<description>Software reset of channel 7. Note   This bit is cleared automatically after write by CPU. The channel registers are set to their reset values and channel operation is stopped immediately. The output register of SOU unit is reset to inverse reset value of SL bit.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RST_CH3</name>
								<description>Software reset of channel 7. Note   This bit is cleared automatically after write by CPU. The channel registers are set to their reset values and channel operation is stopped immediately. The output register of SOU unit is reset to inverse reset value of SL bit.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RST_CH4</name>
								<description>Software reset of channel 7. Note   This bit is cleared automatically after write by CPU. The channel registers are set to their reset values and channel operation is stopped immediately. The output register of SOU unit is reset to inverse reset value of SL bit.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RST_CH5</name>
								<description>Software reset of channel 7. Note   This bit is cleared automatically after write by CPU. The channel registers are set to their reset values and channel operation is stopped immediately. The output register of SOU unit is reset to inverse reset value of SL bit.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RST_CH6</name>
								<description>Software reset of channel 7. Note   This bit is cleared automatically after write by CPU. The channel registers are set to their reset values and channel operation is stopped immediately. The output register of SOU unit is reset to inverse reset value of SL bit.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RST_CH7</name>
								<description>Software reset of channel 7. Note   This bit is cleared automatically after write by CPU. The channel registers are set to their reset values and channel operation is stopped immediately. The output register of SOU unit is reset to inverse reset value of SL bit.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>UPEN_CTRL0</name>
								<description>ATOM channel 7 enable update of register CM0  CM1 and CLK SRC from SR0  SR1 and CLK SRC SR. Write   Read </description>
								<lsb>16</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>UPEN_CTRL1</name>
								<description>ATOM channel 7 enable update of register CM0  CM1 and CLK SRC from SR0  SR1 and CLK SRC SR. Write   Read </description>
								<lsb>18</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>UPEN_CTRL2</name>
								<description>ATOM channel 7 enable update of register CM0  CM1 and CLK SRC from SR0  SR1 and CLK SRC SR. Write   Read </description>
								<lsb>20</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>UPEN_CTRL3</name>
								<description>ATOM channel 7 enable update of register CM0  CM1 and CLK SRC from SR0  SR1 and CLK SRC SR. Write   Read </description>
								<lsb>22</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>UPEN_CTRL4</name>
								<description>ATOM channel 7 enable update of register CM0  CM1 and CLK SRC from SR0  SR1 and CLK SRC SR. Write   Read </description>
								<lsb>24</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>UPEN_CTRL5</name>
								<description>ATOM channel 7 enable update of register CM0  CM1 and CLK SRC from SR0  SR1 and CLK SRC SR. Write   Read </description>
								<lsb>26</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>UPEN_CTRL6</name>
								<description>ATOM channel 7 enable update of register CM0  CM1 and CLK SRC from SR0  SR1 and CLK SRC SR. Write   Read </description>
								<lsb>28</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>UPEN_CTRL7</name>
								<description>ATOM channel 7 enable update of register CM0  CM1 and CLK SRC from SR0  SR1 and CLK SRC SR. Write   Read </description>
								<lsb>30</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ATOM0_AGC_ENDIS_CTRL</name>
						<description>ATOM0 AGC Enable Disable Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>68</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ENDIS_CTRL0</name>
								<description>ATOM channel 7 enable disable update value. If FREEZE 0 and an ATOM channel is disabled  the counter CN0 is stopped and the output register of SOU unit is set to the       inverse value of control bit SL. On an enable event  the counter CN0 starts counting from its current value. If FREEZE 1 and an ATOM channel is disabled  the counter CN0 is       stopped  SOMP  SOMS mode  and each comparison is stopped  SOMC  SOMB mode . On an enable       event  the counter CN0 starts counting from its current value or a comparison is restarted. Write of following double bit values is possible  Note  If the output is disabled  OUTEN x  0   the ATOM channel x output ATOM OUT x  is the inverted value of bit SL.</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_CTRL1</name>
								<description>ATOM channel 7 enable disable update value. If FREEZE 0 and an ATOM channel is disabled  the counter CN0 is stopped and the output register of SOU unit is set to the       inverse value of control bit SL. On an enable event  the counter CN0 starts counting from its current value. If FREEZE 1 and an ATOM channel is disabled  the counter CN0 is       stopped  SOMP  SOMS mode  and each comparison is stopped  SOMC  SOMB mode . On an enable       event  the counter CN0 starts counting from its current value or a comparison is restarted. Write of following double bit values is possible  Note  If the output is disabled  OUTEN x  0   the ATOM channel x output ATOM OUT x  is the inverted value of bit SL.</description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_CTRL2</name>
								<description>ATOM channel 7 enable disable update value. If FREEZE 0 and an ATOM channel is disabled  the counter CN0 is stopped and the output register of SOU unit is set to the       inverse value of control bit SL. On an enable event  the counter CN0 starts counting from its current value. If FREEZE 1 and an ATOM channel is disabled  the counter CN0 is       stopped  SOMP  SOMS mode  and each comparison is stopped  SOMC  SOMB mode . On an enable       event  the counter CN0 starts counting from its current value or a comparison is restarted. Write of following double bit values is possible  Note  If the output is disabled  OUTEN x  0   the ATOM channel x output ATOM OUT x  is the inverted value of bit SL.</description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_CTRL3</name>
								<description>ATOM channel 7 enable disable update value. If FREEZE 0 and an ATOM channel is disabled  the counter CN0 is stopped and the output register of SOU unit is set to the       inverse value of control bit SL. On an enable event  the counter CN0 starts counting from its current value. If FREEZE 1 and an ATOM channel is disabled  the counter CN0 is       stopped  SOMP  SOMS mode  and each comparison is stopped  SOMC  SOMB mode . On an enable       event  the counter CN0 starts counting from its current value or a comparison is restarted. Write of following double bit values is possible  Note  If the output is disabled  OUTEN x  0   the ATOM channel x output ATOM OUT x  is the inverted value of bit SL.</description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_CTRL4</name>
								<description>ATOM channel 7 enable disable update value. If FREEZE 0 and an ATOM channel is disabled  the counter CN0 is stopped and the output register of SOU unit is set to the       inverse value of control bit SL. On an enable event  the counter CN0 starts counting from its current value. If FREEZE 1 and an ATOM channel is disabled  the counter CN0 is       stopped  SOMP  SOMS mode  and each comparison is stopped  SOMC  SOMB mode . On an enable       event  the counter CN0 starts counting from its current value or a comparison is restarted. Write of following double bit values is possible  Note  If the output is disabled  OUTEN x  0   the ATOM channel x output ATOM OUT x  is the inverted value of bit SL.</description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_CTRL5</name>
								<description>ATOM channel 7 enable disable update value. If FREEZE 0 and an ATOM channel is disabled  the counter CN0 is stopped and the output register of SOU unit is set to the       inverse value of control bit SL. On an enable event  the counter CN0 starts counting from its current value. If FREEZE 1 and an ATOM channel is disabled  the counter CN0 is       stopped  SOMP  SOMS mode  and each comparison is stopped  SOMC  SOMB mode . On an enable       event  the counter CN0 starts counting from its current value or a comparison is restarted. Write of following double bit values is possible  Note  If the output is disabled  OUTEN x  0   the ATOM channel x output ATOM OUT x  is the inverted value of bit SL.</description>
								<lsb>10</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_CTRL6</name>
								<description>ATOM channel 7 enable disable update value. If FREEZE 0 and an ATOM channel is disabled  the counter CN0 is stopped and the output register of SOU unit is set to the       inverse value of control bit SL. On an enable event  the counter CN0 starts counting from its current value. If FREEZE 1 and an ATOM channel is disabled  the counter CN0 is       stopped  SOMP  SOMS mode  and each comparison is stopped  SOMC  SOMB mode . On an enable       event  the counter CN0 starts counting from its current value or a comparison is restarted. Write of following double bit values is possible  Note  If the output is disabled  OUTEN x  0   the ATOM channel x output ATOM OUT x  is the inverted value of bit SL.</description>
								<lsb>12</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_CTRL7</name>
								<description>ATOM channel 7 enable disable update value. If FREEZE 0 and an ATOM channel is disabled  the counter CN0 is stopped and the output register of SOU unit is set to the       inverse value of control bit SL. On an enable event  the counter CN0 starts counting from its current value. If FREEZE 1 and an ATOM channel is disabled  the counter CN0 is       stopped  SOMP  SOMS mode  and each comparison is stopped  SOMC  SOMB mode . On an enable       event  the counter CN0 starts counting from its current value or a comparison is restarted. Write of following double bit values is possible  Note  If the output is disabled  OUTEN x  0   the ATOM channel x output ATOM OUT x  is the inverted value of bit SL.</description>
								<lsb>14</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ATOM0_AGC_ENDIS_STAT</name>
						<description>ATOM0 AGC Enable Disable Status Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>72</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ENDIS_STAT0</name>
								<description>ATOM channel 7 enable disable. If FREEZE 0 and an ATOM channel is disabled  the counter CN0 is       stopped and the output register of SOU unit is set to the inverse value of control bit SL. On       an enable event  the counter CN0 starts counting from its current value. If FREEZE 1 and an ATOM channel is disabled  the counter CN0 is       stopped  SOMP  SOMS mode  and each comparison is stopped  SOMC  SOMB mode . On an enable       event  the counter CN0 starts counting from its current value or a comparison is restarted.</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_STAT1</name>
								<description>ATOM channel 7 enable disable. If FREEZE 0 and an ATOM channel is disabled  the counter CN0 is       stopped and the output register of SOU unit is set to the inverse value of control bit SL. On       an enable event  the counter CN0 starts counting from its current value. If FREEZE 1 and an ATOM channel is disabled  the counter CN0 is       stopped  SOMP  SOMS mode  and each comparison is stopped  SOMC  SOMB mode . On an enable       event  the counter CN0 starts counting from its current value or a comparison is restarted.</description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_STAT2</name>
								<description>ATOM channel 7 enable disable. If FREEZE 0 and an ATOM channel is disabled  the counter CN0 is       stopped and the output register of SOU unit is set to the inverse value of control bit SL. On       an enable event  the counter CN0 starts counting from its current value. If FREEZE 1 and an ATOM channel is disabled  the counter CN0 is       stopped  SOMP  SOMS mode  and each comparison is stopped  SOMC  SOMB mode . On an enable       event  the counter CN0 starts counting from its current value or a comparison is restarted.</description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_STAT3</name>
								<description>ATOM channel 7 enable disable. If FREEZE 0 and an ATOM channel is disabled  the counter CN0 is       stopped and the output register of SOU unit is set to the inverse value of control bit SL. On       an enable event  the counter CN0 starts counting from its current value. If FREEZE 1 and an ATOM channel is disabled  the counter CN0 is       stopped  SOMP  SOMS mode  and each comparison is stopped  SOMC  SOMB mode . On an enable       event  the counter CN0 starts counting from its current value or a comparison is restarted.</description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_STAT4</name>
								<description>ATOM channel 7 enable disable. If FREEZE 0 and an ATOM channel is disabled  the counter CN0 is       stopped and the output register of SOU unit is set to the inverse value of control bit SL. On       an enable event  the counter CN0 starts counting from its current value. If FREEZE 1 and an ATOM channel is disabled  the counter CN0 is       stopped  SOMP  SOMS mode  and each comparison is stopped  SOMC  SOMB mode . On an enable       event  the counter CN0 starts counting from its current value or a comparison is restarted.</description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_STAT5</name>
								<description>ATOM channel 7 enable disable. If FREEZE 0 and an ATOM channel is disabled  the counter CN0 is       stopped and the output register of SOU unit is set to the inverse value of control bit SL. On       an enable event  the counter CN0 starts counting from its current value. If FREEZE 1 and an ATOM channel is disabled  the counter CN0 is       stopped  SOMP  SOMS mode  and each comparison is stopped  SOMC  SOMB mode . On an enable       event  the counter CN0 starts counting from its current value or a comparison is restarted.</description>
								<lsb>10</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_STAT6</name>
								<description>ATOM channel 7 enable disable. If FREEZE 0 and an ATOM channel is disabled  the counter CN0 is       stopped and the output register of SOU unit is set to the inverse value of control bit SL. On       an enable event  the counter CN0 starts counting from its current value. If FREEZE 1 and an ATOM channel is disabled  the counter CN0 is       stopped  SOMP  SOMS mode  and each comparison is stopped  SOMC  SOMB mode . On an enable       event  the counter CN0 starts counting from its current value or a comparison is restarted.</description>
								<lsb>12</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENDIS_STAT7</name>
								<description>ATOM channel 7 enable disable. If FREEZE 0 and an ATOM channel is disabled  the counter CN0 is       stopped and the output register of SOU unit is set to the inverse value of control bit SL. On       an enable event  the counter CN0 starts counting from its current value. If FREEZE 1 and an ATOM channel is disabled  the counter CN0 is       stopped  SOMP  SOMS mode  and each comparison is stopped  SOMC  SOMB mode . On an enable       event  the counter CN0 starts counting from its current value or a comparison is restarted.</description>
								<lsb>14</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ATOM0_AGC_ACT_TB</name>
						<description>ATOM0 AGC Action Time Base Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>76</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ACT_TB</name>
								<description>Time base value. Specifies the signed compare value with selected signal TBU TS x          x 0..2. If selected TBU TS x  value is in the interval         ACT TB 007FFFFFh ACT TB   the event is in the past  and the trigger is        generated immediately. Otherwise  the event is in the future  and the        trigger is generated if selected TBU TS x  is equal to ACT TB.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TB_TRIG</name>
								<description>Set trigger request. Note  This flag is reset automatically if the selected time base unit   TBU TS0 or TBU TS1 or TBU TS2  if        present  has reached the value ACT TB   and        the update of the register was triggered.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBU_SEL</name>
								<description>Selection of time base used for comparison. Note   The bit combination 0b10 is only applicable if the TBU of the device contains three time base channels. Otherwise  this bit combination is also reserved. Please refer to GTM Architecture block diagram on page 3 to determine the number of channels for TBU of this device.</description>
								<lsb>25</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
