J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>ATOM0_AGC_OUTEN_CTRL</name>
						<description>ATOM0 AGC Output Enable Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>80</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>OUTEN_CTRL0</name>
								<description>Output ATOM OUT7 enable disable update value. Write of following double bit values is possible  Note   If the channel is disabled  ENDIS 0  0  or the output is disabled  OUTEN 0  0   the TOM channel 0 output ATOM OUT 0  is the inverted value of bit SL.</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_CTRL1</name>
								<description>Output ATOM OUT7 enable disable update value. Write of following double bit values is possible  Note   If the channel is disabled  ENDIS 0  0  or the output is disabled  OUTEN 0  0   the TOM channel 0 output ATOM OUT 0  is the inverted value of bit SL.</description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_CTRL2</name>
								<description>Output ATOM OUT7 enable disable update value. Write of following double bit values is possible  Note   If the channel is disabled  ENDIS 0  0  or the output is disabled  OUTEN 0  0   the TOM channel 0 output ATOM OUT 0  is the inverted value of bit SL.</description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_CTRL3</name>
								<description>Output ATOM OUT7 enable disable update value. Write of following double bit values is possible  Note   If the channel is disabled  ENDIS 0  0  or the output is disabled  OUTEN 0  0   the TOM channel 0 output ATOM OUT 0  is the inverted value of bit SL.</description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_CTRL4</name>
								<description>Output ATOM OUT7 enable disable update value. Write of following double bit values is possible  Note   If the channel is disabled  ENDIS 0  0  or the output is disabled  OUTEN 0  0   the TOM channel 0 output ATOM OUT 0  is the inverted value of bit SL.</description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_CTRL5</name>
								<description>Output ATOM OUT7 enable disable update value. Write of following double bit values is possible  Note   If the channel is disabled  ENDIS 0  0  or the output is disabled  OUTEN 0  0   the TOM channel 0 output ATOM OUT 0  is the inverted value of bit SL.</description>
								<lsb>10</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_CTRL6</name>
								<description>Output ATOM OUT7 enable disable update value. Write of following double bit values is possible  Note   If the channel is disabled  ENDIS 0  0  or the output is disabled  OUTEN 0  0   the TOM channel 0 output ATOM OUT 0  is the inverted value of bit SL.</description>
								<lsb>12</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_CTRL7</name>
								<description>Output ATOM OUT7 enable disable update value. Write of following double bit values is possible  Note   If the channel is disabled  ENDIS 0  0  or the output is disabled  OUTEN 0  0   the TOM channel 0 output ATOM OUT 0  is the inverted value of bit SL.</description>
								<lsb>14</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ATOM0_AGC_OUTEN_STAT</name>
						<description>ATOM0 AGC Output Enable Status Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>84</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>OUTEN_STAT0</name>
								<description>Control status of output ATOM OUT7. Write   Read  </description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_STAT1</name>
								<description>Control status of output ATOM OUT7. Write   Read  </description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_STAT2</name>
								<description>Control status of output ATOM OUT7. Write   Read  </description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_STAT3</name>
								<description>Control status of output ATOM OUT7. Write   Read  </description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_STAT4</name>
								<description>Control status of output ATOM OUT7. Write   Read  </description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_STAT5</name>
								<description>Control status of output ATOM OUT7. Write   Read  </description>
								<lsb>10</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_STAT6</name>
								<description>Control status of output ATOM OUT7. Write   Read  </description>
								<lsb>12</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OUTEN_STAT7</name>
								<description>Control status of output ATOM OUT7. Write   Read  </description>
								<lsb>14</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ATOM0_AGC_FUPD_CTRL</name>
						<description>ATOM0 AGC Force Update Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>88</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>FUPD_CTRL0</name>
								<description>Force update of ATOM channel 7 operation registers. If enabled  force update of register CM0  CM1 and CLK SRC triggered by HOST TRIG  ACT TB compare match  or internal trigger. Write   Read   Note  In SOMP mode  the force update request is stored and executed synchronized to the selected CMU CLK. In all other modes  the force update request is executed immediately. Note  In SOMP mode  in case of ECLK SRC 1 and CLK SRC SR   0b011 0b100 0b101 0b110 a force update leads to an immediate update of CM0  CM1 and CLK SRC.</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FUPD_CTRL1</name>
								<description>Force update of ATOM channel 7 operation registers. If enabled  force update of register CM0  CM1 and CLK SRC triggered by HOST TRIG  ACT TB compare match  or internal trigger. Write   Read   Note  In SOMP mode  the force update request is stored and executed synchronized to the selected CMU CLK. In all other modes  the force update request is executed immediately. Note  In SOMP mode  in case of ECLK SRC 1 and CLK SRC SR   0b011 0b100 0b101 0b110 a force update leads to an immediate update of CM0  CM1 and CLK SRC.</description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FUPD_CTRL2</name>
								<description>Force update of ATOM channel 7 operation registers. If enabled  force update of register CM0  CM1 and CLK SRC triggered by HOST TRIG  ACT TB compare match  or internal trigger. Write   Read   Note  In SOMP mode  the force update request is stored and executed synchronized to the selected CMU CLK. In all other modes  the force update request is executed immediately. Note  In SOMP mode  in case of ECLK SRC 1 and CLK SRC SR   0b011 0b100 0b101 0b110 a force update leads to an immediate update of CM0  CM1 and CLK SRC.</description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FUPD_CTRL3</name>
								<description>Force update of ATOM channel 7 operation registers. If enabled  force update of register CM0  CM1 and CLK SRC triggered by HOST TRIG  ACT TB compare match  or internal trigger. Write   Read   Note  In SOMP mode  the force update request is stored and executed synchronized to the selected CMU CLK. In all other modes  the force update request is executed immediately. Note  In SOMP mode  in case of ECLK SRC 1 and CLK SRC SR   0b011 0b100 0b101 0b110 a force update leads to an immediate update of CM0  CM1 and CLK SRC.</description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FUPD_CTRL4</name>
								<description>Force update of ATOM channel 7 operation registers. If enabled  force update of register CM0  CM1 and CLK SRC triggered by HOST TRIG  ACT TB compare match  or internal trigger. Write   Read   Note  In SOMP mode  the force update request is stored and executed synchronized to the selected CMU CLK. In all other modes  the force update request is executed immediately. Note  In SOMP mode  in case of ECLK SRC 1 and CLK SRC SR   0b011 0b100 0b101 0b110 a force update leads to an immediate update of CM0  CM1 and CLK SRC.</description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FUPD_CTRL5</name>
								<description>Force update of ATOM channel 7 operation registers. If enabled  force update of register CM0  CM1 and CLK SRC triggered by HOST TRIG  ACT TB compare match  or internal trigger. Write   Read   Note  In SOMP mode  the force update request is stored and executed synchronized to the selected CMU CLK. In all other modes  the force update request is executed immediately. Note  In SOMP mode  in case of ECLK SRC 1 and CLK SRC SR   0b011 0b100 0b101 0b110 a force update leads to an immediate update of CM0  CM1 and CLK SRC.</description>
								<lsb>10</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FUPD_CTRL6</name>
								<description>Force update of ATOM channel 7 operation registers. If enabled  force update of register CM0  CM1 and CLK SRC triggered by HOST TRIG  ACT TB compare match  or internal trigger. Write   Read   Note  In SOMP mode  the force update request is stored and executed synchronized to the selected CMU CLK. In all other modes  the force update request is executed immediately. Note  In SOMP mode  in case of ECLK SRC 1 and CLK SRC SR   0b011 0b100 0b101 0b110 a force update leads to an immediate update of CM0  CM1 and CLK SRC.</description>
								<lsb>12</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FUPD_CTRL7</name>
								<description>Force update of ATOM channel 7 operation registers. If enabled  force update of register CM0  CM1 and CLK SRC triggered by HOST TRIG  ACT TB compare match  or internal trigger. Write   Read   Note  In SOMP mode  the force update request is stored and executed synchronized to the selected CMU CLK. In all other modes  the force update request is executed immediately. Note  In SOMP mode  in case of ECLK SRC 1 and CLK SRC SR   0b011 0b100 0b101 0b110 a force update leads to an immediate update of CM0  CM1 and CLK SRC.</description>
								<lsb>14</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSTCN0_CH0</name>
								<description>Reset CN0 of channel 7 on force update event. If enabled  reset CN0 triggered by HOST TRIG  ACT TB compare match  or        internal trigger. Write   Read  </description>
								<lsb>16</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSTCN0_CH1</name>
								<description>Reset CN0 of channel 7 on force update event. If enabled  reset CN0 triggered by HOST TRIG  ACT TB compare match  or        internal trigger. Write   Read  </description>
								<lsb>18</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSTCN0_CH2</name>
								<description>Reset CN0 of channel 7 on force update event. If enabled  reset CN0 triggered by HOST TRIG  ACT TB compare match  or        internal trigger. Write   Read  </description>
								<lsb>20</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSTCN0_CH3</name>
								<description>Reset CN0 of channel 7 on force update event. If enabled  reset CN0 triggered by HOST TRIG  ACT TB compare match  or        internal trigger. Write   Read  </description>
								<lsb>22</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSTCN0_CH4</name>
								<description>Reset CN0 of channel 7 on force update event. If enabled  reset CN0 triggered by HOST TRIG  ACT TB compare match  or        internal trigger. Write   Read  </description>
								<lsb>24</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSTCN0_CH5</name>
								<description>Reset CN0 of channel 7 on force update event. If enabled  reset CN0 triggered by HOST TRIG  ACT TB compare match  or        internal trigger. Write   Read  </description>
								<lsb>26</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSTCN0_CH6</name>
								<description>Reset CN0 of channel 7 on force update event. If enabled  reset CN0 triggered by HOST TRIG  ACT TB compare match  or        internal trigger. Write   Read  </description>
								<lsb>28</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSTCN0_CH7</name>
								<description>Reset CN0 of channel 7 on force update event. If enabled  reset CN0 triggered by HOST TRIG  ACT TB compare match  or        internal trigger. Write   Read  </description>
								<lsb>30</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ATOM0_AGC_INT_TRIG</name>
						<description>ATOM0 AGC Internal Trigger Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>92</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>INT_TRIG0</name>
								<description>Select input signal TRIG 7 as a trigger source. Write   Read  </description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INT_TRIG1</name>
								<description>Select input signal TRIG 7 as a trigger source. Write   Read  </description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INT_TRIG2</name>
								<description>Select input signal TRIG 7 as a trigger source. Write   Read  </description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INT_TRIG3</name>
								<description>Select input signal TRIG 7 as a trigger source. Write   Read  </description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INT_TRIG4</name>
								<description>Select input signal TRIG 7 as a trigger source. Write   Read  </description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INT_TRIG5</name>
								<description>Select input signal TRIG 7 as a trigger source. Write   Read  </description>
								<lsb>10</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INT_TRIG6</name>
								<description>Select input signal TRIG 7 as a trigger source. Write   Read  </description>
								<lsb>12</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INT_TRIG7</name>
								<description>Select input signal TRIG 7 as a trigger source. Write   Read  </description>
								<lsb>14</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<dim>5</dim>
					<dimIncrement>4096</dimIncrement>
					<name>MCS[%s]</name>
					<description>MCS</description>
					<addressOffset>983040</addressOffset>
					<register>
						<name>MCS0_CH0_R0</name>
						<description>MCS0 Channel 7 General Purpose Register 7
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DATA</name>
								<description>Data of general purpose register R y . Note  This register is the same as described in internal register section. Note  For the register MCS i  CH x  R6  see internal register section  an additional write protection during an active ARDI or NARDI instruction is applied</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MCS0_CH0_R1</name>
						<description>MCS0 Channel 7 General Purpose Register 7
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DATA</name>
								<description>Data of general purpose register R y . Note  This register is the same as described in internal register section. Note  For the register MCS i  CH x  R6  see internal register section  an additional write protection during an active ARDI or NARDI instruction is applied</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MCS0_CH0_R2</name>
						<description>MCS0 Channel 7 General Purpose Register 7
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DATA</name>
								<description>Data of general purpose register R y . Note  This register is the same as described in internal register section. Note  For the register MCS i  CH x  R6  see internal register section  an additional write protection during an active ARDI or NARDI instruction is applied</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MCS0_CH0_R3</name>
						<description>MCS0 Channel 7 General Purpose Register 7
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>12</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DATA</name>
								<description>Data of general purpose register R y . Note  This register is the same as described in internal register section. Note  For the register MCS i  CH x  R6  see internal register section  an additional write protection during an active ARDI or NARDI instruction is applied</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MCS0_CH0_R4</name>
						<description>MCS0 Channel 7 General Purpose Register 7
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>16</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DATA</name>
								<description>Data of general purpose register R y . Note  This register is the same as described in internal register section. Note  For the register MCS i  CH x  R6  see internal register section  an additional write protection during an active ARDI or NARDI instruction is applied</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MCS0_CH0_R5</name>
						<description>MCS0 Channel 7 General Purpose Register 7
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>20</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DATA</name>
								<description>Data of general purpose register R y . Note  This register is the same as described in internal register section. Note  For the register MCS i  CH x  R6  see internal register section  an additional write protection during an active ARDI or NARDI instruction is applied</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MCS0_CH0_R6</name>
						<description>MCS0 Channel 7 General Purpose Register 7
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>24</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DATA</name>
								<description>Data of general purpose register R y . Note  This register is the same as described in internal register section. Note  For the register MCS i  CH x  R6  see internal register section  an additional write protection during an active ARDI or NARDI instruction is applied</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MCS0_CH0_R7</name>
						<description>MCS0 Channel 7 General Purpose Register 7
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>28</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DATA</name>
								<description>Data of general purpose register R y . Note  This register is the same as described in internal register section. Note  For the register MCS i  CH x  R6  see internal register section  an additional write protection during an active ARDI or NARDI instruction is applied</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
