J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>CH5_IRQ_EN</name>
						<description>MCS0 Channel 7 Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>712</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>MCS_IRQ_EN</name>
								<description>MCS channel x MCS IRQ interrupt enable</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>STK_ERR_IRQ_EN</name>
								<description>MCS channel x STK ERR IRQ interrupt enable</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ERR_IRQ_EN</name>
								<description>MCS channel x ERR IRQ interrupt enable</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH5_IRQ_FORCINT</name>
						<description>MCS0 Channel 7 Force Interrupt Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>716</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TRG_MCS_IRQ</name>
								<description>Trigger IRQ bit in MCS CH  x  IRQ NOTIFY register by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_STK_ERR_IRQ</name>
								<description>Trigger IRQ bit in MCS CH  x  IRQ NOTIFY register by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_ERR_IRQ</name>
								<description>Trigger IRQ bit in MCS CH  x  IRQ NOTIFY register by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH5_IRQ_MODE</name>
						<description>MCS0 Channel 7 Interrupt Mode Configuration Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>720</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>IRQ_MODE</name>
								<description>IRQ mode selection. The interrupt modes are described in CROSSREFERENCE .</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH5_EIRQ_EN</name>
						<description>MCS0 Channel 7 Error Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>724</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>MCS_EIRQ_EN0</name>
								<description>MCS channel x MCS EIRQ error interrupt enable</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>STK_ERR_EIRQ_EN</name>
								<description>MCS channel x STK ERR IRQ error interrupt enable</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ERR_EIRQ_EN</name>
								<description>MCS channel x ERR EIRQ error interrupt enable</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MCS0_CH6_R0</name>
						<description>MCS0 Channel 7 General Purpose Register 7
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>768</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DATA</name>
								<description>Data of general purpose register R y . Note  This register is the same as described in internal register section. Note  For the register MCS i  CH x  R6  see internal register section  an additional write protection during an active ARDI or NARDI instruction is applied</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MCS0_CH6_R1</name>
						<description>MCS0 Channel 7 General Purpose Register 7
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>772</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DATA</name>
								<description>Data of general purpose register R y . Note  This register is the same as described in internal register section. Note  For the register MCS i  CH x  R6  see internal register section  an additional write protection during an active ARDI or NARDI instruction is applied</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MCS0_CH6_R2</name>
						<description>MCS0 Channel 7 General Purpose Register 7
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>776</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DATA</name>
								<description>Data of general purpose register R y . Note  This register is the same as described in internal register section. Note  For the register MCS i  CH x  R6  see internal register section  an additional write protection during an active ARDI or NARDI instruction is applied</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MCS0_CH6_R3</name>
						<description>MCS0 Channel 7 General Purpose Register 7
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>780</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DATA</name>
								<description>Data of general purpose register R y . Note  This register is the same as described in internal register section. Note  For the register MCS i  CH x  R6  see internal register section  an additional write protection during an active ARDI or NARDI instruction is applied</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MCS0_CH6_R4</name>
						<description>MCS0 Channel 7 General Purpose Register 7
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>784</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DATA</name>
								<description>Data of general purpose register R y . Note  This register is the same as described in internal register section. Note  For the register MCS i  CH x  R6  see internal register section  an additional write protection during an active ARDI or NARDI instruction is applied</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MCS0_CH6_R5</name>
						<description>MCS0 Channel 7 General Purpose Register 7
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>788</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DATA</name>
								<description>Data of general purpose register R y . Note  This register is the same as described in internal register section. Note  For the register MCS i  CH x  R6  see internal register section  an additional write protection during an active ARDI or NARDI instruction is applied</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MCS0_CH6_R6</name>
						<description>MCS0 Channel 7 General Purpose Register 7
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>792</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DATA</name>
								<description>Data of general purpose register R y . Note  This register is the same as described in internal register section. Note  For the register MCS i  CH x  R6  see internal register section  an additional write protection during an active ARDI or NARDI instruction is applied</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MCS0_CH6_R7</name>
						<description>MCS0 Channel 7 General Purpose Register 7
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>796</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DATA</name>
								<description>Data of general purpose register R y . Note  This register is the same as described in internal register section. Note  For the register MCS i  CH x  R6  see internal register section  an additional write protection during an active ARDI or NARDI instruction is applied</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH6_CTRL</name>
						<description>MCS0 Channel 7 Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>800</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>EN</name>
								<description>Enable MCS channel. Note  Enabling or disabling of an MCS channel is synchronized to the ending of an instruction  and thus it may take several clock cycles  e.g. active memory transfers or pending WURM transfers have to be finished before disabling the MCS channel. The internal state of a channel can be obtained by reading bit EN. Note  To disable an MCS channel reliably  the EN bit should be cleared  followed by setting the CAT and CWT bits in order to cancel any pending WURM or ARU instructions. Note  The EN bit is write protected during RAM reset phase.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IRQ</name>
								<description>Interrupt state. This bit is read only  and it mirrors the internal IRQ state.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ERR</name>
								<description>Error state. This bit is read only  and it mirrors the internal error state.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CY</name>
								<description>Carry bit state. This bit is read only and it mirrors the internal carry flag CY.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>Z</name>
								<description>Zero bit state. This bit is read only and it mirrors the internal zero flag Z.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>V</name>
								<description>Overflow bit state. This bit is read only and it mirrors the internal carry flag V.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>N</name>
								<description>Negative bit state. This bit is read only and it mirrors the internal zero flag N.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CAT</name>
								<description>Cancel ARU transfer state. This bit is read only and it mirrors the internal cancel ARU transfer        status flag CAT.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CWT</name>
								<description>Cancel WURM instruction state. This bit is read only and it mirrors the internal cancel WURM        instruction status flag CWT.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SAT</name>
								<description>Successful ARU transfer bit. This bit is read only  and it mirrors the internal state of the ARU        transfer status flag SAT.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SP_CNT</name>
								<description>Stack pointer counter value. Actual stack depth of channel. The bit field is incremented on behalf of        a CALL or PUSH instruction and decremented on behalf of a RET or POP        instruction. The MCS channel STK ERR IRQ is raised  when an overflow or        underflow is detected on this bit field.</description>
								<lsb>16</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH6_ACB</name>
						<description>MCS0 Channel 7 ARU Control Bit Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>804</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ACB0</name>
								<description>ARU Control bit 0. This bit is read only  and it mirrors the internal state.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ACB1</name>
								<description>ARU Control bit 1. This bit is read only  and it mirrors the internal state.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ACB2</name>
								<description>ARU Control bit 2. This bit is read only  and it mirrors the internal state.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ACB3</name>
								<description>ARU Control bit 3. This bit is read only  and it mirrors the internal state.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ACB4</name>
								<description>ARU Control bit 4. This bit is read only  and it mirrors the internal state.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH6_MHB</name>
						<description>MCS0 Channel 7 Memory High Byte Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>828</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DATA</name>
								<description>Data of memory high bit register MHB</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH6_PC</name>
						<description>MCS0 Channel 7 Program Counter Register
 resetvalue={Application Reset:0x1C}</description>
						<addressOffset>832</addressOffset>
						<size>32</size>
						<resetValue>28</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>PC</name>
								<description>Current Program Counter. Note  The program counter is only writable if the corresponding MCS channel is disabled. The bits 0 and 1 are always written as zeros. Note  The actual width of the program counter depends on the MCS configuration. The actual width is RAW USR 2 bits meaning that only the bits 0 to RAW USR 1 are available and the other bits  RAW USR 2 to 31  are reserved.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH6_IRQ_NOTIFY</name>
						<description>MCS0 Channel 7 Interrupt Notification Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>836</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>MCS_IRQ</name>
								<description>Interrupt request by MCS channel x. This bit will be cleared on a CPU write access with a value of  1 . A          read access leaves the bit unchanged. By writing a  1  to this register  the IRQ flag in the MCS channel          status register STA is cleared.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>STK_ERR_IRQ</name>
								<description>Stack counter overflow underflow of channel x. Note  This bit will be cleared on a CPU write access with a value of  1 . A read access leaves the bit unchanged.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ERR_IRQ</name>
								<description>MCS channel x ERR interrupt. If the ERR bit of register STA is triggered  the ERR IRQ will also be          set. This bit will be cleared on a CPU write access with a value of  1 . A          read access leaves the bit unchanged.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH6_IRQ_EN</name>
						<description>MCS0 Channel 7 Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>840</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>MCS_IRQ_EN</name>
								<description>MCS channel x MCS IRQ interrupt enable</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>STK_ERR_IRQ_EN</name>
								<description>MCS channel x STK ERR IRQ interrupt enable</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ERR_IRQ_EN</name>
								<description>MCS channel x ERR IRQ interrupt enable</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH6_IRQ_FORCINT</name>
						<description>MCS0 Channel 7 Force Interrupt Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>844</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TRG_MCS_IRQ</name>
								<description>Trigger IRQ bit in MCS CH  x  IRQ NOTIFY register by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_STK_ERR_IRQ</name>
								<description>Trigger IRQ bit in MCS CH  x  IRQ NOTIFY register by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRG_ERR_IRQ</name>
								<description>Trigger IRQ bit in MCS CH  x  IRQ NOTIFY register by software. This bit is cleared automatically after write. This bit is write protected by bit RF PROT of register GTM CTRL.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH6_IRQ_MODE</name>
						<description>MCS0 Channel 7 Interrupt Mode Configuration Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>848</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>IRQ_MODE</name>
								<description>IRQ mode selection. The interrupt modes are described in CROSSREFERENCE .</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CH6_EIRQ_EN</name>
						<description>MCS0 Channel 7 Error Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>852</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>MCS_EIRQ_EN0</name>
								<description>MCS channel x MCS EIRQ error interrupt enable</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>STK_ERR_EIRQ_EN</name>
								<description>MCS channel x STK ERR IRQ error interrupt enable</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ERR_EIRQ_EN</name>
								<description>MCS channel x ERR EIRQ error interrupt enable</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MCS0_CH7_R0</name>
						<description>MCS0 Channel 7 General Purpose Register 7
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>896</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DATA</name>
								<description>Data of general purpose register R y . Note  This register is the same as described in internal register section. Note  For the register MCS i  CH x  R6  see internal register section  an additional write protection during an active ARDI or NARDI instruction is applied</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
