J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>MCSi_CTRL_STAT</name>
						<description>MCS0 Control and Status Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>100</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SCD_MODE</name>
								<description>Select MCS scheduling mode</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SCD_CH</name>
								<description>Channel selection for scheduling algorithm. MCS channel identifier used by several scheduling modes. The actual width of the bit field SCD CH is calculated as ceiling log 2  T 1  . Unused MSBs are reserved and read as zero.</description>
								<lsb>8</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RAM_RST</name>
								<description>RAM reset bit. The RAM reset initializes the memory content with zeros. RAM access          and enabling of MCS channels is disabled during active RAM reset. This bit is only writable if the bit RF PROT in register GTM CTRL is          cleared  and all MCS channels are disabled. The actual reset value of this bit depends on the silicon vendor          configuration. The reset value is 1  if the RAM reset is performed          together with the sub module reset  otherwise  the reset value is 0.          If the reset value is 1  the reset value is changed to 0 by hardware          when the RAM reset has finished.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>HLT_SP_OFL</name>
								<description>Halt on stack pointer overflow</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ERR_SRC_ID</name>
								<description>Error source identifier. This register is updated once  if an error was detected by the MCS.          The register is set to its initial value 000 after each write access to an existing ERR bit in register MCS i  ERR.          If multiple errors occur  ERR SRC ID is holding the first type of          error which has occurred.</description>
								<lsb>20</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>EN_TIM_FOUT</name>
								<description>Enable routing of TIM i  CH x  F OUT signal</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN_XOREG</name>
								<description>Enable extended register set. Note  If the extended operation register sets are disabled  the MCS instructions can only use the subset OREG of the register set as arguments in the instructions. In this case  the upper address bits in the instructions are always read as zeros  which leads to unexpected results of the MCS program if arguments A or B refer to a register that is not part of OREG .</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>HLT_AEIM_ERR</name>
								<description>Halt on AEI bus master error. If the register HLT AEIM ERR is set  and an MCS channel x is executing          an invalid bus master access  the MCS channel x is halted  the ERR bit          of its register STA is set  and the bit field ERR SRC ID of this          register is updated. If the bus master is accessing a slave that does not insert wait          cycles  e.g. register access   it takes two additional clock cycles          until the MCS channel is halted. Within that time span  the MCS          channel can continue with its program execution  depending on the          selected scheduling mode. The registers AEIM XPT STA and AEIM XPT ADDR of the GTM sub module CCM          are always updated on the first invalid AEI bus master access           independently of the state of HLT AEIM ERR</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MCSi_RESET</name>
						<description>MCS0 Reset Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>104</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RST0</name>
								<description>Software reset of channel 7</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RST1</name>
								<description>Software reset of channel 7</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RST2</name>
								<description>Software reset of channel 7</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RST3</name>
								<description>Software reset of channel 7</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RST4</name>
								<description>Software reset of channel 7</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RST5</name>
								<description>Software reset of channel 7</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RST6</name>
								<description>Software reset of channel 7</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RST7</name>
								<description>Software reset of channel 7</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MCSi_CAT</name>
						<description>MCS0 Cancel ARU Transfer Instruction Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>108</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CAT0</name>
								<description>Cancel ARU transfer for channel 7. The CATx  x   0..T 1  bit inside the STA register of the corresponding          MCS channel is set  and any pending blocking ARU read or write request          is canceled. The MCS channel resumes with the instruction after the          blocking ARU transfer instruction. The CATx  x   0..T 1  bit is cleared by the corresponding MCS channel          when the channel is entering a blocking ARU read or write instruction.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CAT1</name>
								<description>Cancel ARU transfer for channel 7. The CATx  x   0..T 1  bit inside the STA register of the corresponding          MCS channel is set  and any pending blocking ARU read or write request          is canceled. The MCS channel resumes with the instruction after the          blocking ARU transfer instruction. The CATx  x   0..T 1  bit is cleared by the corresponding MCS channel          when the channel is entering a blocking ARU read or write instruction.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CAT2</name>
								<description>Cancel ARU transfer for channel 7. The CATx  x   0..T 1  bit inside the STA register of the corresponding          MCS channel is set  and any pending blocking ARU read or write request          is canceled. The MCS channel resumes with the instruction after the          blocking ARU transfer instruction. The CATx  x   0..T 1  bit is cleared by the corresponding MCS channel          when the channel is entering a blocking ARU read or write instruction.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CAT3</name>
								<description>Cancel ARU transfer for channel 7. The CATx  x   0..T 1  bit inside the STA register of the corresponding          MCS channel is set  and any pending blocking ARU read or write request          is canceled. The MCS channel resumes with the instruction after the          blocking ARU transfer instruction. The CATx  x   0..T 1  bit is cleared by the corresponding MCS channel          when the channel is entering a blocking ARU read or write instruction.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CAT4</name>
								<description>Cancel ARU transfer for channel 7. The CATx  x   0..T 1  bit inside the STA register of the corresponding          MCS channel is set  and any pending blocking ARU read or write request          is canceled. The MCS channel resumes with the instruction after the          blocking ARU transfer instruction. The CATx  x   0..T 1  bit is cleared by the corresponding MCS channel          when the channel is entering a blocking ARU read or write instruction.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CAT5</name>
								<description>Cancel ARU transfer for channel 7. The CATx  x   0..T 1  bit inside the STA register of the corresponding          MCS channel is set  and any pending blocking ARU read or write request          is canceled. The MCS channel resumes with the instruction after the          blocking ARU transfer instruction. The CATx  x   0..T 1  bit is cleared by the corresponding MCS channel          when the channel is entering a blocking ARU read or write instruction.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CAT6</name>
								<description>Cancel ARU transfer for channel 7. The CATx  x   0..T 1  bit inside the STA register of the corresponding          MCS channel is set  and any pending blocking ARU read or write request          is canceled. The MCS channel resumes with the instruction after the          blocking ARU transfer instruction. The CATx  x   0..T 1  bit is cleared by the corresponding MCS channel          when the channel is entering a blocking ARU read or write instruction.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CAT7</name>
								<description>Cancel ARU transfer for channel 7. The CATx  x   0..T 1  bit inside the STA register of the corresponding          MCS channel is set  and any pending blocking ARU read or write request          is canceled. The MCS channel resumes with the instruction after the          blocking ARU transfer instruction. The CATx  x   0..T 1  bit is cleared by the corresponding MCS channel          when the channel is entering a blocking ARU read or write instruction.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MCSi_CWT</name>
						<description>MCS0 Cancel WURM Instruction Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>112</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CWT0</name>
								<description>Cancel WURM instruction for channel 7. The CWTx  x   0..T 1  bit inside the STA register of the corresponding          MCS channel is set  and any pending WURM instruction is canceled. The          MC  channel resumes with the instruction after the WURM instruction. The CWTx  x   0..T 1  bit is cleared by the corresponding MCS channel          when the channel reaches a WURM instruction.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CWT1</name>
								<description>Cancel WURM instruction for channel 7. The CWTx  x   0..T 1  bit inside the STA register of the corresponding          MCS channel is set  and any pending WURM instruction is canceled. The          MC  channel resumes with the instruction after the WURM instruction. The CWTx  x   0..T 1  bit is cleared by the corresponding MCS channel          when the channel reaches a WURM instruction.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CWT2</name>
								<description>Cancel WURM instruction for channel 7. The CWTx  x   0..T 1  bit inside the STA register of the corresponding          MCS channel is set  and any pending WURM instruction is canceled. The          MC  channel resumes with the instruction after the WURM instruction. The CWTx  x   0..T 1  bit is cleared by the corresponding MCS channel          when the channel reaches a WURM instruction.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CWT3</name>
								<description>Cancel WURM instruction for channel 7. The CWTx  x   0..T 1  bit inside the STA register of the corresponding          MCS channel is set  and any pending WURM instruction is canceled. The          MC  channel resumes with the instruction after the WURM instruction. The CWTx  x   0..T 1  bit is cleared by the corresponding MCS channel          when the channel reaches a WURM instruction.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CWT4</name>
								<description>Cancel WURM instruction for channel 7. The CWTx  x   0..T 1  bit inside the STA register of the corresponding          MCS channel is set  and any pending WURM instruction is canceled. The          MC  channel resumes with the instruction after the WURM instruction. The CWTx  x   0..T 1  bit is cleared by the corresponding MCS channel          when the channel reaches a WURM instruction.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CWT5</name>
								<description>Cancel WURM instruction for channel 7. The CWTx  x   0..T 1  bit inside the STA register of the corresponding          MCS channel is set  and any pending WURM instruction is canceled. The          MC  channel resumes with the instruction after the WURM instruction. The CWTx  x   0..T 1  bit is cleared by the corresponding MCS channel          when the channel reaches a WURM instruction.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CWT6</name>
								<description>Cancel WURM instruction for channel 7. The CWTx  x   0..T 1  bit inside the STA register of the corresponding          MCS channel is set  and any pending WURM instruction is canceled. The          MC  channel resumes with the instruction after the WURM instruction. The CWTx  x   0..T 1  bit is cleared by the corresponding MCS channel          when the channel reaches a WURM instruction.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CWT7</name>
								<description>Cancel WURM instruction for channel 7. The CWTx  x   0..T 1  bit inside the STA register of the corresponding          MCS channel is set  and any pending WURM instruction is canceled. The          MC  channel resumes with the instruction after the WURM instruction. The CWTx  x   0..T 1  bit is cleared by the corresponding MCS channel          when the channel reaches a WURM instruction.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MCSi_ERR</name>
						<description>MCS0 error register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>124</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ERR0</name>
								<description>Error State of MCS channel 7. The CPU can read the ERRx  x   0..T 1  bits in order to determine the          current error state of the corresponding MCS channel x. The error state is also evaluated by the sub module MON  if this          module is available. Writing the value 1 to this bit resets the corresponding error state           and resets the channel internal ERR bit in the STA and channel CTRL          registers. Moreover  each write access to this bit also sets the          ERR SRC ID bit field of register MCS i  CTRL STAT to its reset value.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ERR1</name>
								<description>Error State of MCS channel 7. The CPU can read the ERRx  x   0..T 1  bits in order to determine the          current error state of the corresponding MCS channel x. The error state is also evaluated by the sub module MON  if this          module is available. Writing the value 1 to this bit resets the corresponding error state           and resets the channel internal ERR bit in the STA and channel CTRL          registers. Moreover  each write access to this bit also sets the          ERR SRC ID bit field of register MCS i  CTRL STAT to its reset value.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ERR2</name>
								<description>Error State of MCS channel 7. The CPU can read the ERRx  x   0..T 1  bits in order to determine the          current error state of the corresponding MCS channel x. The error state is also evaluated by the sub module MON  if this          module is available. Writing the value 1 to this bit resets the corresponding error state           and resets the channel internal ERR bit in the STA and channel CTRL          registers. Moreover  each write access to this bit also sets the          ERR SRC ID bit field of register MCS i  CTRL STAT to its reset value.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ERR3</name>
								<description>Error State of MCS channel 7. The CPU can read the ERRx  x   0..T 1  bits in order to determine the          current error state of the corresponding MCS channel x. The error state is also evaluated by the sub module MON  if this          module is available. Writing the value 1 to this bit resets the corresponding error state           and resets the channel internal ERR bit in the STA and channel CTRL          registers. Moreover  each write access to this bit also sets the          ERR SRC ID bit field of register MCS i  CTRL STAT to its reset value.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ERR4</name>
								<description>Error State of MCS channel 7. The CPU can read the ERRx  x   0..T 1  bits in order to determine the          current error state of the corresponding MCS channel x. The error state is also evaluated by the sub module MON  if this          module is available. Writing the value 1 to this bit resets the corresponding error state           and resets the channel internal ERR bit in the STA and channel CTRL          registers. Moreover  each write access to this bit also sets the          ERR SRC ID bit field of register MCS i  CTRL STAT to its reset value.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ERR5</name>
								<description>Error State of MCS channel 7. The CPU can read the ERRx  x   0..T 1  bits in order to determine the          current error state of the corresponding MCS channel x. The error state is also evaluated by the sub module MON  if this          module is available. Writing the value 1 to this bit resets the corresponding error state           and resets the channel internal ERR bit in the STA and channel CTRL          registers. Moreover  each write access to this bit also sets the          ERR SRC ID bit field of register MCS i  CTRL STAT to its reset value.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ERR6</name>
								<description>Error State of MCS channel 7. The CPU can read the ERRx  x   0..T 1  bits in order to determine the          current error state of the corresponding MCS channel x. The error state is also evaluated by the sub module MON  if this          module is available. Writing the value 1 to this bit resets the corresponding error state           and resets the channel internal ERR bit in the STA and channel CTRL          registers. Moreover  each write access to this bit also sets the          ERR SRC ID bit field of register MCS i  CTRL STAT to its reset value.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ERR7</name>
								<description>Error State of MCS channel 7. The CPU can read the ERRx  x   0..T 1  bits in order to determine the          current error state of the corresponding MCS channel x. The error state is also evaluated by the sub module MON  if this          module is available. Writing the value 1 to this bit resets the corresponding error state           and resets the channel internal ERR bit in the STA and channel CTRL          registers. Moreover  each write access to this bit also sets the          ERR SRC ID bit field of register MCS i  CTRL STAT to its reset value.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<name>OCDS</name>
					<description>OCDS</description>
					<addressOffset>654616</addressOffset>
					<register>
						<name>OTBU0T</name>
						<description>OCDS TBU0 Trigger Register
 resetvalue={Debug Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CV</name>
								<description>Compare Value. This value is compared to the TBU CH0 BASE register. As long as both        match  the associated TS16 IOS.MISC bit   CROSSREFERENCE          is active.</description>
								<lsb>0</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CM</name>
								<description>Compare Mode</description>
								<lsb>28</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
