J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>OTBU1T</name>
						<description>OCDS TBU1 Trigger Register
 resetvalue={Debug Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CV</name>
								<description>Compare Value. This value is compared to the TBU CH1 BASE register. As long as both        match  the associated TS16 IOS.MISC bit   CROSSREFERENCE          is active.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN</name>
								<description>Enable</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>OTBU2T</name>
						<description>OCDS TBU2 Trigger Register
 resetvalue={Debug Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CV</name>
								<description>Compare Value. This value is compared to the TBU CH2 BASE register. As long as both        match  the associated TS16 IOS.MISC bit   CROSSREFERENCE          is active.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN</name>
								<description>Enable</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>OTBU3T</name>
						<description>OCDS TBU3 Trigger Register
 resetvalue={Debug Reset:0x0}</description>
						<addressOffset>12</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CV</name>
								<description>Compare Value. This value is compared to the TBU CH3 BASE register. As long as both        match  the associated TS16 IOS.MISC bit   CROSSREFERENCE          is active.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN</name>
								<description>Enable</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>OTSS</name>
						<description>OCDS Trigger Set Select Register
 resetvalue={Debug Reset:0x0}</description>
						<addressOffset>16</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>OTGB0</name>
								<description>Trigger Set for OTGB0</description>
								<lsb>0</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OTGB1</name>
								<description>Trigger Set for OTGB1</description>
								<lsb>8</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OTGBM0</name>
								<description>Trigger Set for OTGBM0</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OTGBM1</name>
								<description>Trigger Set for OTGBM1</description>
								<lsb>24</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>OTSC0</name>
						<description>OCDS Trigger Set Control 0 Register
 resetvalue={Debug Reset:0x0}</description>
						<addressOffset>20</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>B0LMT</name>
								<description>OTGB0 TS16 IOS Low Byte Module Type</description>
								<lsb>0</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>B0LMI</name>
								<description>OTGB0 TS16 IOS Low Byte Module Instance. Index of the module instance. Index starts with 0  the max. value        depends on GTM configuration and module type. For SPE signals  there is        a specific mapping   CROSSREFERENCE  .        For MISC signals  this index is ignored.</description>
								<lsb>4</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>B0HMT</name>
								<description>OTGB0 TS16 IOS High Byte Module Type</description>
								<lsb>8</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>B0HMI</name>
								<description>OTGB0 TS16 IOS High Byte Module Instance. Index of the module instance. Index starts with 0  the max. value        depends on GTM configuration and module type. For SPE signals  there is        a specific mapping   CROSSREFERENCE  .        For MISC signals  this index is ignored.</description>
								<lsb>12</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>B1LMT</name>
								<description>OTGB1 TS16 IOS Low Byte Module Type</description>
								<lsb>16</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>B1LMI</name>
								<description>OTGB1 TS16 IOS Low Byte Module Instance. Index of the module instance. Index starts with 0  the max. value        depends on GTM configuration and module type. For SPE signals  there is        a specific mapping   CROSSREFERENCE  .        For MISC signals  this index is ignored.</description>
								<lsb>20</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>B1HMT</name>
								<description>OTGB1 TS16 IOS High Byte Module Type</description>
								<lsb>24</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>B1HMI</name>
								<description>OTGB1 TS16 IOS High Byte Module Instance. Index of the module instance. Index starts with 0  the max. value        depends on GTM configuration and module type. For SPE signals  there is        a specific mapping   CROSSREFERENCE  .        For MISC signals  this index is ignored.</description>
								<lsb>28</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>OTSC1</name>
						<description>OCDS Trigger Set Control 1 Register
 resetvalue={Debug Reset:0x0}</description>
						<addressOffset>24</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>MCS</name>
								<description>MCS Channel Selection. Required by TS32 MCA and TS32 MCD.</description>
								<lsb>0</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MI</name>
								<description>MCS Instance. Required by TS32 MCA and TS32 MCD. Index of the MCS instance. Index starts with 0  the max. value depends        on the GTM configuration.</description>
								<lsb>4</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MOE</name>
								<description>MCS Opcode Trace Enable. Required by TS32 MCD.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ODA</name>
						<description>OCDS Debug Access Register
 resetvalue={Debug Reset:0x0}</description>
						<addressOffset>28</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DRAC</name>
								<description>Debug Read Access Control. Controls Debug Read Access  DRA  of registers with DRA behavior.</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>OCS</name>
						<description>OCDS Control and Status
 resetvalue={Debug Reset:0x0}</description>
						<addressOffset>32</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SUS</name>
								<description>OCDS Suspend Control. Controls the sensitivity to the suspend signal coming from the OCDS        Trigger Switch  OTGS </description>
								<lsb>24</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SUS_P</name>
								<description>SUS Write Protection. SUS is only written when SUS P is 1  otherwise it remains unchanged.        Read as 0.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>SUSSTA</name>
								<description>Suspend State</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<dim>4</dim>
					<dimIncrement>8</dimIncrement>
					<name>DSADC[%s]</name>
					<description>DSADC</description>
					<addressOffset>654880</addressOffset>
					<register>
						<name>DSADCOUTSELi0</name>
						<description>DSADC Output Select i0 Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SEL0</name>
								<description>Output Selection for DSADC7 GTM connection. This bit field defines which TOM ATOM channel output is used as DSADCx        trigger i.</description>
								<lsb>0</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL1</name>
								<description>Output Selection for DSADC7 GTM connection. This bit field defines which TOM ATOM channel output is used as DSADCx        trigger i.</description>
								<lsb>4</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL2</name>
								<description>Output Selection for DSADC7 GTM connection. This bit field defines which TOM ATOM channel output is used as DSADCx        trigger i.</description>
								<lsb>8</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL3</name>
								<description>Output Selection for DSADC7 GTM connection. This bit field defines which TOM ATOM channel output is used as DSADCx        trigger i.</description>
								<lsb>12</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL4</name>
								<description>Output Selection for DSADC7 GTM connection. This bit field defines which TOM ATOM channel output is used as DSADCx        trigger i.</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL5</name>
								<description>Output Selection for DSADC7 GTM connection. This bit field defines which TOM ATOM channel output is used as DSADCx        trigger i.</description>
								<lsb>20</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<dim>5</dim>
					<dimIncrement>8</dimIncrement>
					<name>ADCTRIG[%s]</name>
					<description>ADCTRIG</description>
					<addressOffset>654912</addressOffset>
					<register>
						<name>ADCTRIGiOUT0</name>
						<description>ADC Trigger 0 Output Select 0 Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SEL0</name>
								<description>Output Selection for GTM to ADC7 connection. This bit field defines which TOM ATOM channel output is used as ADCx        trigger i. The decoding is        defined in the specific appendix depending on the ADC.</description>
								<lsb>0</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL1</name>
								<description>Output Selection for GTM to ADC7 connection. This bit field defines which TOM ATOM channel output is used as ADCx        trigger i. The decoding is        defined in the specific appendix depending on the ADC.</description>
								<lsb>4</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL2</name>
								<description>Output Selection for GTM to ADC7 connection. This bit field defines which TOM ATOM channel output is used as ADCx        trigger i. The decoding is        defined in the specific appendix depending on the ADC.</description>
								<lsb>8</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL3</name>
								<description>Output Selection for GTM to ADC7 connection. This bit field defines which TOM ATOM channel output is used as ADCx        trigger i. The decoding is        defined in the specific appendix depending on the ADC.</description>
								<lsb>12</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL4</name>
								<description>Output Selection for GTM to ADC7 connection. This bit field defines which TOM ATOM channel output is used as ADCx        trigger i. The decoding is        defined in the specific appendix depending on the ADC.</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL5</name>
								<description>Output Selection for GTM to ADC7 connection. This bit field defines which TOM ATOM channel output is used as ADCx        trigger i. The decoding is        defined in the specific appendix depending on the ADC.</description>
								<lsb>20</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL6</name>
								<description>Output Selection for GTM to ADC7 connection. This bit field defines which TOM ATOM channel output is used as ADCx        trigger i. The decoding is        defined in the specific appendix depending on the ADC.</description>
								<lsb>24</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL7</name>
								<description>Output Selection for GTM to ADC7 connection. This bit field defines which TOM ATOM channel output is used as ADCx        trigger i. The decoding is        defined in the specific appendix depending on the ADC.</description>
								<lsb>28</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ADCTRIGiOUT1</name>
						<description>ADC Trigger 0 Output Select 1 Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SEL0</name>
								<description>Output Selection for GTM to ADC3 connection. This bit field defines which TOM ATOM channel output is used as ADCx 8        trigger i. Decoding is        defined in the specific appendix.</description>
								<lsb>0</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL1</name>
								<description>Output Selection for GTM to ADC3 connection. This bit field defines which TOM ATOM channel output is used as ADCx 8        trigger i. Decoding is        defined in the specific appendix.</description>
								<lsb>4</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL2</name>
								<description>Output Selection for GTM to ADC3 connection. This bit field defines which TOM ATOM channel output is used as ADCx 8        trigger i. Decoding is        defined in the specific appendix.</description>
								<lsb>8</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SEL3</name>
								<description>Output Selection for GTM to ADC3 connection. This bit field defines which TOM ATOM channel output is used as ADCx 8        trigger i. Decoding is        defined in the specific appendix.</description>
								<lsb>12</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<name>MSC</name>
					<description>MSC</description>
					<addressOffset>655104</addressOffset>
					<cluster>
						<dim>4</dim>
						<dimIncrement>4</dimIncrement>
						<name>SET[%s]</name>
						<description>SET</description>
						<addressOffset>0</addressOffset>
						<register>
							<name>MSCSET0CON0</name>
							<description>MSC Set 0 Control 3 Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>SEL12</name>
									<description>Set 0 15  Input Selection. This bit field defines the GTM timer source configured as Set i signal k        out. Decoding is defined        in the specific appendix.</description>
									<lsb>0</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL13</name>
									<description>Set 0 15  Input Selection. This bit field defines the GTM timer source configured as Set i signal k        out. Decoding is defined        in the specific appendix.</description>
									<lsb>8</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL14</name>
									<description>Set 0 15  Input Selection. This bit field defines the GTM timer source configured as Set i signal k        out. Decoding is defined        in the specific appendix.</description>
									<lsb>16</lsb>
									<msb>20</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL15</name>
									<description>Set 0 15  Input Selection. This bit field defines the GTM timer source configured as Set i signal k        out. Decoding is defined        in the specific appendix.</description>
									<lsb>24</lsb>
									<msb>28</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>MSCSET0CON1</name>
							<description>MSC Set 0 Control 3 Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>4</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>SEL12</name>
									<description>Set 0 15  Input Selection. This bit field defines the GTM timer source configured as Set i signal k        out. Decoding is defined        in the specific appendix.</description>
									<lsb>0</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL13</name>
									<description>Set 0 15  Input Selection. This bit field defines the GTM timer source configured as Set i signal k        out. Decoding is defined        in the specific appendix.</description>
									<lsb>8</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL14</name>
									<description>Set 0 15  Input Selection. This bit field defines the GTM timer source configured as Set i signal k        out. Decoding is defined        in the specific appendix.</description>
									<lsb>16</lsb>
									<msb>20</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL15</name>
									<description>Set 0 15  Input Selection. This bit field defines the GTM timer source configured as Set i signal k        out. Decoding is defined        in the specific appendix.</description>
									<lsb>24</lsb>
									<msb>28</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>MSCSET0CON2</name>
							<description>MSC Set 0 Control 3 Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>8</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>SEL12</name>
									<description>Set 0 15  Input Selection. This bit field defines the GTM timer source configured as Set i signal k        out. Decoding is defined        in the specific appendix.</description>
									<lsb>0</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL13</name>
									<description>Set 0 15  Input Selection. This bit field defines the GTM timer source configured as Set i signal k        out. Decoding is defined        in the specific appendix.</description>
									<lsb>8</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL14</name>
									<description>Set 0 15  Input Selection. This bit field defines the GTM timer source configured as Set i signal k        out. Decoding is defined        in the specific appendix.</description>
									<lsb>16</lsb>
									<msb>20</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL15</name>
									<description>Set 0 15  Input Selection. This bit field defines the GTM timer source configured as Set i signal k        out. Decoding is defined        in the specific appendix.</description>
									<lsb>24</lsb>
									<msb>28</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
