J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
						<register>
							<name>MSCSET0CON3</name>
							<description>MSC Set 0 Control 3 Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>12</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>SEL12</name>
									<description>Set 0 15  Input Selection. This bit field defines the GTM timer source configured as Set i signal k        out. Decoding is defined        in the specific appendix.</description>
									<lsb>0</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL13</name>
									<description>Set 0 15  Input Selection. This bit field defines the GTM timer source configured as Set i signal k        out. Decoding is defined        in the specific appendix.</description>
									<lsb>8</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL14</name>
									<description>Set 0 15  Input Selection. This bit field defines the GTM timer source configured as Set i signal k        out. Decoding is defined        in the specific appendix.</description>
									<lsb>16</lsb>
									<msb>20</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL15</name>
									<description>Set 0 15  Input Selection. This bit field defines the GTM timer source configured as Set i signal k        out. Decoding is defined        in the specific appendix.</description>
									<lsb>24</lsb>
									<msb>28</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
					</cluster>
					<cluster>
						<dim>2</dim>
						<dimIncrement>12</dimIncrement>
						<name>MSCq[%s]</name>
						<description>MSCq</description>
						<addressOffset>144</addressOffset>
						<register>
							<name>MSCiINLCON</name>
							<description>MSC0 Input Low Control Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>SEL0</name>
									<description>GTM MSCq Low 15 Output Selection. GTM output gtm mscqltinl x  is controlled by the timer output.</description>
									<lsb>0</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL1</name>
									<description>GTM MSCq Low 15 Output Selection. GTM output gtm mscqltinl x  is controlled by the timer output.</description>
									<lsb>2</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL2</name>
									<description>GTM MSCq Low 15 Output Selection. GTM output gtm mscqltinl x  is controlled by the timer output.</description>
									<lsb>4</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL3</name>
									<description>GTM MSCq Low 15 Output Selection. GTM output gtm mscqltinl x  is controlled by the timer output.</description>
									<lsb>6</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL4</name>
									<description>GTM MSCq Low 15 Output Selection. GTM output gtm mscqltinl x  is controlled by the timer output.</description>
									<lsb>8</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL5</name>
									<description>GTM MSCq Low 15 Output Selection. GTM output gtm mscqltinl x  is controlled by the timer output.</description>
									<lsb>10</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL6</name>
									<description>GTM MSCq Low 15 Output Selection. GTM output gtm mscqltinl x  is controlled by the timer output.</description>
									<lsb>12</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL7</name>
									<description>GTM MSCq Low 15 Output Selection. GTM output gtm mscqltinl x  is controlled by the timer output.</description>
									<lsb>14</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL8</name>
									<description>GTM MSCq Low 15 Output Selection. GTM output gtm mscqltinl x  is controlled by the timer output.</description>
									<lsb>16</lsb>
									<msb>17</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL9</name>
									<description>GTM MSCq Low 15 Output Selection. GTM output gtm mscqltinl x  is controlled by the timer output.</description>
									<lsb>18</lsb>
									<msb>19</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL10</name>
									<description>GTM MSCq Low 15 Output Selection. GTM output gtm mscqltinl x  is controlled by the timer output.</description>
									<lsb>20</lsb>
									<msb>21</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL11</name>
									<description>GTM MSCq Low 15 Output Selection. GTM output gtm mscqltinl x  is controlled by the timer output.</description>
									<lsb>22</lsb>
									<msb>23</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL12</name>
									<description>GTM MSCq Low 15 Output Selection. GTM output gtm mscqltinl x  is controlled by the timer output.</description>
									<lsb>24</lsb>
									<msb>25</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL13</name>
									<description>GTM MSCq Low 15 Output Selection. GTM output gtm mscqltinl x  is controlled by the timer output.</description>
									<lsb>26</lsb>
									<msb>27</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL14</name>
									<description>GTM MSCq Low 15 Output Selection. GTM output gtm mscqltinl x  is controlled by the timer output.</description>
									<lsb>28</lsb>
									<msb>29</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL15</name>
									<description>GTM MSCq Low 15 Output Selection. GTM output gtm mscqltinl x  is controlled by the timer output.</description>
									<lsb>30</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>MSCiINHCON</name>
							<description>MSC0 Input High Control Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>4</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>SEL0</name>
									<description>GTM MSCq High 15 Output Selection. GTM output gtm mscqaltinh x  is controlled by the timer output.</description>
									<lsb>0</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL1</name>
									<description>GTM MSCq High 15 Output Selection. GTM output gtm mscqaltinh x  is controlled by the timer output.</description>
									<lsb>2</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL2</name>
									<description>GTM MSCq High 15 Output Selection. GTM output gtm mscqaltinh x  is controlled by the timer output.</description>
									<lsb>4</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL3</name>
									<description>GTM MSCq High 15 Output Selection. GTM output gtm mscqaltinh x  is controlled by the timer output.</description>
									<lsb>6</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL4</name>
									<description>GTM MSCq High 15 Output Selection. GTM output gtm mscqaltinh x  is controlled by the timer output.</description>
									<lsb>8</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL5</name>
									<description>GTM MSCq High 15 Output Selection. GTM output gtm mscqaltinh x  is controlled by the timer output.</description>
									<lsb>10</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL6</name>
									<description>GTM MSCq High 15 Output Selection. GTM output gtm mscqaltinh x  is controlled by the timer output.</description>
									<lsb>12</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL7</name>
									<description>GTM MSCq High 15 Output Selection. GTM output gtm mscqaltinh x  is controlled by the timer output.</description>
									<lsb>14</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL8</name>
									<description>GTM MSCq High 15 Output Selection. GTM output gtm mscqaltinh x  is controlled by the timer output.</description>
									<lsb>16</lsb>
									<msb>17</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL9</name>
									<description>GTM MSCq High 15 Output Selection. GTM output gtm mscqaltinh x  is controlled by the timer output.</description>
									<lsb>18</lsb>
									<msb>19</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL10</name>
									<description>GTM MSCq High 15 Output Selection. GTM output gtm mscqaltinh x  is controlled by the timer output.</description>
									<lsb>20</lsb>
									<msb>21</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL11</name>
									<description>GTM MSCq High 15 Output Selection. GTM output gtm mscqaltinh x  is controlled by the timer output.</description>
									<lsb>22</lsb>
									<msb>23</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL12</name>
									<description>GTM MSCq High 15 Output Selection. GTM output gtm mscqaltinh x  is controlled by the timer output.</description>
									<lsb>24</lsb>
									<msb>25</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL13</name>
									<description>GTM MSCq High 15 Output Selection. GTM output gtm mscqaltinh x  is controlled by the timer output.</description>
									<lsb>26</lsb>
									<msb>27</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL14</name>
									<description>GTM MSCq High 15 Output Selection. GTM output gtm mscqaltinh x  is controlled by the timer output.</description>
									<lsb>28</lsb>
									<msb>29</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL15</name>
									<description>GTM MSCq High 15 Output Selection. GTM output gtm mscqaltinh x  is controlled by the timer output.</description>
									<lsb>30</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>MSCiINLEXTCON</name>
							<description>MSC0 Input Low Extended Control Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>8</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>SEL0</name>
									<description>GTM MSCq LowExtended 15 Output Selection. GTM output gtm mscqaltinext x  is controlled by the timer output.</description>
									<lsb>0</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL1</name>
									<description>GTM MSCq LowExtended 15 Output Selection. GTM output gtm mscqaltinext x  is controlled by the timer output.</description>
									<lsb>2</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL2</name>
									<description>GTM MSCq LowExtended 15 Output Selection. GTM output gtm mscqaltinext x  is controlled by the timer output.</description>
									<lsb>4</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL3</name>
									<description>GTM MSCq LowExtended 15 Output Selection. GTM output gtm mscqaltinext x  is controlled by the timer output.</description>
									<lsb>6</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL4</name>
									<description>GTM MSCq LowExtended 15 Output Selection. GTM output gtm mscqaltinext x  is controlled by the timer output.</description>
									<lsb>8</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL5</name>
									<description>GTM MSCq LowExtended 15 Output Selection. GTM output gtm mscqaltinext x  is controlled by the timer output.</description>
									<lsb>10</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL6</name>
									<description>GTM MSCq LowExtended 15 Output Selection. GTM output gtm mscqaltinext x  is controlled by the timer output.</description>
									<lsb>12</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL7</name>
									<description>GTM MSCq LowExtended 15 Output Selection. GTM output gtm mscqaltinext x  is controlled by the timer output.</description>
									<lsb>14</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL8</name>
									<description>GTM MSCq LowExtended 15 Output Selection. GTM output gtm mscqaltinext x  is controlled by the timer output.</description>
									<lsb>16</lsb>
									<msb>17</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL9</name>
									<description>GTM MSCq LowExtended 15 Output Selection. GTM output gtm mscqaltinext x  is controlled by the timer output.</description>
									<lsb>18</lsb>
									<msb>19</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL10</name>
									<description>GTM MSCq LowExtended 15 Output Selection. GTM output gtm mscqaltinext x  is controlled by the timer output.</description>
									<lsb>20</lsb>
									<msb>21</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL11</name>
									<description>GTM MSCq LowExtended 15 Output Selection. GTM output gtm mscqaltinext x  is controlled by the timer output.</description>
									<lsb>22</lsb>
									<msb>23</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL12</name>
									<description>GTM MSCq LowExtended 15 Output Selection. GTM output gtm mscqaltinext x  is controlled by the timer output.</description>
									<lsb>24</lsb>
									<msb>25</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL13</name>
									<description>GTM MSCq LowExtended 15 Output Selection. GTM output gtm mscqaltinext x  is controlled by the timer output.</description>
									<lsb>26</lsb>
									<msb>27</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL14</name>
									<description>GTM MSCq LowExtended 15 Output Selection. GTM output gtm mscqaltinext x  is controlled by the timer output.</description>
									<lsb>28</lsb>
									<msb>29</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SEL15</name>
									<description>GTM MSCq LowExtended 15 Output Selection. GTM output gtm mscqaltinext x  is controlled by the timer output.</description>
									<lsb>30</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
					</cluster>
				</cluster>
				<register>
					<name>REV</name>
					<description>GTM Version Control Register
 resetvalue={Application Reset:0x313315B9}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>825431481</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>STEP</name>
							<description>Release step. GTM Release step</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>NO</name>
							<description>Delivery number. Define delivery number of GTM specification.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MINOR</name>
							<description>Minor version number. Define minor version number of GTM specification.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MAJOR</name>
							<description>Major version number. Define major version number of GTM specification.</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DEV_CODE0</name>
							<description>Device encoding digit 0. Device encoding digit 0.</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DEV_CODE1</name>
							<description>Device encoding digit 1. Device encoding digit 1.</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DEV_CODE2</name>
							<description>Device encoding digit 2. Device encoding digit 2.</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RST</name>
					<description>GTM Global Reset Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>BRIDGE_MODE_WRDIS</name>
							<description>GTM BRIDGE MODE write disable. This bit is write protected by bit RF PROT</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL</name>
					<description>GTM Global Control Register
 resetvalue={Application Reset:0x1}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>1</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RF_PROT</name>
							<description>RST and FORCINT protection</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TO_MODE</name>
							<description>AEI timeout mode</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TO_VAL</name>
							<description>AEI timeout value. These bits define the number of cycles after which a timeout event        occurs. When TO VAL equals zero  0  the AEI timeout functionality is        disabled.</description>
							<lsb>4</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AEIM_CLUSTER</name>
							<description>AEIM cluster number. These bits show the number of the AEI master port cluster which throws        the interrupts AEIM USP ADDR         AEIM IM ADDR and AEIM USP BE depending on the AEI master port access status.Note  If one        of the corresponding irq notify bits  6 4  is set  this bit field will        be frozen until the interrupt notify bits  6 4  are cleared.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AEI_ADDR_XPT</name>
					<description>GTM AEI Timeout Exception Address Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>12</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TO_ADDR</name>
							<description>AEI timeout address. This bit field defines the AEI address for which the AEI timeout event        occurred.</description>
							<lsb>0</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TO_W1R0</name>
							<description>AEI timeout Read Write flag. This bit defines the AEI Read Write flag for which the AEI timeout event        occurred.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EIRQ_EN</name>
					<description>GTM Error Interrupt Enable Register
 resetvalue={Application Reset:0x180}</description>
					<addressOffset>32</addressOffset>
					<size>32</size>
					<resetValue>384</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>AEI_TO_XPT_EIRQ_EN</name>
							<description>AEI TO XPT EIRQ error interrupt enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AEI_USP_ADDR_EIRQ_EN</name>
							<description>AEI USP ADDR EIRQ error interrupt enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AEI_IM_ADDR_EIRQ_EN</name>
							<description>AEI IM ADDR EIRQ error interrupt enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AEI_USP_BE_EIRQ_EN</name>
							<description>AEI USP BE EIRQ error interrupt enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AEIM_USP_ADDR_EIRQ_EN</name>
							<description>AEIM USP ADDR EIRQ error interrupt enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AEIM_IM_ADDR_EIRQ_EN</name>
							<description>AEIM IM ADDR EIRQ error interrupt enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AEIM_USP_BE_EIRQ_EN</name>
							<description>AEIM USP BE EIRQ error interrupt enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLK_EN_ERR_EIRQ_EN</name>
							<description>CLK EN ERR EIRQ interrupt enable. Read as zero in case of INT CLK EN GEN   0b1.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLK_PER_ERR_EIRQ_EN</name>
							<description>CLK PER ERR EIRQ interrupt enable. Read as zero in case of INT CLK EN GEN   0b1. Read as zero  shall be written as zero.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
