J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>HW_CONF</name>
					<description>GTM Hardware Configuration Register
 resetvalue={Application Reset:0x084F022E}</description>
					<addressOffset>36</addressOffset>
					<size>32</size>
					<resetValue>139395630</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>GRSTEN</name>
							<description>Global Reset Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>BRIDGE_MODE_RST</name>
							<description>Bridge mode after reset</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SYNC_INPUT_REG</name>
							<description>Additional pipelined stage in synchronous bridge mode</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CFG_CLOCK_RATE</name>
							<description>Clocks per ARU transfer. This value defines also the availability of configuration bits in        register GTM CLS CLK CFG.if CFG CLOCK RATE 0  only the values 0b00 and        0b01 are valid for bit fields CLS x  CLK DIV.if CFG CLOCK RATE 1  only        the values 0b00  0b01 and 0b10 are valid for bit fields CLS x  CLK DIV.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ATOM_OUT_RST</name>
							<description>ATOM OUT reset level. This value represents the ATOM output level after reset. The inverse        value of this bit is the reset value of bit SL in all ATOM channels.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ATOM_TRIG_CHAIN</name>
							<description>ATOM trigger chain length without synchronization register. It defines after which ATOM instance count a synchronization register is        introduced into trigger chain  after ATOM TRIG  lt i gt  output if instance i and ATOM TRIG  lt i 1 gt  input of instance i 1 . Valid values are 1 to 7. 1 means that after each        instance a synchronization register is placed.</description>
							<lsb>5</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TOM_OUT_RST</name>
							<description>TOM OUT reset level. This value represents the TOM output level after reset. The inverse        value of this bit is the reset value of bit SL in all TOM channels.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TOM_TRIG_CHAIN</name>
							<description>TOM trigger chain length without synchronization register. It defines after which TOM instance count a synchronization register is        introduced into trigger chain  after TOM TRIG  lt i gt  output if instance i and TOM TRIG  lt i 1 gt  input of instance i 1 . Valid values are 1 to 7. 1 means that after each        instance a synchronization register is placed.</description>
							<lsb>9</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RAM_INIT_RST</name>
							<description>RAM initialization from reset</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ERM</name>
							<description>Enable RAM1 MSB for available MCS modules. The bit reflects the state of the configuration parameter ERM mentioned        in the specification of MCFG.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ARU_CONNECT_CONFIG</name>
							<description>Defines number of parallel ARU ports</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IRQ_MODE_LEVEL</name>
							<description>IRQ MODE LEVEL</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IRQ_MODE_PULSE</name>
							<description>IRQ MODE PULSE</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IRQ_MODE_PULSE_NOTIFY</name>
							<description>IRQ MODE PULSE NOTIFY</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IRQ_MODE_SINGLE_PULSE</name>
							<description>IRQ MODE SINGLE PULSE</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ATOM_TRIG_INTCHAIN</name>
							<description>ATOM internal trigger chain length without synchronization register. It defines after which ATOM channel count a synchronization register is        introduced into trigger chain. Valid values are 1 to 8. 4 means that in        channel 4 of the atom instances a synchronization register is placed.</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TOM_TRIG_INTCHAIN</name>
							<description>TOM internal trigger chain length without synchronization register. It defines after which TOM channel count a synchronization register is        introduced into trigger chain. Valid values are 1 to 16. 8 means that in        channel 8 of the tom instances a synchronization register is placed.</description>
							<lsb>24</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>INT_CLK_EN_GEN</name>
							<description>Internal clock enable generation</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CFG</name>
					<description>GTM Configuration Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>40</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SRC_IN_MUX</name>
							<description>GTM TIM i  AUX IN input source selection. See CROSSREFERENCE for details.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AEI_STA_XPT</name>
					<description>GTM AEI Non Zero Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>44</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>AEI exception address. This bit field captures the address of the first AEI access resulting        with a non zero AEI status signal. The bit field can be cleared by        clearing the interrupt flags AEI USP ADDR AEI USP BE  and AEI IM ADDR in        the register GTM IRQ NOTIFY.</description>
							<lsb>0</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>W1R0</name>
							<description>AEI exception Read Write flag. This bit defines the AEI Read Write flag for which the AEI non zero        event occurred. This bit field captures the address of the first AEI        access resulting with a non zero AEI status signal. The bit field can be        cleared by clearing the interrupt flags AEI USP ADDR  AEI USP BE  and        AEI IM ADDR in the register GTM IRQ NOTIFY.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCS_AEM_DIS</name>
					<description>GTM MCS Master Port Disable Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>60</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DIS_CLS0</name>
							<description>Disable MCS AEIM access in cluster 0. Multicore encoding in use   DIS CLSx 1  defines the state of the signal  Any read access to a DIS CLSx bit field        will always result in a value 00 or 11 indicating current state. A        modification of the state is only performed with the values 01 and 10.        Writing the values 00 and 11 is always ignored.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIS_CLS1</name>
							<description>Disable MCS AEIM access in cluster 1  see bit DIS CLS0</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIS_CLS2</name>
							<description>Disable MCS AEIM access in cluster 2  see bit DIS CLS0</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIS_CLS3</name>
							<description>Disable MCS AEIM access in cluster 3  see bit DIS CLS0</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIS_CLS4</name>
							<description>Disable MCS AEIM access in cluster 4  see bit DIS CLS0</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIS_CLS5</name>
							<description>Disable MCS AEIM access in cluster 5  see bit DIS CLS0</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIS_CLS6</name>
							<description>Disable MCS AEIM access in cluster 6  see bit DIS CLS0</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIS_CLS7</name>
							<description>Disable MCS AEIM access in cluster 7  see bit DIS CLS0</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIS_CLS8</name>
							<description>Disable MCS AEIM access in cluster 8  see bit DIS CLS0</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIS_CLS9</name>
							<description>Disable MCS AEIM access in cluster 9  see bit DIS CLS0</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIS_CLS10</name>
							<description>Disable MCS AEIM access in cluster 10  see bit DIS CLS0</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIS_CLS11</name>
							<description>Disable MCS AEIM access in cluster 11  see bit DIS CLS0</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>6</dim>
					<dimIncrement>4</dimIncrement>
					<name>EXT_CAP_EN_i[%s]</name>
					<description>GTM External Capture Trigger Enable 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>92</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TIM_I_EXT_CAP_EN</name>
							<description>TIM i  EXT CAPTURE signal forwarding enable. The trigger event forwarding is possible from TIM i  and TIM i 1  to        MCS i .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIM_IP1_EXT_CAP_EN</name>
							<description>TIM i 1  EXT CAPTURE signal forwarding enable</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CLS_CLK_CFG</name>
					<description>GTM Cluster Clock Configuration
 resetvalue={Application Reset:0x0AAAAAA,Application Reset:0x2AAAA,Application Reset:0x0AAA,Application Reset:0x0A,Application Reset:0x0AA}</description>
					<addressOffset>176</addressOffset>
					<size>32</size>
					<resetValue>10</resetValue>
					<resetMask>4283782495</resetMask>
					<fields>
						<field>
							<name>CLS0_CLK_DIV</name>
							<description>Cluster 11 Clock Divider. This bit is only writable if bit field RF PROT of        register GTM CTRL is cleared.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLS1_CLK_DIV</name>
							<description>Cluster 11 Clock Divider. This bit is only writable if bit field RF PROT of        register GTM CTRL is cleared.</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLS2_CLK_DIV</name>
							<description>Cluster 11 Clock Divider. This bit is only writable if bit field RF PROT of        register GTM CTRL is cleared.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLS3_CLK_DIV</name>
							<description>Cluster 11 Clock Divider. This bit is only writable if bit field RF PROT of        register GTM CTRL is cleared.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLS4_CLK_DIV</name>
							<description>Cluster 11 Clock Divider. This bit is only writable if bit field RF PROT of        register GTM CTRL is cleared.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLS5_CLK_DIV</name>
							<description>Cluster 11 Clock Divider. This bit is only writable if bit field RF PROT of        register GTM CTRL is cleared.</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAP_CTRL</name>
					<description>MAP Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3840</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TSEL</name>
							<description>TRIGGER signal output select</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SSL</name>
							<description>STATE signal output select</description>
							<lsb>1</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LSEL</name>
							<description>TIM0 IN6 input level selection</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSPP0_EN</name>
							<description>Enable of TSPP0 subunit</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSPP0_DLD</name>
							<description>DIR level definition bit</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSPP0_I0V</name>
							<description>Disable of TSPP0 TIM0 CHx 48  input line</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSPP0_I1V</name>
							<description>Disable of TSPP0 TIM0 CHy 48  input line</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSPP0_I2V</name>
							<description>Disable of TSPP0 TIM0 CHz 48  input line</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSPP1_EN</name>
							<description>Enable of TSPP1 subunit</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSPP1_DLD</name>
							<description>DIR level definition bit</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSPP1_I0V</name>
							<description>Disable of TSPP1 TIM0 CHx 48  input line</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSPP1_I1V</name>
							<description>Disable of TSPP1 TIM0 CHy 48  input line</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSPP1_I2V</name>
							<description>Disable of TSPP1 TIM0 CHz 48  input line</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCFG_CTRL</name>
					<description>MCFG Memory Layout Configuration Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3904</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MEM0</name>
							<description>Configure Memory pages for MCS instance MCS9</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MEM1</name>
							<description>Configure Memory pages for MCS instance MCS9</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MEM2</name>
							<description>Configure Memory pages for MCS instance MCS9</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MEM3</name>
							<description>Configure Memory pages for MCS instance MCS9</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MEM4</name>
							<description>Configure Memory pages for MCS instance MCS9</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CLC</name>
					<description>Clock Control Register
 resetvalue={Application Reset:0x3}</description>
					<addressOffset>654592</addressOffset>
					<size>32</size>
					<resetValue>3</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit. Used for enable disable control of the GTM module.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit. This bit indicates the current status of the GTM module.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EDIS</name>
							<description>Sleep Mode Enable Control. Used for module s sleep mode control.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_CLR</name>
					<description>Kernel Reset Status Clear Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>654596</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CLR</name>
							<description>Kernel Reset Status Clear. Read always as 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET1</name>
					<description>Kernel Reset Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>654600</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>Kernel Reset. This reset bit can be used to request for a kernel reset. The kernel        reset will be executed if the reset bits of both kernel registers are        set. The RST bit will be cleared  re set to   180 0  180   by the BPI FPI after the        kernel reset was executed.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RSTSTAT</name>
							<description>Kernel Reset Status. This bit indicates whether a kernel reset was executed or not. This bit        is set by the BPI FPI after the execution of a kernel reset in the same        clock cycle both reset bits. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related RESET CLR register.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET2</name>
					<description>Kernel Reset Register 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>654604</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>Kernel Reset. This reset bit can be used to request a kernel reset. The kernel reset        will be executed if the reset bits of both kernel reset registers are        set. The RST bit will be cleared  re set to   180 0  180   after the kernel reset was        executed.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
