J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>ACCEN0</name>
					<description>Access Enable Register 0
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
					<addressOffset>654608</addressOffset>
					<size>32</size>
					<resetValue>4294967295</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EN0</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN1</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN2</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN3</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN4</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN5</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN6</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN7</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN8</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN9</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN10</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN11</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN12</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN13</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN14</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN15</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN16</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN17</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN18</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN19</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN20</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN21</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN22</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN23</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN24</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN25</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN26</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN27</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN28</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN29</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN30</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN31</name>
							<description>Access Enable for Master TAG ID 31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>6</dim>
					<dimIncrement>4</dimIncrement>
					<name>TIMnINSEL[%s]</name>
					<description>TIM0 Input Select Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>654656</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CH0SEL</name>
							<description>TIM Channel 7 Input Selection. This bit defines which input is connected for TIMn channel x of the GTM.        The input is either derived from a port pad or from an on chip module.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH1SEL</name>
							<description>TIM Channel 7 Input Selection. This bit defines which input is connected for TIMn channel x of the GTM.        The input is either derived from a port pad or from an on chip module.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH2SEL</name>
							<description>TIM Channel 7 Input Selection. This bit defines which input is connected for TIMn channel x of the GTM.        The input is either derived from a port pad or from an on chip module.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH3SEL</name>
							<description>TIM Channel 7 Input Selection. This bit defines which input is connected for TIMn channel x of the GTM.        The input is either derived from a port pad or from an on chip module.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH4SEL</name>
							<description>TIM Channel 7 Input Selection. This bit defines which input is connected for TIMn channel x of the GTM.        The input is either derived from a port pad or from an on chip module.</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH5SEL</name>
							<description>TIM Channel 7 Input Selection. This bit defines which input is connected for TIMn channel x of the GTM.        The input is either derived from a port pad or from an on chip module.</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH6SEL</name>
							<description>TIM Channel 7 Input Selection. This bit defines which input is connected for TIMn channel x of the GTM.        The input is either derived from a port pad or from an on chip module.</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH7SEL</name>
							<description>TIM Channel 7 Input Selection. This bit defines which input is connected for TIMn channel x of the GTM.        The input is either derived from a port pad or from an on chip module.</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>19</dim>
					<dimIncrement>4</dimIncrement>
					<name>TOUTSELn[%s]</name>
					<description>Timer Output Select Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>654688</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SEL0</name>
							<description>TOUT n 8   7  Output Selection. This bit field defines which timer output is connected as TOUT n 8 x . The mapping is defined in the specific appendix. If TOUT n 8 x  is not defined in the specific appendix  this bit field          has to be treated as reserved   0   TOUT not routed to any ports . SELx values not explicitly defined here are equivalent to the last          defined SELx setting.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL1</name>
							<description>TOUT n 8   7  Output Selection. This bit field defines which timer output is connected as TOUT n 8 x . The mapping is defined in the specific appendix. If TOUT n 8 x  is not defined in the specific appendix  this bit field          has to be treated as reserved   0   TOUT not routed to any ports . SELx values not explicitly defined here are equivalent to the last          defined SELx setting.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL2</name>
							<description>TOUT n 8   7  Output Selection. This bit field defines which timer output is connected as TOUT n 8 x . The mapping is defined in the specific appendix. If TOUT n 8 x  is not defined in the specific appendix  this bit field          has to be treated as reserved   0   TOUT not routed to any ports . SELx values not explicitly defined here are equivalent to the last          defined SELx setting.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL3</name>
							<description>TOUT n 8   7  Output Selection. This bit field defines which timer output is connected as TOUT n 8 x . The mapping is defined in the specific appendix. If TOUT n 8 x  is not defined in the specific appendix  this bit field          has to be treated as reserved   0   TOUT not routed to any ports . SELx values not explicitly defined here are equivalent to the last          defined SELx setting.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL4</name>
							<description>TOUT n 8   7  Output Selection. This bit field defines which timer output is connected as TOUT n 8 x . The mapping is defined in the specific appendix. If TOUT n 8 x  is not defined in the specific appendix  this bit field          has to be treated as reserved   0   TOUT not routed to any ports . SELx values not explicitly defined here are equivalent to the last          defined SELx setting.</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL5</name>
							<description>TOUT n 8   7  Output Selection. This bit field defines which timer output is connected as TOUT n 8 x . The mapping is defined in the specific appendix. If TOUT n 8 x  is not defined in the specific appendix  this bit field          has to be treated as reserved   0   TOUT not routed to any ports . SELx values not explicitly defined here are equivalent to the last          defined SELx setting.</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL6</name>
							<description>TOUT n 8   7  Output Selection. This bit field defines which timer output is connected as TOUT n 8 x . The mapping is defined in the specific appendix. If TOUT n 8 x  is not defined in the specific appendix  this bit field          has to be treated as reserved   0   TOUT not routed to any ports . SELx values not explicitly defined here are equivalent to the last          defined SELx setting.</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL7</name>
							<description>TOUT n 8   7  Output Selection. This bit field defines which timer output is connected as TOUT n 8 x . The mapping is defined in the specific appendix. If TOUT n 8 x  is not defined in the specific appendix  this bit field          has to be treated as reserved   0   TOUT not routed to any ports . SELx values not explicitly defined here are equivalent to the last          defined SELx setting.</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>6</dim>
					<dimIncrement>4</dimIncrement>
					<name>DSADCINSEL[%s]</name>
					<description>DSADC Input Select i Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>654848</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>INSEL0</name>
							<description>In Selection for DSADCn GTM connection. This bit field defines which DSADCn output is connected if the channel        input mux is configured as DSADC input for TIMi channel j.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INSEL1</name>
							<description>In Selection for DSADCn GTM connection. This bit field defines which DSADCn output is connected if the channel        input mux is configured as DSADC input for TIMi channel j.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INSEL2</name>
							<description>In Selection for DSADCn GTM connection. This bit field defines which DSADCn output is connected if the channel        input mux is configured as DSADC input for TIMi channel j.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INSEL3</name>
							<description>In Selection for DSADCn GTM connection. This bit field defines which DSADCn output is connected if the channel        input mux is configured as DSADC input for TIMi channel j.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INSEL4</name>
							<description>In Selection for DSADCn GTM connection. This bit field defines which DSADCn output is connected if the channel        input mux is configured as DSADC input for TIMi channel j.</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INSEL5</name>
							<description>In Selection for DSADCn GTM connection. This bit field defines which DSADCn output is connected if the channel        input mux is configured as DSADC input for TIMi channel j.</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INSEL6</name>
							<description>In Selection for DSADCn GTM connection. This bit field defines which DSADCn output is connected if the channel        input mux is configured as DSADC input for TIMi channel j.</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INSEL7</name>
							<description>In Selection for DSADCn GTM connection. This bit field defines which DSADCn output is connected if the channel        input mux is configured as DSADC input for TIMi channel j.</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DXOUTCON</name>
					<description>Data Exchange Output Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>654960</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>OUT0</name>
							<description>Output 04 Control. This bit defines whether register TRIGOUTx INTOUTx is accessible from        the MCS instead of RAM0 or not.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OUT1</name>
							<description>Output 04 Control. This bit defines whether register TRIGOUTx INTOUTx is accessible from        the MCS instead of RAM0 or not.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OUT2</name>
							<description>Output 04 Control. This bit defines whether register TRIGOUTx INTOUTx is accessible from        the MCS instead of RAM0 or not.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OUT3</name>
							<description>Output 04 Control. This bit defines whether register TRIGOUTx INTOUTx is accessible from        the MCS instead of RAM0 or not.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OUT4</name>
							<description>Output 04 Control. This bit defines whether register TRIGOUTx INTOUTx is accessible from        the MCS instead of RAM0 or not.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
