J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<dim>5</dim>
					<dimIncrement>4</dimIncrement>
					<name>TRIGOUTn[%s]</name>
					<description>Trigger Output Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>654964</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TRIG0</name>
							<description>Trigger 7. This bit field defines whether a trigger x request is generated or not.        In case of read  the value 0x00000000 is returned.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TRIG1</name>
							<description>Trigger 7. This bit field defines whether a trigger x request is generated or not.        In case of read  the value 0x00000000 is returned.</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TRIG2</name>
							<description>Trigger 7. This bit field defines whether a trigger x request is generated or not.        In case of read  the value 0x00000000 is returned.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TRIG3</name>
							<description>Trigger 7. This bit field defines whether a trigger x request is generated or not.        In case of read  the value 0x00000000 is returned.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TRIG4</name>
							<description>Trigger 7. This bit field defines whether a trigger x request is generated or not.        In case of read  the value 0x00000000 is returned.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TRIG5</name>
							<description>Trigger 7. This bit field defines whether a trigger x request is generated or not.        In case of read  the value 0x00000000 is returned.</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TRIG6</name>
							<description>Trigger 7. This bit field defines whether a trigger x request is generated or not.        In case of read  the value 0x00000000 is returned.</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TRIG7</name>
							<description>Trigger 7. This bit field defines whether a trigger x request is generated or not.        In case of read  the value 0x00000000 is returned.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>5</dim>
					<dimIncrement>4</dimIncrement>
					<name>INTOUTn[%s]</name>
					<description>Interrupt Output Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>655004</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>INT0</name>
							<description>Interrupt Trigger Request 0. This bit field defines whether an interrupt request 0 is generated or        not.In case of read  the value 0x00000000 is returned</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCSTRIGOUTSEL</name>
					<description>Trigger Output Select Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>655044</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SEL0</name>
							<description>Selects which MCS triggers go to FC7BFDAT SEL</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL1</name>
							<description>Selects which MCS triggers go to FC7BFDAT SEL</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL2</name>
							<description>Selects which MCS triggers go to FC7BFDAT SEL</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL3</name>
							<description>Selects which MCS triggers go to FC7BFDAT SEL</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCSINTSTAT</name>
					<description>MCS Interrupt Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>655048</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MCS00</name>
							<description>MCS4 RAM0 Interrupt 0 Status Flag. The requested interrupt is SRC GTMMCSWn0.  This bit is cleared when       bit MCSINTCLR.MCSn is set.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MCS10</name>
							<description>MCS4 RAM0 Interrupt 0 Status Flag. The requested interrupt is SRC GTMMCSWn0.  This bit is cleared when       bit MCSINTCLR.MCSn is set.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MCS20</name>
							<description>MCS4 RAM0 Interrupt 0 Status Flag. The requested interrupt is SRC GTMMCSWn0.  This bit is cleared when       bit MCSINTCLR.MCSn is set.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MCS30</name>
							<description>MCS4 RAM0 Interrupt 0 Status Flag. The requested interrupt is SRC GTMMCSWn0.  This bit is cleared when       bit MCSINTCLR.MCSn is set.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MCS40</name>
							<description>MCS4 RAM0 Interrupt 0 Status Flag. The requested interrupt is SRC GTMMCSWn0.  This bit is cleared when       bit MCSINTCLR.MCSn is set.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCSINTCLR</name>
					<description>MCS Interrupt Clear Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>655052</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MCS0</name>
							<description>MCSn RAM0 Interrupt 0 Status Clear Bit. This bit is always read as zero.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MCS1</name>
							<description>MCSn RAM0 Interrupt 0 Status Clear Bit. This bit is always read as zero.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MCS2</name>
							<description>MCSn RAM0 Interrupt 0 Status Clear Bit. This bit is always read as zero.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MCS3</name>
							<description>MCSn RAM0 Interrupt 0 Status Clear Bit. This bit is always read as zero.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MCS4</name>
							<description>MCSn RAM0 Interrupt 0 Status Clear Bit. This bit is always read as zero.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DXINCON</name>
					<description>Data Exchange Input Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>655056</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>IN0</name>
							<description>Input 04 Control. This bit defines whether register DATAINx is read from the MCS instead        of RAM0 or not.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IN1</name>
							<description>Input 04 Control. This bit defines whether register DATAINx is read from the MCS instead        of RAM0 or not.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IN2</name>
							<description>Input 04 Control. This bit defines whether register DATAINx is read from the MCS instead        of RAM0 or not.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IN3</name>
							<description>Input 04 Control. This bit defines whether register DATAINx is read from the MCS instead        of RAM0 or not.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IN4</name>
							<description>Input 04 Control. This bit defines whether register DATAINx is read from the MCS instead        of RAM0 or not.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DSS0</name>
							<description>Data Source Select 04 Control. This bit defines whether the 12 LSB of the read operation directed to        register DATAIN0x deliver the register content or the state of 12 inputs.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DSS1</name>
							<description>Data Source Select 04 Control. This bit defines whether the 12 LSB of the read operation directed to        register DATAIN0x deliver the register content or the state of 12 inputs.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DSS2</name>
							<description>Data Source Select 04 Control. This bit defines whether the 12 LSB of the read operation directed to        register DATAIN0x deliver the register content or the state of 12 inputs.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DSS3</name>
							<description>Data Source Select 04 Control. This bit defines whether the 12 LSB of the read operation directed to        register DATAIN0x deliver the register content or the state of 12 inputs.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DSS4</name>
							<description>Data Source Select 04 Control. This bit defines whether the 12 LSB of the read operation directed to        register DATAIN0x deliver the register content or the state of 12 inputs.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>5</dim>
					<dimIncrement>4</dimIncrement>
					<name>DATAINn[%s]</name>
					<description>Data Input 0 Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>655060</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description>Data. This bit field holds the data for the RAM0 replacement.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSI5OUTSEL</name>
					<description>PSI5 Output Select Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>655308</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SEL0</name>
							<description>Output Selection for GTM to PSI55 connection. This bit field defines which TOM ATOM channel output is used as PSI5        trigger x. Decoding is        defined in the specific appendix.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL1</name>
							<description>Output Selection for GTM to PSI55 connection. This bit field defines which TOM ATOM channel output is used as PSI5        trigger x. Decoding is        defined in the specific appendix.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL2</name>
							<description>Output Selection for GTM to PSI55 connection. This bit field defines which TOM ATOM channel output is used as PSI5        trigger x. Decoding is        defined in the specific appendix.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL3</name>
							<description>Output Selection for GTM to PSI55 connection. This bit field defines which TOM ATOM channel output is used as PSI5        trigger x. Decoding is        defined in the specific appendix.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL4</name>
							<description>Output Selection for GTM to PSI55 connection. This bit field defines which TOM ATOM channel output is used as PSI5        trigger x. Decoding is        defined in the specific appendix.</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL5</name>
							<description>Output Selection for GTM to PSI55 connection. This bit field defines which TOM ATOM channel output is used as PSI5        trigger x. Decoding is        defined in the specific appendix.</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSI5SOUTSEL</name>
					<description>PSI5 S Output Select Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>655312</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SEL0</name>
							<description>Output Selection for GTM to PSI5 S connection. This bit field defines which TOM ATOM channel output is used as PSI5 S        trigger x. Decoding is        defined in the specific appendix.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL1</name>
							<description>Output Selection for GTM to PSI5 S connection. This bit field defines which TOM ATOM channel output is used as PSI5 S        trigger x. Decoding is        defined in the specific appendix.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL2</name>
							<description>Output Selection for GTM to PSI5 S connection. This bit field defines which TOM ATOM channel output is used as PSI5 S        trigger x. Decoding is        defined in the specific appendix.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL3</name>
							<description>Output Selection for GTM to PSI5 S connection. This bit field defines which TOM ATOM channel output is used as PSI5 S        trigger x. Decoding is        defined in the specific appendix.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL4</name>
							<description>Output Selection for GTM to PSI5 S connection. This bit field defines which TOM ATOM channel output is used as PSI5 S        trigger x. Decoding is        defined in the specific appendix.</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL5</name>
							<description>Output Selection for GTM to PSI5 S connection. This bit field defines which TOM ATOM channel output is used as PSI5 S        trigger x. Decoding is        defined in the specific appendix.</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL6</name>
							<description>Output Selection for GTM to PSI5 S connection. This bit field defines which TOM ATOM channel output is used as PSI5 S        trigger x. Decoding is        defined in the specific appendix.</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL7</name>
							<description>Output Selection for GTM to PSI5 S connection. This bit field defines which TOM ATOM channel output is used as PSI5 S        trigger x. Decoding is        defined in the specific appendix.</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LCDCDCOUTSEL</name>
					<description>LCDCDC Output Select Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>655316</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SEL</name>
							<description>Output Selection for GTM to LCDCDC connection. This bit field defines which TOM ATOM channel output is used as LCDCDC        signal. Decoding is        defined in the specific appendix.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DTMAUXINSEL</name>
					<description>DTM AUX Input Selection Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>655320</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ASEL0</name>
							<description>CDTM4 DTM4 AUX Input Selection  ATOMx CH0...3 . This bit field defines which GPIO DSADC EVADC signal is connected to the        CDTMx DTM4 AUX input.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ASEL1</name>
							<description>CDTM4 DTM4 AUX Input Selection  ATOMx CH0...3 . This bit field defines which GPIO DSADC EVADC signal is connected to the        CDTMx DTM4 AUX input.</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ASEL2</name>
							<description>CDTM4 DTM4 AUX Input Selection  ATOMx CH0...3 . This bit field defines which GPIO DSADC EVADC signal is connected to the        CDTMx DTM4 AUX input.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ASEL3</name>
							<description>CDTM4 DTM4 AUX Input Selection  ATOMx CH0...3 . This bit field defines which GPIO DSADC EVADC signal is connected to the        CDTMx DTM4 AUX input.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ASEL4</name>
							<description>CDTM4 DTM4 AUX Input Selection  ATOMx CH0...3 . This bit field defines which GPIO DSADC EVADC signal is connected to the        CDTMx DTM4 AUX input.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSEL0</name>
							<description>CDTM2 DTM0 AUX Input Selection  TOMx CH0...3 . This bit field defines which GPIO DSADC EVADC signal is connected to the        CDTMx DTM0 AUX input.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSEL1</name>
							<description>CDTM2 DTM0 AUX Input Selection  TOMx CH0...3 . This bit field defines which GPIO DSADC EVADC signal is connected to the        CDTMx DTM0 AUX input.</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSEL2</name>
							<description>CDTM2 DTM0 AUX Input Selection  TOMx CH0...3 . This bit field defines which GPIO DSADC EVADC signal is connected to the        CDTMx DTM0 AUX input.</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
