J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>CANOUTSEL0</name>
					<description>CAN0 CAN1 Output Select Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>655324</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SEL0</name>
							<description>Output Selection for GTM to CAN connection 7. This bit field defines which TOM ATOM channel output is used as        CAN0 CAN1 node trigger x. Triggers        0 and 1 are also sent to the TTCAN. The decoding is defined in the specific appendix.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL1</name>
							<description>Output Selection for GTM to CAN connection 7. This bit field defines which TOM ATOM channel output is used as        CAN0 CAN1 node trigger x. Triggers        0 and 1 are also sent to the TTCAN. The decoding is defined in the specific appendix.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL2</name>
							<description>Output Selection for GTM to CAN connection 7. This bit field defines which TOM ATOM channel output is used as        CAN0 CAN1 node trigger x. Triggers        0 and 1 are also sent to the TTCAN. The decoding is defined in the specific appendix.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL3</name>
							<description>Output Selection for GTM to CAN connection 7. This bit field defines which TOM ATOM channel output is used as        CAN0 CAN1 node trigger x. Triggers        0 and 1 are also sent to the TTCAN. The decoding is defined in the specific appendix.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL4</name>
							<description>Output Selection for GTM to CAN connection 7. This bit field defines which TOM ATOM channel output is used as        CAN0 CAN1 node trigger x. Triggers        0 and 1 are also sent to the TTCAN. The decoding is defined in the specific appendix.</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL5</name>
							<description>Output Selection for GTM to CAN connection 7. This bit field defines which TOM ATOM channel output is used as        CAN0 CAN1 node trigger x. Triggers        0 and 1 are also sent to the TTCAN. The decoding is defined in the specific appendix.</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL6</name>
							<description>Output Selection for GTM to CAN connection 7. This bit field defines which TOM ATOM channel output is used as        CAN0 CAN1 node trigger x. Triggers        0 and 1 are also sent to the TTCAN. The decoding is defined in the specific appendix.</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL7</name>
							<description>Output Selection for GTM to CAN connection 7. This bit field defines which TOM ATOM channel output is used as        CAN0 CAN1 node trigger x. Triggers        0 and 1 are also sent to the TTCAN. The decoding is defined in the specific appendix.</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CANOUTSEL1</name>
					<description>CAN2 Output Select Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>655328</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>65535</resetMask>
					<fields>
						<field>
							<name>SEL0</name>
							<description>Output Selection for GTM to CAN connection 3. This bit field defines which TOM ATOM channel output is used as CAN2        node trigger x. The        decoding is defined in the specific appendix.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL1</name>
							<description>Output Selection for GTM to CAN connection 3. This bit field defines which TOM ATOM channel output is used as CAN2        node trigger x. The        decoding is defined in the specific appendix.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL2</name>
							<description>Output Selection for GTM to CAN connection 3. This bit field defines which TOM ATOM channel output is used as CAN2        node trigger x. The        decoding is defined in the specific appendix.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL3</name>
							<description>Output Selection for GTM to CAN connection 3. This bit field defines which TOM ATOM channel output is used as CAN2        node trigger x. The        decoding is defined in the specific appendix.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>PMS</name>
			<version>100</version>
			<description>PMS</description>
			<baseAddress>4028923904</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>512</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>ID</name>
					<description>Identification Register
 resetvalue={Application Reset:0x0E8C001}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>15253505</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MODREV</name>
							<description>Module Revision Number   MODREV. This bit field indicates the revision number of the PMS module. This is intended as a continuous numbering scheme defined by Design.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODTYPE</name>
							<description>Module Type   MODTYPE. This bit field is fixed coded as C0 H .        It defines a 32 bit module.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODNUMBER</name>
							<description>Module Number   MODNUMBER. This bit field defines the module identification number. The identification number for the PMS is 00E8 H .</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSTAT</name>
					<description>EVR Status Register
 resetvalue={LVD Reset:0x0,Cold PORST:0x0}</description>
					<addressOffset>44</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EVRC</name>
							<description>EVRC status   EVRC. This bit is set if the internal EVRC regulator is currently active. EVRC        is activated if HWCFG 2  pin level is latched high during start up        phase. The bit reflects the        DCDC regulator enable bit provided from PMS to DCDC.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OVC</name>
							<description>VDD Over voltage event flag   OVC. This bit is set if VDD secondary voltage monitor recognizes a        over voltage event. An alarm is raised to the SMU and the status bit        remains set until violation disappears.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EVR33</name>
							<description>EVR33 status   EVR33. This bit is set if the internal EVR33 LDO regulator is active. EVR33 is        activated if HWCFG 1  pin level is latched high during start up phase. The bit reflects the EVR33 enable bit provided from PMS to PID.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OV33</name>
							<description>VDDP3 Over voltage event flag   OV33. This bit is set if VDDP3 secondary voltage monitor recognizes a        over voltage event. An alarm is raised to the SMU and the status bit        remains set until violation disappears.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OVSWD</name>
							<description>VEXT Over voltage event flag   OVSWD. This bit is set if VEXT secondary voltage monitor recognizes an        over voltage event. An alarm is raised to the SMU and the status bit        remains set until violation disappears.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>UVC</name>
							<description>VDD Under voltage event flag   UVC. This bit is set if VDD secondary voltage monitor recognizes a        under voltage event. An alarm is raised to the SMU and the status bit        remains set until violation disappears.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>UV33</name>
							<description>VDDP3 Under voltage event flag   UV33. This bit is set if VDDP3 secondary voltage monitor recognizes a        under voltage event. An alarm is raised to the SMU and the status bit        remains set until violation disappears.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>UVSWD</name>
							<description>VEXT Under voltage event flag   UVSWD. This bit is set if VEXT secondary voltage monitor recognizes an        under voltage event. An alarm is raised to the SMU and the status bit        remains set until violation disappears.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SYNCLCK</name>
							<description>EVRC Synchronization Input Locked status sd sync in locked o    SYNCLCK. This bitfield indicates the current synchronization status of EVRC SMPS        regulator to external DCDCSYNCI input signal. When the EVRC switching        frequency  edge is locked to the synchronization input  the SYNCLCK bit        is set to HIGH indicating the locked state. When the synchronization is        lost owing to frequency deviations beyond MAXDEV or the feature is        disabled via SYNCEN  the SYNCLCK bit is set to LOW. This EVRC Synchronization status is indicated in EVRSDSTAT0.SYNCLCK        status bits.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EVR33VOK</name>
							<description>EVR33 Regulator Voltage OK status   EVR33VOK. This bit is set after the soft ramp up time of the EVR33 voltage OK ramp        detector has elapsed and is not based on the measured VDDP3 voltage at        the end of ramp phase..</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RSTC</name>
							<description>EVRC Reset Trigger   RSTC</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RST33</name>
							<description>EVR33 Reset Trigger   RST33</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RSTSWD</name>
							<description>EVR SWD Reset Trigger   RSTSWD</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EVRCSHLV</name>
							<description>Short to ground   EVRCSHLV. This bit is set if a short condition to ground has been detected. The        measured EVRC output is below the operational supply range and the upper        controller limits are reached.The feature is supported only during        closed loop operation or EVRCMOD  160    160 00b.  evr sd short to lv </description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EVRCSHHV</name>
							<description>Short to supply   EVRCSHHV. This bit is set if a short condition to supply has been detected. The        measured EVRC output exceeds the allowed supply range and the lower        controller limits are reached. The feature is supported only during        closed loop operation or EVRCMOD  160    160 00b.  evr sd short to hv </description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EVR33SHLV</name>
							<description>Short to ground   EVR33SHLV. This bit is set if a short condition to ground has been detected. The        measured EVR33 output is below the operational supply range and the        lower gate drive threshold voltage driving P ch. MOSFET  VGATEL 0 1V  is reached.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EVR33SHHV</name>
							<description>Short to supply   EVR33SHHV. This bit is set if a short condition to supply has been detected. The        measured EVR33 output exceeds the allowed supply range and the upper        gate drive threshold voltage driving P ch. MOSFET  VGATEL 4 9V  is reached.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SWDLVL</name>
							<description>VEXT External Supply Level Status   SWDLVL. This bit indicates that the VEXT voltage has dropped below  4  160 V to        indicate EVRC parameter switch to differentiate 5V or 3.3V external        supply. A hysteresis of  120  160 mV is implemented on this detector.  drv low vdd . The primary SWD ADC monitor value is used for EVRC SWDLVL        comparator.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SDVOK</name>
							<description>EVRC Regulator Voltage OK status   SDVOK. This bit is set by the EVRC voltage OK detector to indicate that the new        regulator output value has been reached. This bit is reset incase        EVRTRIM. SDVOUTSEL or SDVOUTTRIM values are adapted to scale core        voltage and is set when the new output setpoint is reached. This bit is        also reset incase droop compensation is requested before a load jump        event. A time out period of x  160 us shall be waited when polling SDVOK bit.  status voltok o </description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EVRCMOD</name>
							<description>EVRC Mode   EVRCMOD. This bit indicates the current operation mode of LC   PWM  LPM  STRT. Depending        on whether EVRC is activated the status bit is consequently updated.         status mode o </description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OVPRE</name>
							<description>Pre Regulator VDDPD Over voltage event flag   OVPRE. This bit is set if VDDPD supply secondary voltage monitor recognizes an        over voltage event. An alarm is raised to the SMU.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OVSB</name>
							<description>Standby Supply or VEVRSB Over voltage event flag   OVSB. This bit is set if VEVRSB supply secondary voltage monitor recognizes an        over voltage event. An alarm is raised to the SMU.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OVDDM</name>
							<description>ADC VDDM Supply Over voltage event flag   OVDDM. This bit is set if VDDM ADC supply secondary voltage monitor recognizes        an over voltage event. An alarm is raised to the SMU.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>UVPRE</name>
							<description>Pre Regulator VDDPD Under voltage event flag   UVPRE. This bit is set if VDDPD supply secondary voltage monitor recognizes an        under voltage event. An alarm is raised to the SMU.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>UVSB</name>
							<description>Standby Supply or VEVRSB Under voltage event flag   UVSB. This bit is set if VEVRSB supply secondary voltage monitor recognizes an        under voltage event. An alarm is raised to the SMU.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>UVDDM</name>
							<description>ADC VDDM Supply Under voltage event flag   UVDDM. This bit is set if VDDM ADC supply secondary voltage monitor recognizes        an under voltage event. An alarm is raised to the SMU.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRADCSTAT</name>
					<description>EVR Primary ADC Status Register
 resetvalue={LVD Reset:0x0}</description>
					<addressOffset>52</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADCCV</name>
							<description>ADC VDD Core Voltage Conversion Result   ADCCV. This bit field contains the last filtered conversion result of the ADC measurement of the VDD  xa0    xa0 EVRC supply by the Primary Monitor. VIN  xa0    xa0  0.7125    ADCCV  xa0    xa0 LSB    xa0 V LSB   5  xa0 mV Eg. 1.25 V   6C</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ADC33V</name>
							<description>ADC VDDP3 Voltage Conversion Result   ADC33V. This bit field contains the last filtered conversion result of the ADC measurement of the VDDP3  xa0    xa0 EVR33 supply by the Primary Monitor. VIN  xa0    xa0  0.9375    ADC33V  xa0    xa0 LSB    xa0 V LSB   15  xa0 mV Eg. 3.3 V   9E</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ADCSWDV</name>
							<description>ADC VEXT Supply Conversion Result   ADCSWDV. This bit field contains the last filtered conversion result of the ADC measurement of the external VEXT  3.3V  xa0    xa0 5V  supply by the Primary Monitor. VIN  xa0    xa0  1.050    ADCSWDV  xa0    xa0 LSB    xa0 V  xa0  LSB   20  xa0 mV Eg. 5 V   C6</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OVC</name>
							<description>EVRC Regulator or VDD Over voltage event flag   OVC. This bit is set if VDD primary voltage monitor recognizes a over voltage        event. An alarm is raised to the HSM and SMU.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OV33</name>
							<description>EVR33 Regulator or VDDP3 Over voltage event flag   OV33. This bit is set if VDDP3 primary voltage monitor recognizes a        over voltage event. An alarm is raised to the HSM and SMU.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OVSWD</name>
							<description>Supply Watchdog  SWD  or VEXT Over voltage event flag   OVSWD. This bit is set if VEXT primary voltage monitor recognizes an        over voltage event. An alarm is raised to the HSM and SMU.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>UVC</name>
							<description>EVRC Regulator or VDD Under voltage event flag   UVC. This bit is set if VDD primary voltage monitor recognizes a        under voltage event. An alarm is raised to the HSM and SMU.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>UV33</name>
							<description>EVR33 Regulator or VDDP3 Under voltage event flag   UV33. This bit is set if VDDP3 primary voltage monitor recognizes a        under voltage event. An alarm is raised to the HSM and SMU.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>UVSWD</name>
							<description>Supply Watchdog  SWD  or VEXT Under voltage event flag   UVSWD. This bit is set if VEXT primary voltage monitor recognizes an        under voltage event. An alarm is raised to the HSM and SMU.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
