J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>EVRRSTCON</name>
					<description>EVR Reset Control Register
 resetvalue={LVD Reset:0x597F4A,Cold PORST:0x597F4A,After SSW execution:0x5C834B}</description>
					<addressOffset>60</addressOffset>
					<size>32</size>
					<resetValue>5768010</resetValue>
					<resetMask>4294575102</resetMask>
					<fields>
						<field>
							<name>RSTCTRIM</name>
							<description>VDD Supply Reset Trim Value   RSTCTRIM. This bit field selects the hard reset generation level of VDD supply        rail. This bit field is trimmed by Firmware. RSTCTRIM  160    160   VDDx   712.5 mV    LSB   if        RSTCPTRIM 0  VDDPRIUV  160    160 712.5 mV   LSB   RSTCTRIM          LSB   RSTCPTRIM  signed value  LSB   5 mV</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RST33TRIM</name>
							<description>VDDP3 Supply Reset Trim Value   RST33TRIM. This bit field selects the hard reset generation level of VDDP3 supply        rail. This bit field is trimmed by Firmware. RST33TRIM     VDDx   937.5 mV    LSB   if        RST33PTRIM 0  VDDP3PRIUV  160    160 937.5 mV   LSB   RST33TRIM   LSB   RST33PTRIM  signed        value  LSB   15 mV</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RSTSWDTRIM</name>
							<description>VEXT Supply Reset Trim Value   RSTSWDTRIM. This bit field selects the hard reset generation level of the external        VEXT supply rail. This bitfield is trimmed by Firmware. RSTSWDTRIM     VDDx   1050 mV    LSB   if RSTSWDPTRIM 0  VEXTPRIUV   1050 mV  LSB   RSTSWDTRIM          LSB   RSTSWDPTRIM  signed value  LSB   20 mV</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RSTCOFF</name>
							<description>VDD Reset Enable   RSTCOFF. This bit can only be changed if bit BPRSTCOFF is set in parallel.        RSTCOFF is intended to be used only for internal test purposes and the        primary reset generation is not to be disabled in customer application.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BPRSTCOFF</name>
							<description>Bit Protection RSTCOFF   BPRSTCOFF. Setting this bit enables that bit RSTCOFF can be changed in this write        operation. This bit is read as zero.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RST33OFF</name>
							<description>VDDP3 Reset Enable   RST33OFF. This bit can only be changed if bit BPRST33OFF is set in parallel. The        VDDP3 reset is disabled by application to support voltage drop up to        nominal 3.0  160 V during cranking. RST33OFF is intended to be used only for        internal test purposes and the primary reset generation is not to be        disabled in customer application.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BPRST33OFF</name>
							<description>Bit Protection RST33OFF   BPRST33OFF. Setting this bit enables that bit RST33OFF can be changed in this write        operation. This bit read also as zero.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSTSWDOFF</name>
							<description>VEXT Reset Enable   RSTSWDOFF. This bit can only be changed if bit BPRSTSWDOFF is set in parallel.        RSTSWDOFF is intended to be used only for internal test purposes and the        primary reset generation is not to be disabled in customer application.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BPRSTSWDOFF</name>
							<description>Bit Protection RSTSWDOFF   BPRSTSWDOFF. Setting this bit enables that bit RSTSWDOFF can be changed in this write        operation. This bit is read as zero.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SLCK</name>
							<description>HSM Security Lock   SLCK. If this bit is set  all other bits in this register can no longer be        written. Write requests to other bits when SLCK is set will trigger an        SLCK access error alarm.This bit can not by cleared by software. SLCK        bit can only be set by an access from the HSM master  TAG  160    160 000011 B  .        A set operation performed by any other master or software is ignored and        the bit is kept as cleared.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRRSTSTAT</name>
					<description>EVR Reset Status Register
 resetvalue={LVD Reset:0x0,Cold PORST:0x0}</description>
					<addressOffset>68</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RSTC</name>
							<description>VDD Supply Reset Value Status   RSTC. This bit field indicates the actual cold PORST reset trim setpoint for        core voltage supply rail used by the Primary monitors. The value is        updated via PMS EVRRSTCON .RSTCTRIM and PMS EVRRSTCON2 .RSTCPTRIM register. RSTC   RSTCTRIM   RSTCPTRIM  signed value  RSTC range  160    160 0 up to 255 VDDPRIUV   712.5 mV   LSB   RSTC LSB   5 mV</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RST33</name>
							<description>VDDP3 Supply Reset Value Status   RST33. This bit field indicates the actual cold PORST reset trim setpoint for        3.3  160 V supply rail used by the Primary monitors. The value is updated via PMS EVRRSTCON .RST33TRIM and PMS EVRRSTCON2 .RST33PTRIM register. RST33   RST33TRIM   RST33PTRIM  signed value  RST33 range  160    160 0 up to 255 VDDP3PRIUV   937.5 mV   LSB   RST33 LSB   15 mV</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RSTSWD</name>
							<description>VEXT Supply Reset Value Status   RSTSWD. This bit field indicates the actual cold PORST reset trim setpoint for        5  160 V supply rail used by the Primary monitors. The value is updated via PMS EVRRSTCON .RSTSWDTRIM and PMS EVRRSTCON2 .        RSTSWDPTRIM register. RSTSWD   RSTSWDTRIM          RSTSWDPTRIM  signed value  RSTSWD range  160    160 0 up to 255 VEXTPRIUV   1050 mV  LSB   RSTSWD LSB   20 mV</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RSTCOFF</name>
							<description>EVRC Reset Enable Status   RSTCOFF. The value is updated via PMS EVRRSTCON .RSTCOFF        register bit.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RST33OFF</name>
							<description>EVR33 Reset Enable Status   RST33OFF. The value is updated via PMS EVRRSTCON .RST33OFF        register bit.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RSTSWDOFF</name>
							<description>EVR SWD Reset Enable   RSTSWDOFF. The value is updated via PMS EVRRSTCON .RSTSWDOFF        register bit.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRTRIM</name>
					<description>EVR Trim Control Register
 resetvalue={LVD Reset:0x080006C9E,Cold PORST:0x080006C9E,After SSW execution:0x6C9E}</description>
					<addressOffset>76</addressOffset>
					<size>32</size>
					<resetValue>27806</resetValue>
					<resetMask>2147483647</resetMask>
					<fields>
						<field>
							<name>EVR33VOUTSEL</name>
							<description>EVR33 Regulator Output Voltage Target Value   EVR33VOUTSEL. The VDDP3 output level of the EVR33 LDO regulator. The ramp up        completion to the new target value is indicated via EVRSTAT.EVR33VOK        bit. The  EVR33VOUTSEL   EVR33VOUTTRIM  setpoint value shall be        programmed between 0x24 and 0xDA for valid closed loop PID regulator        function. 3.3 V   9E   158 EVR33VOUTSEL     VDDP3   937.5 mV    LSB  VDDP3   937.5 mV   LSB   EVR33VOUTSEL LSB   15 mV</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SDVOUTSEL</name>
							<description>EVRC Regulator Output Voltage Target Value   SDVOUTSEL. The VDD output level of the Step down regulator.  vosel target i  1.25 V   6C   108 SDVOUTSEL     VDD   712.5 mV    LSB   VDD   712.5 mV   LSB   SDVOUTSEL  LSB   5 mV. This register bitfield requires a parameter update via EVRSDCTRL0.UP for        transfer to EVRC SMPS shadow register. The reaching of the new target        value is indicated via EVRSTAT.SDVOK bit.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EVR33VOUTTRIM</name>
							<description>EVR33 Regulator Output Voltage Trim Value   EVR33VOUTTRIM. The 6 bit ADC BIST trimming value offset added to the EVR33 output level        value installed by firmware from the flash. This        field is meant for trimming during production tests. VDDP3 Setpoint   EVR33VOUTSEL   EVR33VOUTTRIM  signed value  EVR33OUTTRIM RANGE    32 to 31 LSB LSB   15 mV</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SDVOUTTRIM</name>
							<description>EVRC Regulator Output Voltage Trim Value vtrim trim i    SDVOUTTRIM. The 6 bit ADC BIST trimming value offset added to the EVRC output level        value installed by firmware from the flash. The reaching of the new        setpoint is indicated via EVRSTAT.SDVOK bits VDD Setpoint   SDVOUTSEL   SDVOUTTRIM  signed value  SDVOUTTRIM RANGE    32 to 31 LSB LSB   5 mV This register bitfield requires a parameter update via EVRSDCTRL0.UP for        transfer to SMPS shadow register.</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SLCK</name>
							<description>HSM Security Lock   SLCK. If this bit is set  all other bits in this register can no longer be        written. Write requests to other bits when SLCK is set will trigger an        SLCK access error alarm.This bit can not by cleared by software. SLCK        bit can only be set by an access from the HSM master  TAG  160    160 000011 B  .        A set operation performed by any other master or software is ignored and        the bit is kept as cleared.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status   LCK. This bit indicates if the register can be updated with a new value or if        the register is locked and a write action from the bus side has no        effect. When EVRSDCTRL0.UP bit is set to 1  register is locked for shadow        register update and LCK bit is set to 1. Once shadow register update is        done  the lock is released and LCK bit is set to 0.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRTRIMSTAT</name>
					<description>EVR Trim Status Register
 resetvalue={LVD Reset:0x6C9E,Cold PORST:0x6C9E}</description>
					<addressOffset>80</addressOffset>
					<size>32</size>
					<resetValue>27806</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EVR33VOUTSEL</name>
							<description>EVR33 Regulator Output Voltage Target Value   EVR33VOUTSEL. This bitfield indicates EVR33 output target value as configured in        EVTRIM.EVR33VOUTSEL.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SDVOUTSEL</name>
							<description>EVRC Regulator Output Voltage Target Value   SDVOUTSEL. This bit field indicates the EVRC output level of the Step down        regulator as configured in EVTRIM.SDVOUTSEL.  vosel target o </description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EVR33VOUTTRIM</name>
							<description>EVR33 Regulator Output Voltage Trim Value   EVR33VOUTTRIM. This bit field indicates the 6 bit ADC BIST trimming value offset added        to the EVR33 output level value installed by firmware from flash        configuration sector if production trimming is required.</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SDVOUTTRIM</name>
							<description>EVRC Regulator Output Voltage Trim Value vtrim trim o    SDVOUTTRIM. This bit field indicates the 5 bit ADC BIST trimming value offset added        to the EVRC output level value installed by firmware from flash        configuration sector as configured in EVTRIM.SDVOUTTRIM.</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRMONSTAT1</name>
					<description>EVR Secondary ADC Status Register 1
 resetvalue={LVD Reset:0x0,Cold PORST:0x0}</description>
					<addressOffset>96</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADCCV</name>
							<description>VDD Supply Secondary ADC Conversion Result   ADCCV. This bit field contains the last conversion result of the ADC        measurement of the VDD  160    160 EVRC supply by the Secondary Monitor. This        bitfield is updated if secondary over  or under voltage monitoring is        activated via EVRMONCTRL.EVRCxxMOD. The        update of the result is taking place at   6  160    160    160 12  160    160 active channels  160                160 fBACK   4  160    clock cycles. VIN  160    160  LSB  160    160  ADCx 1    160    160 Ideal LSB   5.7692  160 mV Full Range  160    160 1465  160 mV E.g. 1.25  160 V   DA</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ADC33V</name>
							<description>VDDP3 Supply Secondary ADC Conversion Result   ADC33V. This bit field contains the last conversion result of the ADC        measurement of the VDDP3  160    160 EVR33 supply by the Secondary Monitor. This        bitfield is updated if secondary over  or under voltage monitoring is        activated via EVRMONCTRL.EVR33xxMOD. The        update of the result is taking place at   6  160    160    160 12  160    160 active channels  160                160 fBACK   4  160    clock cycles. VIN  160    160  LSB  160    160  ADCx 1    160    160 Ideal LSB   15.00  160 mV Full Range  160    160 3810  160 mV E.g. 3.30  160 V   DD</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ADCSWDV</name>
							<description>VEXT Supply Secondary ADC Conversion Result   ADCSWDV. This bit field contains the last conversion result of the ADC        measurement of the external VEXT  3.3V  160    160 5V  supply by the Secondary        Monitor. This bitfield is updated if secondary over  or under voltage        monitoring is activated via EVRMONCTRL.SWDxxMOD. The        update of the result is taking place at   6  160    160    160 12  160    160 active channels  160                160 fBACK   4  160    clock cycles. VIN  160    160  LSB  160    160  ADCx 1    160    160 LSB   23.077  160 mV Full Range  160    160 5861  160 mV E.g. 5.01  160 V   DA   160   160   160   160   160    160 3.3  160 V   90</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ACTVCNT</name>
							<description>Secondary Monitor Activity Counter   ACTVCNT. This bit field cumulatively counts the end of conversion signals in a        single Secondary Monitor Background Scan over all channels and        respective filter configurations. The total number of conversions ConvTot     8721   ChX  ChXFIL . The counter is reset to 0 on a ConvTot overflow.</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRMONSTAT2</name>
					<description>EVR Secondary ADC Status Register 2
 resetvalue={LVD Reset:0x0,Cold PORST:0x0}</description>
					<addressOffset>100</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADCPRE</name>
							<description>VDDPD Supply Secondary ADC Conversion Result   ADCPRE. This bit field contains the last conversion result of the ADC        measurement of the VDDPD supply by the Secondary Monitor. This bitfield        is updated if secondary over  or under voltage monitoring is activated        via EVRMONCTRL.PRExxMOD. The        update of the result is taking place at   6  160    160    160 12  160    160 active channels  160                160 fBACK   4  160    clock cycles. VIN  160    160  LSB  160    160  ADCx 1    160    160 Ideal LSB   5.7692  160 mV Full Range  160    160 1465  160 mV E.g. 1.25  160 V   DA</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ADCSB</name>
							<description>VEVRSB Supply Secondary ADC Conversion Result   ADCSB. This bit field contains the last conversion result of the ADC        measurement of the external VEVRSB  3.3V  160    160 5V  standby supply by the        Secondary Monitor. This bitfield is updated if secondary over  or        under voltage monitoring is activated via EVRMONCTRL.SBxxMOD. The        update of the result is taking place at   6  160    160    160 12  160    160 active channels  160                160 fBACK   4  160    clock cycles. VIN  160    160  LSB  160    160  ADCx 1    160    160 Ideal LSB   23.077  160 mV Full Range  160    160 5861  160 mV E.g. 5.01  160 V   DA   160   160   160   160   160   160 3.0  160 V   90</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ADCVDDM</name>
							<description>VDDM Supply Secondary ADC Conversion Result   ADCVDDM. This bit field contains the last conversion result of the ADC        measurement of the VDDM ADC supply by the Secondary Monitor. This        bitfield is updated if secondary over  or under voltage monitoring is        activated via EVRMONCTRL.VDDMxxMOD. The        update of the result is taking place at   6  160    160    160 12  160    160 active channels  160                160 fBACK   4  160    clock cycles. VIN  160    160  LSB  160    160  ADCx 1    160    160 Ideal LSB   23.077  160 mV Full Range  160    160 5861  160 mV E.g. 5.01  160 V   DA   160   160   160   160   160   160 3.0  160 V   90</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
