J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>EVRMONCTRL</name>
					<description>EVR Secondary Monitor Control Register
 resetvalue={LVD Reset:0x0A5A5A5,Cold PORST:0x0A5A5A5,After SSW execution:0x0A5A5A5}</description>
					<addressOffset>104</addressOffset>
					<size>32</size>
					<resetValue>10855845</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EVRCOVMOD</name>
							<description>VDD Over voltage monitoring mode   EVRCOVMOD. Incase both EVRCOVMOD  160    160  00  amp         EVRCUVMOD  160    160  00   then ADC        conversion for the respective supply rail does not take place.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PREOVMOD</name>
							<description>EVRPR or VDDPD Over voltage monitoring mode   PREOVMOD. Incase both PREOVMOD  160    160  00  amp         PREUVMOD  160    160  00   then ADC        conversion for the respective supply rail does not take place.</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EVRCUVMOD</name>
							<description>VDD Under voltage monitoring mode   EVRCUVMOD. Incase both EVRCOVMOD  160    160  00  amp         EVRCUVMOD  160    160  00   then ADC        conversion for the respective supply rail does not take place.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PREUVMOD</name>
							<description>EVRPR or VDDPD Under voltage monitoring mode   PREUVMOD. Incase both PREOVMOD  160    160  00  amp         PREUVMOD  160    160  00   then ADC        conversion for the respective supply rail does not take place.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EVR33OVMOD</name>
							<description>VDDP3 Supply Over voltage monitoring mode   EVR33OVMOD. Incase both EVR33OVMOD  160    160  00  amp         EVR33UVMOD  160    160  00   then ADC        conversion for the respective supply rail does not take place.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VDDMOVMOD</name>
							<description>VDDM ADC Supply Over voltage monitoring mode   VDDMOVMOD. Incase both VDDMOVMOD  160    160  00  amp         VDDMUVMOD  160    160  00   then ADC        conversion for the VDDM supply rail continues to run as used for ADC        function.</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EVR33UVMOD</name>
							<description>VDDP3 Supply Under voltage monitoring mode   EVR33UVMOD. Incase both EVR33OVMOD  160    160  00  amp         EVR33UVMOD  160    160  00   then ADC        conversion for the respective supply rail does not take place.</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VDDMUVMOD</name>
							<description>VDDM ADC Supply Under voltage monitoring mode   VDDMUVMOD. Incase both VDDMOVMOD  160    160  00  amp         VDDMUVMOD  160    160  00   then ADC        conversion for the VDDM supply rail continues to run as used for ADC        function.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SWDOVMOD</name>
							<description>VEXT Over voltage monitoring mode   SWDOVMOD. Incase both SWDOVMOD  160    160  00  amp         SWDUVMOD  160    160  00   then ADC        conversion for the respective supply rail does not take place.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SBOVMOD</name>
							<description>EVR Standby Supply or VEVRSB Over voltage monitoring mode   SBOVMOD. Incase both SBOVMOD  160    160  00  amp         SBUVMOD  160    160  00   then ADC        conversion for the respective supply rail does not take place.</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SWDUVMOD</name>
							<description>VEXT Under voltage monitoring mode   SWDUVMOD. Incase both SWDOVMOD  160    160  00  amp         SWDUVMOD  160    160  00   then ADC        conversion for the respective supply rail does not take place.</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SBUVMOD</name>
							<description>EVR Standby Supply or VEVRSB Under voltage monitoring mode   SBUVMOD. Incase both SBOVMOD  160    160  00  amp         SBUVMOD  160    160  00   then ADC        conversion for the respective supply rail does not take place.</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SLCK</name>
							<description>HSM Security Lock   SLCK. If this bit is set  all other bits in this register can no longer be        written. Write requests to other bits when SLCK is set will trigger an        SLCK access error alarm.This bit can not by cleared by software. SLCK        bit can only be set by an access from the HSM master  TAG  160    160 000011 B  .        A set operation performed by any other master or software is ignored and        the bit is kept as cleared.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRMONFILT</name>
					<description>EVR Secondary Monitor Filter Register
 resetvalue={LVD Reset:0x300,Cold PORST:0x300,After SSW execution:0x10301}</description>
					<addressOffset>112</addressOffset>
					<size>32</size>
					<resetValue>768</resetValue>
					<resetMask>4294901758</resetMask>
					<fields>
						<field>
							<name>EVRCFIL</name>
							<description>VDD Secondary ADC Supply Filter   EVRCFIL</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PREFIL</name>
							<description>VDDPD Secondary ADC Supply Filter   PREFIL</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EVR33FIL</name>
							<description>VDDP3 Secondary ADC Supply Filter   EVR33FIL</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VDDMFIL</name>
							<description>VDDM Secondary ADC Supply Filter   VDDMFIL</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SWDFIL</name>
							<description>VEXT Secondary ADC Supply Filter   SWDFIL</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SBFIL</name>
							<description>VEVRSB Secondary ADC Supply Filter   SBFIL</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLRFIL</name>
							<description>Clear all Spike Filters   CLRFIL. To avoid spurious alarms during change of configuration or start up         CLRFIL shall be set followed by alarm reconfiguration followed by        activation of filter logic by clearing CLRFIL register bit.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SLCK</name>
							<description>HSM Security Lock   SLCK. If this bit is set  all other bits in this register can no longer be        written. Write requests to other bits when SLCK is set will trigger an        SLCK access error alarm.This bit can not by cleared by software. SLCK        bit can only be set by an access from the HSM master  TAG  160    160 000011 B  .        A set operation performed by any other master or software is ignored and        the bit is kept as cleared.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMSIEN</name>
					<description>PMS Interrupt Enable Register
 resetvalue={LVD Reset:0x0,Cold PORST:0x0}</description>
					<addressOffset>116</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>OVSWD</name>
							<description>OVSWD Interrupt enable   OVSWD. Interrupt triggered on event as configured in EVRMONCTRL register.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UVSWD</name>
							<description>UVSWD Interrupt enable   UVSWD. Interrupt triggered on event as configured in EVRMONCTRL register.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OV33</name>
							<description>OV33 Interrupt enable   OV33. Interrupt triggered on event as configured in EVRMONCTRL register.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UV33</name>
							<description>UV33 Interrupt enable   UV33. Interrupt triggered on event as configured in EVRMONCTRL register.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OVC</name>
							<description>OVC Interrupt enable   OVC. Interrupt triggered on event as configured in EVRMONCTRL register.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UVC</name>
							<description>UVC Interrupt enable   UVC. Interrupt triggered on event as configured in EVRMONCTRL register.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OVPRE</name>
							<description>OVPRE Interrupt enable   OVPRE. Interrupt triggered on event as configured in EVRMONCTRL register.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UVPRE</name>
							<description>UVPRE Interrupt enable   UVPRE. Interrupt triggered on event as configured in EVRMONCTRL register.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OVDDM</name>
							<description>OVDDM Interrupt enable   OVDDM. Interrupt triggered on event as configured in EVRMONCTRL register.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UVDDM</name>
							<description>UVDDM Interrupt enable   UVDDM. Interrupt triggered on event as configured in EVRMONCTRL register.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OVSB</name>
							<description>OVSB Interrupt enable   OVSB. Interrupt triggered on event as configured in EVRMONCTRL register.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UVSB</name>
							<description>UVSB Interrupt enable   UVSB. Interrupt triggered on event as configured in EVRMONCTRL register.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EVRCMOD</name>
							<description>EVRCMOD Interrupt enable   EVRCMOD. Interrupt triggered on a state change of EVRSTAT.EVRCMOD 0  bitfield.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SDVOK</name>
							<description>SDVOK Interrupt enable   SDVOK. Interrupt triggered on EVRSTAT.SDVOK rising edge event.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNCLCK</name>
							<description>SD SYNCLCK Interrupt enable   SYNCLCK. Interrupt triggered on a state change of EVRSTAT.SYNCLCK bitfield.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SWDLVL</name>
							<description>SWDLVL Interrupt enable   SWDLVL. Interrupt triggered on a state change of EVRSTAT.SWDLVL bitfield.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WUTWKP</name>
							<description>WUTWKP Interrupt enable   WUTWKP. Interrupt triggered on a WUTCNT underflow event.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ESR0WKP</name>
							<description>ESR0WKP Interrupt enable   ESR0WKP. Interrupt triggered on a ESR0WKP event.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ESR1WKP</name>
							<description>ESR1WKP Interrupt enable   ESR1WKP. Interrupt triggered on a ESR1WKP event.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PINAWKP</name>
							<description>PINAWKP Interrupt enable   PINAWKP. Interrupt triggered on a PINAWKP event.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PINBWKP</name>
							<description>PINBWKP Interrupt enable   PINBWKP. Interrupt triggered on a PINBWKP event.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SCRINT</name>
							<description>SCRINT Interrupt enable   SCRINT. Interrupt triggered on a SCRINT event triggered by SCR to PMS to decode        information in PMSWCR2.SCRINT register.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SCRRST</name>
							<description>SCRRST Interrupt enable   SCRRST. Interrupt triggered by SCR to PMS on an internal SCR software reset.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SCRECC</name>
							<description>SCRECC Interrupt enable   SCRECC. Interrupt triggered by SCR to PMS on an internal RAM double bit ECC        error.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SCRWDT</name>
							<description>SCRWDT Interrupt enable   SCRWDT. Interrupt triggered by SCR to PMS on an internal SCR watchdog timeout        error.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRUVMON</name>
					<description>EVR Secondary Under voltage Monitor Register
 resetvalue={LVD Reset:0x75A7B8,Cold PORST:0x75A7B8,After SSW execution:0x75A7B8}</description>
					<addressOffset>120</addressOffset>
					<size>32</size>
					<resetValue>7710648</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EVRCUVVAL</name>
							<description>VDD Supply Secondary Monitor Under voltage threshold   EVRCUVVAL. This field defines the under voltage monitoring threshold level of the        EVRC regulator output or VDD supply. Ideal Threshold     VIN  160    160 LSB   160    160 1  Ideal LSB   5.7692  160 mV</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EVR33UVVAL</name>
							<description>VDDP3 Supply Secondary Monitor Under voltage threshold   EVR33UVVAL. This field defines the under voltage monitoring threshold level of the        EVR33 regulator output or VDDP3 supply. Ideal Threshold     VIN  160    160 LSB   160    160 1 . Ideal LSB   15.00  160 mV</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SWDUVVAL</name>
							<description>VEXT Supply Secondary Monitor Under voltage threshold   SWDUVVAL. This field defines the under voltage threshold level of the external        VEXT supply monitor. Ideal Threshold     VIN  160    160 LSB   160    160 1  Ideal LSB   23.077  160 mV.</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SLCK</name>
							<description>HSM Security Lock   SLCK. If this bit is set  all other bits in this register can no longer be        written. Write requests to other bits when SLCK is set will trigger an        SLCK access error alarm.This bit can not by cleared by software. SLCK        bit can only be set by an access from the HSM master  TAG  160    160 000011 B  .        A set operation performed by any other master or software is ignored and        the bit is kept as cleared.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVROVMON</name>
					<description>EVR Secondary Over voltage Monitor Register
 resetvalue={LVD Reset:0x0FEFEFE,Cold PORST:0x0FEFEFE,After SSW execution:0x0FEFEFE}</description>
					<addressOffset>124</addressOffset>
					<size>32</size>
					<resetValue>16711422</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EVRCOVVAL</name>
							<description>VDD Supply Secondary Monitor Over voltage threshold   EVRCOVVAL. This field defines the over voltage monitoring threshold level of the        EVRC regulator output or VDD supply. Ideal Threshold     VIN  160    160 LSB   160    160 1  Ideal LSB   5.7692  160 mV</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EVR33OVVAL</name>
							<description>VDDP3 Supply Secondary Monitor Over voltage threshold   EVR33OVVAL. This field defines the over voltage monitoring threshold level of the        EVR33 regulator output or VDDP3 supply. Ideal Threshold     VIN  160    160 LSB   160    160 1  Ideal LSB   15.00  160 mV</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SWDOVVAL</name>
							<description>VEXT Supply Secondary Monitor Over voltage threshold   SWDOVVAL. This field defines the over voltage threshold level of the external VEXT        supply monitor. Ideal Threshold     VIN  160    160 LSB   160    160 1  Ideal LSB   23.077  160 mV.</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SLCK</name>
							<description>HSM Security Lock   SLCK. If this bit is set  all other bits in this register can no longer be        written. Write requests to other bits when SLCK is set will trigger an        SLCK access error alarm.This bit can not by cleared by software. SLCK        bit can only be set by an access from the HSM master  TAG  160    160 000011 B  .        A set operation performed by any other master or software is ignored and        the bit is kept as cleared.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRUVMON2</name>
					<description>EVR Secondary Under voltage Monitor Register 2
 resetvalue={LVD Reset:0x2A7000BC,Cold PORST:0x2A7000BC,After SSW execution:0x2A7000BC}</description>
					<addressOffset>128</addressOffset>
					<size>32</size>
					<resetValue>711983292</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PREUVVAL</name>
							<description>VDDPD Supply Secondary Monitor Under voltage threshold   PREUVVAL. This field defines the under voltage monitoring threshold level of the        VDDPD supply or EVRPR output. Ideal Threshold     VIN  160    160 LSB   160    160 1  Ideal LSB   5.7692  160 mV</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VDDMUVVAL</name>
							<description>VDDM Supply Secondary Monitor Under voltage threshold   VDDMUVVAL. This field defines the under voltage monitoring threshold level of the        VDDM ADC supply. Ideal Threshold     VIN  160    160 LSB   160    160 1  Ideal LSB   23.077  160 mV</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SBUVVAL</name>
							<description>VEVRSB Supply Secondary Monitor Under voltage threshold   SBUVVAL. This field defines the under voltage threshold level of the external        VEVRSB  3.3V  160    160 5V  standby supply monitor. Ideal Threshold     VIN  160    160 LSB   160    160 1  Ideal LSB   23.077  160 mV.</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VDDMLVLSEL</name>
							<description>VDDM Level Select   VDDMLVLSEL. This field defines the under voltage monitoring threshold level required        by EVADC  160    160 EDSADC modules to differentiate between 5  160 V or 3.3  160 V VDDM        supply level to adjust analog behavior to the actual voltage level. The        6 MSB bits of the ADC result is compared against VDDMLVLSEL with 4 LSB        hysteresis. Ideal Threshold     VIN   LSB    1  Ideal LSB   92.308 mV</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SLCK</name>
							<description>HSM Security Lock   SLCK. If this bit is set  all other bits in this register can no longer be        written. Write requests to other bits when SLCK is set will trigger an        SLCK access error alarm.This bit can not by cleared by software. SLCK        bit can only be set by an access from the HSM master  TAG  160    160 000011 B  .        A set operation performed by any other master or software is ignored and        the bit is kept as cleared.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
