J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>EVROVMON2</name>
					<description>EVR Secondary Over voltage Monitor Register 2
 resetvalue={LVD Reset:0x0FEFEFE,Cold PORST:0x0FEFEFE,After SSW execution:0x0FEFEFE}</description>
					<addressOffset>132</addressOffset>
					<size>32</size>
					<resetValue>16711422</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PREOVVAL</name>
							<description>VDDPD Supply Secondary Monitor Over voltage threshold   PREOVVAL. This field defines the over voltage monitoring threshold level of the        VDDPD supply or EVRPR output. Ideal Threshold     VIN  160    160 LSB   160    160 1  Ideal LSB   5.7692  160 mV</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VDDMOVVAL</name>
							<description>VDDM Supply Secondary Monitor Over voltage threshold   VDDMOVVAL. This field defines the over voltage monitoring threshold level of the        VDDM ADC supply Ideal Threshold     VIN  160    160 LSB   160    160 1  Ideal LSB   23.077  160 mV</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SBOVVAL</name>
							<description>VEVRSB Supply Secondary Monitor Over voltage threshold   SBOVVAL. This field defines the over voltage threshold level of the external        VEVRSB  3.3V  160    160 5V  standby supply monitor. Ideal Threshold     VIN  160    160 LSB   160    160 1  Ideal LSB   23.077  160 mV</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SLCK</name>
							<description>HSM Security Lock   SLCK. If this bit is set  all other bits in this register can no longer be        written. Write requests to other bits when SLCK is set will trigger an        SLCK access error alarm.This bit can not by cleared by software. SLCK        bit can only be set by an access from the HSM master  TAG  160    160 000011 B  .        A set operation performed by any other master or software is ignored and        the bit is kept as cleared.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HSMUVMON</name>
					<description>EVR Primary HSM Under voltage Monitor Register
 resetvalue={LVD Reset:0x5C824D,Cold PORST:0x5C824D,After SSW execution:0x5C824D}</description>
					<addressOffset>136</addressOffset>
					<size>32</size>
					<resetValue>6062669</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EVRCUVVAL</name>
							<description>VDD Supply Primary Monitor Alarm Under voltage threshold   EVRCUVVAL. This field defines the under voltage monitoring threshold level of the        EVRC regulator output or VDD supply.EVRCUVVAL     VDDx   712.5 mV    LSB  LSB   5 mV</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EVR33UVVAL</name>
							<description>VDDP3 Supply Primary Monitor Alarm Under voltage threshold   EVR33UVVAL. This field defines the under voltage monitoring threshold level of the        EVR33 regulator output or VDDP3 supply. EVR33UVVAL     VDDx   937.5 mV    LSB  LSB   15 mV</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SWDUVVAL</name>
							<description>VEXT Supply Primary Monitor Alarm Under voltage threshold   SWDUVVAL. This field defines the under voltage threshold level of the external        VEXT supply monitor. SWDUVVAL     VDDx   1050 mV    LSB  LSB   20 mV</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EVRCOFF</name>
							<description>VDD Primary Monitor UV Alarm Disable   EVRCOFF</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EVR33OFF</name>
							<description>VDDP3 Primary Monitor UV Alarm Disable   EVR33OFF</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SWDOFF</name>
							<description>VEXT Primary Monitor UV Alarm Disable   SWDOFF</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HSMFIL</name>
							<description>HSM Voltage Filter   HSMFIL</description>
							<lsb>27</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SLCK</name>
							<description>HSM Security Lock   SLCK. If this bit is set  all other bits in this register can no longer be        written. Write requests to other bits when SLCK is set will trigger an        SLCK access error alarm.This bit can not by cleared by software. SLCK        bit can only be set by an access from the HSM master  TAG  160    160 000011 B  .        A set operation performed by any other master or software is ignored and        the bit is kept as cleared.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HSMOVMON</name>
					<description>EVR Primary HSM Over voltage Monitor Register
 resetvalue={LVD Reset:0x0E1B586,Cold PORST:0x0E1B586,After SSW execution:0x0E1B586}</description>
					<addressOffset>140</addressOffset>
					<size>32</size>
					<resetValue>14792070</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EVRCOVVAL</name>
							<description>VDD Supply Primary Monitor Alarm Over voltage threshold   EVRCOVVAL. This field defines the over voltage monitoring threshold level of the        EVRC regulator output or VDD supply. EVRCOVVAL     VDDx   712.5 mV    LSB  LSB   5 mV</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EVR33OVVAL</name>
							<description>VDDP3 Supply Primary Monitor Alarm Over voltage threshold   EVR33OVVAL. This field defines the over voltage monitoring threshold level of the        EVR33 regulator output or VDDP3 supply. EVR33OVVAL     VDDx   937.5 mV    LSB  LSB   15 mV</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SWDOVVAL</name>
							<description>VEXT Supply Primary Monitor Alarm Over voltage threshold   SWDOVVAL. This field defines the over voltage threshold level of the external VEXT        supply monitor. SWDOVVAL     VDDx   1050 mV    LSB  LSB   20 mV</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EVRCOFF</name>
							<description>VDD Primary Monitor OV Alarm Disable   EVRCOFF</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EVR33OFF</name>
							<description>VDDP3 Primary Monitor OV Alarm Disable   EVR33OFF</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SWDOFF</name>
							<description>VEXT Primary Monitor OV Alarm Disable   SWDOFF</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SLCK</name>
							<description>HSM Security Lock   SLCK. If this bit is set  all other bits in this register can no longer be        written. Write requests to other bits when SLCK is set will trigger an        SLCK access error alarm.This bit can not by cleared by software. SLCK        bit can only be set by an access from the HSM master  TAG  160    160 000011 B  .        A set operation performed by any other master or software is ignored and        the bit is kept as cleared.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVR33CON</name>
					<description>EVR33 Control Register
 resetvalue={LVD Reset:0x407ED,Cold PORST:0x407ED,After SSW execution:0x407ED}</description>
					<addressOffset>144</addressOffset>
					<size>32</size>
					<resetValue>264173</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SHVH33</name>
							<description>Short to Supply Voltage Threshold x i    SHVH33. This field defines the upper threshold level VDDP3 supply. EVR33 short to supply alarm has the nominal values of SHVH33   4.5V and t33SHHV   3ms. Do not change the reset value SHVH33     VDDx   937.5 mV    LSB  LSB   15 mV</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SHHVEN</name>
							<description>Short to High Detection Enable   SHHVEN</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SHLVEN</name>
							<description>Short to Low Detection Enable   SHLVEN</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SHVL33</name>
							<description>Short to Ground Voltage Threshold x i    SHVL33. This field defines the lower threshold level VDDP3 supply. EVR33 short to ground alarm has the nominal values of SHVL33   1V and t33SHLV   3ms. Do not change the reset value SHVL33     VDDx   937.5 mV    LSB  LSB   15 mV</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SLCK</name>
							<description>HSM Security Lock   SLCK. If this bit is set  all other bits in this register can no longer be        written. Write requests to other bits when SLCK is set will trigger an        SLCK access error alarm.This bit can not by cleared by software. SLCK        bit can only be set by an access from the HSM master  TAG  160    160 000011 B  .        A set operation performed by any other master or software is ignored and        the bit is kept as cleared.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVROSCCTRL</name>
					<description>EVR Oscillator Control Register
 resetvalue={LVD Reset:0x1F,After SSW execution:0x2000001F}</description>
					<addressOffset>160</addressOffset>
					<size>32</size>
					<resetValue>31</resetValue>
					<resetMask>3758096383</resetMask>
					<fields>
						<field>
							<name>OSCFTRIM</name>
							<description>Back up Clock Fine Trim Value   OSCFTRIM. This thermometer coded bit field contains information about the 100MHz        OSC fine trimming. fBACK ftrim     OSCFTRIM    OSCFPTRIM           OSCTRx if OSCTRIMEN 1       LSBFT  MHz  LSBFT   110kHz Back up Clock accuracy is documented in datasheet. It is recommended to        wait 1  160 us after every fine trim step so that the clock source settles at        the new frequency. fBACK ftrim        value is saturated to range of 64.</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OSCFPTRIM</name>
							<description>OSC Fine Trim Signed Value   OSCFPTRIM. This bit field allows device individual trimming of the oscillator trim        value during application. After updating the trim value  a waiting time        of 1  160 us is required for the change to take effect. OSCTRx        is implicitly added to OSCFPTRIM and saturated to range of  32 to 31</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OSCTEMPOFFS</name>
							<description>Oscillator Temperature Offset Coefficient   OSCTEMPOFFS. This bitfield enables the centering function of the HPOSC temperature        coefficient to compensate for technology variations.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OSCTRIMEN</name>
							<description>Dynamic Oscillator Trim Enable   OSCTRIMEN. Based on temperature  Oscillator can be trimmed.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMSWCR0</name>
					<description>Standby and Wake up Control Register 0
 resetvalue={LVD Reset:0x1002D0}</description>
					<addressOffset>180</addressOffset>
					<size>32</size>
					<resetValue>1049296</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>VEXTSTBYEN</name>
							<description>Standby Entry on VEXT Supply ramp down   VEXTSTBYEN. This bit field enables Standby Entry on VEXT supply ramp down. This is        supported only in case Standby domain is supplied separately via VEVRSB        supply pin and VEXT rail is switched off during Standby. The voltage        threshold for entry is configured in EVRUVMON register. Current        configuration is reflected in PMSWSTAT2.VEXTSTBYEN register bit.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VDDSTBYEN</name>
							<description>Standby Entry on VDD Supply ramp down   VDDSTBYEN. This bit field enables Standby Entry on VDD supply ramp down. This is        supported only in case Standby domain is supplied separately via VEVRSB        supply pin and VDD rail is switched off during Standby. The voltage        threshold for entry is configured in EVRUVMON register. Current        configuration is reflected in PMSWSTAT2.VDDSTBYEN register bit.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ESR0DFEN</name>
							<description>ESR0 Digital Filter Enable   ESR0DFEN. This bit activates digital spike filter. If the digital filter  majority        filter of 3 consecutive values  is enabled during normal RUN mode  then        pulses less than 30ns are suppressed and pulses longer than 100ns will        always result in a trigger. If the back up clock is disabled in Standby        mode and filter is running on 70  160 KHz Standby clock  then pulses less        than 5 us are suppressed and pulses longer than 50 us will always result        in a trigger.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ESR0EDCON</name>
							<description>ESR0 Edge Detection Control   ESR0EDCON. This bit field defines the edge of a ESR0 wake up trigger</description>
							<lsb>5</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ESR1DFEN</name>
							<description>ESR1 Digital Filter Enable   ESR1DFEN. This bit activates digital spike filter. If the digital filter  majority        filter of 3 consecutive values  is enabled during normal RUN mode  then        pulses less than 30ns are suppressed and pulses longer than 100ns will        always result in a trigger. If the back up clock is disabled in Standby        mode and filter is running on 70 KHz Standby clock  then pulses less        than 5 us are suppressed and pulses longer than 50 us will always result        in a trigger.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ESR1EDCON</name>
							<description>ESR1 Edge Detection Control   ESR1EDCON. This bit field defines the edge of a ESR1 wake up trigger</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PINADFEN</name>
							<description>PINA Digital Filter Enable   PINADFEN. This bit activates digital spike filter. If the digital filter  majority        filter of 3 consecutive values  is enabled during normal RUN mode  then        pulses less than 40ns are suppressed and pulses longer than 100ns will        always result in a trigger. If the back up clock is disabled in Standby        mode and filter is running on 70 KHz Standby clock  then pulses less        than 5 us are suppressed and pulses longer than 50 us will always result        in a trigger.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PINAEDCON</name>
							<description>PINA Edge Detection Control   PINAEDCON. This bit field defines the edge of a Pin A wake up trigger</description>
							<lsb>11</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PINBDFEN</name>
							<description>PINB Digital Filter Enable   PINBDFEN. This bit activates digital spike filter. If the digital filter  majority        filter of 3 consecutive values  is enabled during normal RUN mode  then        pulses less than 40ns are suppressed and pulses longer than 100ns will        always result in a trigger. If the back up clock is disabled in Standby        mode and filter is running on 70 KHz Standby clock  then pulses less        than 5 us are suppressed and pulses longer than 50 us will always result        in a trigger.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PINBEDCON</name>
							<description>PINB Edge Detection Control   PINBEDCON. This bit field defines the edge of a Pin B wake up trigger</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STBYRAMSEL</name>
							<description>Standby RAM supply in Standby Mode   STBYRAMSEL. This bit field configures the Standby RAM blocks to be kept supplied        during Standby Mode from VDDPD supply rail. The current configuration is        reflected in PMSWSTAT2.STBYRAM bitfield. All other bit combinations are reserved.</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BLNKFIL</name>
							<description>Blanking Filter delay for Wake up   BLNKFIL. This bitfield enables a nominal blanking filter delay time immediately        after Standby entry only after which a valid wake up event is recognized        and reacted upon. The actual delay may vary     160 30  to this nominal        value. Current configuration is reflected in PMSWSTAT2.BLNKFIL bitfield. All other bit combinations are reserved. Incase WUT is used as a          wake up source  the blanking filter should be configured for a period          greater than 3x 70kHz clock cycles.</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ESR0WKEN</name>
							<description>ESR0 Wake up enable from Standby   ESR0WKEN. This bit configures wake up via ESR0 pin from STANDBY mode and current        configuration is reflected in PMSWSTAT2.ESR0WKEN register bit.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ESR1WKEN</name>
							<description>ESR1 Wake up enable from Standby   ESR1WKEN. This bit configures wake up via ESR1 pin from STANDBY mode and current        configuration is reflected in PMSWSTAT2.ESR1WKEN register bit.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PINAWKEN</name>
							<description>Pin A Wake up enable from Standby   PINAWKEN. This bit configures wake up via PINA pin from STANDBY mode and current        configuration is reflected in PMSWSTAT2.PINAWKEN register bit.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PINBWKEN</name>
							<description>Pin B Wake up enable from Standby   PINBWKEN. This bit configures wake up via PINB pin from STANDBY mode and current        configuration is reflected in PMSWSTAT2.PINBWKEN register bit.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PWRWKEN</name>
							<description>Standby Wake up Enable on VEXT Supply ramp up   PWRWKEN. This bit field enables wake up on VEXT supply ramp up after blanking        filter time has expired. This is supported only in case Standby domain        is supplied separately via VEVRSB supply pin and VEXT rail is switched        off during Standby. Current configuration is reflected in        PMSWSTAT2.PWRWKEN register bit.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SCRWKEN</name>
							<description>Standby Controller Wake up enable from Standby   SCRWKEN. This bit configures wake up via SCR from STANDBY mode and current        configuration is reflected in PMSWSTAT2.SCRWKEN register bit.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PORSTWKEN</name>
							<description>PORST pin Wake up enable from Standby   PORSTWKEN. This bit configures wake up via PORST pin from STANDBY mode and current        configuration is reflected in PMSWSTAT2.PORSTWKEN register bit.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WUTWKEN</name>
							<description>WUT Wake up enable from Standby   WUTWKEN. This bit configures wake up via WUT from STANDBY mode and current        configuration is reflected in PMSWSTAT2.WUTWKEN register bit.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
