J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>PMSWCR2</name>
					<description>Standby and Wake up Control Register 2
 resetvalue={LVD Reset:0x4000000}</description>
					<addressOffset>184</addressOffset>
					<size>32</size>
					<resetValue>67108864</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SCRINT</name>
							<description>Data exchange from Standby Controller to PMS main domain.   SCRINT. This bit field allows fast data exchange from SCR to PMS CPUx. The data        maybe read by CPUx consequent to an interrupt from the SCR to decode the        interrupt. Incase SCR is enabled  at the end of the SCR Firmware        routine  a value of 80H is set in SCRINT register to indicate that SCR        has finished executing the startup code.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SCRECC</name>
							<description>SCR RAM ECC error   reset flag   SCRECC. The flag is set by SCR and cleared by explicit write to the register          bit. The flag is not cleared by SCR.While the SCR is being reset          triggered by SCR RAM ECC error  this flag is set and clearing the flag          is not possible for that duration.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SCRWDT</name>
							<description>SCR Watchdog Timer error   reset flag   SCRWDT. The flag is set by SCR and cleared by explicit write to the register          bit. The flag is not cleared by SCR.While the SCR is being reset          triggered by SCR watchdog  this flag is set and clearing the flag is          not possible for that duration.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SCRRST</name>
							<description>SCR Software reset flag   SCRRST. The flag is set by SCR and cleared by explicit write to the register          bit. The flag is not cleared by SCR. While the SCR is being reset          triggered by SCR software  this flag is set and clearing  the flag is not possible for that duration.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TCINT</name>
							<description>Data exchange from PMS main domain to Standby Controller.   TCINT. This bit field allows fast data exchange from PMS to SCR. The data may        be read by SCR consequent to an interrupt request  TCINTREQ  from        PMS CPUx to SCR to decode the interrupt.</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TCINTREQ</name>
							<description>SW Interrupt request from PMS to Standby Controller.   TCINTREQ. Setting this bit triggers an interrupt to the 8 bit Standby controller. The TCINTREQ bit is cleared after SCR has latched the TCINT value and          SCR NMI is issued.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SMURST</name>
							<description>SMU Reset indication flag   SMURST. SCR is explicitly informed in case reset issued by SMU. The flag is          cleared after SCR has latched the signal and SCR NMI is issued.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RST</name>
							<description>Application or System Reset indication flag   RST. SCR is explicitly informed in case of an application or system reset.          The flag is cleared after SCR has latched the signal and SCR NMI is          issued.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMSWCR3</name>
					<description>Standby and Wake up Control Register 3
 resetvalue={LVD Reset:0x0}</description>
					<addressOffset>192</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>WUTREL</name>
							<description>WUT reload value.   WUTREL. The counter starts counting down from WUTREL value. The current value of        counter is indicated in WUTCNT. On WUTCNT underflow  a reload        WUTCNT  160    160 WUTREL takes place in auto reload mode.</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WUTEN</name>
							<description>WUT enable   WUTEN. This bit enables the Wake up Timer. The status bit PMSWSTAT.WUTEN is set        once Wake up Timer is enabled.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BUSY</name>
							<description>Lock Status   LCK. This bit indicates that the register is busy owing to ongoing bus        access. The register can be updated with a new value when BUSY bit is        cleared. The register requires synchronization to the 70kHz clock domain        on a register update.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>WUTDIV</name>
							<description>WUT clock divider   WUTDIV. A write to this register bitfield may trigger immediate update        irrespective of the status of BUSY bit.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WUTMODE</name>
							<description>WUT mode selection   WUTMODE. This bit configures the Wake up Timer mode. The status bit        PMSWSTAT.WUTMODE is respectively updated. A write to this register        bitfield may trigger immediate update irrespective of the status of BUSY        bit.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMSWCR4</name>
					<description>Standby and Wake up Control Register 4
 resetvalue={LVD Reset:0x20,After SSW execution:0x2000020}</description>
					<addressOffset>196</addressOffset>
					<size>32</size>
					<resetValue>32</resetValue>
					<resetMask>4261412863</resetMask>
					<fields>
						<field>
							<name>BPSCRSTREQ</name>
							<description>Standby Controller Reset request enable   SCRSTEN</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SCRSTREQ</name>
							<description>Standby Controller Reset request   SCRSTREQ</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BPPORSTREQ</name>
							<description>Bit Protection for PORSTREQ   PORSTEN</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PORSTREQ</name>
							<description>SCR Reset behavior on warm PORST in Normal RUN   SLEEP mode   PORSTREQ</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SCRCLKSEL</name>
							<description>Default Clock selection on Standby Mode Entry   SCRCLKSEL</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SCRCFG</name>
							<description>Hardware configuration of the 8 bit SCR controller.   SCRCFG. Any change in SCRCFG is followed by a SCRSTREQ reset request of the 8          bit controller to start off in the chosen mode. All other bit          combinations are reserved. Writing to PMSWCR4.SCRCFG with values             USERMODE1 0 will have an immediate effect on the enabling of debug          pins.</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BPSCREN</name>
							<description>Standby Controller Reset request enable   BPSCREN</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SCREN</name>
							<description>Standby Controller Enable request   SCREN. SCR MBIST maybe activated independent of this bit.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMSWCR5</name>
					<description>Standby and Wake up Control Register 5
 resetvalue={LVD Reset:0x0}</description>
					<addressOffset>200</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>BPTRISTREQ</name>
							<description>Bit protection for Tristate request bit  TRISTREQ    BPTRISTREQ. Setting this bit enables that bit TRISTREQ can be changed by a write        operation.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TRISTREQ</name>
							<description>Tristate enable   TRISTREQ. This bit decides whether pads behave as inputs with weak pull up or        tristate on reset assertion de assertion or Standby  Wake up transition.        After supply ramp up or LVD reset  TRISTREQ  160    160    160 HWCFG6.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ESR0TRIST</name>
							<description>ESR0 Tristate enable   ESR0TRIST. This bit configures ESR0 pin behavior either as reset output or tristate        during Standby mode if VEXT is supplied.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PORSTDF</name>
							<description>PORST Digital Filter enable   PORSTDF. This bit field enables additional PORST digital filter    160 tPORSTDF        parameter  160   to provide enhanced immunity against spurious spikes. The filter is implemented over 20 cycles x 40 ns clock which results in        a total delay between 800ns    2   trimmed fback clock  and is active        only in operational mode. In Standby mode  the filter is implemented        over 2 x 70kHz clock such that pulses less than 8 us are suppressed and        pulses longer than 70 us will result in a wake up trigger.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DCDCSYNCO</name>
							<description>DC DC Synchronisation Output. This bitfield enables the synchronisation output to synchronize the external SMPS regulator with respect to the internal EVRC regulator. This enable bit controls the ENPS signal to the port pin  so that the synchronisation signal is also available during active warm PORST phase. If enabled  this signal need to be also routed to HW DIR  amp  HWEN of the port pin.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMSWSTAT</name>
					<description>Standby and Wake up Status Register
 resetvalue={LVD Reset:0x0A0000}</description>
					<addressOffset>212</addressOffset>
					<size>32</size>
					<resetValue>655360</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>HWCFGEVR</name>
							<description>EVR Hardware Configuration status   HWCFGEVR. This bit field indicates the supply configuration latched by the EVR        from HWCFG 2 1  during a cold startup based on which EVRx regulators are        consequently started. The latched configuration is used during        STANDBY RUN transition to reselect EVR mode. The HWCFG pins are latched continuously during a period of 60us as        measure to improve robustness owing to noise injection.</description>
							<lsb>1</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HWCFG4</name>
							<description>Hardware Configuration Pin 4 status   HWCFG4. This bit field indicates the latched level of HWCFG 4  during a cold        startup. The HWCFG pin is latched continuously during a period of 60us as measure        to improve robustness owing to noise injection.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HWCFG5</name>
							<description>Hardware Configuration Pin 5 status   HWCFG5. This bit field indicates the latched level of HWCFG 5  during a cold        startup. The HWCFG pin is latched continuously during a period of 60us as measure        to improve robustness owing to noise injection.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRIST</name>
							<description>Pad Tristate   Pull up status   TRIST. This bit indicates whether pads are configured as inputs with weak        pull up or as tristate during after reset or after wake up. At start up         the value latched from HWCFG 6  pin decides the default state and is        reflected in TRIST status bit. This bit may be later updated when        PMSWCR5.TRISTREQ is set to override initial latched status from HWCFG 6 .</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TESTMODE</name>
							<description>TESTMODE Pin status   TESTMODE. This bit field indicates the latched level of TESTMODE pin during a cold        startup. The HWCFG pin is latched continuously during a period of 60us as measure        to improve robustness owing to noise injection.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ESR0TRIST</name>
							<description>ESR0 pin status during Standby   ESR0TRIST. This bit indicates if ESR0 pin is configured as reset output or tristate        during Standby mode  amp  transitions if VEXT is supplied.This bit is        updated when PMSWCR5. ESR0TRIST is set.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PORSTDF</name>
							<description>PORST Digital Filter status   PORSTDF. This bit field indicates whether additional PORST digital filter is        activated. This bit is updated when PMSWCR5.PORSTDF is set.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SCR</name>
							<description>Standby Controller status   SCR. This bit indicates whether SCR is enabled. This bit is updated when        PMSWCR4.SCREN bit is set.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SCRST</name>
							<description>Standby Controller Reset Indication flag   SCRST. This bit is set after a power on reset as SCR is in reset state. This bit is consequently set when a reset is issued via PMSWCR4.SCRSTREQ bit. This status flag is set on every SCR reset caused by any SCR reset source.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SCRCLK</name>
							<description>Current Clock configuration for SCR before Standby Mode Entry   SCRCLK. This bit is updated when PMSWCR4.SCRCLKSEL bit is set.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PORSTREQ</name>
							<description>Standby Controller Reset on warm PORST   PORSTREQ. This bit is updated when PMSWCR4.PORSTREQ bit is set.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>WUTEN</name>
							<description>WUT Enable status   WUTEN. This bit indicates whether WUT is enabled. This bit is updated when        PMSWCR3.WUTEN bit is updated.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>WUTRUN</name>
							<description>WUT Run status   WUTRUN. This bit indicates whether WUT is currently running. Due to        synchronization to 70 KHz    160 fSB  160   WUT clock  setting of flag after        enable may take up to 55  160 us.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>WUTMODE</name>
							<description>WUT Mode status   WUTMODE. This bit indicates the current WUT mode. This bit is updated when        PMSWCR3.WUTMODE bit is updated.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ESR0INT</name>
							<description>ESR0 Interrupt flag   ESR0INT. In case interrupt was triggered by ESR0 pin event during RUN mode  this        flag is set. The bit shall be cleared explicitly via        PMSWSTATCLR.ESR0INTCLR bit after interrupt is serviced.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ESR1INT</name>
							<description>ESR1 Interrupt flag   ESR1INT. In case interrupt was triggered by ESR1 pin event during RUN mode  this        flag is set. The bit shall be cleared explicitly via        PMSWSTATCLR.ESR1INTCLR bit after interrupt is serviced.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PINAINT</name>
							<description>Pin A Interrupt flag   PINAINT. In case interrupt was triggered by PINA pin event during RUN mode  this        flag is set. The bit shall be cleared explicitly via        PMSWSTATCLR.PINAINTCLR bit after interrupt is serviced.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PINBINT</name>
							<description>Pin B Interrupt flag   PINBINT. In case interrupt was triggered by PINB pin event during RUN mode  this        flag is set. The bit shall be cleared explicitly via        PMSWSTATCLR.PINBINTCLR bit after interrupt is serviced.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
