J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>PMSWSTAT2</name>
					<description>Standby and Wake up Status Register 2
 resetvalue={LVD Reset:0x100000}</description>
					<addressOffset>216</addressOffset>
					<size>32</size>
					<resetValue>1048576</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ESR0WKP</name>
							<description>ESR0 Wake up flag   ESR0WKP. In case wake up was triggered by ESR0 pin during STANDBY  this flag is        set. The bit shall be cleared explicitly after wakeup via        PMSWSTATCLR.ESR0WKPCLR bit before next STANDBY entry.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ESR1WKP</name>
							<description>ESR1 Wake up flag   ESR1WKP. In case wake up was triggered by ESR1 pin during STANDBY  this flag is        set. The bit shall be cleared explicitly after wakeup via        PMSWSTATCLR.ESR1WKPCLR bit before next STANDBY entry.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PINAWKP</name>
							<description>Pin Wake up flag   PINAWKP. In case wake up was triggered by PINA pin during STANDBY  this flag is        set. The bit shall be cleared explicitly after wakeup via        PMSWSTATCLR.PINAWKPCLR bit before next STANDBY entry.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PINBWKP</name>
							<description>Pin B Wake up flag   PINBWKP. In case wake up was triggered by PINB pin during STANDBY  this flag is        set. The bit shall be cleared explicitly after wakeup via        PMSWSTATCLR.PINBWKPCLR bit before next STANDBY entry.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PWRWKP</name>
							<description>Wake up event on VEXT Supply ramp up   PWRWKP. In case wake up was triggered by VEXT ramp up pin during STANDBY  this        flag is set. The bit shall be cleared explicitly after wakeup via        PMSWSTATCLR.PWRWKPCLR bit before next STANDBY entry.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SCRWKP</name>
							<description>SCR Wake up flag   SCRWKP. In case wake up is triggered by SCR to the main controller during        STANDBY  this flag is set. The bit shall be cleared explicitly after        wakeup via PMSWSTATCLR.SCRWKPCLR bit before next STANDBY entry.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PORSTWKP</name>
							<description>PORST Wake up flag   PORSTWKP. In case wake up was triggered by PORST pin during STANDBY  this flag is        set. The bit shall be cleared explicitly after wakeup via        PMSWSTATCLR.PORSTWKPCLR bit before next STANDBY entry.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>WUTWKP</name>
							<description>WUT Wake up flag   WUTWKP. In case wake up was triggered by Wake up timer during STANDBY  this flag        is set. The bit shall be cleared explicitly after wakeup via        PMSWSTATCLR.WUTWKPCLR bit before next STANDBY entry.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ESR0OVRUN</name>
							<description>ESR0 Overrun status flag   ESR0OVRUN. This flag indicates that a consecutive ESR0 wake up event occurred while        ESR0WKP flag was already set during STANDBY. The bit shall be cleared        explicitly after wakeup via PMSWSTATCLR.ESR0OVRUNCLR bit before next        STANDBY entry.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ESR1OVRUN</name>
							<description>ESR1 Overrun status flag   ESR1OVRUN. This flag indicates that a consecutive ESR1 wake up event occurred while        ESR1WKP flag was already set during STANDBY. The bit shall be cleared        explicitly after wakeup via PMSWSTATCLR.ESR1OVRUNCLR bit before next        STANDBY entry.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PINAOVRUN</name>
							<description>Pin A Overrun status flag   PINAOVRUN. This flag indicates that a consecutive PINA wake up event occurred while        PINAWKP flag was already set during STANDBY. The bit shall be cleared        explicitly after wakeup via PMSWSTATCLR.PINAOVRUNCLR bit before next        STANDBY entry.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PINBOVRUN</name>
							<description>Pin B Overrun status flag   PINBOVRUN. This flag indicates that a consecutive PINB wake up event occurred while        PINBWKP flag was already set during STANDBY. The bit shall be cleared        explicitly after wakeup via PMSWSTATCLR.PINBOVRUNCLR bit before next        STANDBY entry.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>VDDSTBYEN</name>
							<description>Standby Entry Enable status on VDD Supply ramp down   VDDSTBYWKEN. This bit indicates that Standby Entry may be triggered on a VDD Supply        undervoltage event  VDDUV . This is supported only when Standby domain        is supplied separately by VEVRSB Standby supply pin.This bit is updated        when PMSWCR0.VDDSTBYWKEN bit is updated.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SCROVRUN</name>
							<description>SCR Overrun status flag   SCROVRUN. This flag indicates that a consecutive SCR wake up event occurred while        SCRWKP flag was already set during STANDBY. The bit shall be cleared        explicitly after wakeup via PMSWSTATCLR.SCROVRUNCLR bit before next        STANDBY entry.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PORSTOVRUN</name>
							<description>PORST Overrun status flag   PORSTOVRUN. This flag indicates that a consecutive PORST wake up event occurred        while PORSTWKP flag was already set during STANDBY. The bit shall be        cleared explicitly after wakeup via PMSWSTATCLR.PORSTOVRUNCLR bit before        next STANDBY entry.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>WUTOVRUN</name>
							<description>WUT Overrun status flag   WUTOVRUN. This flag indicates that a consecutive WUT wake up event occurred while        WUTWKP flag was already set during STANDBY. The bit shall be cleared        explicitly after wakeup via PMSWSTATCLR.WUTOVRUNCLR bit before next        STANDBY entry. WUTREL need to be greater than 10 during Standby mode to        be able to latch consecutive WUT underflow events and update the        WUTOVRRUN register bitfield.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>STBYRAM</name>
							<description>Standby RAM Supply status   STBYRAM. This bit field indicates whether Standby RAM was supplied during Standby        Mode and to infer status after a wake up event. This bit is updated when        PMSWCR0.STBYRAMSEL is set. All other bit combinations are reserved. In case of VDDPD Standby          supply fail or VEVRSB supply fail leading to LVD reset  indicated also          in RSTSTAT.STBYR   the STBYRAM status bit is reset to 000b to indicate          that Standby RAM contents may be corrupted.</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>VEXTSTBYEN</name>
							<description>Standby Entry Enable status on VEXT Supply ramp down   VEXTSTBYWKEN. This bit indicates that Standby Entry may be triggered on a VEXT Supply        undervoltage event  SWDUV . This is supported only when Standby domain        is supplied separately by VEVRSB Standby supply pin.This bit is updated        when PMSWCR0.VEXTSTBYWKEN bit is updated.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>BLNKFIL</name>
							<description>Blanking Filter Delay for VEXT Supply Wake up   BLNKFIL. This bit field indicates the Blanking filter configuration. This bit        field is updated with the value configured in PMSWCR0.BLNKFIL bitfield. All other bit combinations are reserved.</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ESR0WKEN</name>
							<description>ESR0 Wake up enable status   ESR0WKEN. This bit indicates that ESR0 is enabled to trigger wake up from Standby.        This bit is updated when PMSWCR0.ESR0WKEN bit is updated.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ESR1WKEN</name>
							<description>ESR1 Wake up enable status   ESR1WKEN. This bit indicates that ESR1 is enabled to trigger wake up from Standby.        This bit is updated when PMSWCR0.ESR1WKEN bit is updated.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PINAWKEN</name>
							<description>Pin A Wake up enable status   PINAWKEN. This bit indicates that PINA is enabled to trigger wake up from Standby.        This bit is updated when PMSWCR0.PINAWKEN bit is updated.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PINBWKEN</name>
							<description>Pin B Wake up enable status   PINBWKEN. This bit indicates that PINB is enabled to trigger wake up from Standby.        This bit is updated when PMSWCR0.PINBWKEN bit is updated.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PWRWKEN</name>
							<description>Standby Wake up Enable status on VEXT Supply ramp up   PWRWKEN. This bit indicates that VEXT detector is enabled to trigger wake up from        Standby during VEXT supply ramp up after blanking filter time has        expired. This is supported only when Standby domain is supplied        separately by VEVRSB Standby supply pin.This bit is updated when        PMSWCR0.PWRWKEN bit is updated.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SCRWKEN</name>
							<description>Standby Controller Wake up Enable status   SCRWKEN. This bit indicates that SCR is enabled to trigger wake up from Standby.        This bit is updated when PMSWCR0.SCRWKEN bit is updated.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PORSTWKEN</name>
							<description>PORST pin Wake up enable status from Standby   PORSTWKEN. This bit indicates that wake up via PORST pin is enabled during STANDBY        mode. This bit is updated when PMSWCR0. PORSTWKEN bit is updated.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>WUTWKEN</name>
							<description>WUT Wake up enable status   WUTWKEN. This bit indicates that WUT is enabled to trigger wake up from Standby.        This bit is updated when PMSWCR0.WUTWKEN bit is updated.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMSWUTCNT</name>
					<description>Standby WUT Counter Register
 resetvalue={LVD Reset:0x0}</description>
					<addressOffset>220</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>WUTCNT</name>
							<description>WUT counter value.   WUTCNT. The current WUT counter value is indicated in this register bitfield.        The WUTCNT value may have a deviation of 3 additional clock cycles to        the expected counter value owing to synchronization overheads. The WUT        clock is based on standby 70 kHz clock with       160 30  variation. The        counter depending on the mode can run through a RUN to STANDBY to RUN        mode transition without interruption.</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMSWSTATCLR</name>
					<description>Standby and Wake up Status Clear Register
 resetvalue={LVD Reset:0x0}</description>
					<addressOffset>232</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ESR0WKPCLR</name>
							<description>ESR0 Wake up indication flag clear   ESR0WKPCLR</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ESR1WKPCLR</name>
							<description>ESR1 Wake up indication flag clear   ESR1WKPCLR</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PINAWKPCLR</name>
							<description>PINA Wake up indication flag clear   PINAWKPCLR</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PINBWKPCLR</name>
							<description>PINB Wake up indication flag clear   PINBWKPCLR</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PWRWKPCLR</name>
							<description>PWRWKP Wake up indication flag clear   PWRWKPCLR</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SCRWKPCLR</name>
							<description>SCR Wake up indication flag clear   SCRWKPCLR</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PORSTWKPCLR</name>
							<description>PORST Wake up indication flag clear   PORSTWKPCLR</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>WUTWKPCLR</name>
							<description>WUT Wake up indication flag clear   WUTWKPCLR</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ESR0OVRUNCLR</name>
							<description>ESR0 Overrun status indication flag clear   ESR0OVRUNCLR</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ESR1OVRUNCLR</name>
							<description>ESR1 Overrun status indication flag clear   ESR1OVRUNCLR</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PINAOVRUNCLR</name>
							<description>PINA Overrun status indication flag clear   PINAOVRUNCLR</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PINBOVRUNCLR</name>
							<description>PINB Overrun status indication flag clear   PINBOVRUNCLR</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SCROVRUNCLR</name>
							<description>SCR Overrun status indication flag clear   SCROVRUNCLR</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PORSTOVRUNCLR</name>
							<description>PORST Overrun status indication flag clear   PORSTOVRUNCLR</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>WUTOVRUNCLR</name>
							<description>WUT Overrun status indication flag clear   WUTOVRUNCLR</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SCRSTCLR</name>
							<description>Standby controller SCRST indication flag clear   SCRSTCLR</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ESR0INTCLR</name>
							<description>ESR0 Interrupt indication flag clear   ESR0INTCLR</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ESR1INTCLR</name>
							<description>ESR1 Interrupt indication flag clear   ESR1INTCLR</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PINAINTCLR</name>
							<description>PINA Interrupt indication flag clear   PINAINTCLR</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PINBINTCLR</name>
							<description>PINB Interrupt indication flag clear   PINBINTCLR</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDSTAT0</name>
					<description>EVR SD Status Register 0
 resetvalue={LVD Reset:0x0,Cold PORST:0x0}</description>
					<addressOffset>252</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADCFBCV</name>
							<description>Step Down Converter Core Voltage Feedback ADC Conversion Result   ADCFBCV. This bit field indicates the last ADC conversion result of the step down converter feedback ADC measuring VDD core voltage. VIN  xa0    xa0  LSB  xa0    xa0  ADCFBCV  xa0    xa0 EVRTRIM.SDVOUTTRIM    0.7125   xa0 V  xa0    xa0 LSB   5  xa0 mV E.g. 1.20  xa0 V   62   98</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DPWMOUT</name>
							<description>DPWM Control Output Status   DPWMOUT. This bit field reflects the actual PWM output of the controller provided        to the external MOSFET switches.</description>
							<lsb>16</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCTRL0</name>
					<description>EVRC SD Control Register 0
 resetvalue={LVD Reset:0x0F0390001,Cold PORST:0x0F0390001,After SSW execution:0x0F0390001}</description>
					<addressOffset>264</addressOffset>
					<size>32</size>
					<resetValue>4030267393</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SDFREQSPRD</name>
							<description>Frequency Spread Threshold freqsp coeff i    SDFREQSPRD. This bit field defines the additional frequency spread to the nominal        EVRC regulator switching frequency during operation</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SDFREQ</name>
							<description>Regulator Switching Frequency or Over sampling Factor m0osfl fact i m0osfh fact i    SDFREQ. This bit field configures the EVRC regulator switching frequency during        closed loop operation.The switching frequency is equal to  100  160 MHz           SDFREQ 1   value. SDFREQ represents the corresponding over sampling        factor or clock cycles in a period.</description>
							<lsb>16</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NGOFF</name>
							<description>NMOS level during OFF state drvslo ngoff i    NGOFF. This bit field configures the state of N ch. MOSFET driver during        start up and shut down phases.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PGOFF</name>
							<description>PMOS level during OFF state drvslo pgoff i    PGOFF. This bitfield configures the state of Pch. MOSFET driver during start up        and shut down phases.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UP</name>
							<description>Update request for SMPS register values   UP. This bitfield triggers the update of the current register values from        PMS FPI EVRC registers to the local SMPS module registers. It shall be ensured that ALL EVRSDCTRLx and EVRSDCOEFFx registers have        correct and coherent values across the various registers before the        update request is issued. Incase of singular register update  the other        register values should match and be consistent. After a cold PORST  the        UP bit is set as default reset value to ensure that the complete SMPS        regulator parameter set is set back to its reset state. Consequently         the UP bit is reset and a read delivers 0. The parameter update via UP        bit is not allowed in start up and low power mode.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status   LCK. This bit indicates if the register can be updated with a new value or if        the register is locked and a write action from the bus side has no        effect. When UP bit is set to 1  register is locked for shadow register update        and LCK bit is set to 1. Once shadow register update is done  the lock        is released and LCK bit is set to 0.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
