J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>EVRSDCTRL1</name>
					<description>EVRC SD Control Register 1
 resetvalue={LVD Reset:0x086690708,Cold PORST:0x086690708,After SSW execution:0x086690708}</description>
					<addressOffset>268</addressOffset>
					<size>32</size>
					<resetValue>2255030024</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>M0TOFF</name>
							<description>Minimum Off Time m0toff mintof i    M0TOFF. This bitfield configures the minimum off time within one period in        100MHz clock cycle periods during closed loop operation.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0TON</name>
							<description>Minimum On Time m0ton minton i    M0TON. This bitfield configures the minimum on time within one period in 100MHz        clock cycle periods during closed loop operation.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0S0COEFF</name>
							<description>S0 coefficient m0s0 coeff i    M0S0COEFF. This bitfield indicates the S0 coefficient during closed loop operation.</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0DEADBD</name>
							<description>Dead Band m0s0 deadbd i    M0DEADBD. This bitfield specifies the dead band to block the ADC ripple during        closed loop operation.</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0ADCZB</name>
							<description>ADC Zero Bin m0fcfg adczb i    M0ADCZB. This bitfield specifies the zero error bin during closed loop operation.</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0SKIP</name>
							<description>Skip Pulse Threshold m0skip thres i    M0SKIP. This bitfield specifies the threshold to detect a skip pulse condition        during closed loop operation.  N channel MOSFET .</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNCEN</name>
							<description>EVRC Synchronization input enable synci0 en i    SYNCEN. This bitfield enables the input synchronization logic of EVRC SMPS        regulator. When set to 1  the DCDC will start to lock to the external        synchronization input signal. This EVRC Synchronization status is indicated in EVRSTAT.SYNCLCK status        bits.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status   LCK. This bit indicates if the register can be updated with a new value or if        the register is locked and a write action from the bus side has no        effect. When EVRSDCTRL0.UP bit is set to 1  register is locked for shadow        register update and LCK bit is set to 1. Once shadow register update is        done  the lock is released and LCK bit is set to 0.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCTRL2</name>
					<description>EVRC SD Control Register 2
 resetvalue={LVD Reset:0x36033B,Cold PORST:0x36033B,After SSW execution:0x36033B}</description>
					<addressOffset>272</addressOffset>
					<size>32</size>
					<resetValue>3539771</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LPBNDOFFSET</name>
							<description>Low Power Mode Hysteresis OFFSET lpbnd offset i    LPBNDOFFSET. This bitfield defines the turn on threshold in LP mode</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LPBNDWIDTH</name>
							<description>Low Power Mode Hysteresis Band Width lpbnd width i    LPBNDWIDTH. This bitfield defines the turn on threshold in LP mode.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LPLPFCOEFF</name>
							<description>Low Pass Filter Coefficient lplpf coeff i    LPLPFCOEFF. This bit field configures the low pass filter coefficient for the        setting of the turn on threshold of the Sliding function.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SDFREQLP</name>
							<description>Regulator Over sampling Factor m1osfl fact i m1osfh fact i    SDFREQLP. This bitfield configures the EVRC regulator FB ADC sampling period        during low power mode. The switching frequency is not constant.</description>
							<lsb>16</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EVRCMOD</name>
							<description>LPM or PWM EVRC Mode Activation   EVRCMOD. This bit switches operation mode between PWM and LPM mode.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status   LCK. This bit indicates if the register can be updated with a new value or if        the register is locked and a write action from the bus side has no        effect. When EVRSDCTRL0.UP bit is set to 1  register is locked for shadow        register update and LCK bit is set to 1. Once shadow register update is        done  the lock is released and LCK bit is set to 0.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCTRL3</name>
					<description>EVRC SD Control Register 3
 resetvalue={LVD Reset:0x0B690810,Cold PORST:0x0B690810,After SSW execution:0x0B690810}</description>
					<addressOffset>276</addressOffset>
					<size>32</size>
					<resetValue>191432720</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>M1TOFF</name>
							<description>Minimum Off Time m1toff mintof i    M1TOFF. This bitfield configures the minimum off time within one period in        100MHz clock cycle periods during LP mode.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1TON</name>
							<description>Minimum On Time m1ton minton i    M1TON. This bitfield configures the minimum on time within one period in 100MHz        clock cycle periods during LP mode.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1S0COEFF</name>
							<description>S0 coefficient m1s0 coeff i    M1S0COEFF. This bitfield indicates the S0 coefficient during LP mode.</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1DEADBD</name>
							<description>Dead Band m1s0 deadbd i    M1DEADBD. This bitfield specifies the dead band to block the ADC ripple during LP        mode.</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1ADCZB</name>
							<description>ADC Zero Bin m1fcfg adczb i    M1ADCZB. This bitfield specifies the zero error bin during LP mode.</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1SKIP</name>
							<description>Skip Pulse Threshold m1skip thres i    M1SKIP. This bitfield is disabled in LPM mode as PFM applied by control itself.</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCTRL4</name>
					<description>EVRC SD Control Register 4
 resetvalue={LVD Reset:0x360009,Cold PORST:0x360009,After SSW execution:0x360009}</description>
					<addressOffset>280</addressOffset>
					<size>32</size>
					<resetValue>3538953</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>VOKCFG</name>
							<description>Voltage OK Circuit Configuration vokcfg config i    VOKCFG. t.b.d.</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SDFREQST</name>
							<description>Regulator Switching Frequency or Over sampling Factor m2osfl fact i m2osfh fact i    SDFREQST. This bit field configures the EVRC regulator switching frequency during        closed loop start up.The switching frequency is equal to  100  160 MHz          SDFREQ  value. SDFREQ represents the corresponding over sampling factor.</description>
							<lsb>16</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCTRL5</name>
					<description>EVRC SD Control Register 5
 resetvalue={LVD Reset:0x0B690808,Cold PORST:0x0B690808,After SSW execution:0x0B690808}</description>
					<addressOffset>284</addressOffset>
					<size>32</size>
					<resetValue>191432712</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>M2TOFF</name>
							<description>Minimum Off Time m2toff mintof i    M2TOFF. This bitfield configures the minimum off time within one period in        100MHz clock cycle periods during closed loop operation.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2TON</name>
							<description>Minimum On Time m2ton minton i    M2TON. This bitfield configures the minimum on time within one period in 100MHz        clock cycle periods during closed loop operation.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2S0COEFF</name>
							<description>S0 coefficient m2s0 coeff i    M2S0COEFF. This bitfield indicates the S0 coefficient during closed loop operation.</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2DEADBD</name>
							<description>Dead Band m2s0 deadbd i    M2DEADBD. This bitfield specifies the dead band to block the ADC ripple during        closed loop operation.</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2ADCZB</name>
							<description>ADC Zero Bin m2fcfg adczb i    M2ADCZB. This bitfield specifies the zero error bin during closed loop operation.</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2SKIP</name>
							<description>Skip Pulse Threshold m2skip thres i    M2SKIP. This bitfield specifies the threshold to detect a skip pulse condition        during closed loop operation.  N channel MOSFET .</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCTRL6</name>
					<description>EVRC SD Control Register 6
 resetvalue={LVD Reset:0x080231C94,Cold PORST:0x080231C94,After SSW execution:0x080231C94}</description>
					<addressOffset>288</addressOffset>
					<size>32</size>
					<resetValue>2149784724</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SVINTH</name>
							<description>Vin threshold to switch between SINCLO or SINCHI. svinth thres i    SVINTH. This bit field specifies the threshold to decide on the ramp up        increment during startup. If Vin is below the threshold  SINCLO is taken        as ramp up increment  else if Vin is equal or above the threshold         SINCHI is taken as ramp up increment.The threshold is compared to the        FF ADC counter value  without offset.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SVOTH</name>
							<description>Vout threshold to switch from open loop start up to closed loop mode. svoth thres i    SVOTH. This bit field specifies the threshold to decide when to switch from        open loop mode to closed loop mode during startup. If Vout is below the        threshold  open loop ramp up is executed. if Vout is equal or above the        threshold  closed loop PWM in start up configuration is executed. The        threshold is compared to the low pass filtered FB ADC counter value         without offset. The switch happens only in one direction during startup        and the system does not switch back into start up mode even if threshold        is crossed in other direction.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SINCLO</name>
							<description>Increment for low input voltage. sinc sinclo i    SINCLO. This bitfield specifies the increment of the on time during open loop        ramp up during startup. If Vin is below the threshold  SVINTH   SINCLO        is taken as ramp up increment. if Vin is equal or above the threshold         SVINTH   SINCHI is taken as ramp up increment</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SINCHI</name>
							<description>Increment for high input voltage. sinc sinchi i    SINCHI. This bitfield specifies the increment of the on time during open loop        ramp up during startup. If Vin is below the threshold  SVINTH   SINCLO        is taken as ramp up increment. if Vin is equal or above the threshold         SVINTH   SINCHI is taken as ramp up increment</description>
							<lsb>20</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status   LCK. This bit indicates if the register can be updated with a new value or if        the register is locked and a write action from the bus side has no        effect. When EVRSDCTRL0.UP bit is set to 1  register is locked for shadow        register update and LCK bit is set to 1. Once shadow register update is        done  the lock is released and LCK bit is set to 0.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCTRL7</name>
					<description>EVRC SD Control Register 7
 resetvalue={LVD Reset:0x0800000FE,Cold PORST:0x0800000FE,After SSW execution:0x0800000FE}</description>
					<addressOffset>292</addressOffset>
					<size>32</size>
					<resetValue>2147483902</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DRVNI</name>
							<description>Selection of N driver current   DRVNI. Adjustable driver strength of the N driver current</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DRVPCBF</name>
							<description>P Driver Current Boost Factor drvp strgth i    DRVPCBF. Adjustable boost factor for the P driver current</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DRVP</name>
							<description>P Driver Current drvp strgth i    DRVP. Base drive current of the P channel MOSFET when driven with 3.3V  160    160  5V.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DRVSLOMODE</name>
							<description>Switching Configuration drvslo mode i    DRVSLOMODE. This bitfield configure the type of switching.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DRVSPR</name>
							<description>Spare bits drvspr x i    DRVSPR</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNCDIVFAC</name>
							<description>Switching frequency division factor for external synchronisation synco divfac i    SYNCDIVFAC. This bit field defines the divider factor for the SMPS switching output        to generate DCDCSYNCO output to synchronize external regulator to the        internal EVRC regulator. The sigal is routed to pin if enabled via        PMSWCR5.DCDCSYNCO bit. All other combinations are reserved.</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status   LCK. This bit indicates if the register can be updated with a new value or if        the register is locked and a write action from the bus side has no        effect. When EVRSDCTRL0.UP bit is set to 1  register is locked for shadow        register update and LCK bit is set to 1. Once shadow register update is        done  the lock is released and LCK bit is set to 0.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCTRL8</name>
					<description>EVRC SD Control Register 8
 resetvalue={LVD Reset:0x09121048E,Cold PORST:0x09121048E,After SSW execution:0x09121048E}</description>
					<addressOffset>296</addressOffset>
					<size>32</size>
					<resetValue>2434860174</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FBADCOFFS</name>
							<description>Feedback Converted Counter Value Offset fbadc2 offset i    FBADCOFFS. This bitfield configures the offset of the converted counter value of        the feedback ADC measuring the core voltage.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FBADCSMP</name>
							<description>FB ADC Sampling period fbadc1 smpthr i    FBADCSMP. This bitfield configures the sampling period in 100 MHz clock cycles for        the feedback ADC measuring the core voltage.</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FBADCBLNK</name>
							<description>FB ADC Blanked Samples Number fbadc0 blank i    FBADCBLNK. This bitfield configures the number of feedback ADC samples that are        blanked in case of a transition of the PWM drive output to minimise        switching noise influence.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FBADCLPF</name>
							<description>FB ADC Counter LPF Coefficient fbadc0 lpfcnt i    FBADCLPF. This bit field configures the coefficient of the Low Pass Filter of the        feedback ADC counter value measuring the core voltage. y  160  k   160    160    160 y  160  k 1   160    160  1 a   160    160    160    160 x  160  k   160    160 a   160   y  160  k  is filter output         x  160  k  is ADC output a  160    160  1  160    160  2  160    160 LPF  .If LPF  160    160 0  the filter output is the same as ADC        output.</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FBADCERR</name>
							<description>FB ADC Error LPF Coefficient fbadc3 lpferr i    FBADCERR. This bitfield configures the coefficient of the Low Pass Filter of the        output voltage error signal of the feedback ADC.</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FBADCLSB</name>
							<description>FB ADC LSB for Error Computation fbadc3 lsb i    FBADCLSB. This bitfield configures the LSB of the feedback ADC counter value used        for the error computation.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status   LCK. This bit indicates if the register can be updated with a new value or if        the register is locked and a write action from the bus side has no        effect. When EVRSDCTRL0.UP bit is set to 1  register is locked for shadow        register update and LCK bit is set to 1. Once shadow register update is        done  the lock is released and LCK bit is set to 0.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCTRL9</name>
					<description>EVRC SD Control Register 9
 resetvalue={LVD Reset:0x080000434,Cold PORST:0x080000434,After SSW execution:0x080000434}</description>
					<addressOffset>300</addressOffset>
					<size>32</size>
					<resetValue>2147484724</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FFADCOFFS</name>
							<description>Feed Forward Converted Counter Value Offset ffadc1 offset i    FFADCOFFS. This bit field configures the offset of the converted counter value of        the feed forward ADC measuring the input VEXT voltage.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FFADCLPF</name>
							<description>FF ADC Counter LPF Coefficient ffadc0 lpfcnt i    FFADCLPF. This bit field configures the coefficient of the Low Pass Filter of the        feed forward ADC counter value measuring the input VEXT voltage. y  160  k   160    160    160 y  160  k 1   160    160  1 a   160    160    160    160 x  160  k   160    160 a   160   y  160  k  is filter output         x  160  k  is ADC output a  160    160  1  160    160  2  160    160 LPF  .If LPF  160    160 0  the filter output is the same as ADC        output.</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status   LCK. This bit indicates if the register can be updated with a new value or if        the register is locked and a write action from the bus side has no        effect. When EVRSDCTRL0.UP bit is set to 1  register is locked for shadow        register update and LCK bit is set to 1. Once shadow register update is        done  the lock is released and LCK bit is set to 0.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
