J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>EVRSDCTRL10</name>
					<description>EVRC SD Control Register 10
 resetvalue={LVD Reset:0x5A82,Cold PORST:0x5A82,After SSW execution:0x5A82}</description>
					<addressOffset>304</addressOffset>
					<size>32</size>
					<resetValue>23170</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SHVH</name>
							<description>Short to High Voltage Threshold shrth1 shvh i    SHVH. High Voltage Threshold    SDVOUTSEL  160    160 SHVH  160 x  160 5  160 mV . EVRC short to supply        alarm has the nominal values of SHVH of 1.9V and tCSHHV of 3ms.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SHVL</name>
							<description>Short to Low Voltage Threshold shrtl1 shvl i    SHVL. Low Voltage Threshold    SDVOUTSEL  160    160 SHVL  160 x  160 5  160 mV . EVRC short to ground        alarm has the nominal values of SHVL of 0.8V and tCSHLV of 3ms.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SHHVEN</name>
							<description>Short to High Detection Enable shrth0 shhven i    SHHVEN</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SHLVEN</name>
							<description>Short to Low Detection Enable shrtl0 shlven i    SHLVEN</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCTRL11</name>
					<description>EVRC SD Control Register 11
 resetvalue={LVD Reset:0x092070909,Cold PORST:0x092070909,After SSW execution:0x092070909}</description>
					<addressOffset>308</addressOffset>
					<size>32</size>
					<resetValue>2449934601</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DROOPVH</name>
							<description>High VDD Limit for Droop request droopvh thres i    DROOPVH. This bitfield defines the VDD high voltage limit above which a positive        droop request on VDD voltage shall be ignored. VDD Droop High Limit   712.5 mV   LSB    SDVOUTSEL  SDVOUTTRIM         DROOPVH   LSB   5 mV</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DROOPVL</name>
							<description>Low VDD Limit for Droop request droopvl thres i    DROOPVL. This bitfield defines the VDD low voltage limit below which a negative        droop request on VDD voltage shall be ignored. VDD Droop Low Limit   712.5 mV   LSB    SDVOUTSEL  SDVOUTTRIM  DROOPVL          LSB   5 mV</description>
							<lsb>8</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNCMAXDEV</name>
							<description>Maximum Deviation of the Synchronization Input Frequency synci1 maxdev i    SYNCMAXDEV. This bitfield defines the maximum allowed frequency deviation of the        synchronization input signal frequency from the programmed nominal DCDC        switching frequency  EVRSDCTRL0.SDFREQ . For locking         EVRSDCTRL11.SYNCMAXDEV has to be chosen to be greater or equal to the        value of EVRSDCTRL11.SYNCHYST  and unequal to zero. Violation of limit        leads to loss of synchronization.The frequency window is defined as        follows d  160  f MAXDEV   160   100 MHz   2 SYNCMAXDEV            SDFREQ 2 SYNCMAXDEV 2  SYNCMAXDEV  160   round    100 MHz   d  160  f MAXDEV     sqrt   100 MHz   d  160  f MAXDEV   2          SDFREQ 2   </description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNCHYST</name>
							<description>Lock Unlock Hysteresis Window synci0 hyst i    SYNCHYST. This bitfield defines the hysteresis window for synchronization locking        and unlocking. For locking  EVRSDCTRL11.SYNCHYST has to be chosen to be        lower or equal to the value of EVRSDCTRL11.SYNCMAXDEV  and unequal to        zero. The limit is applied to the period counter running at 100 MHz. Upper unlock condition  SDFREQ          SYNCMAXDEV Upper lock condition  SDFREQ          SYNCMAXDEV   SYNCHYST Lower unlock condition   SDFREQ          SYNCMAXDEV Lower lock condition   SDFREQ          SYNCMAXDEV   SYNCHYST SYNCHYST   round   d  160  f HYST    SDFREQ   177  SYNCMAXDEV  2       d  160  f HYST    SDFREQ   177  SYNCMAXDEV    100 MHz  </description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNCMUXSEL</name>
							<description>Synchronisation Input Multiplexer   SYNCMUXSEL. This bitfield selects synchronisation input either from CCU6 or GTM        inputs to be forwarded to EVRC SMPS regulator.</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status   LCK. This bit indicates if the register can be updated with a new value or if        the register is locked and a write action from the bus side has no        effect. When EVRSDCTRL0.UP bit is set to 1  register is locked for shadow        register update and LCK bit is set to 1. Once shadow register update is        done  the lock is released and LCK bit is set to 0.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCOEFF0</name>
					<description>EVRC SD Coefficient Register 0
 resetvalue={LVD Reset:0x0B50873B6,Cold PORST:0x0B50873B6,After SSW execution:0x0B50873B6}</description>
					<addressOffset>328</addressOffset>
					<size>32</size>
					<resetValue>3037230006</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>M0S0EN</name>
							<description>S0 Enable m0en s0en i    M0S0EN. This bitfield enables the fast forward error term.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0S2EN</name>
							<description>S2 Enable m0en s2en i    M0S2EN. This bitfield enables the digital reconstruction of the inductor current.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0S3EN</name>
							<description>S3 Enable m0en s3en i    M0S3EN. This bitfield enables the integrator.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0S3CLIP</name>
							<description>S3 Clip m0en s3clip i    M0S3CLIP. This bitfield specifies the clipping of the integrator state to negative        values.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0S4EN</name>
							<description>S4 Enable m0en s4en i    M0S4EN. This bitfield enables the double integrator branch.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0RAMPEN</name>
							<description>Ramp Enable m0en rampen i    M0RAMPEN. This bitfield enables the artificial ramp in order to avoid        instabilities at high duty cycles.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0SFRGET</name>
							<description>SFRGET m0en sfrget i    M0SFRGET. This bitfield enables the compensation of parasitic effects in the        inductor current reconstruction.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0SKIPEN</name>
							<description>Skip Enable m0en skipen i    M0SKIPEN. This bitfield enables the skip pulse logic.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0S3COEFF</name>
							<description>S3 Coefficient m0s3 coeff i    M0S3COEFF. Configuration register of S3   integrator coefficient.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0S4COEFF</name>
							<description>S4 Coefficient m0s4 coeff i    M0S4COEFF. Configuration register of S4   double integrator coefficient.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0SRMPCOEFF</name>
							<description>S Ramp Coefficient m0srmp coeff i    M0SRMPCOEFF. Configuration register of S Ramp   artificial ramp coefficient.</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0FGETCOEFF</name>
							<description>S2 Forgetting Factor m0fget coeff i    M0FGETCOEFF. This bitfield specifies the forgetting factor for compensation of        parasitic effects.</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0S2COEFF</name>
							<description>S2 Coefficient m0s2 coeff i    M0S2COEFF. Inductor current reconstruction coefficient.</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0S2VINSRC</name>
							<description>S2 Vin Source m0s2 vinsrc i    M0S2VINSRC. This bitfield specifies the source of the input voltage used for the        inductor current reconstruction.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0S2VOSRC</name>
							<description>S2 Vout Source m0s2 vosrc i    M0S2VOSRC. This bitfield specifies the source of the output voltage used for the        inductor current reconstruction.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0SRMPCOEFFFRAC</name>
							<description>S Ramp Fractional Coefficient. This bitfield specifies the S Ramp fractional coefficient.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status   LCK. This bit indicates if the register can be updated with a new value or if        the register is locked and a write action from the bus side has no        effect. When EVRSDCTRL0.UP bit is set to 1  register is locked for shadow        register update and LCK bit is set to 1. Once shadow register update is        done  the lock is released and LCK bit is set to 0.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCOEFF1</name>
					<description>EVRC SD Coefficient Register 1
 resetvalue={LVD Reset:0x0A2946C46,Cold PORST:0x0A2946C46,After SSW execution:0x0A2946C46}</description>
					<addressOffset>332</addressOffset>
					<size>32</size>
					<resetValue>2727636038</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>M0VOCFLPF</name>
							<description>LPF Coefficient m0vocf lpf i    M0VOCFLPF. This bitfield reflects LPF coefficient used in the LPF applied to the        FB ADC counter value or the programmed register value. y  160  k   160    160    160 y  160  k 1   160    160  1 a   160    160    160    160 x  160  k   160    160 a   160   y  160  k  is filter output         x  160  k  is ADC output a  160    160  1  160    160  2  160    160 LPF  .If LPF  160    160 0  the filter output is the same as ADC        output.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0VOCFINC</name>
							<description>Output Voltage Ramp Coefficient m0vocf inc i    M0VOCFINC. This bitfield reflects increment for the output voltage ramp used in the        inductor current reconstruction. Step applied to ramp   2  160    160 M0VOCFINC.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0VOUT</name>
							<description>Digital representation of the target voltage m0vo lb i    M0VOUT. This bitfield can be used for the inductor current reconstruction        instead of the FBADC value.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0VIN</name>
							<description>Digital representation of the input voltage m0vinh vin i m0vinl vin i     M0VIN. This bitfield is used for the inductor current reconstruction instead of        the FFADC value. Absolute value including ADC offset.</description>
							<lsb>16</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0S3COEFFFRAC</name>
							<description>S3 Fractional Coefficient. This bitfield specifies the S3 fractional integrator coefficient. 00   no fractional coefficient used 01 ... fractional coefficient 1 4 used  S3   0.25  10 ... fractional coefficient 1 2 used  S3   0.5  11 ... fractional coefficient 3 4 used  S3   0.75 </description>
							<lsb>27</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0S2COEFFFRAC</name>
							<description>S2 Fractional Coefficient. This bitfield specifies the S2 fractional coefficient of the inductor        current reconstruction coefficient. 00   no fractional coefficient used 01 ... fractional coefficient 1 4 used  S2   0.25  10 ... fractional coefficient 1 2 used  S2   0.5  11 ... fractional coefficient 3 4 used  S2   0.75 </description>
							<lsb>29</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status   LCK. This bit indicates if the register can be updated with a new value or if        the register is locked and a write action from the bus side has no        effect. When EVRSDCTRL0.UP bit is set to 1  register is locked for shadow        register update and LCK bit is set to 1. Once shadow register update is        done  the lock is released and LCK bit is set to 0.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCOEFF2</name>
					<description>EVRC SD Coefficient Register 2
 resetvalue={LVD Reset:0x3408710E,Cold PORST:0x3408710E,After SSW execution:0x3408710E}</description>
					<addressOffset>336</addressOffset>
					<size>32</size>
					<resetValue>872968462</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>M1S0EN</name>
							<description>S0 Enable m1en s0en i    M1S0EN. This bitfield enables the fast forward error term.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1S2EN</name>
							<description>S2 Enable m1en s2en i    M1S2EN. This bitfield enables the digital reconstruction of the inductor current.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1S3EN</name>
							<description>S3 Enable m1en s3en i    M1S3EN. This bitfield enables the integrator.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1S3CLIP</name>
							<description>S3 Clip m1en s3clip i    M1S3CLIP. This bitfield specifies the clipping of the integrator state to negative        values.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1S4EN</name>
							<description>S4 Enable m1en s4en i    M1S4EN. This bitfield enables the double integrator branch.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1RAMPEN</name>
							<description>Ramp Enable m1en rampen i    M1RAMPEN. This bitfield enables the artificial ramp in order to avoid        instabilities at high duty cycles.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1SFRGET</name>
							<description>SFRGET m1en sfrget i    M1SFRGET. This bitfield enables the compensation of parasitic effects in the        inductor current reconstruction.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1SKIPEN</name>
							<description>Skip Enable m1en skipen i    M1SKIPEN. This bitfield enables the skip pulse logic.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1S3COEFF</name>
							<description>S3 Coefficient m1s3 coeff i    M1S3COEFF. Configuration register of S3   integrator coefficient.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1S4COEFF</name>
							<description>S4 Coefficient m1s4 coeff i    M1S4COEFF. Configuration register of S4   double integrator coefficient.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1SRMPCOEFF</name>
							<description>S Ramp Coefficient m1srmp coeff i    M1SRMPCOEFF. Configuration register of S Ramp   artificial ramp coefficient.</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1FGETCOEFF</name>
							<description>S2 Forgetting Factor m1fget coeff i    M1FGETCOEFF. This bitfield specifies the forgetting factor for compensation of        parasitic effects.</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1S2COEFF</name>
							<description>S2 Coefficient m1s2 coeff i    M1S2COEFF. Inductor current reconstruction coefficient.</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1S2VINSRC</name>
							<description>S2 Vin Source m1s2 vinsrc i    M1S2VINSRC. This bitfield specifies the source of the input voltage used for the        inductor current reconstruction.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1S2VOSRC</name>
							<description>S2 Vout Source m1s2 vosrc i    M1S2VOSRC. This bitfield specifies the source of the output voltage used for the        inductor current reconstruction.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCOEFF3</name>
					<description>EVRC SD Coefficient Register 3
 resetvalue={LVD Reset:0x2946C44,Cold PORST:0x2946C44,After SSW execution:0x2946C44}</description>
					<addressOffset>340</addressOffset>
					<size>32</size>
					<resetValue>43281476</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>M1VOCFLPF</name>
							<description>LPF Coefficient m1vocf lpf i    M1VOCFLPF. This bitfield reflects LPF coefficient used in the LPF applied to the        FB ADC counter value or the programmed register value. y  160  k   160    160    160 y  160  k 1   160    160  1 a   160    160    160    160 x  160  k   160    160 a   160   y  160  k  is filter output         x  160  k  is ADC output a  160    160  1  160    160  2  160    160 LPF  .If LPF  160    160 0  the filter output is the same as ADC        output.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1VOCFINC</name>
							<description>Output Voltage Ramp Coefficient m1vocf inc i    M1VOCFINC. This bitfield reflects increment for the output voltage ramp used in the        inductor current reconstruction. Step applied to ramp   2  160    160 M1VOCFINC.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1VOUT</name>
							<description>Digital representation of the target voltage m1vo lb i    M1VOUT. This bitfield can be used for the inductor current reconstruction        instead of the FBADC value.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1VIN</name>
							<description>Digital representation of the input voltage m1vinh vin i m1vinl vin i    M1VIN. This bitfield can be used for the inductor current reconstruction        instead of the FFADC value. Absolute value including ADC offset.</description>
							<lsb>16</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1S3COEFFFRAC</name>
							<description>S3 Fractional Coefficient. This bitfield specifies the S3 fractional integrator coefficient. 00   no fractional coefficient used 01 ... fractional coefficient 1 4 used  S3   0.25  10 ... fractional coefficient 1 2 used  S3   0.5  11 ... fractional coefficient 3 4 used  S3   0.75 </description>
							<lsb>27</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1S2COEFFFRAC</name>
							<description>S2 Fractional Coefficient. This bitfield specifies the S2 fractional coefficient of the inductor        current reconstruction coefficient. 00   no fractional coefficient used 01 ... fractional coefficient 1 4 used  S2   0.25  10 ... fractional coefficient 1 2 used  S2   0.5  11 ... fractional coefficient 3 4 used  S2   0.75 </description>
							<lsb>29</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1SRMPCOEFFFRAC</name>
							<description>S Ramp Fractional Coefficient. This bitfield specifies the S Ramp fractional coefficient.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
