J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>EVRSDCOEFF4</name>
					<description>EVRC SD Coefficient Register 4
 resetvalue={LVD Reset:0x1B0822B6,Cold PORST:0x1B0822B6,After SSW execution:0x1B0822B6}</description>
					<addressOffset>344</addressOffset>
					<size>32</size>
					<resetValue>453518006</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>M2S0EN</name>
							<description>S0 Enable m2en s0en i    M2S0EN. This bitfield enables the fast forward error term.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2S2EN</name>
							<description>S2 Enable m2en s2en i    M2S2EN. This bitfield enables the digital reconstruction of the inductor current.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2S3EN</name>
							<description>S3 Enable m2en s3en i    M2S3EN. This bitfield enables the integrator.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2S3CLIP</name>
							<description>S3 Clip m2en s3clip i    M2S3CLIP. This bitfield specifies the clipping of the integrator state to negative        values.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2S4EN</name>
							<description>S4 Enable m2en s4en i    M2S4EN. This bitfield enables the double integrator branch.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2RAMPEN</name>
							<description>Ramp Enable m2en rampen i    M2RAMPEN. This bitfield enables the artificial ramp in order to avoid        instabilities at high duty cycles.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2SFRGET</name>
							<description>SFRGET m2en sfrget i    M2SFRGET. This bitfield enables the compensation of parasitic effects in the        inductor current reconstruction.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2SKIPEN</name>
							<description>Skip Enable m2en skipen i    M2SKIPEN. This bitfield enables the skip pulse logic.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2S3COEFF</name>
							<description>S3 Coefficient m2s3 coeff i    M2S3COEFF. Configuration register of S3   integrator coefficient.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2S4COEFF</name>
							<description>S4 Coefficient m2s4 coeff i    M2S4COEFF. Configuration register of S4   double integrator coefficient.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2SRMPCOEFF</name>
							<description>S Ramp Coefficient m2srmp coeff i    M2SRMPCOEFF. Configuration register of S Ramp   artificial ramp coefficient.</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2FGETCOEFF</name>
							<description>S2 Forgetting Factor m2fget coeff i    M2FGETCOEFF. This bitfield specifies the forgetting factor for compensation of        parasitic effects.</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2S2COEFF</name>
							<description>S2 Coefficient m2s2 coeff i    M2S2COEFF. Inductor current reconstruction coefficient.</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2S2VINSRC</name>
							<description>S2 Vin Source m2s2 vinsrc i    M2S2VINSRC. This bitfield specifies the source of the input voltage used for the        inductor current reconstruction.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2S2VOSRC</name>
							<description>S2 Vout Source m2s2 vosrc i    M2S2VOSRC. This bitfield specifies the source of the output voltage used for the        inductor current reconstruction.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCOEFF5</name>
					<description>EVRC SD Coefficient Register 5
 resetvalue={LVD Reset:0x2946C46,Cold PORST:0x2946C46,After SSW execution:0x2946C46}</description>
					<addressOffset>348</addressOffset>
					<size>32</size>
					<resetValue>43281478</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>M2VOCFLPF</name>
							<description>LPF Coefficient m2vocf lpf i    M2VOCFLPF. This bitfield reflects LPF coefficient used in the LPF applied to the        FB ADC counter value or the programmed register value. y  160  k   160    160    160 y  160  k 1   160    160  1 a   160    160    160    160 x  160  k   160    160 a   160   y  160  k  is filter output         x  160  k  is ADC output a  160    160  1  160    160  2  160    160 LPF  .If LPF  160    160 0  the filter output is the same as ADC        output.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2VOCFINC</name>
							<description>Output Voltage Ramp Coefficient m2vocf inc i    M2VOCFINC. This bitfield reflects the increment for the output voltage ramp used in        the inductor current reconstruction. Step applied to ramp   2  160    160 M2VOCFINC.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2VOUT</name>
							<description>Digital representation of the target voltage m2vo lb i    M2VOUT. This bitfield can be used for the inductor current reconstruction        instead of the FBADC value.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2VIN</name>
							<description>Digital representation of the input voltage m2vinh vin i m2vinl vin i    M2VIN. This bitfield can be used for the inductor current reconstruction        instead of the FFADC value. Absolute value including ADC offset.</description>
							<lsb>16</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2S3COEFFFRAC</name>
							<description>S3 Fractional Coefficient. This bitfield specifies the S3 fractional integrator coefficient. 00   no fractional coefficient used 01 ... fractional coefficient 1 4 used  S3   0.25  10 ... fractional coefficient 1 2 used  S3   0.5  11 ... fractional coefficient 3 4 used  S3   0.75 </description>
							<lsb>27</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2S2COEFFFRAC</name>
							<description>S2 Fractional Coefficient. This bitfield specifies the S2 fractional coefficient of the inductor        current reconstruction coefficient. 00   no fractional coefficient used 01 ... fractional coefficient 1 4 used  S2   0.25  10 ... fractional coefficient 1 2 used  S2   0.5  11 ... fractional coefficient 3 4 used  S2   0.75 </description>
							<lsb>29</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2SRMPCOEFFFRAC</name>
							<description>S Ramp Fractional Coefficient. This bitfield specifies the S Ramp fractional coefficient.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCOEFF6</name>
					<description>EVRC SD Coefficient Register 6
 resetvalue={LVD Reset:0x080971802,Cold PORST:0x080971802,After SSW execution:0x080971802}</description>
					<addressOffset>352</addressOffset>
					<size>32</size>
					<resetValue>2157385730</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CT5REG0</name>
							<description>Commutation trimming and Slope Control drv5v0 trim i    CT5REG0. Trimming of the commutation parameters of the external driver  5V .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CT5REG1</name>
							<description>Commutation trimming drv5v1 trim i    CT5REG1. Trimming of the commutation parameters of the external driver  5V .</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CT5REG2</name>
							<description>Commutation trimming drv5v2 trim i    CT5REG2. Trimming of the commutation parameters of the external driver  5V .</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status   LCK. This bit indicates if the register can be updated with a new value or if        the register is locked and a write action from the bus side has no        effect. When EVRSDCTRL0.UP bit is set to 1  register is locked for shadow        register update and LCK bit is set to 1. Once shadow register update is        done  the lock is released and LCK bit is set to 0.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCOEFF7</name>
					<description>EVRC SD Coefficient Register 7
 resetvalue={LVD Reset:0x08000D8F7,Cold PORST:0x08000D8F7,After SSW execution:0x08000D8F7}</description>
					<addressOffset>356</addressOffset>
					<size>32</size>
					<resetValue>2147539191</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CT5REG3</name>
							<description>Commutation trimming drv5v3 trim i    CT5REG3. Trimming of the commutation parameters of the external driver  5V .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CT5REG4</name>
							<description>Commutation trimming drv5v4 trim i    CT5REG4. Trimming of the commutation parameters of the external driver  5V .</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status   LCK. This bit indicates if the register can be updated with a new value or if        the register is locked and a write action from the bus side has no        effect. When EVRSDCTRL0.UP bit is set to 1  register is locked for shadow        register update and LCK bit is set to 1. Once shadow register update is        done  the lock is released and LCK bit is set to 0.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCOEFF8</name>
					<description>EVRC SD Coefficient Register 8
 resetvalue={LVD Reset:0x080171002,Cold PORST:0x080171002,After SSW execution:0x080171002}</description>
					<addressOffset>360</addressOffset>
					<size>32</size>
					<resetValue>2148995074</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CT33REG0</name>
							<description>Commutation trimming drv3v0 trim i    CT33REG0. Trimming of the commutation parameters of the external driver  3.3V .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CT33REG1</name>
							<description>Commutation trimming drv3v1 trim i    CT33REG1. Trimming of the commutation parameters of the external driver  3.3V .</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CT33REG2</name>
							<description>Commutation trimming drv3v2 trim i    CT33REG2. Trimming of the commutation parameters of the external driver  3.3V .</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status   LCK. This bit indicates if the register can be updated with a new value or if        the register is locked and a write action from the bus side has no        effect. When EVRSDCTRL0.UP bit is set to 1  register is locked for shadow        register update and LCK bit is set to 1. Once shadow register update is        done  the lock is released and LCK bit is set to 0.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCOEFF9</name>
					<description>EVRC SD Coefficient Register 9
 resetvalue={LVD Reset:0x08000A0AF,Cold PORST:0x08000A0AF,After SSW execution:0x08000A0AF}</description>
					<addressOffset>364</addressOffset>
					<size>32</size>
					<resetValue>2147524783</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CT33REG3</name>
							<description>Commutation trimming drv3v3 trim i    CT33REG3. Trimming of the commutation parameters of the external driver  3.3V .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CT33REG4</name>
							<description>Commutation trimming drv3v4 trim i    CT33REG4. Trimming of the commutation parameters of the external driver  3.3V .</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status   LCK. This bit indicates if the register can be updated with a new value or if        the register is locked and a write action from the bus side has no        effect. When EVRSDCTRL0.UP bit is set to 1  register is locked for shadow        register update and LCK bit is set to 1. Once shadow register update is        done  the lock is released and LCK bit is set to 0.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DTSSTAT</name>
					<description>Die Temperature Sensor Status Register
 resetvalue={LVD Reset:0x0,Cold PORST:0x0}</description>
					<addressOffset>448</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Result of the DTS Measurement   RESULT. This bit field shows the result of the DTS measurement. The value given        is directly related to the die temperature and can be evaluated using        the following formula. T    176 C     RESULT   Gnom    273.15 T   176 K   RESULT  G nom RESULT  G nom    T    176 C    273.15    G nom   T    176 K  G nom   7.505</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DTSLIM</name>
					<description>Die Temperature Sensor Limit Register
 resetvalue={LVD Reset:0x0CD806D6,Cold PORST:0x0CD806D6}</description>
					<addressOffset>456</addressOffset>
					<size>32</size>
					<resetValue>215484118</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LOWER</name>
							<description>Lower Limit   LOWER. This bit field defines the lower limit of the DTS temperature check. The        DTS measurement result is compared against this value and if the        measurement result is less than or equal to the configured LOWER        bitfield value  flag LLU is set.</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LLU</name>
							<description>Lower Limit Underflow   LLU. When this bit is set  a HSM temperature underflow trigger is generated.        When this bit is set the related SMU DTS alarm trigger is generated.        This bit has to be written with zero in order to clear it. Writing a one        has no effect. This bit is set when a DTS measurement is finished and        the result is below the lower limit  i.e. DTSLIM.LOWER .</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UPPER</name>
							<description>Upper Limit   UPPER. This bit field defines the upper limit of the DTS temperature check. The        DTS measurement result is compared against this value and if the        measurement result is greater than or equal to the configured UPPER        bitfield value  flag UOF is set.</description>
							<lsb>16</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SLCK</name>
							<description>HSM Security Lock   SLCK. If this bit is set  all other bits in this register can no longer be        written. Write requests to other bits when SLCK is set will trigger an        SLCK access error alarm.This bit can not by cleared by software. SLCK        bit can only be set by an access from the HSM master  TAG  160    160 000011 B  .        A set operation performed by any other master or software is ignored and        the bit is kept as cleared.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UOF</name>
							<description>Upper Limit Overflow   UOF. When this bit is set  a HSM temperature overflow trigger is generated. When this bit is set  the related SMU DTS alarm trigger is generated. This bit has to be written with zero in order to clear it. Writing a one        has no effect. This bit is set when a DTS measurement is finished and the result is        exceeding the upper limit  i.e. DTSLIM.UPPER .</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OTSS</name>
					<description>OCDS Trigger Set Select Register
 resetvalue={LVD Reset:0x0,Debug Reset:0x0}</description>
					<addressOffset>480</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>OTGB0</name>
							<description>Trigger Set for OTGB0   OTGB0</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OTGB1</name>
							<description>Trigger Set for OTGB1   OTGB1</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OTSC0</name>
					<description>OCDS Trigger Set Control 0 Register
 resetvalue={LVD Reset:0x0,Debug Reset:0x0}</description>
					<addressOffset>484</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>B0LAM</name>
							<description>OTGB0 TS16 ADCMON Low Byte   B0LAM</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>B0HAM</name>
							<description>OTGB0 TS16 ADCMON High Byte   B0HAM</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>B1LAM</name>
							<description>OTGB1 TS16 ADCMON Low Byte   B1LAM</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>B1HAM</name>
							<description>OTGB1 TS16 ADCMON High Byte   B1HAM</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OTSC1</name>
					<description>OCDS Trigger Set Control 1 Register
 resetvalue={LVD Reset:0x0,Debug Reset:0x0}</description>
					<addressOffset>488</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>B0EC</name>
							<description>OTGB0 TS16 EVRCON   B0EC</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>B1EC</name>
							<description>OTGB1 TS16 EVRCON   B1EC</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DMONAD</name>
							<description>OTGB0 TS16 EVRCON DMONAD   DMONAD. The multiplexer signal selection documented in DMONAD coding table.</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SMCDBG</name>
							<description>OTGB0 TS16 EVRCON SMCDBG   SMCDBG. Reserved for future extensions.</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
