J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>ACCEN0</name>
					<description>Access Enable Register 0
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
					<addressOffset>508</addressOffset>
					<size>32</size>
					<resetValue>4294967295</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EN0</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN1</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN2</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN3</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN4</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN5</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN6</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN7</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN8</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN9</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN10</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN11</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN12</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN13</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN14</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN15</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN16</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN17</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN18</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN19</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN20</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN21</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN22</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN23</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN24</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN25</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN26</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN27</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN28</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN29</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN30</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN31</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the PMS kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>AG2i_STDBY[%s]</name>
					<description>Alarm Status Register
 resetvalue={LVD Reset:0x0}</description>
					<addressOffset>392</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SF4</name>
							<description>Status flag for alarm 16 belonging to alarm group i.   SF16</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF5</name>
							<description>Status flag for alarm 16 belonging to alarm group i.   SF16</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF6</name>
							<description>Status flag for alarm 16 belonging to alarm group i.   SF16</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF7</name>
							<description>Status flag for alarm 16 belonging to alarm group i.   SF16</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF8</name>
							<description>Status flag for alarm 16 belonging to alarm group i.   SF16</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF9</name>
							<description>Status flag for alarm 16 belonging to alarm group i.   SF16</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF10</name>
							<description>Status flag for alarm 16 belonging to alarm group i.   SF16</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF11</name>
							<description>Status flag for alarm 16 belonging to alarm group i.   SF16</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF12</name>
							<description>Status flag for alarm 16 belonging to alarm group i.   SF16</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF13</name>
							<description>Status flag for alarm 16 belonging to alarm group i.   SF16</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF14</name>
							<description>Status flag for alarm 16 belonging to alarm group i.   SF16</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SF15</name>
							<description>Status flag for alarm 16 belonging to alarm group i.   SF16</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FSPERR</name>
							<description>Error Pin Fault State Status Bit   FSPERR. The bit indicates that Error pin was set into fault state by the SMU stdby. Reset by setting to 1. If the Error Pins were set in fault state by the SMU stdby  reseting this bit sets the Error Pins back in fault free state</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MONBISTSTAT</name>
					<description>SMU stdby BIST Status Register
 resetvalue={LVD Reset:0x0,Warm PORST:0x0}</description>
					<addressOffset>400</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TSTOK</name>
							<description>SMU stdby BIST ok bit   TSTOK. This status bit indicates that MONBIST test was successful and the        result is as expected.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSTRUN</name>
							<description>SMU stdby BIST run bit   TSTRUN. The status bit indicates that MONBIST test is ongoing.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSTDONE</name>
							<description>SMU stdby BIST done bit   TSTDONE. The status bit indicates that MONBIST test is completed.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SMUERR</name>
							<description>Error found in SMU stdby found by SMU stdby BIST. This status bit indicates that the MONBIST test found an error in the        SMU stdby.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PMSERR</name>
							<description>Error found in PMS SARADC by SMU stdby BIST. This status bit indicates that SMU stdby BIST found an error in the PMS        SARADC.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MONBISTCTRL</name>
					<description>SMU stdby BIST Control Register
 resetvalue={LVD Reset:0x0,Warm PORST:0x0}</description>
					<addressOffset>408</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TSTEN</name>
							<description>SMU stdby alarm BIST enable   TSTEN. If SMUEN in the CMD stdby register is set to 1  setting the TSTEN bit triggers SMU stdby BIST tests to test the alarm path and PMS components. This bit can only be changed if bit BITPROT is set in parallel. This bit is cleared by hardware at the end of the SMU stdby BIST operation.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSTCLR</name>
							<description>SMU stdby BIST flag clear   TSTCLR. Setting this bit enables the clearing of the bitfields TSTOK  TSTDONE  TSTRUN  SMUERR and PMSERR of register MONBISTSTAT.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>BITPROT</name>
							<description>Bit Protection TSTEN   BITPROT. Setting this bit enables that bit TSTEN can be changed in this write        operation. This bit is read as zero.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMD_STDBY</name>
					<description>SMU stdby Command Register
 resetvalue={LVD Reset:0x0,Warm PORST:0x0}</description>
					<addressOffset>412</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SMUEN</name>
							<description>SMU stdby Module Enable   SMUEN. This bit enables SMU stdby to issue a FSP reaction when an alarm is received. Also  SMUEN needs to be set to enter the SMU stdby BIST mode.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FSP0EN</name>
							<description>SMU stdby FSP0 Error pin enable   FSP0EN. This bit enables SMU stdby Error pin function to be able set P33.8 to        fault state.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FSP1EN</name>
							<description>SMU stdby FSP1 Error pin enable   FSP1EN. This bit enables SMU stdby Error pin function to be able set P33.10 to        fault state.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ASCE</name>
							<description>SMU stdby alarm status clear enable   ASCE. This bit controls if a status flag set in an AGx register upon detection        of the alarm event can be cleared by software or not. When ASCE is        enabled  software shall write a 1 to bit position in AGx to clear the        bit  W1C . When a W1C action takes place the ASCE bit is automatically        cleared to 0 by hardware and software shall set the ASCE bit again.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BITPROT</name>
							<description>CMD STDBY register bits protection. Setting this bit enables that bits SMUEN  FSP0EN  FSP1EN or and ASCE can        be changed in this write operation. This bit is read as zero.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>AG2iFSP_STDBY[%s]</name>
					<description>SMU stdby FSP Configuration Register
 resetvalue={LVD Reset:0x0,Warm PORST:0x0}</description>
					<addressOffset>420</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FE4</name>
							<description>Fault signaling configuration flag for alarm 16 belonging to alarm group i.   FE16</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE5</name>
							<description>Fault signaling configuration flag for alarm 16 belonging to alarm group i.   FE16</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE6</name>
							<description>Fault signaling configuration flag for alarm 16 belonging to alarm group i.   FE16</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE7</name>
							<description>Fault signaling configuration flag for alarm 16 belonging to alarm group i.   FE16</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE8</name>
							<description>Fault signaling configuration flag for alarm 16 belonging to alarm group i.   FE16</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE9</name>
							<description>Fault signaling configuration flag for alarm 16 belonging to alarm group i.   FE16</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE10</name>
							<description>Fault signaling configuration flag for alarm 16 belonging to alarm group i.   FE16</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE11</name>
							<description>Fault signaling configuration flag for alarm 16 belonging to alarm group i.   FE16</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE12</name>
							<description>Fault signaling configuration flag for alarm 16 belonging to alarm group i.   FE16</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE13</name>
							<description>Fault signaling configuration flag for alarm 16 belonging to alarm group i.   FE16</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE14</name>
							<description>Fault signaling configuration flag for alarm 16 belonging to alarm group i.   FE16</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE15</name>
							<description>Fault signaling configuration flag for alarm 16 belonging to alarm group i.   FE16</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BITPROT</name>
							<description>AG2iFSP STDBY register bits protection. Setting this bit enables that bits FE z  can be changed in this write        operation. This bit is read as zero.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
