J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>STM1</name>
			<version>100</version>
			<description>STM</description>
			<baseAddress>4026536192</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>256</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CLC</name>
					<description>Clock Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit   DISR. Used for enable disable control of the STM module. f STM is generated by the CCU.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit   DISS. Bit indicates the current status of the STM module.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EDIS</name>
							<description>Sleep Mode Enable Control   EDIS. Used for module sleep mode control.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Module Identification Register
 resetvalue={Application Reset:0x0C007}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>49159</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MODREV</name>
							<description>Module Revision Number   MODREV. MODREV defines the module revision number. The value of a              module revision starts with 01 H  first revision .              Current revision is 0x7.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODTYPE</name>
							<description>Module Type   MODTYPE. This bit field defines the module as a 32 bit module  C0 H</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODNUM</name>
							<description>Module Number Value   MODNUM. This bit field defines the module identification number for the              STM  0068 H</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TIM0</name>
					<description>Timer Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>16</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>STM_31_0</name>
							<description>System Timer Bits  31 0    STM 31 0 . This bit field contains bits  31 0  of the 64 bit STM.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TIM1</name>
					<description>Timer Register 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>20</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>STM_35_4</name>
							<description>System Timer Bits  35 4    STM 35 4 . This bit field contains bits  35 4  of the 64 bit STM.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TIM2</name>
					<description>Timer Register 2
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>24</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>STM_39_8</name>
							<description>System Timer Bits  39 8    STM 39 8 . This bit field contains bits  39 8  of the 64 bit STM.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TIM3</name>
					<description>Timer Register 3
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>28</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>STM_43_12</name>
							<description>System Timer Bits  43 12    STM 43 12 . This bit field contains bits  43 12  of the 64 bit STM.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TIM4</name>
					<description>Timer Register 4
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>32</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>STM_47_16</name>
							<description>System Timer Bits  47 16    STM 47 16 . This bit field contains bits  47 16  of the 64 bit STM.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TIM5</name>
					<description>Timer Register 5
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>36</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>STM_51_20</name>
							<description>System Timer Bits  51 20    STM 51 20 . This bit field contains bits  51 20  of the 64 bit STM.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TIM6</name>
					<description>Timer Register 6
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>40</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>STM_63_32</name>
							<description>System Timer Bits  63 32    STM 63 32 . This bit field contains bits  63 32  of the 64 bit STM.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAP</name>
					<description>Timer Capture Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>44</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>STMCAP_63_32</name>
							<description>Captured System Timer Bits  63 32    STMCAP 63 32 . The capture register STMCAP always captures the STM bits               63 32  when one of the registers TIM0 to TIM6 or TIM0SV is read. This capture operation              is performed in order to enable software to operate with a coherent value of all the 64              STM bits at one time stamp.This bit field contains bits  63 32  of the 64 bit STM. Reading register TIM0SV captures also the read value for                  register TIM6. In this way reading TIM0SV followed by CAPSV delivers the timer                  values for the first read request.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>CMPx[%s]</name>
					<description>Compare Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>48</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CMPVAL</name>
							<description>Compare Value of Compare Register x   CMPVAL. This bit field holds up to 32 bits of the compare value  right adjusted .</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMCON</name>
					<description>Compare Match Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>56</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MSIZE0</name>
							<description>Compare Register Size for CMP0   MSIZE0. This bit field determines the number of bits in register CMP0  starting from bit 0  that are used for the compare operation with the System Timer. ...</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSTART0</name>
							<description>Start Bit Location for CMP0   MSTART0. This bit field determines the lowest bit number of the 64 bit STM that is compared with the content of register CMP0 bit 0. The number of bits to be compared is defined by bit field MSIZE0. ...</description>
							<lsb>8</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIZE1</name>
							<description>Compare Register Size for CMP1   MSIZE1. This bit field determines the number of bits in register CMP1  starting from bit 0  that are used for the compare operation with the System Timer. ...</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSTART1</name>
							<description>Start Bit Location for CMP1   MSTART1. This bit field determines the lowest bit number of the 64 bit STM that is compared with the content of register CMP1 bit 0. The number of bits to be compared is defined by bit field MSIZE1. ...</description>
							<lsb>24</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ICR</name>
					<description>Interrupt Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>60</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CMP0EN</name>
							<description>Compare Register CMP0 Interrupt Enable Control   CMP0EN. This bit enables the compare match interrupt with compare register CMP0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP0IR</name>
							<description>Compare Register CMP0 Interrupt Request Flag   CMP0IR. This bit indicates whether or not a compare match event of compare register CMP0 has occured. CMP0IR can be cleared by software and can be set by software  too  see ISCR register . After a STM reset operation  CMP0IR is immediately set as a result of a compare match event with the reset values of the STM and the compare registers CMP0. This flag does not gate the interrupt generation. i.e.  even if this flag is not cleared  compare match event interrupts are forwarded if CMPxEN is set.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CMP0OS</name>
							<description>Compare Register CMP0 Interrupt Output Selection   CMP0OS. This bit determines the interrupt output that is activated on a compare match event of compare register CMP0.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP1EN</name>
							<description>Compare Register CMP1 Interrupt Enable Control   CMP1EN. This bit enables the compare match interrupt with compare register CMP1.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP1IR</name>
							<description>Compare Register CMP1 Interrupt Request Flag   CMP1IR. This bit indicates whether or not a compare match event of compare register CMP1 has occured. CMP1IR can be cleared by software and can be set by software  too  see ISCR register . After a STM reset operation  CMP1IR is immediately set as a result of a compare match event with the reset values of the STM and the compare register CMP1. This flag does not gate the interrupt generation. i.e.  even if this flag is not cleared  compare match event interrupts are forwarded if CMPxEN is set.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CMP1OS</name>
							<description>Compare Register CMP1 Interrupt Output Selection   CMP1OS. This bit determines the interrupt output that is activated on a compare match event of compare register CMP1.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ISCR</name>
					<description>Interrupt Set Clear Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>64</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CMP0IRR</name>
							<description>Reset Compare Register CMP0 Interrupt Flag   CMP0IRR</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CMP0IRS</name>
							<description>Set Compare Register CMP0 Interrupt Flag   CMP0IRS</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CMP1IRR</name>
							<description>Reset Compare Register CMP1 Interrupt Flag   CMP1IRR</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CMP1IRS</name>
							<description>Set Compare Register CMP1 Interrupt Flag   CMP1IRS</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TIM0SV</name>
					<description>Timer Register 0 Second View
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>80</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>STM_31_0</name>
							<description>System Timer Bits  31 0    STM 31 0 . This bit field contains bits  31 0  of the 64 bit STM.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAPSV</name>
					<description>Timer Capture Register Second View
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>84</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>STMCAP_63_32</name>
							<description>Captured System Timer Bits  63 32    STMCAP 63 32 . The capture register STMCAP always captures the STM bits               63 32  when one of the registers TIM0 to TIM6 or TIM0SV is read. This capture operation              is performed in order to enable software to operate with a coherent value of all the 64              STM bits at one time stamp.This bit field contains bits  63 32  of the 64 bit STM. Reading register TIM0SV captures also the read value for                  register TIM6. In this way reading TIM0SV followed by CAPSV delivers the timer                  values for the first read request.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OCS</name>
					<description>OCDS Control and Status Register
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>232</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SUS</name>
							<description>OCDS Suspend Control   SUS. Controls the sensitivity of STMx to the suspend signal coming from CPUx  CPUxSUSOUT </description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SUS_P</name>
							<description>SUS Write Protection   SUS P. SUS is only written when SUS P is 1  otherwise unchanged. Read as 0.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SUSSTA</name>
							<description>Suspend State   SUSSTA</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRSTCLR</name>
					<description>Kernel Reset Status Clear Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>236</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CLR</name>
							<description>Kernel Reset Status Clear   CLR. Read always as 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRST1</name>
					<description>Kernel Reset Register 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>240</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>Kernel Reset   RST. This reset bit can be used to request for a kernel reset. The kernel reset will be executed if the reset bits of both kernel reset registers is set. The RST bit will be cleared  re set to  0   after the kernel reset was executed.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRST0</name>
					<description>Kernel Reset Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>244</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>Kernel Reset   RST. This reset bit can be used to request for a kernel reset. The kernel reset will be executed if the reset bits of both kernel registers are set. The RST bit will be cleared  re set to  0   by the BPI FPI after the kernel reset was executed.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RSTSTAT</name>
							<description>Kernel Reset Status   RSTSTAT. This bit indicates wether a kernel reset was executed or not. This bit is set by the BPI FPI after the execution of a kernel reset in the same clock cycle both reset bits. This bit can be cleared by writing with  1  to the CLR bit in the related KRSTCLR register.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
