J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>FLAGSCLEAR</name>
					<description>Flags Clear Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>60</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>THC</name>
							<description>Flag Clear Bit   THC. Write of   8220 1  8221  in this bit clears the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TRC</name>
							<description>Flag Clear Bit   TRC. Write of   8220 1  8221  in this bit clears the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RHC</name>
							<description>Flag Clear Bit   RHC. Write of   8220 1  8221  in this bit clears the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RRC</name>
							<description>Flag Clear Bit   RRC. Write of   8220 1  8221  in this bit clears the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FEDC</name>
							<description>Flag Clear Bit   FEDC. Write of   8220 1  8221  in this bit clears the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>REDC</name>
							<description>Flag Clear Bit   REDC. Write of   8220 1  8221  in this bit clears the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TWRQC</name>
							<description>Flag Clear Bit   TWRQC. Write of   8220 1  8221  in this bit clears the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>THRQC</name>
							<description>Flag Clear Bit   THRQC. Write of   8220 1  8221  in this bit clears the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TRRQC</name>
							<description>Flag Clear Bit   TRRQC. Write of   8220 1  8221  in this bit clears the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PEC</name>
							<description>Flag Clear Bit   PEC. Write of   8220 1  8221  in this bit clears the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TCC</name>
							<description>Flag Clear Bit   TCC. Write of   8220 1  8221  in this bit clears the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FEC</name>
							<description>Flag Clear Bit   FEC. Write of   8220 1  8221  in this bit clears the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>HTC</name>
							<description>Flag Clear Bit   HTC. Write of   8220 1  8221  in this bit clears the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RTC</name>
							<description>Flag Clear Bit   RTC. Write of   8220 1  8221  in this bit clears the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>BDC</name>
							<description>Flag Clear Bit   BDC. Write of   8220 1  8221  in this bit clears the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LPC</name>
							<description>Flag Clear Bit   LPC. Write of   8220 1  8221  in this bit clears the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LAC</name>
							<description>Flag Clear Bit   LAC. Write of   8220 1  8221  in this bit clears the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LCC</name>
							<description>Flag Clear Bit   LCC. Write of   8220 1  8221  in this bit clears the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CEC</name>
							<description>Flag Clear Bit   CEC. Write of   8220 1  8221  in this bit clears the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RFOC</name>
							<description>Flag Clear Bit   RFOC. Write of   8220 1  8221  in this bit clears the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RFUC</name>
							<description>Flag Clear Bit   RFUC. Write of   8220 1  8221  in this bit clears the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RFLC</name>
							<description>Flag Clear Bit   RFLC. Write of   8220 1  8221  in this bit clears the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TFOC</name>
							<description>Flag Clear Bit   TFOC. Write of   8220 1  8221  in this bit clears the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TFLC</name>
							<description>Flag Clear Bit   TFLC. Write of   8220 1  8221  in this bit clears the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FLAGSENABLE</name>
					<description>Flags Enable Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>64</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>THE</name>
							<description>Flag Enable Bit   THE. This bit enables the interrupt for the flag at the corresponding        position in the FLAGS register.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TRE</name>
							<description>Flag Enable Bit   TRE. This bit enables the interrupt for the flag at the corresponding position in the FLAGS register.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RHE</name>
							<description>Flag Enable Bit   RHE. This bit enables the interrupt for the flag at the corresponding position in the FLAGS register.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RRE</name>
							<description>Flag Enable Bit   RRE. This bit enables the interrupt for the flag at the corresponding position in the FLAGS register.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FEDE</name>
							<description>Flag Enable Bit   FEDE. This bit enables the interrupt for the flag at the corresponding position in the FLAGS register.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REDE</name>
							<description>Flag Enable Bit   REDE. This bit enables the interrupt for the flag at the corresponding position in the FLAGS register.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PEE</name>
							<description>Flag Enable Bit   PEE. This bit enables the interrupt for the flag at the corresponding position in the FLAGS register.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TCE</name>
							<description>Flag Enable Bit   TCE. This bit enables the interrupt for the flag at the corresponding position in the FLAGS register.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FEE</name>
							<description>Flag Enable Bit   FEE. This bit enables the interrupt for the flag at the corresponding position in the FLAGS register.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HTE</name>
							<description>Flag Enable Bit   HTE. This bit enables the interrupt for the flag at the corresponding        position in the FLAGS register.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RTE</name>
							<description>Flag Enable Bit   RTE. This bit enables the interrupt for the flag at the corresponding position in the FLAGS register.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BDE</name>
							<description>Flag Enable Bit   BDE. This bit enables the interrupt for the flag at the corresponding position in the FLAGS register.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LPE</name>
							<description>Flag Enable Bit   LPE. This bit enables the interrupt for the flag at the corresponding position in the FLAGS register.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LAE</name>
							<description>Flag Enable Bit   LAE. This bit enables the interrupt for the flag at the corresponding        position in the FLAGS register.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LCE</name>
							<description>Flag Enable Bit   LCE. This bit enables the interrupt for the flag at the corresponding        position in the FLAGS register.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CEE</name>
							<description>Flag Enable Bit   CEE. This bit enables the interrupt for the flag at the corresponding position in the FLAGS register.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RFOE</name>
							<description>Flag Enable Bit   RFOE. This bit enables the interrupt for the flag at the corresponding position in the FLAGS register.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RFUE</name>
							<description>Flag Enable Bit   RFUE. This bit enables the interrupt for the flag at the corresponding position in the FLAGS register.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RFLE</name>
							<description>Flag Enable Bit   RFLE. This bit enables the interrupt for the flag at the corresponding position in the FLAGS register.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TFOE</name>
							<description>Flag Enable Bit   TFOE. This bit enables the interrupt for the flag at the corresponding position in the FLAGS register.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TFLE</name>
							<description>Flag Enable Bit   TFLE. This bit enables the interrupt for the flag at the corresponding position in the FLAGS register.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXDATA</name>
					<description>Transmit Data Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>68</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description>Data   DATA. Writing to this bit field writes the content to the TXFIFO  depending on        the write width   8  16 or 32 bit  configured in TXFIFOCON.INW . A        read access to this register returns 0x0.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXDATA</name>
					<description>Receive Data Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>72</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description>Data   DATA. Reading from this bit field takes content from the RXFIFO  depending on        the read width   8  16 or 32 bit  configured in RXFIFOCON.OUTW . A        write access to this register has no effect.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CSR</name>
					<description>Clock Selection Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>76</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CLKSEL</name>
							<description>Baud Rate Logic Clock Select   CLKSEL</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CON</name>
							<description>Clock On Flag   CON. Shows if the clock in the bit time domain is switched on or off. Many        configuration registers can be written only if this bit shows 0  see        header of registers IOCR  BITCON  FRAMECON  BRG  BRD  LINCON  LINBTIMER         LINHTIMER .</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXDATAD</name>
					<description>Receive Data Debug Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>80</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description>Data   DATA. Reading from this bit field takes content from the RXFIFO  depending on        the read width   8  16 or 32 bit  see RXFIFOCON.OUTW   but does not        influence the read pointer of the RXFIFO. A write access to this        register has no effect.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OCS</name>
					<description>OCDS Control and Status
 resetvalue={Debug Reset:0x0,PowerOn Reset:0x0}</description>
					<addressOffset>232</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SUS</name>
							<description>OCDS Suspend Control   SUS. Controls the sensitivity to the suspend signal coming from the OCDS        Trigger Switch  OTGS </description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SUS_P</name>
							<description>SUS Write Protection   SUS P. SUS is only written when SUS P is 1  otherwise unchanged. Read as 0.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SUSSTA</name>
							<description>Suspend State   SUSSTA</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRSTCLR</name>
					<description>Kernel Reset Status Clear Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>236</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CLR</name>
							<description>Kernel Reset Status Clear   CLR. Read always as 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRST1</name>
					<description>Kernel Reset Register 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>240</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>Kernel Reset   RST. This reset bit can be used to request for a kernel reset. The kernel        reset will be executed if the reset bits of both kernel reset registers        is set. The RST bit will be cleared  re set to   180 0  180   by the BPI FPI after the        kernel reset was executed.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRST0</name>
					<description>Kernel Reset Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>244</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>Kernel Reset   RST. This reset bit can be used to request for a kernel reset. The kernel reset will be executed if the reset bits of both kernel registers are set. The RST bit will be cleared  re set to  0   by the BPI FPI after the kernel reset was executed.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RSTSTAT</name>
							<description>Kernel Reset Status   RSTSTAT. This bit indicates wether a kernel reset was executed or not. This bit is set by the BPI FPI after the execution of a kernel reset in the same clock cycle both reset bits. This bit can be cleared by writing with  1  to the CLR bit in the related KRSTCLR register.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
