J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>ASCLIN4</name>
			<version>100</version>
			<description>ASCLIN4</description>
			<baseAddress>4026534400</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>256</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<cluster>
					<name>LIN</name>
					<description>LIN</description>
					<addressOffset>40</addressOffset>
					<register>
						<name>LINCON</name>
						<description>LIN Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CSI</name>
								<description>Checksum Injection   CSI. Defines if the received checksum byte is written into the RXFIFO or not.  See CROSSREFERENCE .</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CSEN</name>
								<description>Hardware Checksum Enable   CSEN. Enables the hardware checksum generation and checking.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MS</name>
								<description>Master Slave Mode   MS. Configures if the module in LIN mode operates as master or as slave.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABD</name>
								<description>Autobaud Detection   ABD. Enables the autobaud detection feature in LIN slave mode. In all other        operating modes of the module  LIN master  ASC  SPI  not effective. If the autobaud detection is disabled  the oscillator precision of the        slave is sufficient   the sync field  byte field and stop bit  is        checked if correct. If not correct  a framing error is triggered.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>LINBTIMER</name>
						<description>LIN Break Timer Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>BREAK</name>
								<description>Break Pulse Generation and Detection   BREAK. In LIN slave mode  this bit field defines the duration of the detection threshold for the break pulse. In LIN master mode  this bit field defines the duration of the transmitted break pulse. The time unit is bit time.</description>
								<lsb>0</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>LINHTIMER</name>
						<description>LIN Header Timer Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>HEADER</name>
								<description>Header Timeout Threshold Value   HEADER. Defines the timer limit in the range of 0 to 255 bit times.</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
				<register>
					<name>CLC</name>
					<description>Clock Control Register
 resetvalue={Application Reset:0x3}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>3</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit   DISR. Used for enable disable control of the module.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit   DISS. Bit indicates the current status of the module.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EDIS</name>
							<description>Sleep Mode Enable Control   EDIS. Used to control module s sleep mode  that is if the sensitivity of the module to the sleep signal is enabled to react to it or disabled to ignore it.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IOCR</name>
					<description>Input and Output Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>268435455</resetMask>
					<fields>
						<field>
							<name>ALTI</name>
							<description>Alternate Input Select   ALTI. Selects the alternate input for the RX signal </description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DEPTH</name>
							<description>Digital Glitch Filter Depth   DEPTH. DEPTH determines the number of port input samples clocked with        microticks that are taken into account for the calculation of the        floating average. The higher the DEPTH is chosen to be  the longer the        glitches that are suppressed and the longer the delay of the input        signal introduced by this filter.</description>
							<lsb>4</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTS</name>
							<description>CTS Select   CTS. Selects the CTS input pin out of maximum four possible.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RCPOL</name>
							<description>RTS CTS Polarity   RCPOL. RCPOL defines the active level or the RTS and CTS signals. Active means        ready clear to send.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPOL</name>
							<description>Clock Polarity in Synchronous Mode   CPOL. CPOL defines the idle level of the clock signal if the module is set in        the SPI mode. The idle level is the level outside the data transmission        time intervals. Default is low level.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SPOL</name>
							<description>Slave Polarity in Synchronous Mode   SPOL. Defines the idle level of the SLSO signal  which is the level outside        the data transmission  leading and trailing time intervals.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LB</name>
							<description>Loop Back Mode   LB. Enables the in module connection of the transmit signal to receive        signal. If Loop back is enabled  the module can be run and tested        without an external connection  in ASC and SPI modes. In LIN mode  loopback should not be used  because the module can be        either master or slave.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTSEN</name>
							<description>Input Signal CTS Enable   CTSEN. Enables the sensitivity of the module to the external CTS signal. If        disabled  the CTS signal is considered being permanently active.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXM</name>
							<description>Receive Monitor   RXM. Shows the status of the receive signal.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXM</name>
							<description>Transmit Monitor   TXM. Shows the status of the transmit signal.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Module Identification Register
 resetvalue={Application Reset:0x0C1C000}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>12697600</resetValue>
					<resetMask>4294967040</resetMask>
					<fields>
						<field>
							<name>MODREV</name>
							<description>Module Revision Number   MODREV. MODREV defines the module revision number. The value of a module revision starts with 01 H  first revision .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODTYPE</name>
							<description>Module Type   MODTYPE. This bit field is C0 H . It defines a 32 bit module.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODNUMBER</name>
							<description>Module Number Value   MODNUMBER. This bit field together with MODTYPE uniquely identifies a module.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXFIFOCON</name>
					<description>TX FIFO Configuration Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>12</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FLUSH</name>
							<description>Flush the transmit FIFO   FLUSH. Write of 1 brings the Tx FIFO in empty state. Write of 0 has no effect.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ENO</name>
							<description>Transmit FIFO Outlet Enable   ENO. Enables the TxFIFO outlet. In SPI and ASC modes  data transmission starts immediately when the data is available  whereas in LIN case the transmission start is controlled by the protocol engine.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FM</name>
							<description>TXFIFO Mode   FM. Selects between the TXFIFO Modes.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INW</name>
							<description>Transmit FIFO Inlet Width   INW. Defines the number of bytes written to the Tx FIFO with one FPI bus write.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INTLEVEL</name>
							<description>FIFO Interrupt Level   INTLEVEL. Defines the filling level that triggers a re fill interrupt or DMA        access. An interrupt is generated when the filling level falls to INTLEVEL or        below  each time when a data byte is taken out of the FIFO. This        behavior corresponds to the Combined Compatibility Mode of interrupt        generation. See also Single Move Mode and Batch Move Mode for two        additional modes.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FILL</name>
							<description>FIFO Filling Level   FILL. Read only bit field containing the current filling level of the FIFO.</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXFIFOCON</name>
					<description>RX FIFO Configuration Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>16</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FLUSH</name>
							<description>Flush the receive FIFO   FLUSH. Write of 1 brings the Rx FIFO in empty state. Write of 0 has no effect.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ENI</name>
							<description>Receive FIFO Inlet Enable   ENI. Enables the receiver and the filling of the Rx FIFO through the shift        register. In LIN slave mode  this bit is set by hardware after the        correct reception of the sync byte. The software can clear this bit        after reception of an foreign ID in order to suppress the reception of        the following response.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FM</name>
							<description>RXFIFO Mode   FM. Selects between the RXFIFO Modes.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OUTW</name>
							<description>Receive FIFO Outlet Width   OUTW. Defines the number of bytes read to the Rx FIFO with one FPI bus read.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INTLEVEL</name>
							<description>FIFO Interrupt Level   INTLEVEL. Defines the filling level that triggers a drain interrupt or DMA access.        An interrupt is generated when the filling level rises to INTLEVEL or        beyond  each time when a data byte is delivered to the FIFO. This        behavior corresponds to the Combined Compatibility Mode of interrupt        generation. See also Single Move Mode and Batch Move Mode for two        additional modes.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FILL</name>
							<description>FIFO Filling Level   FILL. Read only bit field containing the current filling level of the FIFO.</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>BUF</name>
							<description>Receive Buffer Mode   BUF. If this bit is zero  then the RXFIFO behaves normally as described in this document. If this bit is set  the RXFIFO behaves as simple 32 bit one stage RX buffer  which is overwritten with each new received data. The received bits appear in the RXDATA register on the lowest bit locations. The upper locations are padded with zeros.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BITCON</name>
					<description>Bit Configuration Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>20</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PRESCALER</name>
							<description>Prescaling of the Fractional Divider   PRESCALER. Prescaler bit field with values in the range of 0 to 4095  defining        division ratios from 1 to 4096. Used also as a microtick generator for        the input digital filter.</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OVERSAMPLING</name>
							<description>Oversampling Factor   OVERSAMPLING. Defines the bit length in ticks in the range of 1 to 16. The lengths of        1 to 3 are not allowed. The position of the sampling points is shown in CROSSREFERENCE .</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SAMPLEPOINT</name>
							<description>Sample Point Position   SAMPLEPOINT. Programmable in the range of 0 to 15 according to the CROSSREFERENCE . For example  if three sample points at position 7  8  9 are required         this bit field would contain 9. In SPI mode  this bit field   1 defines the length of the first SCLK        half period in ticks. Values equal or higher then the OVERSAMPLING value are forbidden.</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SM</name>
							<description>Sample Mode   SM. Number of samples per bit.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FRAMECON</name>
					<description>Frame Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>24</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>IDLE</name>
							<description>Duration of the IDLE delay   IDLE. Defines the duration of the IDLE delay in bit times. If more characters        are available in the TXFIFO  this is the pause inserted between the        characters. In the SPI mode  this is the idle time between the frames.        In the ASC and LIN mode  this is the pause inserted between transmission        of bytes. Idle also applies to the pause between the header and the        response  response space . The collision detection runs in parallel to the idle delay and in LIN          master mode it may extend the time between two bytes for one bit          length. This effect may occur if the round trip delay including the          digital filter delay is longer than the idle delay. For LIN slave mode          use IDLE 0.</description>
							<lsb>6</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STOP</name>
							<description>Number of Stop Bits   STOP. Defines the number of stop bits in ASC and LIN mode  or the trailing        delay in SPI mode. In ASC mode  standard values are 1 and 2. In LIN        mode  standard value is 1. In SPI mode there is no standard value. Nevertheless  all settings are possible in all modes.</description>
							<lsb>9</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LEAD</name>
							<description>Duration of the Leading Delay   LEAD. Defines the leading delay in bit times in SPI mode. Has no meaning in the ASC mode. In LIN mode  this is a delay inserted between the end of the break and        the start of the sync character.</description>
							<lsb>12</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE</name>
							<description>Mode Selection   MODE. This bit field defines the basic operating mode of the module. In INIT mode  all outputs are at inactive level  and the module does not        respond to the input signals. Changing the mode of the module must be        done by switching first to INIT mode  and then to the other mode. The SCLK signal generated by the module is active only in the SPI mode. The CTS output generated by the module is active only in the ASC mode.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSB</name>
							<description>Shift Direction   MSB. Defines the shift direction of the shift register. Relevant for the SPI mode. In ASC and LIN modes  should be set to zero. Parity bit is shifted out last independently of the shift direction.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CEN</name>
							<description>Collision Detection Enable   CEN. Enables the collision detection mechanism.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PEN</name>
							<description>Parity Enable   PEN. Enables the parity bit attached to the data bits. Parity bit can be used for ASC and SPI protocols. The standard LIN bytes do not use this parity bit.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ODD</name>
							<description>Parity Type   ODD. Defines the type of parity bit attached to the data bits. This setting is valid for all modes of operation  ASC  LIN  SPI .</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DATCON</name>
					<description>Data Configuration Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>28</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DATLEN</name>
							<description>Data Length   DATLEN. Defines the number of bits in a character. In the ASC mode  standard        length is 7  8  or 9 bits. In the SPI mode  there is no standard length. In ASC and SPI modes  any length from 2 to 16 bits is possible  although        not standard for some protocols. In LIN mode  standard length is 8 bits per character. Therefore  this        field defines the number of data bytes of the response.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HO</name>
							<description>Header Only   HO. Defines if the LIN frame shall consist of a header and response or of a header only.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RM</name>
							<description>Response Mode   RM. Defines if the RESPONSE bit field defines a LIN Response or LIN Frame timeout threshold. See CROSSREFERENCE .</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CSM</name>
							<description>Checksum Mode   CSM. Defines if the classic or the enhanced checksum will be calculated by the checksum block.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RESPONSE</name>
							<description>Response Timeout Threshold Value   RESPONSE. Defines the timer limit in the range of 1 to 256 bit times.</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BRG</name>
					<description>Baud Rate Generation Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>32</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DENOMINATOR</name>
							<description>Denominator   DENOMINATOR. Programmed by software  in a range of 0 to 4095.  The setting of 0 is not allowed If the module is used as ASC  SPI  LIN master and LIN slave without autobaud detection  this value determines the baud rate. In slave mode with autobaud detection  it contains the nominal value. For the value measured by the autobaud detection hardware  see the BRD register.</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NUMERATOR</name>
							<description>Numerator   NUMERATOR. Defines the numerator of the fractional divider in a range of 0 to 4095. Programmed by software. The setting of 0 is not allowed.</description>
							<lsb>16</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
