J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>BRD</name>
					<description>Baud Rate Detection Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>36</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LOWERLIMIT</name>
							<description>Lower Limit   LOWERLIMIT. This field defines the 8 most significant bits of the 12 bit compare value. The lower four bits are 1000 . See CROSSREFERENCE .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UPPERLIMIT</name>
							<description>Upper Limit   UPPERLIMIT. This field defines the 8 most significant bits of the 12 bit compare value. The lower four bits are 1000 . See CROSSREFERENCE .</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MEASURED</name>
							<description>Measured Value of 8 bits from Sync Field   MEASURED. This bit field contains the measured value of the duration of 8 bits        form the sync field of the LIN header in microticks. It is automatically        loaded in the denominator of the fractional divider  in case of LIN        slave operation with autobaud detection.</description>
							<lsb>16</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FLAGS</name>
					<description>Flags Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>52</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TH</name>
							<description>Transmit Header End Flag   TH. Signals the HEADER TX END event.  Set by hardware  clear by software. If enabled  a transmit interrupt is triggered.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TR</name>
							<description>Transmit Response End Flag   TR. Signals that RESPONSE TX END event.  Set by hardware  clear by software. If enabled  a transmit interrupt is triggered.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RH</name>
							<description>Receive Header End Flag   RH. Signals that HEADER RX END event.  Set by hardware  clear by software. If enabled  a receive interrupt is triggered.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RR</name>
							<description>Receive Response End Flag   RR. Signals that RESPONSE RX END event.  Set by hardware  clear by software. If enabled  a receive interrupt is triggered.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FED</name>
							<description>Falling Edge from Level 1 to Level 0 Detected   FED. This bit is set by hardware when a falling edge is detected on the RX line.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RED</name>
							<description>Rising Edge from Level 0 to Level 1 Detected   RED. This bit is set by hardware when a rising edge is detected on the RX line.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TWRQ</name>
							<description>Transmit Wake Request Flag   TWRQ. Signals that transmission of wake has been requested. No interrupt triggered. As soon as the wake pulse transmission starts  the bit is cleared by the hardware.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>THRQ</name>
							<description>Transmit Header Request Flag   THRQ. Signals that transmission of header has been requested. No interrupt triggered. As soon as the header transmission starts  the bit is cleared by the hardware.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRRQ</name>
							<description>Transmit Response Request Flag   TRRQ. Signals that transmission of response has been requested. No interrupt triggered. As soon as the response transmission starts  the bit is cleared by the hardware.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PE</name>
							<description>Parity Error Flag   PE. Signals parity error. If enabled  an error interrupt is triggered. Parity error occurs if the internally calculated parity bit is not equal to the received parity bit.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TC</name>
							<description>Transmission Completed Flag   TC. Signals an end of an ASC or SPI frame. This bit is set after the last        stop bit transmission in ASC mode  or after the trailing delay in case        of SPI mode. In LIN mode  if the node is transmitting a header this flag        is set after each transmission break  incl lead  field  Sync field or        PID field. If the node is transmitting a response  this flag is set        after each byte is transmitted. If enabled  an EX interrupt is        triggered. Should be cleared by software.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FE</name>
							<description>Framing Error Flag   FE. Signals framing error. If enabled  an error interrupt is triggered. Framing error occurs if  0  is received at a stop bit position. If autobaud detection is deactivated  then the sync field is checked for framing error.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HT</name>
							<description>Header Timeout Flag   HT. Signals violation of the header duration limit. If enabled  an error interrupt is triggered.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RT</name>
							<description>Response Timeout Flag   RT. Signals violation of the response or frame duration limit as defined in DATCON .RM bit. If enabled  an error interrupt is triggered.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>BD</name>
							<description>Break Detected Flag   BD. Signals a detection of a break pulse. If enabled  an error interrupt is triggered. Slave mode only.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LP</name>
							<description>LIN Parity Error Flag   LP. Signals parity error in the LIN identifier. If enabled  an error interrupt is triggered. Applies to LIN mode only. LIN parity error occurs if the internally calculated parity bits are not equal to the received parity bits.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LA</name>
							<description>LIN Autobaud Detection Error Flag   LA. Signals baudrate outside the range defined by BRD .LOWERLIMIT and BRD .UPPERLIMIT.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LC</name>
							<description>LIN Checksum Error Flag   LC. Signals checksum error when receiving response  if the internally        calculated checksum is different than the received checksum. If enabled         an error interrupt is triggered.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CE</name>
							<description>Collision Detection Error Flag   CE. When transmitting  signals if the transmitted data differs from the received data. If enabled  an error interrupt is triggered in case of a mismatch. Collision detection is mandatory only when supporting LIN version 2.1.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RFO</name>
							<description>Receive FIFO Overflow Flag   RFO. Signals an overflow error. If enabled  an error interrupt is triggered.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RFU</name>
							<description>Receive FIFO Underflow Flag   RFU. Signals an underflow error. If enabled  an error interrupt is triggered.        See also CROSSREFERENCE .</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RFL</name>
							<description>Receive FIFO Level Flag   RFL. This flag signals whenever a RXFIFO fill interrupt is generated based on        RXFIFOCON.FM mode.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TFO</name>
							<description>Transmit FIFO Overflow Flag   TFO. Signals an overflow error. If enabled  an error interrupt is triggered.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TFL</name>
							<description>Transmit FIFO Level Flag   TFL. This flag signals whenever a TXFIFO refill interrupt  if enabled  is        generated based on TXFIFOCON.FM mode.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FLAGSSET</name>
					<description>Flags Set Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>56</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>THS</name>
							<description>Flag Set Bit   THS. Write of   8220 1  8221  in this bit sets the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TRS</name>
							<description>Flag Set Bit   TRS. Write of   8220 1  8221  in this bit sets the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RHS</name>
							<description>Flag Set Bit   RHS. Write of   8220 1  8221  in this bit sets the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RRS</name>
							<description>Flag Set Bit   RRS. Write of   8220 1  8221  in this bit sets the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FEDS</name>
							<description>Flag Set Bit   FEDS. Write of   8220 1  8221  in this bit sets the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>REDS</name>
							<description>Flag Set Bit   REDS. Write of   8220 1  8221  in this bit sets the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TWRQS</name>
							<description>Flag Set Bit   TWRQS. Write of   8220 1  8221  in this bit sets the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>THRQS</name>
							<description>Flag Set Bit   THRQS. Write of   8220 1  8221  in this bit sets the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TRRQS</name>
							<description>Flag Set Bit   TRRQS. Write of   8220 1  8221  in this bit sets the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PES</name>
							<description>Flag Set Bit   PES. Write of   8220 1  8221  in this bit sets the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TCS</name>
							<description>Flag Set Bit   TCS. Write of   8220 1  8221  in this bit sets the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FES</name>
							<description>Flag Set Bit   FES. Write of   8220 1  8221  in this bit sets the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>HTS</name>
							<description>Flag Set Bit   HTS. Write of   8220 1  8221  in this bit sets the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RTS</name>
							<description>Flag Set Bit   RTS. Write of   8220 1  8221  in this bit sets the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>BDS</name>
							<description>Flag Set Bit   BDS. Write of   8220 1  8221  in this bit sets the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LPS</name>
							<description>Flag Set Bit   LPS. Write of   8220 1  8221  in this bit sets the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LAS</name>
							<description>Flag Set Bit   LAS. Write of   8220 1  8221  in this bit sets the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LCS</name>
							<description>Flag Set Bit   LCS. Write of   8220 1  8221  in this bit sets the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CES</name>
							<description>Flag Set Bit   CES. Write of   8220 1  8221  in this bit sets the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RFOS</name>
							<description>Flag Set Bit   RFOS. Write of   8220 1  8221  in this bit sets the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RFUS</name>
							<description>Flag Set Bit   RFUS. Write of   8220 1  8221  in this bit sets the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RFLS</name>
							<description>Flag Set Bit   RFLS. Write of   8220 1  8221  in this bit sets the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TFOS</name>
							<description>Flag Set Bit   TFOS. Write of   8220 1  8221  in this bit sets the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TFLS</name>
							<description>Flag Set Bit   TFLS. Write of   8220 1  8221  in this bit sets the bit at the corresponding position in        the FLAGS register.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
