J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>ERAY0</name>
			<version>100</version>
			<description>ERAY</description>
			<baseAddress>4026646528</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>2304</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CLC</name>
					<description>Clock Control Register
 resetvalue={Application Reset:0x3}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>3</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit   DISR. Used for enable disable control of the module. This bit disables the kernel clocks f CLC ERAY and the sampling clock f SCLK .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit   DISS. Bit indicates the current status of the module.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EDIS</name>
							<description>External Sleep Mode Request Disable Bit   EDIS. Used to control module  8217 s sleep mode. If this bit is cleared the kernel clock f CLC ERAY and the sampling clock f SCLK are disabled during System Sleep Mode.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RMC</name>
							<description>Clock Divider in Run Mode   RMC. This bit field is not affected by an application reset. This bit field only controls the kernel clock f CLC ERAY and not the sampling clock f SCLK .</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CUST1</name>
					<description>Busy and Input Buffer Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>INT0</name>
							<description>CIF Timeout Service Request Status   INT0. INT0 will be set if a timeout has occurred during the auto delay scheme        and must be reset by writing zero to INT0. Software can also set this        bit field. In case hardware sets INT0 and at the same point of time software          clears INT0  INT0 is cleared.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OEN</name>
							<description>Enable auto delay scheme for Output Buffer Control Register  OBCR    OEN. This control bit controls the delay scheme for Output Buffer Control        Register  OBCR  read accesses.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IEN</name>
							<description>Enable auto delay scheme for Input Buffer Control Register  IBCR    IEN. This control bit controls the auto delay scheme for Input Buffer Control Register  IBCR  read accesses.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IBFS</name>
							<description>Input Buffer Status Register   IBFS. This status bit  eray mhd signal  ifb ifb1 2n  indicates which of the two Input Buffer RAMs  IBF  is accessible by the host  via CIF  as Input Buffer. The other non accessible buffer RAM is currently used as shadow buffer RAM by the ERAY message handler and therefore not accessible by the host. After reset  it is set by hardware.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IBF1PAG</name>
							<description>Input Buffer 1 Page Select Register   IBF1PAG. This control bit selects if the upper page or lower page of Input Buffer 1  IBF1  currently active. Write is only possible  if Input Buffer RAM 1 is currently accessible by the host  via CIF  and therefore IBFS set.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IBF2PAG</name>
							<description>Input Buffer 2 Page Select Register   IBF2PAG. This control bit selects if the upper page or lower page of Input Buffer 2  IBF2  currently active. Write is only possible  if Input Buffer RAM 2 is currently accessible by the host  via CIF  and therefore IBFS cleared.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RISA</name>
							<description>Receive Input Select Channel A   RISA</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RISB</name>
							<description>Receive Input Select Channel B   RISB</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STPWTS</name>
							<description>Stop Watch Trigger Input Select   STPWTS</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Module Identification Register
 resetvalue={Application Reset:0x44C000}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>4505600</resetValue>
					<resetMask>4294967040</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision Number   MOD REV. MOD REV defines the module revision number. The value of a module revision starts with 01 H  first revision .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type   MOD TYPE. The value of this bit field is C0 H . It defines the module as a 32 bit module.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number Value   MOD NUMBER. This bit field defines a module identification number. For the E Ray module the module identification number is 44 H .</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CUST3</name>
					<description>Customer Interface Timeout Counter Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>12</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TO</name>
							<description>CIF Timeout Reload Value   TO. The 32 bit down counter reload  start up  value must be setup for the automatic delay scheme.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TEST1</name>
					<description>Test Register 1
 resetvalue={Application Reset:0x300}</description>
					<addressOffset>16</addressOffset>
					<size>32</size>
					<resetValue>768</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>WRTEN</name>
							<description>Write Test Register Enable   WRTEN. Enables write access to the test registers. To set the bit from 0 to 1        the test mode key has to be written as defined on   8220 Lock Register  8221 . The        unlock sequence is not required when TEST1.WRTEN is kept at 1 while        other bits of the register are changed. The bit can be reset to 0 at any        time.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ELBE</name>
							<description>External Loop Back Enable   ELBE. There are two possibilities to perform a loop back test. External loop back via physical layer or internal loop back for in system self test  default . In case of an internal loop back pins TXENA and TXENB are in their inactive state  pins TXDA and TXDB are set to HIGH  pins RXDA and RXDB are not evaluated. Bit ELBE is evaluated only when POC is in loop back mode and test multiplexer control is in non multiplexed mode TMC   00.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TMC</name>
							<description>Test Multiplexer Control   TMC</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AOA</name>
							<description>Activity on A   AOA. The channel idle condition is specified in the FlexRay  protocol spec v2.1  chapter 3  BITSTRB process  zChannelIdle .</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AOB</name>
							<description>Activity on B   AOB. The channel idle condition is specified in the FlexRay  8482  protocol spec        v2.1  chapter 3  BITSTRB process  zChannelIdle .</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXA</name>
							<description>Read Channel A Receive Pin   RXA. This bit field shows the current logic state of RXDA.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXB</name>
							<description>Read Channel B Receive Pin   RXB. This bit field shows the current logic state of RXDB.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXA</name>
							<description>Read or Write to Channel A Transmit Pin   TXA. A write to this bit field sets the TXDA to corresponding logic state. A        read from this bit field shows the current logic state of TXDA.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXB</name>
							<description>Read or Write to Channel B Transmit Pin   TXB. A write to this bit field sets the TXDB to corresponding logic state. A        read from this bit field shows the current logic state of TXDB.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXENA</name>
							<description>Read or Write to Channel A Transmit Enable Pin   TXENA. A write to this bit field sets the TXENA to corresponding logic state. A        read from this bit field shows the current logic state of TXENA.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXENB</name>
							<description>Read or Write to Channel B Transmit Enable Pin   TXENB. A write to this bit field sets the TXENB to corresponding logic state. A        read from this bit field shows the current logic state of TXENB.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CERA</name>
							<description>Coding Error Report Channel A   CERA. Set when a coding error is detected on channel A. Reset to zero when        register TEST1 is read or written. Once the CERA is set it will remain        unchanged until the Host accesses the TEST1 register. Other combinations are reserved.</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CERB</name>
							<description>Coding Error Report Channel B    CERB. Set when a coding error is detected on channel B. Reset to zero when        register TEST1 is read or written. Once the CERB is set it will remain        unchanged until the Host accesses the TEST1 register. Other combinations are reserved.</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TEST2</name>
					<description>Test Register 2
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>20</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RS</name>
							<description>RAM Select   RS. In RAM Test mode the RAM blocks selected by RS are mapped to module        address 0000  160 0400 H to 0000  160 07FF H  1024 byte addresses .</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SSEL</name>
							<description>Segment Select   SSEL. To enable access to the complete Message RAM  8192 byte addresses  the        Message RAM is segmented.</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WRECC</name>
							<description>Write ECC Data Enable   WRECC. Content of ECCW is transferred to the RAM  Test mode must be entered. See   8220 Test Register 1  8221 </description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LCK</name>
					<description>Lock Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>28</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CLK</name>
							<description>Configuration Lock Key   CLK. To leave  CONFIG  state by writing to SUCC1.CMD commands READY  MONITOR MODE  ATM  LOOP BACK  in the SUC Configuration Register 1  the write operation has to be directly preceded by two consecutive write accesses to the Configuration Lock Key  unlock sequence . If the write sequence below is interrupted by other write accesses between the second write to the Configuration Lock Key and the write access to the SUCC1 register  the Communication Controller remains in  CONFIG  state and the sequence has to be repeated. First write  LCK.CLK   CE H   1100 1110 B Second write  LCK.CLK   31 H   0011 0001 B Third write  SUCC1.CMD Returns 0 if read</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TMK</name>
							<description>Test Mode Key   TMK. To set bit TEST1.WRTEN the write operation has to be directly preceded by two consecutive write accesses to the Test Mode Key. If the write sequence is interrupted by other write accesses between the second write to the Test Mode Key and the write access to the Test1 register  bit TEST1.WRTEN is not set to 1 and the sequence has to be repeated. First write  LCK.TMK   75 H   0111 0101 B Second write  LCK.TMK   8A H   1000 1010 B Second write  TEST1.WRTEN   1 Returns 0 if read</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EIR</name>
					<description>Error Service Request Select Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>32</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PEMC</name>
							<description>POC Error Mode Changed   PEMC. This flag is set whenever the error mode signalled by CCEV.ERRM in the        Communication Controller Error Vector register has changed. This flag is cleared by writing a 1.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CNA</name>
							<description>Command Not Accepted   CNA. The flag signals that the write access to the CHI command vector        SUCC1.CMD in the SUC Configuration Register 1 was not successful because        the requested command was not valid in the actual POC state  or because        the CHI command was locked  CCL   1 . This flag is cleared by writing a 1.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SFBM</name>
							<description>SYNC Frames Below Minimum   SFBM. This flag signals that the number of SYNC Frames received during the        last communication cycle was below the limit required by the FlexRay  8482         protocol. May be set during startup and therefore should be cleared by        the Host after the Communication Controller entered   8220 NORMAL ACTIVE  8221         state. This flag is cleared by writing a 1.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SFO</name>
							<description>SYNC Frame Overflow   SFO. Set when either the number of SYNC Frames received during the last        communication cycle or the total number of SYNC Frames received during        the last double cycle exceeds the maximum number of SYNC Frames as        defined by GTUC02.SNM in the GTU Configuration Register  160 2. This flag is cleared by writing a 1.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CCF</name>
							<description>Clock Correction Failure   CCF. This flag is set at the end of the cycle whenever one of the following        errors occurred  Missing offset and   or rate correction Clock Correction limit reached The clock correction status is monitored in registers CCEV and SFS. A        failure may occur during startup  therefore bit CCF should be cleared by        the Host after the Communication Controller entered   8220 NORMAL ACTIVE  8221         state. This flag is cleared by writing a 1.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CCL</name>
							<description>CHI Command Locked   CCL. The flag signals that the write access to the CHI command vector        SUCC1.CMD was not successful because the execution of the previous CHI        command has not yet completed. In this case bit EIR.CNA is also set to 1. This flag is cleared by writing a 1.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EERR</name>
							<description>ECC Error   EERR. The flag signals an ECC error to the Host. It is set whenever one of the        flags MHDS.EIBF  MHDS.EOBF  MHDS.EMR  MHDS.ETBF1  MHDS.ETBF2 changes        from 0 to 1. See also   8220 Message Handler Status  8221 . This bit must be cleared at        initialization of the module </description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RFO</name>
							<description>Receive FIFO Overrun   RFO. The flag is set by the Communication Controller when a receive FIFO        overrun is detected. When a receive FIFO overrun occurs  the oldest        message is overwritten with the actual received message. The actual        state of the FIFO is monitored in register FSR.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EFA</name>
							<description>Empty FIFO Access   EFA. This flag is set by the Communication Controller when the Host requests        the transfer of a message from the receive FIFO via Output Buffer while        the receive FIFO is empty.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IIBA</name>
							<description>Illegal Input Buffer Access   IIBA. This flag is set by the Communication Controller when the Host wants to        modify a Message Buffer via Input Buffer while the Communication        Controller is not in   8220 CONFIG  8221  or   8220 DEFAULT CONFIG  8221  state and one of the        following conditions applies  The Host writes to the Input Buffer Command Request register to modify          the  Header Section of Message Buffer 0  1 if configured for transmission            in key slot Header Section of static Message Buffers with buffer number  lt             MRC.FDB while MRC.SEC   01 B Header Section of any static or dynamic Message Buffer while MRC.SEC              1x B Header and   or Data Section of any message buffer belonging to the            receive FIFO The Host writes to any register of the Input Buffer while IBCR.IBSYS          is set.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IOBA</name>
							<description>Illegal Output Buffer Access   IOBA. This flag is set by the Communication Controller when the Host requests        the transfer of a Message Buffer from the Message RAM to the Output        Buffer while OBCR.OBSYS is set to 1.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MHF</name>
							<description>Message Handler Constraints Flag   MHF. The flag signals a Message Handler constraints violation condition. It        is set whenever one of the flags MHDF.SNUA  MHDF.SNUB  MHDF.FNFA         MHDF.FNFB  MHDF.TBFA  MHDF.TBFB  MHDF.TNSA  MHDF.TNSB  MHDF.WAHP changes        from 0 to 1.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EDA</name>
							<description>Error Detected on Channel A   EDA. This bit is set whenever one of the flags ACS.SEDA  ACS.CEDA  ACS.CIA         ACS.SBVA changes from 0 to 1. This flag is cleared by writing a 1.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LTVA</name>
							<description>Latest Transmit Violation Channel A   LTVA. The flag signals a latest transmit violation on channel A to the Host. This flag is cleared by writing a 1.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TABA</name>
							<description>Transmission Across Boundary Channel A   TABA. The flag signals to the Host that a transmission across a slot boundary        occurred for channel A. This flag is cleared by writing a 1.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EDB</name>
							<description>Error Detected on Channel B   EDB. This bit is set whenever one of the flags ACS.SEDB  ACS.CEDB  ACS.CIB         ACS.SBVB changes from 0 to 1. This flag is cleared by writing a 1.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LTVB</name>
							<description>Latest Transmit Violation Channel B   LTVB. The flag signals a latest transmit violation on channel B to the Host. This flag is cleared by writing a 1.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TABB</name>
							<description>Transmission Across Boundary Channel B   TABB. The flag signals to the Host that a transmission across a slot boundary        occurred for channel B. This flag is cleared by writing a 1.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
