J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>SIR</name>
					<description>Status Service Request Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>36</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>WST</name>
							<description>Wakeup Status   WST. This flag is set when the wakeup status vector CCSV.WSV in the Communication Controller Status Vector register changes to a value other than UNDEFINED. This flag is cleared by writing a 1.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CAS</name>
							<description>Collision Avoidance Symbol   CAS. This flag is set by the Communication Controller during STARTUP state when a CAS or potential CAS was received. This flag is cleared by writing a 1.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CYCS</name>
							<description>Cycle Start Service Request   CYCS. This flag is set by the Communication Controller when a communication        cycle starts This flag is cleared by writing a 1.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXI</name>
							<description>Transmit Service Request   TXI. This flag is set by the Communication Controller at the end of Frame        transmission if bit WRHS1.MBI in the respective Message Buffer is set. This flag is cleared by writing a 1.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXI</name>
							<description>Receive Service Request   RXI. This flag is set by the Communication Controller whenever the set        condition of a Message Buffer ND flag is fulfilled and if bit WRHS1.MBI        of that Message Buffer is set to 1. This flag is cleared by writing a 1.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RFNE</name>
							<description>Receive FIFO Not Empty   RFNE. This flag is set by the Communication Controller when a received valid        Frame was stored into the empty receive FIFO.m The actual state of the        receive FIFO is monitored in register FSR</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RFCL</name>
							<description>Receive FIFO Critical Level   RFCL. This flag is set when a valid receive FIFO fill level FSR.RFFL is equal or greater than the critical level as configured by FCL.CL.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>NMVC</name>
							<description>Network Management Vector Changed   NMVC. This service request flag signals a change in the Network Management Vector visible to the Host. This flag is cleared by writing a 1.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TI0</name>
							<description>Timer Service Request 0   TI0. This flag is set whenever timer 0 matches the conditions configured in the Timer Service Request 0 Configuration Register T0C. A Timer Service Request 0 is also signalled by TINT0SRC. This flag is cleared by writing a 1.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TI1</name>
							<description>Timer Service Request 1   TI1. This flag is set whenever the conditions programmed in the Timer Service Request 1 Configuration Register T1C are met. A Timer Service Request 1 is also signalled by TINT1SRC. This flag is cleared by writing a 1.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIBC</name>
							<description>Transfer Input Buffer Completed   TIBC. This flag is set whenever a transfer from Input Buffer to the Message RAM has completed and bit IBCR.IBSYS in the Input Buffer Command Request register has been reset by the Message Handler. This flag is cleared by writing a 1.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TOBC</name>
							<description>Transfer Output Buffer Completed   TOBC. This flag is set whenever a transfer from Message RAM to the Output Buffer has completed and bit OBCR.OBSYS in the Output Buffer Command Request register has been reset by the Message Handler. This flag is cleared by writing a 1.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SWE</name>
							<description>Stop Watch Event   SWE. This flag is set after a stop watch activation when the current cycle counter and Macrotick value are stored in the Stop Watch Register 1  STPW1 . This flag is cleared by writing a 1.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SUCS</name>
							<description>Startup Completed Successfully   SUCS. This flag is set whenever a startup completed successfully and the Communication Controller entered  NORMAL ACTIVE  state. This flag is cleared by writing a 1.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MBSI</name>
							<description>Message Buffer Status Service Request   MBSI. This flag is set by the Communication Controller when the Message Buffer        status MBS has changed and if bit RDHS1.MBI of that Message Buffer is        set. This flag is cleared by writing a 1.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SDS</name>
							<description>Start of Dynamic Segment   SDS. This flag is set by the Communication Controller when the dynamic        segment starts.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WUPA</name>
							<description>Wakeup Pattern Channel A   WUPA. This flag is set by the Communication Controller when a wakeup pattern was received on channel A. Only set when the Communication Controller is in  WAKEUP    READY   or  STARTUP  state  or when in Monitor mode. This flag is cleared by writing a 1.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MTSA</name>
							<description>MTS Received on Channel A vSS ValidMTSA    MTSA. Media Access Test symbol received on channel A during the proceeding symbol window. Updated by the Communication Controller for each channel at the end of the symbol window. This flag is cleared by writing a 1.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WUPB</name>
							<description>Wakeup Pattern Channel B   WUPB. This flag is set by the Communication Controller when a wakeup pattern        was received on channel B. Only set when the Communication Controller is        in   8220 WAKEUP  8221     8220 READY  8221   or   8220 STARTUP  8221  state  or when in Monitor mode. This flag is cleared by writing a 1.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MTSB</name>
							<description>MTS Received on Channel B   MTSB. Media Access Test symbol received on channel B during the proceeding        symbol window. Updated by the Communication Controller for each channel        at the end of the symbol window. This flag is cleared by writing a 1.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EILS</name>
					<description>Error Service Request Line Select
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>40</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PEMCL</name>
							<description>POC Error Mode Changed Service Request Line   PEMCL</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CNAL</name>
							<description>Command Not Accepted Service Request Line   CNAL</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SFBML</name>
							<description>SYNC Frames Below Minimum Service Request Line   SFBML</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SFOL</name>
							<description>SYNC Frame Overflow Service Request Line   SFOL</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CCFL</name>
							<description>Clock Correction Failure Service Request Line   CCFL</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CCLL</name>
							<description>CHI Command Locked Service Request Line   CCLL</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EERRL</name>
							<description>ECC Error Service Request Line   EERRL</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RFOL</name>
							<description>Receive FIFO Overrun Service Request Line   RFOL</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EFAL</name>
							<description>Empty FIFO Access Service Request Line   EFAL</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IIBAL</name>
							<description>Illegal Input Buffer Access Service Request Line   IIBAL</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IOBAL</name>
							<description>Illegal Output Buffer Access Service Request Line   IOBAL</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MHFL</name>
							<description>Message Handler Constrains Flag Service Request Line   MHFL</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EDAL</name>
							<description>Error Detected on Channel A Service Request Line   EDAL</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LTVAL</name>
							<description>Latest Transmit Violation Channel A Service Request Line   LTVAL</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TABAL</name>
							<description>Transmission Across Boundary Channel A Service Request Line   TABAL</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EDBL</name>
							<description>Error Detected on Channel B Service Request Line   EDBL</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LTVBL</name>
							<description>Latest Transmit Violation Channel B Service Request Line   LTVBL</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TABBL</name>
							<description>Transmission Across Boundary Channel B Service Request Line   TABBL</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SILS</name>
					<description>Status Service Request Line Select
 resetvalue={Application Reset:0x303FFFF}</description>
					<addressOffset>44</addressOffset>
					<size>32</size>
					<resetValue>50593791</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>WSTL</name>
							<description>Wakeup Status Service Request Line   WSTL</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CASL</name>
							<description>Collision Avoidance Symbol Service Request Line   CASL</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CYCSL</name>
							<description>Cycle Start Service Request Line   CYCSL</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXIL</name>
							<description>Transmit Service Request Line   TXIL</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIL</name>
							<description>Receive Service Request Line   RXIL</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RFNEL</name>
							<description>Receive FIFO Not Empty Service Request Line   RFNEL</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RFCLL</name>
							<description>Receive FIFO Critical Level Service Request Line   RFCLL</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NMVCL</name>
							<description>Network Management Vector Changed Service Request Line   NMVCL</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TI0L</name>
							<description>Timer Service Request 0 Line   TI0L</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TI1L</name>
							<description>Timer Service Request 1 Line   TI1L</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIBCL</name>
							<description>Transfer Input Buffer Completed Service Request Line   TIBCL</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TOBCL</name>
							<description>Transfer Output Buffer Completed Service Request Line   TOBCL</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SWEL</name>
							<description>Stop Watch Event Service Request Line   SWEL</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SUCSL</name>
							<description>Startup Completed Successfully Service Request Line   SUCSL</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MBSIL</name>
							<description>Message Buffer Status Service Request Line   MBSIL</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SDSL</name>
							<description>Start of Dynamic Segment Service Request Line   SDSL</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WUPAL</name>
							<description>Wakeup Pattern Channel A Service Request Line   WUPAL</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MTSAL</name>
							<description>Media Access Test Symbol Channel A Service Request Line   MTSAL</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WUPBL</name>
							<description>Wakeup Pattern Channel B Service Request Line   WUPBL</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MTSBL</name>
							<description>Media Access Test Symbol Channel B Service Request Line   MTSBL</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EIES</name>
					<description>Error Service Request Enable Set
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>48</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PEMCE</name>
							<description>POC Error Mode Changed Service Request Enable   PEMCE</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CNAE</name>
							<description>Command Not Accepted Service Request Enable   CNAE</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SFBME</name>
							<description>SYNC Frames Below Minimum Service Request Enable   SFBME</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SFOE</name>
							<description>SYNC Frame Overflow Service Request Enable   SFOE</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CCFE</name>
							<description>Clock Correction Failure Service Request Enable   CCFE</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CCLE</name>
							<description>CHI Command Locked Service Request Enable   CCLE</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EERRE</name>
							<description>ECC Error Service Request Enable   EERRE</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RFOE</name>
							<description>Receive FIFO Overrun Service Request Enable   RFOE</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EFAE</name>
							<description>Empty FIFO Access Service Request Enable   EFAE</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IIBAE</name>
							<description>Illegal Input Buffer Access Service Request Enable   IIBAE</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IOBAE</name>
							<description>Illegal Output Buffer Access Service Request Enable   IOBAE</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MHFE</name>
							<description>Message Handler Constraints Flag Service Request Enable   MHFE</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EDAE</name>
							<description>Error Detected on Channel A Service Request Enable   EDAE</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LTVAE</name>
							<description>Latest Transmit Violation Channel A Service Request Enable   LTVAE</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TABAE</name>
							<description>Transmission Across Boundary Channel A Service Request Enable   TABAE</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EDBE</name>
							<description>Error Detected on Channel B Service Request Enable   EDBE</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LTVBE</name>
							<description>Latest Transmit Violation Channel B Service Request Enable   LTVBE</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TABBE</name>
							<description>Transmission Across Boundary Channel B Service Request Enable   TABBE</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
