J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>EIER</name>
					<description>Error Service Request Enable Reset
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>52</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PEMCE</name>
							<description>POC Error Mode Changed Service Request Enable   PEMCE</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CNAE</name>
							<description>Command Not Accepted Service Request Enable   CNAE</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SFBME</name>
							<description>SYNC Frames Below Minimum Service Request Enable   SFBME</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SFOE</name>
							<description>SYNC Frame Overflow Service Request Enable   SFOE</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CCFE</name>
							<description>Clock Correction Failure Service Request Enable   CCFE</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CCLE</name>
							<description>CHI Command Locked Service Request Enable   CCLE</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EERRE</name>
							<description>ECC Error Service Request Enable   EERRE</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RFOE</name>
							<description>Receive FIFO Overrun Service Request Enable   RFOE</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EFAE</name>
							<description>Empty FIFO Access Service Request Enable   EFAE</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IIBAE</name>
							<description>Illegal Input Buffer Access Service Request Enable   IIBAE</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IOBAE</name>
							<description>Illegal Output Buffer Access Service Request Enable   IOBAE</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MHFE</name>
							<description>Message Handler Constraints Flag Service Request Enable   MHFE</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EDAE</name>
							<description>Error Detected on Channel A Service Request Enable   EDAE</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LTVAE</name>
							<description>Latest Transmit Violation Channel A Service Request Enable   LTVAE</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TABAE</name>
							<description>Transmission Across Boundary Channel A Service Request Enable   TABAE</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EDBE</name>
							<description>Error Detected on Channel B Service Request Enable   EDBE</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LTVBE</name>
							<description>Latest Transmit Violation Channel B Service Request Enable   LTVBE</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TABBE</name>
							<description>Transmission Across Boundary Channel B Service Request Enable   TABBE</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SIES</name>
					<description>Status Service Request Enable Set
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>56</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>WSTE</name>
							<description>Wakeup Status Service Request Enable   WSTE</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CASE</name>
							<description>Collision Avoidance Symbol Service Request Enable   CASE</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CYCSE</name>
							<description>Cycle Start Service Request Enable   CYCSE</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXIE</name>
							<description>Transmit Service Request Enable   TXIE</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIE</name>
							<description>Receive Service Request Enable   RXIE</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RFNEE</name>
							<description>Receive FIFO Not Empty Service Request Enable   RFNEE</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RFCLE</name>
							<description>Receive FIFO Critical Level Service Request Enable   RFCLE</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NMVCE</name>
							<description>Network Management Vector Changed Service Request Enable   NMVCE</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TI0E</name>
							<description>Timer Service Request 0 Enable   TI0E</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TI1E</name>
							<description>Timer Service Request 1 Enable   TI1E</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIBCE</name>
							<description>Transfer Input Buffer Completed Service Request Enable   TIBCE</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TOBCE</name>
							<description>Transfer Output Buffer Completed Service Request Enable   TOBCE</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SWEE</name>
							<description>Stop Watch Event Service Request Enable   SWEE</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SUCSE</name>
							<description>Startup Completed Successfully Service Request Enable   SUCSE</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MBSIE</name>
							<description>Message Buffer Status Service Request Enable   MBSIE</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SDSE</name>
							<description>Start of Dynamic Segment Service Request Enable   SDSE</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WUPAE</name>
							<description>Wakeup Pattern Channel A Service Request Enable   WUPAE</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MTSAE</name>
							<description>Media Access Test Symbol Channel A Service Request Enable   MTSAE</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WUPBE</name>
							<description>Wakeup Pattern Channel B Service Request Enable   WUPBE</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MTSBE</name>
							<description>Media Access Test Symbol Channel B Service Request Enable   MTSBE</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SIER</name>
					<description>Status Service Request Enable Reset
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>60</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>WSTE</name>
							<description>Wakeup Status Service Request Enable   WSTE</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CASE</name>
							<description>Collision Avoidance Symbol Service Request Enable   CASE</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CYCSE</name>
							<description>Cycle Start Service Request Enable   CYCSE</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXIE</name>
							<description>Transmit Service Request Enable   TXIE</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIE</name>
							<description>Receive Service Request Enable   RXIE</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RFNEE</name>
							<description>Receive FIFO Not Empty Service Request Enable   RFNEE</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RFCLE</name>
							<description>Receive FIFO Critical Level Service Request Enable   RFCLE</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NMVCE</name>
							<description>Network Management Vector Changed Service Request Enable   NMVCE</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TI0E</name>
							<description>Timer Service Request 0 Enable   TI0E</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TI1E</name>
							<description>Timer Service Request 1 Enable   TI1E</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIBCE</name>
							<description>Transfer Input Buffer Completed Service Request Enable   TIBCE</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TOBCE</name>
							<description>Transfer Output Buffer Completed Service Request Enable   TOBCE</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SWEE</name>
							<description>Stop Watch Event Service Request Enable   SWEE</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SUCSE</name>
							<description>Startup Completed Successfully Service Request Enable   SUCSE</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MBSIE</name>
							<description>Message Buffer Status Service Request Enable   MBSIE</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SDSE</name>
							<description>Start of Dynamic Segment Service Request Enable   SDSE</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WUPAE</name>
							<description>Wakeup Pattern Channel A Service Request Enable   WUPAE</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MTSAE</name>
							<description>Media Access Test Symbol Channel A Service Request Enable   MTSAE</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WUPBE</name>
							<description>Wakeup Pattern Channel B Service Request Enable   WUPBE</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MTSBE</name>
							<description>Media Access Test Symbol Channel B Service Request Enable   MTSBE</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ILE</name>
					<description>Service Request Line Enable
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>64</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EINT0</name>
							<description>Enable Service Request Line 0 INT0SRC    EINT0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EINT1</name>
							<description>Enable Service Request Line 1 INT1SRC    EINT1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T0C</name>
					<description>Timer 0 Configuration
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>68</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>T0RC</name>
							<description>Timer 0 Run Control   T0RC</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T0MS</name>
							<description>Timer 0 Mode Select   T0MS</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T0CC</name>
							<description>Timer 0 Cycle Code   T0CC. The 7 bit timer 0 cycle code determines the cycle set used for        generation of the timer 0 service request. For details about the        configuration of the cycle code see   8220 Cycle Counter Filtering  8221 .</description>
							<lsb>8</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T0MO</name>
							<description>Timer 0 Macrotick Offset   T0MO. Configures the Macrotick offset from the beginning of the cycle where the service request is to occur. The Timer 0 Service Request occurs at this offset for each cycle of the cycle set.</description>
							<lsb>16</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T1C</name>
					<description>Timer 1 Configuration
 resetvalue={Application Reset:0x20000}</description>
					<addressOffset>72</addressOffset>
					<size>32</size>
					<resetValue>131072</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>T1RC</name>
							<description>Timer 1 Run Control   T1RC</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T1MS</name>
							<description>Timer 1 Mode Select   T1MS</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T1MC</name>
							<description>Timer 1 Macrotick Count   T1MC. When the configured Macrotick count is reached the timer 1 service request is generated. Valid values are  2 H  3FFF H Macroticks in continuous mode 1 H  3FFF H Macroticks in single shot mode</description>
							<lsb>16</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STPW1</name>
					<description>Stop Watch Register 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>76</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ESWT</name>
							<description>Enable Stop Watch Trigger   ESWT. If enabled an edge on input STPW  pin eray stpwt   if embedded  eray stpwt0  eray stpwt1  eray stpwt2  or eray stpwt3  or a service request 0 or 1 event  rising edge on signal INT0SR or INT1SR   eray int0 or eray int 1  activates the stop watch. In single shot mode this bit is reset to 0 after the actual cycle counter and Macrotick value are stored in the Stop Watch register.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SWMS</name>
							<description>Stop Watch Mode Select   SWMS. It is not possible to change the Stop Watch Mode during enabled stop watch trigger  STPW1.ESWT </description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EDGE</name>
							<description>Stop Watch Trigger Edge Select   EDGE</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SSWT</name>
							<description>Software Stop Watch Trigger   SSWT. When the Host writes this bit to 1 the stop watch is activated. After the actual cycle counter and Macrotick value are stored in the Stop Watch register this bit is reset to 0. The bit is only writeable while ESWT   0.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EETP</name>
							<description>Enable External Trigger Pin   EETP. Enables stop watch trigger event via signal STPW  eray stpwt  if ESWT   1.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EINT0</name>
							<description>Enable Service Request 0 Trigger   EINT0. Enables stop watch trigger by service request 0 event if ESWT   1.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EINT1</name>
							<description>Enable Service Request 1 Trigger   EINT1. Enables stop watch trigger by service request 1 event if ESWT   1.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SCCV</name>
							<description>Stopped Cycle Counter Value   SCCV. State of the cycle counter when the stop watch event occurred. Valid values are  0 3F H Valid Values</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SMTV</name>
							<description>Stopped Macrotick Value   SMTV. State of the Macrotick counter when the stop watch event occurred. Valid values are  0 3F H Valid Values</description>
							<lsb>16</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STPW2</name>
					<description>Stop Watch Register 2
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>80</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SSCVA</name>
							<description>Stop Watch Captured Slot Counter Value Channel A   SSCVA. State of the slot counter for channel A when the stop watch event occurred. Valid values are 0 to 2047  0 H to 7FF H  .</description>
							<lsb>0</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SSCVB</name>
							<description>Stop Watch Captured Slot Counter Value Channel B   SSCVB. State of the slot counter for channel B when the stop watch event occurred. Valid values are 0 to 2047  0 H to 7FF H  .</description>
							<lsb>16</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
