J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>SUCC1</name>
					<description>SUC Configuration Register 1
 resetvalue={Application Reset:0x0C401000}</description>
					<addressOffset>128</addressOffset>
					<size>32</size>
					<resetValue>205524992</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CMD</name>
							<description>CHI Command Vector   CMD. The host may write any CHI command at any time  but certain commands are        only enabled in specific POC states. A disabled command will not be        executed  the CHI command vector CMD will be reset to 0000 B     8220 COMMAND NOT ACCEPTED  8221   and flag EIR.CNA in the Error Service Request        register will be set to 1. In case the previous CHI command has not yet        completed  EIR.CCL is set to 1 together with EIR.CNA  the CHI command        needs to be repeated. Except for HALT state  POC state change command        applied while the Communication Controller is already in the requested        POC state will be ignored. Reading SUCC1.CMD shows whether the last CHI command was accepted.        CCSV.POCS monitors the actual POC state. The reserved CHI commands code        hardware test functions.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PBSY</name>
							<description>POC Busy   PBSY. Signals that the POC is busy and cannot accept a command from the Host.        SUCC1.CMD is locked against write accesses. Set to 1 after hard reset        during initialization of internal RAM blocks.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXST</name>
							<description>Transmit Startup Frame in Key Slot   pKeySlotUsedForStartup    TXST. Defines whether the key slot is used to transmit startup Frames. The bit        can be modified in   8220 DEFAULT CONFIG  8221  or   8220 CONFIG  8221  state only.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXSY</name>
							<description>Transmit SYNC Frame in Key Slot  pKeySlotUsedForSync    TXSY. Defines whether the key slot is used to transmit SYNC Frames. The bit        can be modified in   8220 DEFAULT CONFIG  8221  or   8220 CONFIG  8221  state only. 1         2 </description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CSA</name>
							<description>Cold Start Attempts  gColdStartAttempts    CSA. Configures the maximum number of attempts that a cold starting node is        permitted to try to start up the network without receiving any valid        response from another node. It can be modified in   8220 DEFAULT CONFIG  8221  or          8220 CONFIG  8221  state only. Must be identical in all nodes of a cluster. Valid        values are 2 to 31.</description>
							<lsb>11</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PTA</name>
							<description>Passive to Active  pAllowPassiveToActive    PTA. Defines the number of consecutive even   odd cycle pairs that must have        valid clock correction terms before the Communication Controller is        allowed to transit from   8220 NORMAL PASSIVE  8221  to   8220 NORMAL ACTIVE  8221  state. If        set to 00000 B the Communication        Controller is not allowed to transit from   8220 NORMAL PASSIVE  8221  to          8220 NORMAL ACTIVE  8221  state. It can be modified in   8220 DEFAULT CONFIG  8221  or          8220 CONFIG  8221  state only. Valid values are 0 to 31 even   odd cycle pairs.</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WUCS</name>
							<description>Wakeup Channel Select  pWakeupChannel    WUCS. With this bit the Host selects the channel on which the Communication        Controller sends the Wakeup pattern. The Communication Controller        ignores any attempt to change the status of this bit when not in          8220 DEFAULT CONFIG  8221  or   8220 CONFIG  8221  state.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSM</name>
							<description>Transmission Slot Mode  pSingleSlotEnabled    TSM. Selects the initial transmission slot mode. In SINGLE slot mode the        Communication Controller may only transmit in the preconfigured key        slot. The key slot ID is configured in the Header Section of Message        Buffer 0 respectively Message Buffers 0 and 1 depending on bit MRC.SPLM.        In case SUCC1.TSM   1  Message Buffer 0 respectively Message Buffers 0 1        can be  re configured in   8220 DEFAULT CONFIG  8221  or   8220 CONFIG  8221  state only. In ALL        slot mode the Communication Controller may transmit in all slots. The        bit can be written in   8220 DEFAULT CONFIG  8221  or   8220 CONFIG  8221  state only. The        communication controller changes to ALL slot mode when the Host        successfully applied the ALL SLOTS command by writing SUCC1.CMD  160    160 0101 B in POC states   8220 NORMAL ACTIVE  8221  or   8220 NORMAL PASSIVE  8221 . The actual slot mode        is monitored by CCSV.SLM.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HCSE</name>
							<description>Halt due to Clock Sync Error  pAllowHaltDueToClock    HCSE. Controls the transition to   8220 HALT  8221  state due to a clock synchronization        error. The bit can be modified in   8220 DEFAULT CONFIG  8221  or   8220 CONFIG  8221  state        only.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MTSA</name>
							<description>Select Channel A for MTS Transmission   MTSA. The bit selects channel A for MTS symbol transmission. The flag is reset        by default and may be modified only in   8220 DEFAULT CONFIG  8221  or   8220 CONFIG  8221         state.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MTSB</name>
							<description>Select Channel B for MTS Transmission   MTSB. The bit selects channel B for MTS symbol transmission. The flag is reset        by default and may be modified only in   8220 DEFAULT CONFIG  8221  or   8220 CONFIG  8221         state.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CCHA</name>
							<description>Connected to Channel A  pChannels    CCHA. Configures whether the node is connected to channel A.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CCHB</name>
							<description>Connected to Channel B  pChannels    CCHB. Configures whether the node is connected to channel B.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUCC2</name>
					<description>SUC Configuration Register 2
 resetvalue={Application Reset:0x1000504}</description>
					<addressOffset>132</addressOffset>
					<size>32</size>
					<resetValue>16778500</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LT</name>
							<description>Listen Timeout pdListenTimeout    LT. Configures wakeup   startup listen timeout in Microticks. The range for wakeup   startup listen timeout  pdListenTimeout  is 1284 to 1283846  504 H to 139706 H   Microticks</description>
							<lsb>0</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LTN</name>
							<description>Listen Time out Noise  gListenNoise   1     LTN. Configures the upper limit for startup and wakeup listen timeout in the        presence of noise expressed as a multiple of the cluster constant        pdListenTimeout. The range of pdListenTimeout 2 to 16. LTN must be        configured identical in all nodes of a cluster. This bit can be updated        in  quot DEFAULT CONFIG quot  or  quot CONFIG quot  state only.</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUCC3</name>
					<description>SUC Configuration Register 3
 resetvalue={Application Reset:0x11}</description>
					<addressOffset>136</addressOffset>
					<size>32</size>
					<resetValue>17</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>WCP</name>
							<description>Maximum Without Clock Correction Passive gMaxWithoutClockCorrectionPassive    WCP. Defines the number of consecutive even   odd cycle pairs with missing        clock correction terms that will cause a transition from   8220 NORMAL ACTIVE  8221         to   8220 NORMAL PASSIVE  8221  state. Must be identical in all nodes of a cluster.        Valid values are 1 to 15  1 H to F H          cycle pairs.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WCF</name>
							<description>Maximum Without Clock Correction Fatal  gMaxWithoutClockCorrecti on Fatal    WCF. Defines the number of consecutive even   odd cycle pairs with missing        clock correction terms that will cause a transition from   8220 NORMAL ACTIVE  8221         or   8220 NORMAL PASSIVE  8221  to   8220 HALT  8221  state. Must be identical in all nodes of a        cluster. Valid values are 1 to 15  1 H to F H  cycle pairs.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NEMC</name>
					<description>NEM Configuration Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>140</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>NML</name>
							<description>Network Management Vector Length gNetworkManagementVectorLength    NML. These bits configure the length of the NM Vector. The configured length must be identical in all nodes of a cluster. Valid values are 0 to 12  0 H to C H   bytes.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRTC1</name>
					<description>PRT Configuration Register 1
 resetvalue={Application Reset:0x084C0633}</description>
					<addressOffset>144</addressOffset>
					<size>32</size>
					<resetValue>139200051</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TSST</name>
							<description>Transmission Start Sequence Transmitter gdTSSTransmitter    TSST. Configures the duration of the Transmission Start Sequence  TSS  in        terms of Bit Times  1 bit time  160   4  160 Microticks  160   100ns at 10Mbps . Must        be identical in all nodes of a cluster. Valid values are 3 to 15  3 H to F H   Bit Times.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CASM</name>
							<description>Collision Avoidance Symbol Maximum  gdCASRxLowMax    CASM. Configures the upper limit of the acceptance window for a collision        avoidance symbol  CAS . Valid values are 67 to 99  43 H to 63 H  . Most significant bit of CASM        is hard wired to 1 and can not be modified.</description>
							<lsb>4</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SPP</name>
							<description>Strobe Point Position   SPP. Defines the sample count value for strobing. The strobed bit value is        set to the voted value when the sample count is incremented to the value        configured by SPP. The current revision 2.1 of the FlexRay  8482  protocol requires that SPP            00 B . The alternate strobe point          positions could be used to compensate for asymmetries in the physical          layer.</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BRP</name>
							<description>Baud Rate Prescaler  gdSampleClockPeriod  pSamplePerMicrotick    BRP. The baud rate prescaler configures the baud rate on the FlexRay  8482  bus.        The baud rates listed below are valid with a sample clock f SCLK          80  160 MHz. One bit time always consists of 8 samples independent of the        configured baud rate.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXW</name>
							<description>Wakeup Symbol Receive Window Length  gdWakeupSymbolRxWindow    RXW. Configures the number of Bit Times used by the node to test the duration        of the received wakeup pattern. Must be identical in all nodes of a        cluster. Valid values are 76 to 301  4C H to 12D H   Bit Times.</description>
							<lsb>16</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RWP</name>
							<description>Repetitions of Tx Wakeup Pattern  pWakeupPattern    RWP. Configures the number of repetitions  sequences  of the Tx wakeup        symbol. Valid values are 2 to 63  2 H to 3F H  .</description>
							<lsb>26</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRTC2</name>
					<description>PRT Configuration Register 2
 resetvalue={Application Reset:0x0F2D0A0E}</description>
					<addressOffset>148</addressOffset>
					<size>32</size>
					<resetValue>254609934</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXI</name>
							<description>Wakeup Symbol Receive Idle gdWakeupSymbolRxIdle    RXI. Configures the number of Bit Times used by the node to test the duration        of the idle phase of the received wakeup symbol. Must be identical in        all nodes of a cluster. Valid values are 14 to 59  E H to 3B H   Bit Times.</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXL</name>
							<description>Wakeup Symbol Receive Low  gdWakeupSymbolRxLow    RXL. Configures the number of Bit Times used by the node to test the duration        of the low phase of the received wakeup symbol. Must be identical in all        nodes of a cluster. Valid values are 10 to 55  A H to 37 H   Bit Times.</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXI</name>
							<description>Wakeup Symbol Transmit Idle  gdWakeupSymbolTxIdle    TXI. Configures the number of Bit Times used by the node to transmit the idle        phase of the wakeup symbol. Must be identical in all nodes of a cluster.        Valid values are 45 to 180  2D H to B4 H  Bit        Times.</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXL</name>
							<description>Wakeup Symbol Transmit Low  gdWakeupSymbolTxLow    TXL. Configures the number of Bit Times used by the node to transmit the low        phase of the wakeup symbol. Must be identical in all nodes of a cluster.        Valid values are 15 to 60  F H to 3C H          Bit Times.</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MHDC</name>
					<description>MHD Configuration Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>152</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SFDL</name>
							<description>Static Frame Data Length gPayloadLengthStatic    SFDL. Configures the cluster wide payload length for all Frames sent in the        static segment in double byte. The payload length must be identical in        all nodes of a cluster. Valid values are 0 to 127  0 to 7F H  .</description>
							<lsb>0</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SLT</name>
							<description>Start of Latest Transmit pLatestTx     SLT. Configures the maximum minislot value allowed before inhibiting Frame        transmission in the dynamic segment of the cycle. There is no        transmission dynamic segment if SLT is reset to zero. Valid values are 0        to 7981  0 to 1F2D H   minislots.</description>
							<lsb>16</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GTUC01</name>
					<description>GTU Configuration Register 1
 resetvalue={Application Reset:0x280}</description>
					<addressOffset>160</addressOffset>
					<size>32</size>
					<resetValue>640</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>UT</name>
							<description>Microtick per Cycle pMicroPerCycle    UT. Configures the duration of the communication cycle in Microticks. Valid        values are 640 to 640000  280 H to 9C400 H          Microticks.</description>
							<lsb>0</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GTUC02</name>
					<description>GTU Configuration Register 2
 resetvalue={Application Reset:0x2000A}</description>
					<addressOffset>164</addressOffset>
					<size>32</size>
					<resetValue>131082</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MPC</name>
							<description>Macrotick Per Cycle gMacroPerCycle    MPC. Configures the duration of one communication cycle in Macroticks. The        cycle length must be identical in all nodes of a cluster. Valid values        are 10 to 16000  A H to 3E80 H          Macroticks.</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SNM</name>
							<description>Sync Node Max gSyncNodeMax    SNM. Maximum number of Frames within a cluster with SYNC Frame indicator bit        SYN set to 1. Must be identical in all nodes of a cluster. Valid values        are 2 to 15  2 H to F H  .</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GTUC03</name>
					<description>GTU Configuration Register 3
 resetvalue={Application Reset:0x2020000}</description>
					<addressOffset>168</addressOffset>
					<size>32</size>
					<resetValue>33685504</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>UIOA</name>
							<description>Microtick Initial Offset Channel A pMicroInitialOffset A     UIOA. Configures the number of Microticks between the actual time reference        point on channel A and the subsequent Macrotick boundary of the        secondary time reference point. The parameter depends on        pDelayCompensation A  and therefore has to be set for each channel        independently. Valid values are 0 to 240  0 H to F0 H   Microticks.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UIOB</name>
							<description>Microtick Initial Offset Channel B  pMicroInitialOffset B     UIOB. Configures the number of Microticks between the actual time reference        point on channel B and the subsequent Macrotick boundary of the        secondary time reference point. The parameter depends on        pDelayCompensation B  and therefore has to be set for each channel        independently. Valid values are 0 to 240  0 H to F0 H   Microticks.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MIOA</name>
							<description>Macrotick Initial Offset Channel A gMacroInitialOffset A     MIOA. Configures the number of Macroticks between the static slot boundary and        the subsequent Macrotick boundary of the secondary time reference point        based on the nominal Macrotick duration. Must be identical in all nodes        of a cluster. Valid values are 2 to 72  2 H to 48 H   Macroticks.</description>
							<lsb>16</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MIOB</name>
							<description>Macrotick Initial Offset Channel B gMacroInitialOffset B     MIOB. Configures the number of Macroticks between the static slot boundary and        the subsequent Macrotick boundary of the secondary time reference point        based on the nominal Macrotick duration. Must be identical in all nodes        of a cluster. Valid values are 2 to 72  2 H to 48 H   Macroticks.</description>
							<lsb>24</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GTUC04</name>
					<description>GTU Configuration Register 4
 resetvalue={Application Reset:0x080007}</description>
					<addressOffset>172</addressOffset>
					<size>32</size>
					<resetValue>524295</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>NIT</name>
							<description>Network Idle Time Start gMacroPerCycle   gdNIT   1    NIT. Configures the starting point of the Network Idle Time  NIT  at the end        of the communication cycle expressed in terms of Macroticks from the        beginning of the cycle. The start of network idle time  NIT  is        recognized if Macrotick   gMacroPerCycle   gdNIT  1 and the increment        pulse of Macrotick is set. Must be identical in all nodes of a cluster.        Valid values are 7 to 15997  7 H to 3E7D H          Macroticks.</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OCS</name>
							<description>Offset Correction Start  gOffsetCorrectionStart   1    OCS. Determines the start of the offset correction within the network idle        time  NIT  phase  calculated from start of cycle. Must be identical in        all nodes of a cluster. For cluster consisting of E Ray implementations only  it is sufficient to program OCS   NIT   1. Valid        values are 8 to 15998  8 H to 3E7E H          Macroticks.</description>
							<lsb>16</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
