J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>GTUC05</name>
					<description>GTU Configuration Register 5
 resetvalue={Application Reset:0x0E000000}</description>
					<addressOffset>176</addressOffset>
					<size>32</size>
					<resetValue>234881024</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DCA</name>
							<description>Delay Compensation Channel A pDelayCompensation A     DCA. Used to compensate for reception delays on channel A. This covers        assumed propagation delay up to cPropagationDelayMax for Microticks in        the range of 0.0125  160   181 s to 0.05  160   181 s. In practice  the minimum of the        propagation delays of all sync nodes should be applied. Valid values are 0 to 200  0 H to C8 H          Microticks.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DCB</name>
							<description>Delay Compensation Channel B  pDelayCompensation B     DCB. Used to compensate for reception delays on channel B. This covers        assumed propagation delay up to cPropagationDelayMax for Microticks in        the range of 0.0125 to 0.05  160   181 s. In practice  the minimum of the        propagation delays of all sync nodes should be applied. Valid values are 0 to 200  0 H to C8 H          Microticks.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CDD</name>
							<description>Cluster Drift Damping pClusterDriftDamping    CDD. Configures the cluster drift damping value used in clock synchronization        to minimize accumulation of rounding errors. Valid values are 0 to 20  0 H to 14 H   Microticks.</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DEC</name>
							<description>Decoding Correction pDecodingCorrection    DEC. Configures the decoding correction value used to determine the primary        time reference point. Valid values are 14 to 143  E H to 8F H   Microticks.</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GTUC06</name>
					<description>GTU Configuration Register 6
 resetvalue={Application Reset:0x20000}</description>
					<addressOffset>180</addressOffset>
					<size>32</size>
					<resetValue>131072</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ASR</name>
							<description>Accepted Startup Range pdAcceptedStartupRange    ASR. Number of Microticks constituting the expanded range of measured deviation for startup Frames during integration. Valid values are 0 to 1875  0 H to 753 H   Microticks.</description>
							<lsb>0</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MOD</name>
							<description>Maximum Oscillator Drift pdMaxDrift 1    MOD. Maximum drift offset between two nodes that operate with unsynchronized clocks over one communication cycle in Microticks. Valid values are 2 to 1923  2 H to 783 H   Microticks.</description>
							<lsb>16</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GTUC07</name>
					<description>GTU Configuration Register 7
 resetvalue={Application Reset:0x20004}</description>
					<addressOffset>184</addressOffset>
					<size>32</size>
					<resetValue>131076</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SSL</name>
							<description>Static Slot Length gdStaticSlot    SSL. Configures the duration of a static slot in Macroticks. The static slot        length must be identical in all nodes of a cluster. Valid values are 4        to 659  4 H to 293 H          Macroticks.</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NSS</name>
							<description>Number of Static Slots gNumberOfStaticSlots    NSS. Configures the number of static slots in a cycle. At least 2 coldstart        nodes must be configured to startup a FlexRay  8482  network. The number of        static slots must be identical in all nodes of a cluster. Valid values        are 2 to 1023  2 H to 3FF H  .</description>
							<lsb>16</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GTUC08</name>
					<description>GTU Configuration Register 8
 resetvalue={Application Reset:0x2}</description>
					<addressOffset>188</addressOffset>
					<size>32</size>
					<resetValue>2</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MSL</name>
							<description>Minislot Length gdMinislot    MSL. Configures the duration of a minislot in Macroticks. The minislot length        must be identical in all nodes of a cluster. Valid values are 2 to 63  2 H to 3F H   Macroticks.</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NMS</name>
							<description>Number of Minislots gNumberOfMinislots    NMS. Configures the number of minislots within the dynamic segment of a        cycle. The number of minislots must be identical in all nodes of a        cluster. Valid values are 0 to 7986  0 H to 1F32 H  .</description>
							<lsb>16</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GTUC09</name>
					<description>GTU Configuration Register 9
 resetvalue={Application Reset:0x101}</description>
					<addressOffset>192</addressOffset>
					<size>32</size>
					<resetValue>257</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>APO</name>
							<description>Action Point Offset gdActionPointOffset    APO. Configures the action point offset in Macroticks within static slots and        symbol window. Must be identical in all nodes of a cluster. Valid values        are 1 to 63  1 H to 3F H          Macroticks.</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MAPO</name>
							<description>Minislot Action Point Offset  gd Minislot Action Point Offset    MAPO. Configures the action point offset in Macroticks within the minislots of        the dynamic segment. Must be identical in all nodes of a cluster. Valid        values are 1 to 31  1 H to 1F H          Macroticks.</description>
							<lsb>8</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DSI</name>
							<description>Dynamic Slot Idle Phase  gdDynamicSlotIdlePhase    DSI. The duration of the dynamic slot idle phase has to be greater or equal        than the idle detection time. Must be identical in all nodes of a        cluster. Valid values are 0 to 2 Minislot.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GTUC10</name>
					<description>GTU Configuration Register 10
 resetvalue={Application Reset:0x20005}</description>
					<addressOffset>196</addressOffset>
					<size>32</size>
					<resetValue>131077</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MOC</name>
							<description>Maximum Offset Correction pOffsetCorrectionOut    MOC. Holds the maximum permitted offset correction value to be applied by the        internal clock synchronization algorithm  absolute value . The        Communication Controller checks only the internal offset correction        value against the maximum offset correction value. Valid values are 5 to        15266  5 H to 3BA2 H          Microticks.</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MRC</name>
							<description>Maximum Rate Correction  pRateCorrectionOut    MRC. Holds the maximum permitted rate correction value to be applied by the        internal clock synchronization algorithm. The communication controller        checks only the internal rate correction value against the maximum rate        correction value  absolute value . Valid values are 2 to 1923  2 H to 783 H   Microticks.</description>
							<lsb>16</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GTUC11</name>
					<description>GTU Configuration Register 11
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>200</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EOCC</name>
							<description>External Offset Correction Control pExternOffsetControl    EOCC. By writing to EOCC the external offset correction is enabled as        specified below. Should be modified only outside network idle time  NIT .</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ERCC</name>
							<description>External Rate Correction Control pExternRateControl    ERCC. By writing to ERCC the external rate correction is enabled as specified        below. Should be modified only outside network idle time  NIT .</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EOC</name>
							<description>External Offset Correction pExternOffsetCorrection    EOC. Holds the external clock offset correction value in Microticks to be        applied by the internal synchronization algorithm. The value is        subtracted   added from   to the calculated offset correction value. The        value is applied during network idle time  NIT . May be modified in          8220 DEFAULT CONFIG  8221  or   8220 CONFIG  8221  state only. Valid values are 0 to 7        Microticks.</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ERC</name>
							<description>External Rate Correction  pExternRateCorrection    ERC. Holds the external rate correction value in Microticks to be applied by        the internal clock synchronization algorithm. The value is subtracted          added from   to the calculated rate correction value. The value is        applied during network idle time  NIT . Can be modified in          8220 DEFAULT CONFIG  8221  or   8220 CONFIG  8221  state only. Valid values are 0 to 7        Microticks.</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCSV</name>
					<description>Communication Controller Status Vector
 resetvalue={Application Reset:0x104000}</description>
					<addressOffset>256</addressOffset>
					<size>32</size>
					<resetValue>1064960</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>POCS</name>
							<description>Protocol Operation Control Status   POCS. 00 H ... 05 H   0F H Indicates the actual        state of operation of the Communication Controller Protocol Operation        Control 06 H   160    8230   160 14 H are reserved. 10 H ... 13 H Indicates the actual state of        operation of the POC in the wakeup path 14 H   160    8230   160 1F H are reserved. 20 H ... 2B H Indicates the actual state of        operation of the POC in the startup path 2C H   160    8230   160 3F H are reserved.</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FSI</name>
							<description>Freeze Status Indicator vPOC Freeze    FSI. Indicates that the POC has entered the   8220 HALT  8221  state due to CHI command          8220 FREEZE  8221  or due to an error condition requiring an immediate POC halt.        Reset by transition from   8220 HALT  8221  to   8220 DEFAULT CONFIG  8221  state.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HRQ</name>
							<description>Halt Request vPOC CHIHaltRequest    HRQ. Indicates that a request from the Host has been received to halt the POC        at the end of the communication cycle. Reset by transition from   8220 HALT  8221         to   8220 DEFAULT CONFIG  8221  state or when entering   8220 READY  8221  state.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SLM</name>
							<description>Slot Mode vPOC SlotMode    SLM. Indicates the actual slot mode of the POC in states READY  WAKEUP         STARTUP  NORMAL ACTIVE  and NORMAL PASSIVE. Default is   8220 SINGLE  8221 . Changes        to   8220 ALL  8221   depending on configuration bit SUCC1.TSM. In   8220 NORMAL ACTIVE  8221         or   8220 NORMAL PASSIVE  8221  state the CHI command   8220 ALL SLOTS  8221  will change the        slot mode from   8220 SINGLE  8221  over   8220 ALL PENDING  8221  to   8220 ALL  8221 . Set to SINGLE in        all other states.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CSNI</name>
							<description>Coldstart Noise Indicator vPOC ColdstartNoise    CSNI. Indicates that the cold start procedure occurred under noisy conditions.        Reset by CHI command   8220 RESET STATUS INDICATORS  8221  or by transition from          8220 HALT  8221  to   8220 DEFAULT CONFIG  8221  state or from   8220 READY  8221  to   8220 STARTUP  8221  state.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CSAI</name>
							<description>Coldstart Abort Indicator   CSAI. Coldstart aborted. Reset by CHI command   8220 RESET STATUS INDICATORS  8221  or by        transition from   8220 HALT  8221  to   8220 DEFAULT CONFIG  8221  state or from   8220 READY  8221  to          8220 STARTUP  8221  state.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CSI</name>
							<description>Cold Start Inhibit vColdStartInhibit    CSI. Indicates that the node is disabled from cold starting. The flag is set        whenever the POC enters   8220 READY  8221  state due to CHI command   8220 READY  8221 . The        flag has to be reset under control of the Host by CHI command          8220 ALLOW COLDSTART  8221   SUCC1.CMD  160    160 1001 B  .</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>WSV</name>
							<description>Wakeup Status vPOC WakeupStatus    WSV. Indicates the status of the current wakeup attempt. Reset by CHI command          8220 RESET STATUS INDICATORS  8221  or by transition from   8220 HALT  8221  to          8220 DEFAULT CONFIG  8221  state.</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RCA</name>
							<description>Remaining Coldstart Attempts vRemainingColdstartAttempts    RCA. Indicates the number of remaining coldstart attempts. The RUN command        resets this counter to the maximum number of coldstart attempts as        configured by SUCC1.CSA.</description>
							<lsb>19</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PSL</name>
							<description>POC Status Log   PSL. Status of CCSV.POCS immediately before entering   8220 HALT  8221  state. Set when        entering   8220 HALT  8221  state. Set to   8220 HALT  8221  when FREEZE command is applied        during   8220 HALT  8221  state. Reset to 000000 B when leaving   8220 HALT  8221  state.</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCEV</name>
					<description>Communication Controller Error Vector
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>260</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CCFC</name>
							<description>Clock Correction Failed Counter vClockCorrectionFailed    CCFC. The Clock Correction Failed Counter is incremented by one at the end of        any odd communication cycle where either the missing offset correction        error or missing rate correction error are active. The Clock Correction        Failed Counter is reset to 0 at the end of an odd communication cycle if        neither the offset correction failed nor the rate correction failed        errors are active. The Clock Correction Failed Counter stops at 15.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ERRM</name>
							<description>Error Mode vPOC ErrorMode    ERRM. Indicates the actual error mode of the POC.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PTAC</name>
							<description>Passive to Active Count vAllowPassiveToActive    PTAC. Indicates the number of consecutive even   odd cycle pairs that have passed with valid rate and offset correction terms  while the node is waiting to transit from  NORMAL PASSIVE  state to  NORMAL ACTIVE  state. The transition takes place when PTAC equals SUCC1.PTA 1.</description>
							<lsb>8</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SCV</name>
					<description>Slot Counter Value
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>272</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SCCA</name>
							<description>Slot Counter Channel A vSlotCounter A     SCCA. Current slot counter value on channel A. The value is incremented by the        Communication Controller and reset at the start of a communication        cycle. Valid values are 0 to 2047  0 H to 7FF H  .</description>
							<lsb>0</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SCCB</name>
							<description>Slot Counter Channel B vSlotCounter B     SCCB. Current slot counter value on channel B. The value is incremented by the        Communication Controller and reset at the start of a communication        cycle. Valid values are 0 to 2047  0 H to 7FF H  .</description>
							<lsb>16</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MTCCV</name>
					<description>Macrotick and Cycle Counter Value
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>276</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MTV</name>
							<description>Macrotick Value vMacrotick    MTV. Current Macrotick value. The value is incremented by the Communication Controller and reset at the start of a communication cycle. Valid values are 0 to 16000  0 H to 3E80 H  .</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CCV</name>
							<description>Cycle Counter Value vCycleCounter    CCV. Current cycle counter value. The value is incremented by the Communication Controller at the start of a communication cycle. Valid values are 0 to 63  0 H to 3F H  .</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCV</name>
					<description>Rate Correction Value
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>280</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RCV</name>
							<description>Rate Correction Value vRateCorrection    RCV. Rate correction value  two s complement . Calculated internal rate correction value before limitation. If the RCV value exceeds the limits defined by GTUC10.MRC  flag SFS.RCLR is set to 1.</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OCV</name>
					<description>Offset Correction Value
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>284</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>OCV</name>
							<description>Offset Correction Value vOffsetCorrection    OCV. Offset correction value  two s complement . Calculated internal offset correction value before limitation. If the OCV value exceeds the limits defined by GTUC10.MOC flag SFS.OCLR is set to 1.</description>
							<lsb>0</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
