J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>SFS</name>
					<description>SYNC Frame Status
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>288</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>VSAE</name>
							<description>Valid SYNC Frames Channel A  even communication cycle   VSAE. Holds the number of valid SYNC Frames received on channel A in the even communication cycle. If transmission of SYNC Frames is enabled by SUCC1.TXSY the value is incremented by one. The value is updated during the network idle time  NIT  of each even communication cycle. This bit field is only valid if the channel A is assigned to the Communication Controller by SUCC1.CCHA.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>VSAO</name>
							<description>Valid SYNC Frames Channel A  odd communication cycle   VSAO. Holds the number of valid SYNC Frames received on channel A in the odd communication cycle. If transmission of SYNC Frames is enabled by SUCC1.TXSY the value is incremented by one. The value is updated during the network idle time  NIT  of each odd communication cycle. This bit field is only valid if the channel A is assigned to the Communication Controller by SUCC1.CCHA.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>VSBE</name>
							<description>Valid SYNC Frames Channel B  even communication cycle   VSBE. Holds the number of valid SYNC Frames received on channel B in the even communication cycle. If transmission of SYNC Frames is enabled by SUCC1.TXSY the value is incremented by one. The value is updated during the network idle time  NIT  of each even communication cycle. This bit field is only valid if the channel B is assigned to the Communication Controller by SUCC1.CCHB.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>VSBO</name>
							<description>Valid SYNC Frames Channel B  odd communication cycle   VSBO. Holds the number of valid SYNC Frames received on channel B in the odd communication cycle. If transmission of SYNC Frames is enabled by SUCC1.TXSY the value is incremented by one. The value is updated during the network idle time  NIT  of each odd communication cycle. This bit field is only valid if the channel B is assigned to the Communication Controller by SUCC1.CCHB.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOCS</name>
							<description>Missing Offset Correction Signal   MOCS. The Missing Offset Correction flag signals to the Host  that no offset correction calculation can be performed because no SYNC Frames were received. The flag is updated by the Communication Controller at start of offset correction phase.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OCLR</name>
							<description>Offset Correction Limit Reached   OCLR. The Offset Correction Limit Reached flag signals to the Host  that the offset correction value has exceeded its limit as defined by GTUC10.MOC. The flag is updated by the Communication Controller at start of offset correction phase.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MRCS</name>
							<description>Missing Rate Correction Signal   MRCS. The Missing Rate Correction Flag signals to the Host  that no rate correction calculation can be performed because no pairs of even   odd SYNC Frames were received. The flag is updated by the Communication Controller at start of offset correction phase.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RCLR</name>
							<description>Rate Correction Limit Reached   RCLR. The Rate Correction Limit Reached flag signals to the Host  that the rate correction value has exceeded its limit.as defined by GTUC10.MRC. The flag is updated by the Communication Controller at start of offset correction phase.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWNIT</name>
					<description>Symbol Window and Network Idle Time Status
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>292</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SESA</name>
							<description>Syntax Error in Symbol Window Channel A vSS SyntaxErrorA    SESA</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SBSA</name>
							<description>Slot Boundary Violation in Symbol Window Channel A vSS BViolationA    SBSA</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TCSA</name>
							<description>Transmission Conflict in Symbol Window Channel A vSS TxConflictA    TCSA</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SESB</name>
							<description>Syntax Error in Symbol Window Channel B vSS SyntaxErrorB    SESB</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SBSB</name>
							<description>Slot Boundary Violation in Symbol Window Channel B vSS BViolationB    SBSB</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TCSB</name>
							<description>Transmission Conflict in Symbol Window Channel B vSS TxConflictB    TCSB</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MTSA</name>
							<description>MTS Received on Channel A vSS ValidMTSA    MTSA. Media Access Test symbol received on channel A during the proceeding        symbol window. Updated by the Communication Controller for each channel        at the end of the symbol window. When this bit is set to 1  also        interrupt flag SIR.MTSA is set to 1.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MTSB</name>
							<description>MTS Received on Channel B vSS ValidMTSB    MTSB. Media Access Test symbol received on channel B during the proceeding        symbol window. Updated by the Communication Controller for each channel        at the end of the symbol window. When this bit is set to 1  also        interrupt flag SIR.MTSB is set to 1.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SENA</name>
							<description>Syntax Error during network idle time  NIT  Channel A vSS SyntaxErrorA    SENA. Updated by the Communication Controller channel A at the end of the NIT.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SBNA</name>
							<description>Slot Boundary Violation during network idle time  NIT  Channel A vSS BViolationA    SBNA. Updated by the Communication Controller channel A at the end of the NIT.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SENB</name>
							<description>Syntax Error during network idle time  NIT  Channel B vSS SyntaxErrorB    SENB. Updated by the Communication Controller channel B at the end of the NIT.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SBNB</name>
							<description>Slot Boundary Violation during network idle time  NIT  Channel B vSS BViolationB    SBNB. Updated by the Communication Controller channel B at the end of the NIT.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ACS</name>
					<description>Aggregated Channel Status
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>296</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>VFRA</name>
							<description>Valid Frame Received on Channel A vSS ValidFrameA    VFRA. One or more valid Frames were received on channel A in any static or dynamic slot during the observation period.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEDA</name>
							<description>Syntax Error Detected on Channel A vSS SyntaxErrorA    SEDA. One or more syntax errors in static or dynamic slots  symbol window  and network idle time  NIT  were observed on channel A.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CEDA</name>
							<description>Content Error Detected on Channel A vSS ContentErrorA    CEDA. One or more Frames with a content error were received on channel A in any static or dynamic slot during the observation period.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CIA</name>
							<description>Communication Indicator Channel A   CIA. One or more valid Frames were received on channel A in slots that also contained any additional communication during the observation period  i.e. one or more slots received a valid Frame AND had any combination of either syntax error OR content error OR slot boundary violation.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SBVA</name>
							<description>Slot Boundary Violation on Channel A vSS BViolationA    SBVA. One or more slot boundary violations were observed on channel A at any time during the observation period  static or dynamic slots  symbol window  and network idle time NIT .</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VFRB</name>
							<description>Valid Frame Received on Channel B vSS ValidFrameB    VFRB. One or more valid Frames were received on channel B in any static or dynamic slot during the observation period.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEDB</name>
							<description>Syntax Error Detected on Channel B vSS SyntaxErrorB    SEDB. One or more syntax errors in static or dynamic slots  symbol window  and network idle time  NIT  were observed on channel B.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CEDB</name>
							<description>Content Error Detected on Channel B vSS ContentErrorB    CEDB. One or more Frames with a content error were received on channel B in any static or dynamic slot during the observation period.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CIB</name>
							<description>Communication Indicator Channel B   CIB. One or more valid Frames were received on channel B in slots that also contained any additional communication during the observation period  i.e. one or more slots received a valid Frame AND had any combination of either syntax error OR content error OR slot boundary violation.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SBVB</name>
							<description>Slot Boundary Violation on Channel B vSS BViolationB    SBVB. One or more slot boundary violations were observed on channel B at any time during the observation period  static or dynamic slots  symbol window  and network idle time NIT .</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>15</dim>
					<dimIncrement>4</dimIncrement>
					<name>ESIDn[%s]</name>
					<description>Even Sync ID Symbol Window 01
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>304</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EID</name>
							<description>Even Sync ID vsSyncIDListA B even    EID. SYNC Frame ID even communication cycle.</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXEA</name>
							<description>Received Configured Even Sync ID on Channel A   RXEA. Signals that a SYNC Frame corresponding to the stored even sync ID was received on channel A or that the node is configured to be a sync node with key slot   EID  ESID1 only .</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXEB</name>
							<description>Received Configured Even Sync ID on Channel B   RXEB. Signals that a SYNC Frame corresponding to the stored even sync ID was received on channel B or that the node is configured to be a sync node with key slot   EID  ESID1 only .</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>15</dim>
					<dimIncrement>4</dimIncrement>
					<name>OSIDn[%s]</name>
					<description>Odd Sync ID Symbol Window 01
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>368</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>OID</name>
							<description>Odd Sync ID vsSyncIDListA B odd    OID. SYNC Frame ID even communication cycle.</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXOA</name>
							<description>Received Odd Sync ID on Channel A   RXOA. Signals that a SYNC Frame corresponding to the stored odd sync ID was received on channel A or that the node is configured to be a sync node with key slot   OID  OSID1 only .</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXOB</name>
							<description>Received Odd Sync ID on Channel B   RXOB. Signals that a SYNC Frame corresponding to the stored odd sync ID was received on channel B or that the node is configured to be a sync node with key slot   OID  OSID1 only </description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>4</dimIncrement>
					<name>NMVx[%s]</name>
					<description>Network Management Vector 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>432</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>NM</name>
							<description>Network Management Vector   NM</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MRC</name>
					<description>Message RAM Configuration
 resetvalue={Application Reset:0x1800000}</description>
					<addressOffset>768</addressOffset>
					<size>32</size>
					<resetValue>25165824</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FDB</name>
							<description>First Dynamic Buffer   FDB. May be modified in  DEFAULT CONFIG  or  CONFIG  state only.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FFB</name>
							<description>First Buffer of FIFO   FFB. May be modified in  DEFAULT CONFIG  or  CONFIG  state only.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LCB</name>
							<description>Last Configured Buffer   LCB. May be only modified in  DEFAULT CONFIG  or  CONFIG  state.</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEC</name>
							<description>Secure Buffers   SEC. Not evaluated when the Communication Controller is in   8220 DEFAULT CONFIG  8221         or   8220 CONFIG  8221  state. For temporary unlocking see   8220 Host Handling of Errors  8221 . In nodes configured for SYNC Frame transmission or for single slot          mode operation Message Buffer 0  and if SPLM   1  also Message Buffer          1  Reconfiguration of all Message Buffers is always locked</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SPLM</name>
							<description>SYNC Frame Payload Multiplex   SPLM. This bit is only evaluated if the node is configured as sync node  SUCC1.TXSY   1  or for single slot mode operation  SUCC1.TSM   1 . When this bit is set to 1 Message Buffers 0 and 1 are dedicated for SYNC Frame transmission with different payload data on channel A and B. When this bit is reset to 0  SYNC Frames are transmitted from Message Buffer 0 with the same payload data on both channels. Note that the channel filter configuration for Message Buffer 0 resp. Message Buffer 1 has to be chosen accordingly.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FRF</name>
					<description>FIFO Rejection Filter
 resetvalue={Application Reset:0x1800000}</description>
					<addressOffset>772</addressOffset>
					<size>32</size>
					<resetValue>25165824</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CH</name>
							<description>Channel Filter   CH. May be modified in  DEFAULT CONFIG  or  CONFIG  state only.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FID</name>
							<description>Frame ID Filter   FID. Determines the Frame ID to be rejected by the FIFO. With the additional configuration of register FRFM  the corresponding Frame ID filter bits are ignored  which results in further rejected Frame IDs. When FRFM.MFID is zero  a Frame ID filter value of zero means that no Frame ID is rejected.</description>
							<lsb>2</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CYF</name>
							<description>Cycle Counter Filter   CYF. The 7 bit cycle counter filter determines the cycle set to which Frame        ID and channel rejection filter are applied. In cycles not belonging to the cycle set specified by CYF  all Frames are        rejected. For details about the configuration of the cycle counter        filter see   8220 Cycle Counter Filtering  8221 . May be modified in          8220 DEFAULT CONFIG  8221  or   8220 CONFIG  8221  state only.</description>
							<lsb>16</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RSS</name>
							<description>Reject in Static Segment   RSS. If this bit is set  the FIFO is used only be used in dynamic segment. May be modified in  DEFAULT CONFIG  or  CONFIG  state only.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RNF</name>
							<description>Reject NULL Frames   RNF. If this bit is set  received NULL Frames are not stored in the FIFO. May be modified in  DEFAULT CONFIG  or  CONFIG  state only.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FRFM</name>
					<description>FIFO Rejection Filter Mask
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>776</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MFID</name>
							<description>Mask Frame ID Filter   MFID. May be modified in   8220 DEFAULT CONFIG  8221  or   8220 CONFIG  8221  state only. When  0         written in a bit position  the corresponding Frame ID filter bit is used        for rejection filtering. When  1  written in a bit position  the        corresponding Frame ID filter bit is ignored. Valid values are from        0x000   0x3FF.</description>
							<lsb>2</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FCL</name>
					<description>FIFO Critical Level
 resetvalue={Application Reset:0x080}</description>
					<addressOffset>780</addressOffset>
					<size>32</size>
					<resetValue>128</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CL</name>
							<description>Critical Level   CL. When the receive FIFO fill level FSR.RFFL is equal or greater than the critical level configured by CL  the receive FIFO critical level flag FSR.RFCL is set. If CL is programmed to values  gt  128  bit FSR.RFCL is never set. When FSR.RFCL changes from 0 to 1 bit SIR.RFCL is set to 1  and if enabled  a service request is generated.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
