J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MHDS</name>
					<description>Message Handler Status
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>784</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EIBF</name>
							<description>ECC Error Input Buffer RAM 1 2   EIBF</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EOBF</name>
							<description>ECC Error Output Buffer RAM 1 2   EOBF</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EMR</name>
							<description>ECC Error Message RAM   EMR</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETBF1</name>
							<description>ECC Error Transient Buffer RAM A   ETBF1</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETBF2</name>
							<description>ECC Error Transient Buffer RAM B   ETBF2</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FMBD</name>
							<description>Faulty Message Buffer Detected   FMBD</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MFMB</name>
							<description>Multiple Faulty Message Buffers detected   MFMB</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CRAM</name>
							<description>Clear all internal RAM s   CRAM. Signals that execution of the CHI command CLEAR RAMS is ongoing  all bits of all internal RAM blocks are written to 0 . The bit is set by CHI command CLEAR RAMS.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FMB</name>
							<description>Faulty Message Buffer   FMB. ECC error occurred when reading from the Message Buffer or when transferring data from Input Buffer or Transient Buffer A or Transient Buffer B to the Message Buffer referenced by MHDS.FMB. Value only valid when one of the flags MHDS.EIBF  MHDS.EMR  MHDS.ETBF1  MHDS.ETBF2  and flag MHDS.FMBD is set. Updated only after the Host has reset flag MHDS.FMBD.</description>
							<lsb>8</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBT</name>
							<description>Message Buffer Transmitted   MBT. Number of last successfully transmitted Message Buffer. If the Message Buffer is configured for single shot mode  the respective TXR flag in the Transmission Request Registers TXRQ1 to TXRQ4 was reset. MBT is reset when the Communication Controller leaves  CONFIG  state or enters  STARTUP  state.</description>
							<lsb>16</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBU</name>
							<description>Message Buffer Updated   MBU. Number of Message Buffer that was updated last. For this Message Buffer the respective NDn  n   0 31  to NDn  n   96 127 and   or MBCn  n   0 31  to MBCn  n   96 127  flag in the New Data Registers NDAT1 to NDAT4 and the Message Buffer Status Changed MBSC1 to MBSC4 registers are also set. MBU is reset when the Communication Controller leaves  CONFIG  state or enters  STARTUP  state.</description>
							<lsb>24</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LDTS</name>
					<description>Last Dynamic Transmit Slot
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>788</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LDTA</name>
							<description>Last Dynamic Transmission Channel A   LDTA. Value of  vSlotCounter A   at the time of the last Frame transmission on channel A in the dynamic segment of this node. It is updated at the end of the dynamic segment and is reset to zero if no Frame was transmitted during the dynamic segment.</description>
							<lsb>0</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LDTB</name>
							<description>Last Dynamic Transmission Channel B   LDTB. Value of  vSlotCounter B   at the time of the last Frame transmission on channel B in the dynamic segment of this node. It is updated at the end of the dynamic segment and is reset to zero if no Frame was transmitted during the dynamic segment.</description>
							<lsb>16</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FSR</name>
					<description>FIFO Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>792</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RFNE</name>
							<description>Receive FIFO Not Empty   RFNE. This flag is set by the Communication Controller when a received valid Frame  data or NULL Frame depending on rejection mask  was stored in the FIFO. In addition  service request flag SIR.RFNE is set. The bit is reset after the Host has read all message from the FIFO.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RFCL</name>
							<description>Receive FIFO Critical Level   RFCL. This flag is set when the receive FIFO fill level RFFL is equal or greater than the critical level as configured by FCL.CL. The flag is cleared by the Communication Controller as soon as RFFL drops below FCL.CL. When RFCL changes from 0 to 1 bit SIR.RFCL is set to 1  and if enabled  an service request is generated.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RFO</name>
							<description>Receive FIFO Overrun   RFO. The flag is set by the Communication Controller when a receive FIFO overrun is detected. When a receive FIFO overrun occurs  the oldest message is overwritten with the actual received message. In addition  service request flag EIR.RFO is set.The flag is cleared by the next FIFO read access issued by the Host.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RFFL</name>
							<description>Receive FIFO Fill Level   RFFL. Number of FIFO buffers filled up with new data not yet read by the Host. Maximum value is 128.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MHDF</name>
					<description>Message Handler Constraints Flags
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>796</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SNUA</name>
							<description>Status Not Updated Channel A   SNUA. This flag is set by the Communication Controller when the Message Handler  due to overload condition  was not able to update a Message Buffer s status MBS with respect to channel A.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SNUB</name>
							<description>Status Not Updated Channel B   SNUB. This flag is set by the Communication Controller when the Message Handler  due to overload condition  was not able to update a Message Buffer s status MBS with respect to channel B.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FNFA</name>
							<description>Find Sequence Not Finished Channel A   FNFA. This flag is set by the Communication Controller when the Message Handler  due to overload condition  was not able to finish a find sequence  scan of Message RAM for matching Message Buffer  with respect to channel A.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FNFB</name>
							<description>Find Sequence Not Finished Channel B   FNFB. This flag is set by the Communication Controller when the Message Handler  due to overload condition  was not able to finish a find sequence  scan of Message RAM for matching Message Buffer  with respect to channel B.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TBFA</name>
							<description>Transient Buffer Access Failure A   TBFA. This flag is set by the Communication Controller when a read or write access to Transient Buffer A requested by PRT A could not complete within the available time.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TBFB</name>
							<description>Transient Buffer Access Failure B   TBFB. This flag is set by the Communication Controller when a read or write access to Transient Buffer B requested by PRT B could not complete within the available time.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TNSA</name>
							<description>Transmission Not Started Channel A   TNSA. This flag is set by the CC when the Message Handler was not ready to start a scheduled transmission on channel A at the action point of the configured slot.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TNSB</name>
							<description>Transmission Not Started Channel B   TNSB. This flag is set by the CC when the Message Handler was not ready to start a scheduled transmission on channel B at the action point of the configured slot.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WAHP</name>
							<description>Write Attempt to Header Partition   WAHP. Outside  DEFAULT CONFIG  and  CONFIG  state this flag is set by the Communication Controller when the message handler tries to write message data into the Header Partition of the Message RAM due to faulty configuration of a Message Buffer. The write attempt is not executed  to protect the Header Partition from unintended write accesses.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
