J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>TXRQ1</name>
					<description>Transmission Request Register 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>800</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXR0</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR1</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR2</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR3</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR4</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR5</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR6</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR7</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR8</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR9</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR10</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR11</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR12</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR13</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR14</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR15</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR16</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR17</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR18</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR19</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR20</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR21</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR22</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR23</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR24</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR25</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR26</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR27</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR28</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR29</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR30</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR31</name>
							<description>Transmission Request 31  n   0 31    TXR31. If the flag is set  the respective Message Buffer 0 to 31 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
