J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>TXRQ2</name>
					<description>Transmission Request Register 2
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>804</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXR32</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR33</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR34</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR35</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR36</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR37</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR38</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR39</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR40</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR41</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR42</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR43</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR44</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR45</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR46</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR47</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR48</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR49</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR50</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR51</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR52</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR53</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR54</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR55</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR56</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR57</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR58</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR59</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR60</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR61</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR62</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR63</name>
							<description>Transmission Request 63  n   32 63    TXR63. If the flag is set  the respective Message Buffer 32 to 63 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
