J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>TXRQ3</name>
					<description>Transmission Request Register 3
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>808</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXR64</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR65</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR66</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR67</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR68</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR69</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR70</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR71</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR72</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR73</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR74</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR75</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR76</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR77</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR78</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR79</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR80</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR81</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR82</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR83</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR84</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR85</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR86</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR87</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR88</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR89</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR90</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR91</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR92</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR93</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR94</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR95</name>
							<description>Transmission Request 95  n   64 95    TXR95. If the flag is set  the respective Message Buffer 64 to 95 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
