J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>TXRQ4</name>
					<description>Transmission Request Register 4
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>812</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXR96</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR97</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR98</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR99</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR100</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR101</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR102</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR103</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR104</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR105</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR106</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR107</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR108</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR109</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR110</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR111</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR112</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR113</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR114</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR115</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR116</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR117</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR118</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR119</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR120</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR121</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR122</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR123</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR124</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR125</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR126</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXR127</name>
							<description>Transmission Request 127  n   96 127    TXR127. If the flag is set  the respective Message Buffer 96 to 127 is ready for transmission respectively transmission of this Message Buffer is in progress. In single shot mode the flags are reset after transmission has completed.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
