J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MBSC3</name>
					<description>Message Buffer Status Changed 3
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>840</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MBC64</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC65</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC66</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC67</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC68</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC69</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC70</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC71</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC72</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC73</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC74</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC75</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC76</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC77</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC78</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC79</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC80</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC81</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC82</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC83</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC84</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC85</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC86</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC87</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC88</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC89</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC90</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC91</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC92</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC93</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC94</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBC95</name>
							<description>Message Buffer Status Changed 95  n   64 95    MBC95. An MBC flags is set whenever the Message Handler changes on of the        status flags VFRA  VFRB  SEOA  SEOB  CEOA  CEOB  SVOA  SVOB  TCIA  TCIB         ESA  ESB  MLST  FTA  FTB in the Header Section  see   8220 Message Buffer        Status  8221   of the respective Message Buffer  160 64 to Message Buffer  160 95. The        flags are reset when the Header Section of the Message Buffer is        reconfigured or when it has been transferred to the Output Buffer.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
