J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>NDIC1</name>
					<description>New Data Interrupt Control 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>936</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>NDIP0</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP1</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP2</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP3</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP4</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP5</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP6</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP7</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP8</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP9</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP10</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP11</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP12</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP13</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP14</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP15</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP16</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP17</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP18</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP19</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP20</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP21</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP22</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP23</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP24</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP25</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP26</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP27</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP28</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP29</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP30</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP31</name>
							<description>New Data Interrupt Pointer 31  n   0 31    NDIP31. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NDIC2</name>
					<description>New Data Interrupt Control 2
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>940</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>NDIP32</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP33</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP34</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP35</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP36</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP37</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP38</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP39</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP40</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP41</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP42</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP43</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP44</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP45</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP46</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP47</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP48</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP49</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP50</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP51</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP52</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP53</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP54</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP55</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP56</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP57</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP58</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP59</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP60</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP61</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP62</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP63</name>
							<description>New Data Interrupt Pointer 63  n   32 63    NDIP63. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
