J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>NDIC3</name>
					<description>New Data Interrupt Control 3
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>944</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>NDIP64</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP65</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP66</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP67</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP68</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP69</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP70</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP71</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP72</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP73</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP74</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP75</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP76</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP77</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP78</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP79</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP80</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP81</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP82</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP83</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP84</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP85</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP86</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP87</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP88</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP89</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP90</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP91</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP92</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP93</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP94</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP95</name>
							<description>New Data Interrupt Pointer 95  n   64 95    NDIP95. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NDIC4</name>
					<description>New Data Interrupt Control 4
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>948</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>NDIP96</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP97</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP98</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP99</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP100</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP101</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP102</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP103</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP104</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP105</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP106</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP107</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP108</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP109</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP110</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP111</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP112</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP113</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP114</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP115</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP116</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP117</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP118</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP119</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP120</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP121</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP122</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP123</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP124</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP125</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP126</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIP127</name>
							<description>New Data Interrupt Pointer 127  n   96 127    NDIP127. NDIPn determines the interrupt  NDAT0SRC or NDAT1SRC  of the service request output that becomes active on a New Data Flag becoming active.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
