J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MSIC2</name>
					<description>Message Buffer Status Changed Interrupt Control 2
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>956</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MSIP32</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP33</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP34</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP35</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP36</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP37</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP38</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP39</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP40</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP41</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP42</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP43</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP44</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP45</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP46</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP47</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP48</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP49</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP50</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP51</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP52</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP53</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP54</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP55</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP56</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP57</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP58</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP59</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP60</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP61</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP62</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP63</name>
							<description>Message Buffer Status Changed Interrupt Pointer 63  n   32 63    MSIP63. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service        request output that becomes active on a Message Buffer Status Changed        Flag becoming active.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
