J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MSIC3</name>
					<description>Message Buffer Status Changed Interrupt Control 3
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>960</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MSIP64</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP65</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP66</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP67</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP68</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP69</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP70</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP71</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP72</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP73</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP74</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP75</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP76</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP77</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP78</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP79</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP80</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP81</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP82</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP83</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP84</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP85</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP86</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP87</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP88</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP89</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP90</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP91</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP92</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP93</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP94</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP95</name>
							<description>Message Buffer Status Changed Interrupt Pointer 95  n   64 95    MSIP95. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
