J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MSIC4</name>
					<description>Message Buffer Status Changed Interrupt Control 4
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>964</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MSIP96</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP97</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP98</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP99</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP100</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP101</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP102</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP103</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP104</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP105</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP106</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP107</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP108</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP109</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP110</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP111</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP112</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP113</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP114</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP115</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP116</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP117</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP118</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP119</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP120</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP121</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP122</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP123</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP124</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP125</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP126</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSIP127</name>
							<description>Message Buffer Status Changed Interrupt Pointer 127  n   96 127    MSIP127. MSIPn determines the interrupt  MBSC0SRC or MBSC1SRC  of the service request output that becomes active on a Message Buffer Status Changed Flag becoming active.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CREL</name>
					<description>Core Release Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1008</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>DAY</name>
							<description>Design Time Stamp  Day   DAY. Two digits  BCD coded.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MON</name>
							<description>Design Time Stamp  Month   MON. Two digits  BCD coded.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>YEAR</name>
							<description>Design Time Stamp  Year   YEAR. One digit  BCD coded.</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SUBSTEP</name>
							<description>Sub Step of Core Release   SUBSTEP. One digits  BCD coded.</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>STEP</name>
							<description>Step of Core Release   STEP. One digits  BCD coded.</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>REL</name>
							<description>Core Release   REL. One digit  BCD coded.</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ENDN</name>
					<description>Endian Register
 resetvalue={Application Reset:0x087654321}</description>
					<addressOffset>1012</addressOffset>
					<size>32</size>
					<resetValue>2271560481</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ETV</name>
							<description>Endianness Test Value   ETV. The endianness test value.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>64</dim>
					<dimIncrement>4</dimIncrement>
					<name>WRDSn[%s]</name>
					<description>Write Data Section 01
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1024</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MDWB0</name>
							<description>32 Bit Word nn  Byte 0   MDWB0</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MDWB1</name>
							<description>32 Bit Word nn  Byte 1   MDWB1</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MDWB2</name>
							<description>32 Bit Word nn  Byte 2   MDWB2</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MDWB3</name>
							<description>32 Bit Word nn  Byte 3   MDWB3</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WRHS1</name>
					<description>Write Header Section 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1280</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FID</name>
							<description>Frame ID   FID. Frame ID of the selected Message Buffer. The Frame ID defines the slot        number for transmission   reception of the respective message. Message        Buffers with Frame ID   0 are considered as not valid.</description>
							<lsb>0</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CYC</name>
							<description>Cycle Code   CYC. The 7 bit cycle code determines the cycle set used for cycle counter        filtering. For details about the configuration of the cycle code see        Section  160  quot Cycle Counter Filtering quot .</description>
							<lsb>16</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CHA</name>
							<description>Channel Filter Control A   CHA. The channel filtering field A associated with the buffer serves of        channel A as a filter for receive buffers  and as a control field for        transmit buffers</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CHB</name>
							<description>Channel Filter Control B   CHB. The channel filtering field B associated with the buffer serves of        channel B as a filter for receive buffers  and as a control field for        transmit buffers</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CFG</name>
							<description>Message Buffer Direction Configuration Bit   CFG. This bit is used to configure the corresponding buffer as a transmit        buffer or as a receive buffer. For Message Buffers belonging to the        receive FIFO the bit is not evaluated.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PPIT</name>
							<description>Payload Preamble Indicator Transmit   PPIT. This bit is used to control the state of the Payload Preamble Indicator        in transmit Frames. If the bit is set in a static Message Buffer  the        respective Message Buffer holds Network Management information. If the        bit is set in a dynamic Message Buffer the first two byte of the Payload        Segment may be used for message ID filtering by the receiver. Message ID        filtering of received FlexRay  8482  Frames is not supported by the E Ray module  but can be done by the Host.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXM</name>
							<description>Transmission Mode   TXM. This bit is used to select the transmission mode  see   8220 Transmit        Buffers  8221  .</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MBI</name>
							<description>Message Buffer Service Request   MBI. This bit enables the receive   transmit service request for the        corresponding Message Buffer. After a dedicated receive buffer has been        updated by the Message Handler  flag SIR.RXI and  or SIR.MBSI in the        Status Service Request register are set. After a transmission has        completed flag SIR.TXI is set.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WRHS2</name>
					<description>Write Header Section 2
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1284</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CRC</name>
							<description>Header CRC vRF Header HeaderCRC    CRC. Receive Buffer  Configuration not required Transmit Buffer  Header CRC calculated and configured by the Host. For calculation of the Header CRC the payload length of the Frame send on the bus has to be considered. In static segment the payload length of all Frames is configured by MHDC.SFDL.</description>
							<lsb>0</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PLC</name>
							<description>Payload Length Configured   PLC. Length of Data Section  number of 2 byte words  as configured by the Host. During static segment the static Frame payload length as configured by MHDC.SFDL in the MHD Configuration Register defines the payload length for all static Frames. If the payload length configured by PLC is shorter than this value padding byte are inserted to ensure that Frames have proper physical length. The padding pattern is logical zero.</description>
							<lsb>16</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WRHS3</name>
					<description>Write Header Section 3
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1288</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DP</name>
							<description>Data Pointer   DP. Pointer to the first 32 bit word of the Data Section of the addressed Message Buffer in the Message RAM.</description>
							<lsb>0</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
