J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>IBCM</name>
					<description>Input Buffer Command Mask
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1296</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LHSH</name>
							<description>Load Header Section Host   LHSH</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LDSH</name>
							<description>Load Data Section Host   LDSH</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STXRH</name>
							<description>Set Transmission Request Host   STXRH. If this bit is set to 1  the Transmission Request flag TXRQ1.TXRn  n   0 31  to TXRQ4.TXRn  n   96 127  for the selected Message Buffer is set in the Transmission Request Registers to release the Message Buffer for transmission. In single shot mode the flag is cleared by the Communication Controller after transmission has completed. TXRQ1.TXRn  n   0 31  to TXRQ4.TXRn  n   96 127  are evaluated for transmit buffer only.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LHSS</name>
							<description>Load Header Section Shadow   LHSS</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LDSS</name>
							<description>Load Data Section Shadow   LDSS</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>STXRS</name>
							<description>Transmission Request Shadow   STXRS. If this bit is set to 1  the Transmission Request flag TXRQ1.TXRn  n   0 31  to TXRQ4.TXRn  n   96 127  for the selected Message Buffer is set in the Transmission Request Registers to release the Message Buffer for transmission. In single shot mode the flag is cleared by the Communication Controller after transmission has completed. TXRQ1.TXRn  n   0 31  to TXRQ4.TXRn  n   96 127  are evaluated for transmit buffer only.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IBCR</name>
					<description>Input Buffer Command Request
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1300</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>IBRH</name>
							<description>Input Buffer Request Host   IBRH. Selects the target Message Buffer in the Message RAM for data transfer from Input Buffer. Valid values are 00 H to 7F H  0 127 .</description>
							<lsb>0</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IBSYH</name>
							<description>Input Buffer Busy Host   IBSYH. Set to 1 by writing IBRH while IBSYS is still 1. After the ongoing transfer between IBF Shadow and the Message RAM has completed  the IBSYH is set back to 0.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IBRS</name>
							<description>Input Buffer Request Shadow   IBRS. Number of the target Message Buffer actually updated lately updated. Valid values are 00 H to 7F H  0 127 .</description>
							<lsb>16</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IBSYS</name>
							<description>Input Buffer Busy Shadow   IBSYS. Set to 1 after writing IBRH. When the transfer between IBF Shadow and the Message RAM has completed  IBSYS is set back to 0.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>64</dim>
					<dimIncrement>4</dimIncrement>
					<name>RDDSn[%s]</name>
					<description>Read Data Section 01
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1536</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MDRB0</name>
							<description>32 Bit Word nn  Byte 0   MDRB0</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MDRB1</name>
							<description>32 Bit Word nn  Byte 1   MDRB1</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MDRB2</name>
							<description>32 Bit Word nn  Byte 2   MDRB2</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MDRB3</name>
							<description>32 Bit Word nn  Byte 3   MDRB3</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RDHS1</name>
					<description>Read Header Section 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1792</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FID</name>
							<description>Frame ID   FID</description>
							<lsb>0</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CYC</name>
							<description>Cycle Code   CYC</description>
							<lsb>16</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CHA</name>
							<description>Channel Filter Control A   CHA</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CHB</name>
							<description>Channel Filter Control B   CHB</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CFG</name>
							<description>Message Buffer Direction Configuration Bit   CFG</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PPIT</name>
							<description>Payload Preamble Indicator Transmit   PPIT</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXM</name>
							<description>Transmission Mode   TXM</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MBI</name>
							<description>Message Buffer Service Request   MBI</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RDHS2</name>
					<description>Read Header Section 2
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1796</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CRC</name>
							<description>Header CRC vRF Header HeaderCRC    CRC. Receive Buffer  Configuration not required. Header CRC updated from receive Data Frames. Transmit Buffer  Header CRC calculated and configured by the Host</description>
							<lsb>0</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PLC</name>
							<description>Payload Length Configured   PLC. Length of Data Section  number of 2 byte words  as configured by the Host.</description>
							<lsb>16</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PLR</name>
							<description>Payload Length Received vRF Header Length    PLR. Payload length value updated from received Data Frame  exception  if Message Buffer belongs to the receive FIFO PLR is also updated from received NULL Frames . When a message is stored into a Message Buffer the following behavior with respect to payload length received and payload length configured is implemented  PLR  gt  PLC  The payload data stored in the Message Buffer is truncated to the payload length configured for even PLC or else truncated to PLC   1. PLR   PLC  The received payload data is stored into the Message Buffers Data Section. The remaining data bytes of the Data Section as configured by PLC are filled with undefined data. PLR   0  The Message Buffer s Data Section is filled with undefined data. PLC   0  Message Buffer has no Data Section configured. No data is stored into the  Message Buffer s Data Section.</description>
							<lsb>24</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RDHS3</name>
					<description>Read Header Section 3
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1800</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DP</name>
							<description>Data Pointer   DP. Pointer to the first 32 bit word of the Data Section of the addressed Message Buffer in the Message RAM.</description>
							<lsb>0</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RCC</name>
							<description>Receive Cycle Count vRF Header CycleCount    RCC. Cycle counter value updated from received Data Frame.</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RCI</name>
							<description>Received on Channel Indicator vSS Channel    RCI. Indicates the channel from which the received Data Frame was taken to update the respective receive buffer.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SFI</name>
							<description>Startup Frame Indicator vRF Header SuFIndicator    SFI. A Startup Frame is marked by the Startup Frame indicator.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SYN</name>
							<description>SYNC Frame Indicator vRF Header SyFIndicator    SYN. A SYNC Frame is marked by the SYNC Frame indicator.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>NFI</name>
							<description>NULL Frame Indicator vRF Header NFIndicator    NFI. Is set to 1 after storage of the first received Data Frame.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PPI</name>
							<description>Payload Preamble Indicator vRF Header PPIndicator    PPI. The payload preamble indicator defines whether a Network Management vector or message ID is contained within the Payload Segment of the received Frame.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MBS</name>
					<description>Message Buffer Status
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1804</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>VFRA</name>
							<description>Valid Frame Received on Channel A vSS ValidFrameA    VFRA. A valid Frame indication is set if a valid Frame was received on channel A.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>VFRB</name>
							<description>Valid Frame Received on Channel B vSS ValidFrameB    VFRB. A valid Frame indication is set if a valid Frame was received on channel B.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SEOA</name>
							<description>Syntax Error Observed on Channel A vSS SyntaxErrorA    SEOA. A syntax error was observed in the assigned slot on channel A.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SEOB</name>
							<description>Syntax Error Observed on Channel B vSS SyntaxErrorB    SEOB. A syntax error was observed in the assigned slot on channel B.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CEOA</name>
							<description>Content Error Observed on Channel A vSS ContentErrorA    CEOA. A content error was observed in the assigned slot on channel A.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CEOB</name>
							<description>Content Error Observed on Channel B vSS ContentErrorB    CEOB. A content error was observed in the assigned slot on channel B.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SVOA</name>
							<description>Slot Boundary Violation Observed on Channel A vSS BViolationA    SVOA. A slot boundary violation  channel active at the start or at the end of the assigned slot  was observed on channel A.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SVOB</name>
							<description>Slot Boundary Violation Observed on Channel B vSS BViolationB    SVOB. A slot boundary violation  channel active at the start or at the end of the assigned slot  was observed on channel B.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TCIA</name>
							<description>Transmission Conflict Indication Channel A vSS TxConflictA    TCIA. A transmission conflict indication is set if a transmission conflict has occurred on channel A.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TCIB</name>
							<description>Transmission Conflict Indication Channel B vSS TxConflictB    TCIB. A transmission conflict indication is set if a transmission conflict has occurred on channel B.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ESA</name>
							<description>Empty Slot Channel A   ESA. In an empty slot there is no activity detected on the bus. The condition is checked in static and dynamic slots.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ESB</name>
							<description>Empty Slot Channel B   ESB. In an empty slot there is no activity detected on the bus. The condition is checked in static and dynamic slots.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MLST</name>
							<description>Message Lost   MLST. The flag is set in case the Host did not read the message before the Message Buffer was updated from a received Data Frame. Not affected by reception of NULL Frames except for Message Buffers belonging to the receive FIFO. The flag is reset by a Host write to the Message Buffer via IBF or when a new message is stored into the Message Buffer after the Message Buffers ND flag was reset by reading out the Message Buffer via OBF.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FTA</name>
							<description>Frame Transmitted on Channel A   FTA. Indicates that this node has transmitted a Data Frame in the assigned slot on channel A. The FlexRay  protocol specification requires that FTA can only be reset by the Host. Therefore the Cycle Count Status CCS for these bits is only valid for the cycle where the bits are set to 1</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FTB</name>
							<description>Frame Transmitted on Channel B   FTB. Indicates that this node has transmitted a Data Frame in the assigned slot on channel B. The FlexRay  protocol specification requires that FTB can only be reset by the Host. Therefore the Cycle Count Status CCS for these bits is only valid for the cycle where the bits are set to 1</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CCS</name>
							<description>Cycle Count Status   CCS. Cycle Count when status  MBS register  has been updated.</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RCIS</name>
							<description>Received on Channel Indicator Status vSS Channel    RCIS. Indicates the channel on which the Frame was received. For receive buffers  CFG   0  the RCIS is updated from both valid data and NULL Frames. If no valid Frame was received  the previous value is maintained. For transmit buffers the flags have no meaning and should be ignored.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SFIS</name>
							<description>Startup Frame Indicator Status vRF Header SuFIndicator    SFIS. A Startup Frame is marked by the Startup Frame indicator. For receive buffers  CFG   0  the SFIS is updated from both valid data and NULL Frames. If no valid Frame was received  the previous value is maintained. For transmit buffers the flags have no meaning and should be ignored.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SYNS</name>
							<description>SYNC Frame Indicator Status vRF Header SyFIndicator    SYNS. A SYNC Frame is marked by the SYNC Frame indicator. For receive buffers  CFG   0  the SYNS is updated from both valid data and NULL Frames. If no valid Frame was received  the previous value is maintained. For transmit buffers the flags have no meaning and should be ignored.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>NFIS</name>
							<description>NULL Frame Indicator Status vRF Header NFIndicator    NFIS. If reset to 0 the Payload Segment of the received Frame contains no usable data. For receive buffers  CFG   0  the NFIS is updated from both valid data and NULL Frames. If no valid Frame was received  the previous value is maintained. For transmit buffers the flags have no meaning and should be ignored.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PPIS</name>
							<description>Payload Preamble Indictor Status vRF Header PPIndicator    PPIS. The payload preamble indicator defines whether a Network Management vector or message ID is contained within the Payload Segment of the received Frame. For receive buffers  CFG   0  the PPIS is updated from both valid data and NULL Frames. If no valid Frame was received  the previous value is maintained. For transmit buffers the flags have no meaning and should be ignored.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OBCM</name>
					<description>Output Buffer Command Mask
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1808</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RHSS</name>
							<description>Read Header Section Shadow   RHSS</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RDSS</name>
							<description>Read Data Section Shadow   RDSS</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RHSH</name>
							<description>Read Header Section Host   RHSH</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RDSH</name>
							<description>Read Data Section Host   RDSH</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OBCR</name>
					<description>Output Buffer Command Request
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1812</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>OBRS</name>
							<description>Output Buffer Request Shadow   OBRS. Number of source Message Buffer to be transferred from the Message RAM        to OBF Shadow. Valid values are 00 H to 7F H  0 to 127 . If the number of the first Message Buffer of the receive FIFO is written        to this register the Message Handler transfers the Message Buffer        addressed by the GET Index Register  GIDX    8220 FIFO Function  8221   to OBF        Shadow.</description>
							<lsb>0</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VIEW</name>
							<description>View Shadow Buffer   VIEW. Toggles between OBF Shadow and OBF Host. Only writeable while OBCR.OBSYS   0.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REQ</name>
							<description>Request Message RAM Transfer   REQ. Requests transfer of Message Buffer addressed by OBCR.OBRS from Message RAM to OBF Shadow. Only writeable while OBCR.OBSYS   0.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OBSYS</name>
							<description>Output Buffer Busy Shadow   OBSYS. Set to 1 after setting bit OBCR.REQ. When the transfer between the        Message RAM and OBF Shadow has completed  OBCR.OBSYS is cleared again.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OBRH</name>
							<description>Output Buffer Request Host   OBRH. Number of Message Buffer currently accessible by the Host via RDHS1 to        RDHS3  MBS  and RDDSnn  nn   01 64 . By setting OBCR.VIEW OBF Shadow and        OBF Host are swapped and the transferred Message Buffer is accessible by        the Host. Valid values are 00 H to 7F H  01 to 127 .</description>
							<lsb>16</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
