J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>GETH</name>
			<version>100</version>
			<description>GETH</description>
			<baseAddress>4026650624</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>8276</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<cluster>
					<name>MTL_TXQ0</name>
					<description>MTL TXQ0</description>
					<addressOffset>3328</addressOffset>
					<register>
						<name>MTL_TXQ0_OPERATION_MODE</name>
						<description>MTL Queue 0 Transmit Operation Mode Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>FTQ</name>
								<description>Flush Transmit Queue   FTQ. When this bit is set  the Tx queue controller logic is reset to its default values. Therefore  all the data in the Tx queue is lost or flushed. This bit is internally reset when the flushing operation is complete. Until this bit is reset  you should not write to the MTL TxQ1 Operation Mode register. The data which is already accepted by the MAC transmitter is not flushed. It is scheduled for transmission and results in underflow and runt packet transmission. Note   The flush operation is complete only when the Tx queue is empty and the application has accepted the pending Tx Status of all transmitted packets. To complete this flush operation  the PHY Tx clock  clk tx i  should be active. Access restriction applies. Setting 1 sets. Self cleared. Setting 0 has no effect. Value After Reset  0x0</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TSF</name>
								<description>Transmit Store and Forward   TSF. When this bit is set  the transmission starts when a full packet resides in the MTL Tx queue. When this bit is set  the TTC values specified in Bits 6 4  of this register are ignored. This bit should be changed only when the transmission is stopped. Value After Reset  0x0</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TXQEN</name>
								<description>Transmit Queue Enable   TXQEN. This field is used to enable disable the transmit queue 0. This field is        Read Only in Single Queue configurations and Read Write in Multiple        Queue configurations. Note   In multiple Tx queues configuration         all the queues are disabled by default. Enable the Tx queue by        programming this field. Value After Reset  0x0</description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TTC</name>
								<description>Transmit Threshold Control   TTC. These bits control the threshold level of the MTL Tx Queue. The        transmission starts when the packet size within the MTL Tx Queue is        larger than the threshold. In addition  full packets with length less        than the threshold are also transmitted. These bits are used only when        the TSF bit is reset. Value After Reset  0x0</description>
								<lsb>4</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TQS</name>
								<description>Transmit Queue Size   TQS. This field indicates the size of the allocated Transmit queues in blocks        of 256 bytes. The TQS field is read write only if the number of Tx        Queues more than one  the reset value is 0x0 and indicates size of 256        bytes. When the number of Tx Queues is one  the field is read only and        the configured TX FIFO size in blocks of 256 bytes is reflected in the        reset value. The width of this field depends on the Tx memory size        selected in your configuration. For example  if the memory size is 2048         the width of this field is 3 bits  LOG2 2048 256    LOG2 8    3 bits Value After Reset  0x0</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MTL_TXQ0_UNDERFLOW</name>
						<description>MTL Queue 0 Transmit Underflow Counter Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>UFFRMCNT</name>
								<description>Underflow Packet Counter   UFFRMCNT. This field indicates the number of packets aborted by the controller because of Tx Queue Underflow. This counter is incremented each time the MAC aborts outgoing packet because of underflow. The counter is cleared when this register is read with mci be i 0  at 1 b1. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
								<lsb>0</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>UFCNTOVF</name>
								<description>Overflow Bit for Underflow Packet Counter   UFCNTOVF. This bit is set every time the Tx queue Underflow Packet Counter field overflows  that is  it has crossed the maximum count. In such a scenario  the overflow packet counter is reset to all zeros and this bit indicates that the rollover happened. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MTL_TXQ0_DEBUG</name>
						<description>MTL Queue 0 Transmit Debug Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TXQPAUSED</name>
								<description>Transmit Queue in Pause   TXQPAUSED. When this bit is high and the Rx flow control is enabled  it indicates that the Tx Queue is in the Pause condition  in the full duplex only mode  because of the following  Reception of the PFC packet for the priorities assigned to the Tx Queue when PFC is enabled Reception of 802.3x Pause packet when PFC is disabled Value After Reset  0x0</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TRCSTS</name>
								<description>MTL Tx Queue Read Controller Status   TRCSTS. This field indicates the state of the Tx Queue Read Controller  Value After Reset  0x0</description>
								<lsb>1</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TWCSTS</name>
								<description>MTL Tx Queue Write Controller Status   TWCSTS. When high  this bit indicates that the MTL Tx Queue Write Controller is active  and it is transferring the data to the Tx Queue. Value After Reset  0x0</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TXQSTS</name>
								<description>MTL Tx Queue Not Empty Status   TXQSTS. When this bit is high  it indicates that the MTL Tx Queue is not empty and some data is left for transmission. Value After Reset  0x0</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TXSTSFSTS</name>
								<description>MTL Tx Status FIFO Full Status   TXSTSFSTS. When high  this bit indicates that the MTL Tx Status FIFO is full. Therefore  the MTL cannot accept any more packets for transmission. Value After Reset  0x0</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>PTXQ</name>
								<description>Number of Packets in the Transmit Queue   PTXQ. This field indicates the current number of packets in the Tx Queue. When the DTXSTS bit of MTL Operation Mode register is set to 1  this field does not reflect the number of packets in the Transmit queue. Value After Reset  0x0</description>
								<lsb>16</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>STXSTSF</name>
								<description>Number of Status Words in Tx Status FIFO of Queue   STXSTSF. This field indicates the current number of status in the Tx Status FIFO of this queue. When the DTXSTS bit of MTL Operation Mode register is set to 1  this field does not reflect the number of status words in Tx Status FIFO. Value After Reset  0x0</description>
								<lsb>20</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MTL_TXQ0_ETS_STATUS</name>
						<description>MTL Queue 0 Transmit Status Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>20</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ABS</name>
								<description>Average Bits per Slot This field contains the average transmitted bits per slot.   ABS. When the DCB operation is enabled for Queue 0  this field is computed over every 10 million bit times slot  10 ms in 1000 Mbps  100 ms in 100 Mbps . The maximum value is 0x989680. Value After Reset  0x0</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MTL_TXQ0_QUANTUM_WEIGHT</name>
						<description>MTL Queue 0 Transmit Quantum or Weights Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>24</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ISCQW</name>
								<description>Quantum or Weights   ISCQW. When the DCB operation is enabled with DWRR algorithm for Queue 0 traffic  this field contains the quantum value in bytes to be added to credit during every queue scanning cycle. The maximum value is 0x1312D0 bytes. When DCB operation is enabled with WFQ algorithm for Queue 0 traffic  this field contains the weight for this queue. The maximum value is 0x3FFF where weight of 0 indicates 100  bandwidth. Bits 20 14  must be written to zero. When DCB operation or generic queueing operation is enabled with WRR algorithm for Queue 0 traffic  this field contains the weight for this queue. The maximum value is 0x64. Bits  20 7  must be written to zero. Value After Reset  0x0</description>
								<lsb>0</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<name>MTL_Q0</name>
					<description>MTL Q0</description>
					<addressOffset>3372</addressOffset>
					<register>
						<name>MTL_Q0_INTERRUPT_CONTROL_STATUS</name>
						<description>MTL Queue 0 Interrupt Control Status Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TXUNFIS</name>
								<description>Transmit Queue Underflow Interrupt Status   TXUNFIS. This bit indicates that the Transmit Queue had an underflow while transmitting the packet. Transmission is suspended and an Underflow Error TDES3 2  is set. This bit is cleared when the application writes 1 to this bit. Access restriction applies. Self set to 1 on internal event. Setting 1 clears. Setting 0 has no effect. Value After Reset  0x0</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABPSIS</name>
								<description>Average Bits Per Slot Interrupt Status   ABPSIS. When set  this bit indicates that the MAC has updated the ABS value. This bit is cleared when the application writes 1 to this bit. Access restriction applies. Self set to 1 on internal event. Setting 1 clears. Setting 0 has no effect. Value After Reset  0x0</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TXUIE</name>
								<description>Transmit Queue Underflow Interrupt Enable   TXUIE. When this bit is set  the Transmit Queue Underflow interrupt is enabled. When this bit is reset  the Transmit Queue Underflow interrupt is disabled. Value After Reset  0x0</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ABPSIE</name>
								<description>Average Bits Per Slot Interrupt Enable   ABPSIE. When this bit is set  the MAC asserts the sbd intr o or mci intr o interrupt when the average bits per slot status is updated. When this bit is cleared  the interrupt is not asserted for such an event. Value After Reset  0x0</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RXOVFIS</name>
								<description>Receive Queue Overflow Interrupt Status   RXOVFIS. This bit indicates that the Receive Queue had an overflow while receiving the packet. If a partial packet is transferred to the application  the overflow status is set in RDES3 21 . This bit is cleared when the application writes 1 to this bit. Access restriction applies. Self set to 1 on internal event. Setting 1 clears. Setting 0 has no effect. Value After Reset  0x0</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RXOIE</name>
								<description>Receive Queue Overflow Interrupt Enable   RXOIE. When this bit is set  the Receive Queue Overflow interrupt is enabled. When this bit is reset  the Receive Queue Overflow interrupt is disabled. Value After Reset  0x0</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<name>MTL_RXQ0</name>
					<description>MTL RXQ0</description>
					<addressOffset>3376</addressOffset>
					<register>
						<name>MTL_RXQ0_OPERATION_MODE</name>
						<description>MTL Queue 0 Receive Operation Mode Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RTC</name>
								<description>Receive Queue Threshold Control   RTC. These bits control the threshold level of the MTL Rx queue  in bytes   The received packet is transferred to the application or DMA when the packet size within the MTL Rx queue is larger than the threshold. In addition  full packets with length less than the threshold are automatically transferred. This field is valid only when the RSF bit is zero. This field is ignored when the RSF bit is set to 1. Value After Reset  0x0</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FUP</name>
								<description>Forward Undersized Good Packets   FUP. When this bit is set  the Rx queue forwards the undersized good packets  packets with no error and length less than 64 bytes   including pad bytes and CRC. When this bit is reset  the Rx queue drops all packets of less than 64 bytes  unless a packet is already transferred because of the lower value of Rx Threshold  for example  RTC   01. Value After Reset  0x0</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FEP</name>
								<description>Forward Error Packets   FEP. When this bit is reset  the Rx queue drops packets with error status  CRC error  GMII ER  watchdog timeout  or overflow . However  if the start byte  write  pointer of a packet is already transferred to the read controller side  in Threshold mode   the packet is not dropped. When this bit is set  all packets except the runt error packets are forwarded to the application or DMA. If the RSF bit is set and the Rx queue overflows when a partial packet is written  the packet is dropped irrespective of the setting of this bit. However  if the RSF bit is reset and the Rx queue overflows when a partial packet is written  a partial packet may be forwarded to the application or DMA. Value After Reset  0x0</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSF</name>
								<description>Receive Queue Store and Forward   RSF. When this bit is set  the DWC ether qos reads a packet from the Rx queue only after the complete packet has been written to it  ignoring the RTC field of this register. When this bit is reset  the Rx queue operates in the Threshold  cut through  mode  subject to the threshold specified by the RTC field of this register. Value After Reset  0x0</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DIS_TCP_EF</name>
								<description>Disable Dropping of TCP IP Checksum Error Packets   DIS TCP EF. When this bit is set  the MAC does not drop the packets which only have the errors detected by the Receive Checksum Offload engine. Such packets have errors only in the encapsulated payload. There are no errors  including FCS error  in the Ethernet packet received by the MAC. When this bit is reset  all error packets are dropped if the FEP bit is reset. Value After Reset  0x0</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EHFC</name>
								<description>Enable Hardware Flow Control   EHFC. When this bit is set  the flow control signal operation  based on the fill level of Rx queue  is enabled. When reset  the flow control operation is disabled. Value After Reset  0x0</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RFA</name>
								<description>Threshold for Activating Flow Control  in half duplex and full duplex   RFA. These bits control the threshold  fill level of Rx queue  at which the flow control is activated  For more information on encoding for this field  see RFD. Value After Reset  0x0</description>
								<lsb>8</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RFD</name>
								<description>Threshold for Deactivating Flow Control  in half duplex and full duplex modes    RFD. These bits control the threshold  fill level of Rx queue  at which the flow control is de asserted after activation  LOST SEQUENCE DEFINITION The de assertion is effective only after flow control is asserted. Note  The value must be programmed in such a way to make sure that the threshold is a positive number. When the EHFC is set high  these values are applicable only when the Rx queue size determined by the RQS field of this register  is equal to or greater than 4 KB. For a given queue size  the values ranges between 0 and the encoding for FULL minus  QSIZE   0.5 KB  and all other values are illegal. Here the term FULL and QSIZE refers to the queue size determined by the RQS field of this register. The width of this field depends on RX FIFO size selected during the configuration. Remaining bits are reserved and read only. Value After Reset  0x0</description>
								<lsb>14</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RQS</name>
								<description>Receive Queue Size   RQS. This field indicates the size of the allocated Receive queues in blocks        of 256 bytes. The RQS field is read write only if the number of Rx        Queues more than one  the reset value is 0x0 and indicates size of 256        bytes. When the number of Rx Queues is one  the field is read only and the        configured RX FIFO size in blocks of 256 bytes is reflected in the reset        value. The width of this field depends on the Rx memory size selected in your        configuration. For example  if the memory size is 2048  the width of        this field is 3 bits  LOG2 2048 256    LOG2 8    3 bits Value After Reset  0x0</description>
								<lsb>20</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT</name>
						<description>MTL Queue 0 Receive Missed Packet and Overflow Counter Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>OVFPKTCNT</name>
								<description>Overflow Packet Counter   OVFPKTCNT. This field indicates the number of packets discarded by the DWC ether qos because of Receive queue overflow. This counter is incremented each time the DWC ether qos discards an incoming packet because of overflow. This counter is reset when this register is read with mci be i 0  at 1 b1. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
								<lsb>0</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>OVFCNTOVF</name>
								<description>Overflow Counter Overflow Bit   OVFCNTOVF. When set  this bit indicates that the Rx Queue Overflow Packet Counter field crossed the maximum limit. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>MISPKTCNT</name>
								<description>Missed Packet Counter   MISPKTCNT. This field indicates the number of packets missed by the DWC ether qos because the application asserted ari pkt flush i   for this queue. This counter is reset when this register is read with mci be i 0  at 1b1. This counter is incremented by 1 when the DMA discards the packet because of buffer unavailability. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
								<lsb>16</lsb>
								<msb>26</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>MISCNTOVF</name>
								<description>Missed Packet Counter Overflow Bit   MISCNTOVF. When set  this bit indicates that the Rx Queue Missed Packet Counter crossed the maximum limit. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
