J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>MTL_RXQ0_DEBUG</name>
						<description>MTL Queue 0 Receive Debug Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RWCSTS</name>
								<description>MTL Rx Queue Write Controller Active Status   RWCSTS. When high  this bit indicates that the MTL Rx queue Write controller is        active  and it is transferring a received packet to the Rx Queue. Value After Reset  0x0</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RRCSTS</name>
								<description>MTL Rx Queue Read Controller State   RRCSTS. This field gives the state of the Rx queue Read controller  Value After Reset  0x0</description>
								<lsb>1</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RXQSTS</name>
								<description>MTL Rx Queue Fill Level Status   RXQSTS. This field gives the status of the fill level of the Rx Queue  Value After Reset  0x0</description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>PRXQ</name>
								<description>Number of Packets in Receive Queue   PRXQ. This field indicates the current number of packets in the Rx Queue. The theoretical maximum value for this field is 256KB 16B   16K Packets  that is  Max Queue Size Min Packet Size. Value After Reset  0x0</description>
								<lsb>16</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>MTL_RXQ0_CONTROL</name>
						<description>MTL Queue 0 Receive Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>12</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RXQ_WEGT</name>
								<description>Receive Queue Weight   RXQ WEGT. This field indicates the weight assigned to the Rx Queue 0. The weight is used as the number of continuous PBL or packets requests  depending on the RXQ FRM ARBIT  allocated to the queue in one arbitration cycle. Value After Reset  0x0</description>
								<lsb>0</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RXQ_FRM_ARBIT</name>
								<description>Receive Queue Packet Arbitration   RXQ FRM ARBIT. When this bit is set  the DWC ether qos drives the packet data to the ARI interface such that the entire packet data of currently selected queue is transmitted before switching to other queue. When this bit is reset  the DWC ether qos drives the packet data to the ARI interface such that the following amount of data of currently selected queue is transmitted before switching to other queue  PBL amount of data  indicated by ari qN pbl i    or Complete data of a packet The status and the timestamp are not a part of the PBL data. Therefore  the DWC ether qos drives the complete status  including timestamp status  during first PBL request for the packet  in store and forward mode  or the last PBL request for the packet  in Threshold mode . Value After Reset  0x0</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<dim>4</dim>
					<dimIncrement>128</dimIncrement>
					<name>DMA_CH[%s]</name>
					<description>DMA CH</description>
					<addressOffset>4352</addressOffset>
					<register>
						<name>DMA_CHi_CONTROL</name>
						<description>DMA Channel 0 Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>PBLx8</name>
								<description>8xPBL mode   PBLx8. When this bit is set  the PBL value programmed in Bits 21 16  in        DMA CH0 Tx Control and Bits 21 16  in DMA CH0 Rx Control is multiplied        by eight times. Therefore  the DMA transfers the data in 8  16  32  64         128  and 256 beats depending on the PBL value. Value After Reset  0x0</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DSL</name>
								<description>Descriptor Skip Length   DSL. This bit specifies the Word  Dword  or Lword number  depending on the 32 bit  64 bit  or 128 bit bus  to skip between two unchained descriptors. The address skipping starts from the end of the current descriptor to the start of the next descriptor. When the DSL value is equal to zero  the DMA takes the descriptor table as contiguous. Value After Reset  0x0</description>
								<lsb>18</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SPH</name>
								<description>Split Headers   SPH. When this bit is set  the DMA splits the header and payload in the Receive path. The DMA writes the header to the Buffer Address1 of RDES0. The DMA writes the payload to the buffer to which the Buffer Address2 is pointing. The software must ensure that the header fits into the Receive buffers. If the header length exceeds the receive buffer size  the DMA does not split the header and payload. This bit is available only if Enable Split Header Structure option is selected. Value After Reset  0x0</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_CHi_TX_CONTROL</name>
						<description>DMA Channel 0 Transmit Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ST</name>
								<description>Start or Stop Transmission Command   ST. When this bit is set  transmission is placed in the Running state. The DMA checks the Transmit list at the current position for a packet to be transmitted. The DMA tries to acquire descriptor from either of the following positions  The current position in the list This is the base address of the Transmit list set by the DMA CH0 TxDesc List Address register. The position at which the transmission was previously stopped If the DMA does not own the current descriptor  the transmission enters the Suspended state and the TBU bit of the DMA CH0 Status register is set. The Start Transmission command is effective only when the transmission is stopped. If the command is issued before setting the DMA CH0 TxDesc List Address register  the DMA behavior is unpredictable. When this bit is reset  the transmission process is placed in the Stopped state after completing the transmission of the current packet. The Next Descriptor position in the Transmit list is saved  and it becomes the current position when the transmission is restarted. To change the list address  you need to program DMA CH0 TxDesc List Address register with a new value when this bit is reset. The new value is considered when this bit is set again. The stop transmission command is effective only when the transmission of the current packet is complete or the transmission is in the Suspended state. Value After Reset  0x0</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TCW</name>
								<description>Transmit Channel Weight   TCW. This field indicates the weight assigned to the corresponding Transmit channel. When reset is complete  this field is set to 0 for all channels by default  resulting in equal weights to all channels. Value After Reset  0x0</description>
								<lsb>1</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OSF</name>
								<description>Operate on Second Packet   OSF. When this bit is set  it instructs the DMA to process the second packet        of the Transmit data even before the status for the first packet is        obtained. Value After Reset  0x0</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TxPBL</name>
								<description>Transmit Programmable Burst Length   TxPBL. These bits indicate the maximum number of beats to be transferred in one        DMA block data transfer. The DMA always attempts max burst as specified        in PBL each time it starts a burst transfer on the application bus. You        can program PBL with any of the following values  1  2  4  8  16  or 32.        Any other value results in undefined behavior. To transfer more than 32 beats  perform the following steps  1. Set the 8xPBL mode in DMA CH0 Control register. 2. Set the TxPBL. Note  The maximum value of TxPBL must be less than or equal to half the        Tx Queue size  TQS field of MTL TxQ n  Operation Mode register  in terms        of beats. This is required so that the Tx Queue has space to store at        least another Tx PBL worth of data while the MTL Tx Queue Controller is        transferring data to MAC. For example  in 64 bit data width        configurations the total locations in Tx Queue of size 512 bytes is 64         TxPBL and 8xPBL needs to be programmed to less than or equal to 32.        Value After Reset  0x0</description>
								<lsb>16</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_CHi_RX_CONTROL</name>
						<description>DMA Channel 0 Receive Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SR</name>
								<description>Start or Stop Receive   SR. When this bit is set  the DMA tries to acquire the descriptor from the        Receive list and processes the incoming packets. The DMA tries to acquire descriptor from either of the following        positions  The current position in the list This is the address set by the DMA CH0 RxDesc List Address register. The position at which the Rx process was previously stopped If the DMA does not own the current descriptor  the reception is        suspended and the RBU bit of the DMA CH0 Status register is set. The        Start Receive command is effective only when the reception is stopped.        If the command is issued before setting the DMA CH0 RxDesc List Address        register  the DMA behavior is unpredictable. When this bit is reset  the Rx DMA operation is stopped after the        transfer of the current packet. The next descriptor position in the        Receive list is saved  and it becomes the current position after the Rx        process is restarted. The Stop Receive command is effective only when        the Rx process is in the Running  waiting for Rx packet  or Suspended        state. Value After Reset  0x0</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RBSZ_x_0</name>
								<description>Receive Buffer size Low   RBSZ x 0. RBSZ 13 0  is split into two fields RBSZ 13 y and RBSZ x 0. The RBSZ x 0        is the lower field whose width is based on data bus width of the        configuration. This field is of width 2  3  or 4 bits for 32 bit         64 bit  or 128 bit data bus width respectively. This field is read only         RO . Value After Reset  0x0</description>
								<lsb>1</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RBSZ_13_y</name>
								<description>Receive Buffer size High   RBSZ 13 y. RBSZ 13 0  is split into two fields higher RBSZ 13 y and lower RBSZ x 0.        The RBSZ 13 0  field indicates the size of the Rx buffers specified in        bytes. The maximum buffer size is limited to 16K bytes. The buffer size        is applicable to payload buffers when split headers are enabled. Note   The buffer size must be a multiple of        4  8  or 16 depending on the data bus widths  32 bit  64 bit  or 128 bit        respectively . This is required even if the value of buffer address        pointer is not aligned to data bus width. Hence the lower RBSZ x 0 bits        are read only and the value is considered as allzero. Thus the RBSZ 13 y        indicates the buffer size in terms of locations  with the width same as        bus width . Value After Reset  0x0</description>
								<lsb>3</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RxPBL</name>
								<description>Receive Programmable Burst Length   RxPBL. These bits indicate the maximum number of beats to be transferred in one        DMA block data transfer. The DMA always attempts max burst as specified        in PBL each time it starts a burst transfer on the application bus. You        can program PBL with any of the following values  1  2  4  8  16  or 32.        Any other value results in undefined behavior. To transfer more than 32 beats  perform the following steps  1. Set the 8xPBL mode in the DMA CH0 Control register. 2. Set the RxPBL. Note  The maximum value of RxPBL must be less than or equal to half the        Rx Queue size  RQS field of MTL RxQ n  Operation Mode register  in terms        of beats. This is required so that the Rx Queue has space to store at        least another Rx PBL worth of data while the Rx DMA is transferring a        block of data. For example  in 64 bit data width configurations the        total locations in Rx Queue of size 512 bytes is 64  so RxPBL and 8xPBL        needs to be programmed to less than or equal to 32. Value After Reset         0x0</description>
								<lsb>16</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RPF</name>
								<description>DMA Rx Channel0 Packet Flush   RPF. When this bit is set to 1  then DWC ether qos automatically flushes the packet from the Rx Queues destined to this DMA Rx Channel  when it is stopped. When this bit remains set and the DMA is re started by the software driver  the packets residing in the Rx Queues that were received when this RxDMA was stopped  get flushed out. The packets that are received by the MAC after the RxDMA is re started are routed to the RxDMA. The flushing happens on the Read side of the Rx Queue. When this bit is set to 0  the DWC ether qos not flush the packet in the Rx Queue destined to this RxDMA Channel when it is STOP state. This may in turn cause head of line blocking in the corresponding RxQueue. Value After Reset  0x0</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_CHi_TXDESC_LIST_ADDRESS</name>
						<description>DMA Channel 0 Transmit Descriptor List Address Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>20</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TDESLA</name>
								<description>Start of Transmit List   TDESLA. This field contains the base address of the first descriptor in the Transmit descriptor list. The DMA ignores the LSB bits  1 0  2 0  or 3 0  for 32 bit  64 bit  or 128 bit bus width and internally takes these bits as all zero. Therefore  these LSB bits are read only  RO . The width of this field depends on the configuration  31 2 for 32 bit configuration 31 3 for 64 bit configuration 31 4 for 128 bit configuration Value After Reset  0x0</description>
								<lsb>2</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_CHi_RXDESC_LIST_ADDRESS</name>
						<description>DMA Channel 0 Receive Descriptor List Address Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>28</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RDESLA</name>
								<description>Start of Receive List   RDESLA. This field contains the base address of the first descriptor in the Rx Descriptor list. The DMA ignores the LSB bits  1 0  2 0  or 3 0  for 32 bit  64 bit  or 128 bit bus width and internally takes these bits as all zero. Therefore  these LSB bits are read only  RO . The width of this field depends on the configuration  31 2 for 32 bit configuration 31 3 for 64 bit configuration 31 4 for 128 bit configuration Value After Reset  0x0</description>
								<lsb>2</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_CHi_TXDESC_TAIL_POINTER</name>
						<description>DMA Channel 0 Transmit Descriptor Tail Pointer Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>32</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TDTP</name>
								<description>Transmit Descriptor Tail Pointer   TDTP. This field contains the tail pointer for the Tx descriptor ring. The software writes the tail pointer to add more descriptors to the Tx channel. The hardware tries to transmit all packets referenced by the descriptors between the head and the tail pointer registers. The width of this field depends on the configuration  31 2 for 32 bit configuration 31 3 for 64 bit configuration 31 4 for 128 bit configuration Value After Reset  0x0</description>
								<lsb>2</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_CHi_RXDESC_TAIL_POINTER</name>
						<description>DMA Channel 0 Recieve Descriptor Tail Pointer Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>40</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RDTP</name>
								<description>Receive Descriptor Tail Pointer   RDTP. This field contains the tail pointer for the Rx descriptor ring. The software writes the tail pointer to add more descriptors to the Rx channel. The hardware tries to write all received packets to the descriptors referenced between the head and the tail pointer registers. The width of this field depends on the configuration  31 2 for 32 bit configuration 31 3 for 64 bit configuration 31 4 for 128 bit configuration Value After Reset  0x0</description>
								<lsb>2</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_CHi_TXDESC_RING_LENGTH</name>
						<description>DMA Channel 0 Transmit Descriptor Ring Length Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>44</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TDRL</name>
								<description>Transmit Descriptor Ring Length   TDRL. This field sets the maximum number of Tx descriptors in the circular        descriptor ring. The maximum number of descriptors is limited to 1K        descriptors. Synopsys recommends a minimum ring descriptor length of 4.        For example  You can program any value up to 0x3FF in this field. This        field is 10 bits wide  if you program 0x3FF  you can have 1024        descriptors. If you want to have 10 descriptors  program it to a value        of 0x9. Value After Reset  0x0</description>
								<lsb>0</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_CHi_RXDESC_RING_LENGTH</name>
						<description>DMA Channel 0 Recieve Descriptor Ring Length Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>48</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RDRL</name>
								<description>Receive Descriptor Ring Length   RDRL. This register sets the maximum number of Rx descriptors in the circular        descriptor ring. The maximum number of descriptors is limited to 1K        descriptors. For example  You can program any value up to 0x3FF in this        field. This field is 10 bits wide  if you program 0x3FF  you can have        1024 descriptors. If you want to have 10 descriptors  program it to a        value of 0x9. Value After Reset  0x0</description>
								<lsb>0</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
