J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>DMA_CHi_INTERRUPT_ENABLE</name>
						<description>DMA Channel 0 Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>52</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TIE</name>
								<description>Transmit Interrupt Enable   TIE. When this bit is set along with the NIE bit  the Transmit Interrupt is        enabled. When this bit is reset  the Transmit Interrupt is disabled. Value After Reset  0x0</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TXSE</name>
								<description>Transmit Stopped Enable   TXSE. When this bit is set along with the AIE bit  the Transmission Stopped interrupt is enabled. When this bit is reset  the Transmission Stopped interrupt is disabled. Value After Reset  0x0</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBUE</name>
								<description>Transmit Buffer Unavailable Enable   TBUE. When this bit is set along with the NIE bit  the Transmit Buffer Unavailable interrupt is enabled. When this bit is reset  the Transmit Buffer Unavailable interrupt is disabled. Value After Reset  0x0</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RIE</name>
								<description>Receive Interrupt Enable   RIE. When this bit is set along with the NIE bit  the Receive Interrupt is enabled. When this bit is reset  the Receive Interrupt is disabled. Value After Reset  0x0</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RBUE</name>
								<description>Receive Buffer Unavailable Enable   RBUE. When this bit is set along with the AIE bit  the Receive Buffer Unavailable interrupt is enabled. When this bit is reset  the Receive Buffer Unavailable interrupt is disabled. Value After Reset  0x0</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSE</name>
								<description>Receive Stopped Enable   RSE. When this bit is set along with the AIE bit  the Receive Stopped Interrupt is enabled. When this bit is reset  the Receive Stopped interrupt is disabled. Value After Reset  0x0</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RWTE</name>
								<description>Receive Watchdog Timeout Enable   RWTE. When this bit is set along with the AIE bit  the Receive Watchdog Timeout interrupt is enabled. When this bit is reset  the Receive Watchdog Timeout interrupt is disabled. Value After Reset  0x0</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ETIE</name>
								<description>Early Transmit Interrupt Enable   ETIE. When this bit is set along with the AIE bit  the Early Transmit interrupt is enabled. When this bit is reset  the Early Transmit interrupt is disabled. Value After Reset  0x0</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ERIE</name>
								<description>Early Receive Interrupt Enable   ERIE. When this bit is set along with the NIE bit  the Early Receive interrupt is enabled. When this bit is reset  the Early Receive interrupt is disabled. Value After Reset  0x0</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FBEE</name>
								<description>Fatal Bus Error Enable   FBEE. When this bit is set along with the AIE bit  the Fatal Bus error interrupt is enabled. When this bit is reset  the Fatal Bus Error error interrupt is disabled. Value After Reset  0x0</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CDEE</name>
								<description>Context Descriptor Error Enable   CDEE. When this bit is set along with the AIE bit  the Context Descriptor        error interrupt is enabled. When this bit is reset  the Context        Descriptor error interrupt is disabled. Value After Reset  0x0</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AIE</name>
								<description>Abnormal Interrupt Summary Enable   AIE. When this bit is set  the abnormal interrupt summary is enabled. This bit enables the following interrupts in the DMA CH0 Status register  Bit 1  Transmit Process Stopped Bit 7  Rx Buffer Unavailable Bit 8  Receive Process Stopped Bit 9  Receive Watchdog Timeout Bit 10  Early Transmit Interrupt Bit 12  Fatal Bus Error Bit 13  Context Descriptor Error When this bit is reset  the abnormal interrupt summary is disabled. Value After Reset  0x0</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>NIE</name>
								<description>Normal Interrupt Summary Enable   NIE. When this bit is set  the normal interrupt summary is enabled. This bit enables the following interrupts in the DMA CH0 Status register  Bit 0  Transmit Interrupt Bit 2  Transmit Buffer Unavailable Bit 6  Receive Interrupt Bit 11  Early Receive Interrupt When this bit is reset  the normal interrupt summary is disabled. Value After Reset  0x0</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_CHi_RX_INTERRUPT_WATCHDOG_TIMER</name>
						<description>DMA Channel 0 Recieve Interrupt Watchdog Timer Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>56</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RWT</name>
								<description>Receive Interrupt Watchdog Timer Count   RWT. This field indicates the number of system clock cycles  multiplied by factor indicated in RWTU field  for which the watchdog timer is set. The watchdog timer is triggered with the programmed value after the Rx DMA completes the transfer of a packet for which the RI bit is not set in the DMA CH0 Status register  because of the setting of Interrupt Enable bit in the corresponding descriptor RDES3 30 . When the watchdog timer runs out  the RI bit is set and the timer is stopped. The watchdog timer is reset when the RI bit is set high because of automatic setting of RI as per the Interrupt Enable bit RDES3 30  of any received packet. Value After Reset  0x0</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RWTU</name>
								<description>Receive Interrupt Watchdog Timer Count Units   RWTU. This fields indicates the number of system clock cycles corresponding to one unit in RWT field. For example  when RWT 2 and RWTU 1  the watchdog timer is set for 2 512 1024 system clock cycles. Value After Reset  0x0</description>
								<lsb>16</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_CHi_SLOT_FUNCTION_CONTROL_STATUS</name>
						<description>DMA Channel 0 Slot Function Control and Status Register
 resetvalue={Application Reset:0x7C0}</description>
						<addressOffset>60</addressOffset>
						<size>32</size>
						<resetValue>1984</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ESC</name>
								<description>Enable Slot Comparison   ESC. When set  this bit enables the checking of the slot numbers programmed in the Tx descriptor with the current reference given in the RSN field. The DMA fetches the data from the corresponding buffer only when the slot number is equal to the reference slot number or ahead of the reference slot number by one slot When reset  this bit disables the checking of the slot numbers. The DMA fetches the data immediately after the descriptor is processed. Value After Reset  0x0</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ASC</name>
								<description>Advance Slot Check   ASC. When set  this bit enables the DMA to fetch the data from the buffer        when the slot number  SLOTNUM  programmed in the Tx descriptor is equal to the reference slot number given in the RSN field or ahead of the reference slot number by up to two slots This bit is applicable only when the ESC bit is set. Value After Reset  0x0</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SIV</name>
								<description>Slot Interval Value   SIV. This field controls the period of the slot interval in which the TxDMA        fetches the scheduled packets. A value of 0 specifies the slot interval        of 1 us while the maximum value 4095 specifies the slot interval of        4096us. The default  reset value is 0x07C which corresponds to slot        interval of 125us. Value After Reset  0x7c</description>
								<lsb>4</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RSN</name>
								<description>Reference Slot Number   RSN. This field gives the current value of the reference slot number in the        DMA. It is used for slot comparison. Value After Reset  0x0</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_CHi_CURRENT_APP_TXDESC</name>
						<description>DMA Channel 0 Current Application Transmit Descriptor Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>68</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CURTDESAPTR</name>
								<description>Application Transmit Descriptor Address Pointer   CURTDESAPTR. The DMA updates this pointer during Tx operation. This pointer is cleared on reset. Value After Reset  0x0</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_CHi_CURRENT_APP_RXDESC</name>
						<description>DMA Channel 0 Current Application Receive Descriptor Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>76</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CURRDESAPTR</name>
								<description>Application Receive Descriptor Address Pointer   CURRDESAPTR. The DMA updates this pointer during Rx operation. This pointer is cleared on reset. Value After Reset  0x0</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_CHi_CURRENT_APP_TXBUFFER</name>
						<description>DMA Channel 0 Current Application Transmit Buffer Address Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>84</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CURTBUFAPTR</name>
								<description>Application Transmit Buffer Address Pointer   CURTBUFAPTR. The DMA updates this pointer during Tx operation. This pointer is cleared on reset. Value After Reset  0x0</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_CHi_CURRENT_APP_RXBUFFER</name>
						<description>DMA Channel 0 Current Application Receive Buffer Address Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>92</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CURRBUFAPTR</name>
								<description>Application Receive Buffer Address Pointer   CURRBUFAPTR. The DMA updates this pointer during Rx operation. This pointer is cleared on reset. Value After Reset  0x0</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_CHi_STATUS</name>
						<description>DMA Channel 0 Status Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>96</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TI</name>
								<description>Transmit Interrupt   TI. This bit indicates that the packet transmission is complete. When        transmission is complete  Bit 31 of TDES3 is reset in the last        descriptor  and the specific packet status information is updated in the        descriptor. Access restriction applies. Self set to 1 on internal event. Setting 1        clears. Setting 0 has no effect. Value After Reset  0x0</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TPS</name>
								<description>Transmit Process Stopped   TPS. This bit is set when the transmission is stopped. Access restriction applies. Self set to 1 on internal event. Setting 1 clears. Setting 0 has no effect. Value After Reset  0x0</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBU</name>
								<description>Transmit Buffer Unavailable   TBU. This bit indicates that the application owns the next descriptor in the        Transmit list  and the DMA cannot acquire it. Transmission is suspended.        The TPS0 field of the DMA Debug Status0 register explains the Transmit        Process state transitions. To resume processing the Transmit descriptors  the application should do        the following  1. Change the ownership of the descriptor by setting Bit 31 of TDES3. 2. Issue a Transmit Poll Demand command. For ring mode  the application should advance the Transmit Descriptor        Tail Pointer register of a channel. Access restriction applies. Self set to 1 on internal event. Setting 1        clears. Setting 0 has no effect. Value After Reset  0x0</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RI</name>
								<description>Receive Interrupt   RI. This bit indicates that the packet reception is complete. When packet        reception is complete  Bit 31 of RDES3 is reset in the last descriptor         and the specific packet status information is updated in the descriptor. The reception remains in the Running state. Access restriction applies. Self set to 1 on internal event. Setting 1        clears. Setting 0 has no effect. Value After Reset  0x0</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RBU</name>
								<description>Receive Buffer Unavailable   RBU. This bit indicates that the application owns the next descriptor in the Receive list  and the DMA cannot acquire it. The Rx process is suspended. To resume processing Rx descriptors  the application should change the ownership of the descriptor and issue a Receive Poll Demand command. If this command is not issued  the Rx process resumes when the next recognized incoming packet is received. In ring mode  the application should advance the Receive Descriptor Tail Pointer register of a channel. This bit is set only when the DMA owns the previous Rx descriptor. Access restriction applies. Self set to 1 on internal event. Setting 1 clears. Setting 0 has no effect. Value After Reset  0x0</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RPS</name>
								<description>Receive Process Stopped   RPS. This bit is asserted when the Rx process enters the Stopped state. Access restriction applies. Self set to 1 on internal event. Setting 1 clears. Setting 0 has no effect. Value After Reset  0x0</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RWT</name>
								<description>Receive Watchdog Timeout   RWT. This bit is asserted when a packet with length greater than 2 048 bytes  10 240 bytes when Jumbo Packet mode is enabled  is received. Value After Reset  0x0</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ETI</name>
								<description>Early Transmit Interrupt   ETI. This bit indicates that the packet to be transmitted is fully transferred to the MTL Tx FIFO. Access restriction applies. Self set to 1 on internal event. Setting 1 clears. Setting 0 has no effect. Value After Reset  0x0</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ERI</name>
								<description>Early Receive Interrupt   ERI. This bit indicates that the DMA filled the first data buffer of the packet. The RI bit of this register automatically clears this bit. Access restriction applies. Self set to 1 on internal event. Setting 1 clears. Setting 0 has no effect. Value After Reset  0x0</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FBE</name>
								<description>Fatal Bus Error   FBE. This bit indicates that a bus error occurred  as described in the EB field . When this bit is set  the corresponding DMA channel engine disables all bus accesses. Access restriction applies. Self set to 1 on internal event. Setting 1 clears. Setting 0 has no effect. Value After Reset  0x0</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CDE</name>
								<description>Context Descriptor Error   CDE. This bit indicates that the DMA Tx Rx engine received a descriptor        error  which indicates invalid context in the middle of packet flow         intermediate descriptor  or all one s descriptor in Tx case and on Rx        side it indicates DMA has read a descriptor with either of the buffer        address as ones which is considered to be invalid.Access restriction        applies. Self set to 1 on internal event. Setting 1 clears. Setting 0        has no effect. Value After Reset  0x0</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AIS</name>
								<description>Abnormal Interrupt Summary   AIS. Abnormal Interrupt Summary bit value is the logical OR of the following when the corresponding interrupt bits are enabled in the DMA CH0 Interrupt Enable register  Bit 1  Transmit Process Stopped Bit 7  Receive Buffer Unavailable Bit 8  Receive Process Stopped Bit 10  Early Transmit Interrupt Bit 12  Fatal Bus Error Bit 13  Context Descriptor Error Only unmasked bits affect the Abnormal Interrupt Summary bit. This is a sticky bit. You must clear this bit  by writing 1 to this bit  each time a corresponding bit  which causes AIS to be set  is cleared. Access restriction applies. Self set to 1 on internal event. Setting 1 clears. Setting 0 has no effect. Value After Reset  0x0</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>NIS</name>
								<description>Normal Interrupt Summary   NIS. Normal Interrupt Summary bit value is the logical OR of the following bits when the corresponding interrupt bits are enabled in the DMA CH0 Interrupt Enable register  Bit 0  Transmit Interrupt Bit 2  Transmit Buffer Unavailable Bit 6  Receive Interrupt Bit 11  Early Receive Interrupt Only unmasked bits  interrupts for which interrupt enable is set in DMA CH0 Interrupt Enable register  affect the Normal Interrupt Summary bit. This is a sticky bit. You must clear this bit  by writing 1 to this bit  each time a corresponding bit which causes NIS to be set is cleared. Access restriction applies. Self set to 1 on internal event. Setting 1 clears. Setting 0 has no effect. Value After Reset  0x0</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TEB</name>
								<description>Tx DMA Error Bits   TEB. This field indicates the type of error that caused a Bus Error. For example  error response on the AHB or AXI interface. Bit 18 1 B Error during data transfer by Tx DMA 0 B No Error during data transfer by Tx DMA Bit 17 1 B Error during descriptor access 0 B Error during data buffer access Bit 16 1 B Error during read transfer 0 B Error during write transfer This field is valid only when the FBE bit is set. This field does not generate an interrupt. Value After Reset  0x0</description>
								<lsb>16</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>REB</name>
								<description>Rx DMA Error Bits   REB. This field indicates the type of error that caused a Bus Error. For example  error response on the AHB or AXI interface. Bit 21 1 B Error during data transfer by Rx DMA 0 B No Error during data transfer by Rx DMA Bit 20 1 B Error during descriptor access 0 B Error during data buffer access Bit 19 1 B Error during read transfer 0 B Error during write transfer This field is valid only when the FBE bit is set. This field does not generate an interrupt. Value After Reset  0x0</description>
								<lsb>19</lsb>
								<msb>21</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_CHi_MISS_FRAME_CNT</name>
						<description>DMA Channel 0 Missed Frames Count Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>100</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>MFC</name>
								<description>Dropped Packet Counters   MFC. This counter indicates the number of packet counters that are dropped by the DMA either because of bus error or because of programing RPF field in DMA CHx RX CONTROL register. The counter gets cleared when this register is read. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
								<lsb>0</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>MFCO</name>
								<description>Overflow status of the MFC Counter   MFCO. When this bit is set then the MFC counter does not get incremented further. The bit gets cleared when this register is read. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
				</cluster>
