J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<cluster>
					<dim>4</dim>
					<dimIncrement>8</dimIncrement>
					<name>ACCEND[%s]</name>
					<description>ACCEND</description>
					<addressOffset>8224</addressOffset>
					<register>
						<name>ACCEN0Dx</name>
						<description>Access Enable Register 0 for DMA0
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>4294967295</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>EN0</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n If the I O Test Mode of RGMII interface is active  i.e. TEN bit in        MAC TEST register is set to   8217 1  8217    write access to all ACCEN0Dx registers        and from all master TAG IDs will be permanently enabled  including those        which are controlled by ACCENx registers . In this case the ACCEN0Dx        register bits will be reused to define the RGMII TD RD loop test        sequence as follows  ACCEN0D0.bit 15 0   16 bit test sequence for TXD0   gt  RXD0        ACCEN0D0.bit 31 16   16 bit test sequence for TXD1   gt  RXD1        ACCEN0D1.bit 15 0   16 bit test sequence for TXD2   gt  RXD2        ACCEN0D1.bit 31 16   16 bit test sequence for TXD3   gt  RXD3        ACCEN0D2.bit 15 0   16 bit test sequence for TXCLK   gt  RXCLK        ACCEN0D2.bit 31 16   16 bit test sequence for TCTL   gt  RCTL        ACCEN0D3.bit 15 0   no function ACCEN0D3.bit 31 16   no function LSB value will be applied first  MSB last in the 16 bit test data test        sequence. The value of all ACCEND0x registers shall remain stable while a RGMII IF        test operation is underway  i.e. if MAC TEST.BUSY is set to  1  .</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN1</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n If the I O Test Mode of RGMII interface is active  i.e. TEN bit in        MAC TEST register is set to   8217 1  8217    write access to all ACCEN0Dx registers        and from all master TAG IDs will be permanently enabled  including those        which are controlled by ACCENx registers . In this case the ACCEN0Dx        register bits will be reused to define the RGMII TD RD loop test        sequence as follows  ACCEN0D0.bit 15 0   16 bit test sequence for TXD0   gt  RXD0        ACCEN0D0.bit 31 16   16 bit test sequence for TXD1   gt  RXD1        ACCEN0D1.bit 15 0   16 bit test sequence for TXD2   gt  RXD2        ACCEN0D1.bit 31 16   16 bit test sequence for TXD3   gt  RXD3        ACCEN0D2.bit 15 0   16 bit test sequence for TXCLK   gt  RXCLK        ACCEN0D2.bit 31 16   16 bit test sequence for TCTL   gt  RCTL        ACCEN0D3.bit 15 0   no function ACCEN0D3.bit 31 16   no function LSB value will be applied first  MSB last in the 16 bit test data test        sequence. The value of all ACCEND0x registers shall remain stable while a RGMII IF        test operation is underway  i.e. if MAC TEST.BUSY is set to  1  .</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN2</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n If the I O Test Mode of RGMII interface is active  i.e. TEN bit in        MAC TEST register is set to   8217 1  8217    write access to all ACCEN0Dx registers        and from all master TAG IDs will be permanently enabled  including those        which are controlled by ACCENx registers . In this case the ACCEN0Dx        register bits will be reused to define the RGMII TD RD loop test        sequence as follows  ACCEN0D0.bit 15 0   16 bit test sequence for TXD0   gt  RXD0        ACCEN0D0.bit 31 16   16 bit test sequence for TXD1   gt  RXD1        ACCEN0D1.bit 15 0   16 bit test sequence for TXD2   gt  RXD2        ACCEN0D1.bit 31 16   16 bit test sequence for TXD3   gt  RXD3        ACCEN0D2.bit 15 0   16 bit test sequence for TXCLK   gt  RXCLK        ACCEN0D2.bit 31 16   16 bit test sequence for TCTL   gt  RCTL        ACCEN0D3.bit 15 0   no function ACCEN0D3.bit 31 16   no function LSB value will be applied first  MSB last in the 16 bit test data test        sequence. The value of all ACCEND0x registers shall remain stable while a RGMII IF        test operation is underway  i.e. if MAC TEST.BUSY is set to  1  .</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN3</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n If the I O Test Mode of RGMII interface is active  i.e. TEN bit in        MAC TEST register is set to   8217 1  8217    write access to all ACCEN0Dx registers        and from all master TAG IDs will be permanently enabled  including those        which are controlled by ACCENx registers . In this case the ACCEN0Dx        register bits will be reused to define the RGMII TD RD loop test        sequence as follows  ACCEN0D0.bit 15 0   16 bit test sequence for TXD0   gt  RXD0        ACCEN0D0.bit 31 16   16 bit test sequence for TXD1   gt  RXD1        ACCEN0D1.bit 15 0   16 bit test sequence for TXD2   gt  RXD2        ACCEN0D1.bit 31 16   16 bit test sequence for TXD3   gt  RXD3        ACCEN0D2.bit 15 0   16 bit test sequence for TXCLK   gt  RXCLK        ACCEN0D2.bit 31 16   16 bit test sequence for TCTL   gt  RCTL        ACCEN0D3.bit 15 0   no function ACCEN0D3.bit 31 16   no function LSB value will be applied first  MSB last in the 16 bit test data test        sequence. The value of all ACCEND0x registers shall remain stable while a RGMII IF        test operation is underway  i.e. if MAC TEST.BUSY is set to  1  .</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN4</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n If the I O Test Mode of RGMII interface is active  i.e. TEN bit in        MAC TEST register is set to   8217 1  8217    write access to all ACCEN0Dx registers        and from all master TAG IDs will be permanently enabled  including those        which are controlled by ACCENx registers . In this case the ACCEN0Dx        register bits will be reused to define the RGMII TD RD loop test        sequence as follows  ACCEN0D0.bit 15 0   16 bit test sequence for TXD0   gt  RXD0        ACCEN0D0.bit 31 16   16 bit test sequence for TXD1   gt  RXD1        ACCEN0D1.bit 15 0   16 bit test sequence for TXD2   gt  RXD2        ACCEN0D1.bit 31 16   16 bit test sequence for TXD3   gt  RXD3        ACCEN0D2.bit 15 0   16 bit test sequence for TXCLK   gt  RXCLK        ACCEN0D2.bit 31 16   16 bit test sequence for TCTL   gt  RCTL        ACCEN0D3.bit 15 0   no function ACCEN0D3.bit 31 16   no function LSB value will be applied first  MSB last in the 16 bit test data test        sequence. The value of all ACCEND0x registers shall remain stable while a RGMII IF        test operation is underway  i.e. if MAC TEST.BUSY is set to  1  .</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN5</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n If the I O Test Mode of RGMII interface is active  i.e. TEN bit in        MAC TEST register is set to   8217 1  8217    write access to all ACCEN0Dx registers        and from all master TAG IDs will be permanently enabled  including those        which are controlled by ACCENx registers . In this case the ACCEN0Dx        register bits will be reused to define the RGMII TD RD loop test        sequence as follows  ACCEN0D0.bit 15 0   16 bit test sequence for TXD0   gt  RXD0        ACCEN0D0.bit 31 16   16 bit test sequence for TXD1   gt  RXD1        ACCEN0D1.bit 15 0   16 bit test sequence for TXD2   gt  RXD2        ACCEN0D1.bit 31 16   16 bit test sequence for TXD3   gt  RXD3        ACCEN0D2.bit 15 0   16 bit test sequence for TXCLK   gt  RXCLK        ACCEN0D2.bit 31 16   16 bit test sequence for TCTL   gt  RCTL        ACCEN0D3.bit 15 0   no function ACCEN0D3.bit 31 16   no function LSB value will be applied first  MSB last in the 16 bit test data test        sequence. The value of all ACCEND0x registers shall remain stable while a RGMII IF        test operation is underway  i.e. if MAC TEST.BUSY is set to  1  .</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN6</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n If the I O Test Mode of RGMII interface is active  i.e. TEN bit in        MAC TEST register is set to   8217 1  8217    write access to all ACCEN0Dx registers        and from all master TAG IDs will be permanently enabled  including those        which are controlled by ACCENx registers . In this case the ACCEN0Dx        register bits will be reused to define the RGMII TD RD loop test        sequence as follows  ACCEN0D0.bit 15 0   16 bit test sequence for TXD0   gt  RXD0        ACCEN0D0.bit 31 16   16 bit test sequence for TXD1   gt  RXD1        ACCEN0D1.bit 15 0   16 bit test sequence for TXD2   gt  RXD2        ACCEN0D1.bit 31 16   16 bit test sequence for TXD3   gt  RXD3        ACCEN0D2.bit 15 0   16 bit test sequence for TXCLK   gt  RXCLK        ACCEN0D2.bit 31 16   16 bit test sequence for TCTL   gt  RCTL        ACCEN0D3.bit 15 0   no function ACCEN0D3.bit 31 16   no function LSB value will be applied first  MSB last in the 16 bit test data test        sequence. The value of all ACCEND0x registers shall remain stable while a RGMII IF        test operation is underway  i.e. if MAC TEST.BUSY is set to  1  .</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN7</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n If the I O Test Mode of RGMII interface is active  i.e. TEN bit in        MAC TEST register is set to   8217 1  8217    write access to all ACCEN0Dx registers        and from all master TAG IDs will be permanently enabled  including those        which are controlled by ACCENx registers . In this case the ACCEN0Dx        register bits will be reused to define the RGMII TD RD loop test        sequence as follows  ACCEN0D0.bit 15 0   16 bit test sequence for TXD0   gt  RXD0        ACCEN0D0.bit 31 16   16 bit test sequence for TXD1   gt  RXD1        ACCEN0D1.bit 15 0   16 bit test sequence for TXD2   gt  RXD2        ACCEN0D1.bit 31 16   16 bit test sequence for TXD3   gt  RXD3        ACCEN0D2.bit 15 0   16 bit test sequence for TXCLK   gt  RXCLK        ACCEN0D2.bit 31 16   16 bit test sequence for TCTL   gt  RCTL        ACCEN0D3.bit 15 0   no function ACCEN0D3.bit 31 16   no function LSB value will be applied first  MSB last in the 16 bit test data test        sequence. The value of all ACCEND0x registers shall remain stable while a RGMII IF        test operation is underway  i.e. if MAC TEST.BUSY is set to  1  .</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN8</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n If the I O Test Mode of RGMII interface is active  i.e. TEN bit in        MAC TEST register is set to   8217 1  8217    write access to all ACCEN0Dx registers        and from all master TAG IDs will be permanently enabled  including those        which are controlled by ACCENx registers . In this case the ACCEN0Dx        register bits will be reused to define the RGMII TD RD loop test        sequence as follows  ACCEN0D0.bit 15 0   16 bit test sequence for TXD0   gt  RXD0        ACCEN0D0.bit 31 16   16 bit test sequence for TXD1   gt  RXD1        ACCEN0D1.bit 15 0   16 bit test sequence for TXD2   gt  RXD2        ACCEN0D1.bit 31 16   16 bit test sequence for TXD3   gt  RXD3        ACCEN0D2.bit 15 0   16 bit test sequence for TXCLK   gt  RXCLK        ACCEN0D2.bit 31 16   16 bit test sequence for TCTL   gt  RCTL        ACCEN0D3.bit 15 0   no function ACCEN0D3.bit 31 16   no function LSB value will be applied first  MSB last in the 16 bit test data test        sequence. The value of all ACCEND0x registers shall remain stable while a RGMII IF        test operation is underway  i.e. if MAC TEST.BUSY is set to  1  .</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN9</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n If the I O Test Mode of RGMII interface is active  i.e. TEN bit in        MAC TEST register is set to   8217 1  8217    write access to all ACCEN0Dx registers        and from all master TAG IDs will be permanently enabled  including those        which are controlled by ACCENx registers . In this case the ACCEN0Dx        register bits will be reused to define the RGMII TD RD loop test        sequence as follows  ACCEN0D0.bit 15 0   16 bit test sequence for TXD0   gt  RXD0        ACCEN0D0.bit 31 16   16 bit test sequence for TXD1   gt  RXD1        ACCEN0D1.bit 15 0   16 bit test sequence for TXD2   gt  RXD2        ACCEN0D1.bit 31 16   16 bit test sequence for TXD3   gt  RXD3        ACCEN0D2.bit 15 0   16 bit test sequence for TXCLK   gt  RXCLK        ACCEN0D2.bit 31 16   16 bit test sequence for TCTL   gt  RCTL        ACCEN0D3.bit 15 0   no function ACCEN0D3.bit 31 16   no function LSB value will be applied first  MSB last in the 16 bit test data test        sequence. The value of all ACCEND0x registers shall remain stable while a RGMII IF        test operation is underway  i.e. if MAC TEST.BUSY is set to  1  .</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN10</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n If the I O Test Mode of RGMII interface is active  i.e. TEN bit in        MAC TEST register is set to   8217 1  8217    write access to all ACCEN0Dx registers        and from all master TAG IDs will be permanently enabled  including those        which are controlled by ACCENx registers . In this case the ACCEN0Dx        register bits will be reused to define the RGMII TD RD loop test        sequence as follows  ACCEN0D0.bit 15 0   16 bit test sequence for TXD0   gt  RXD0        ACCEN0D0.bit 31 16   16 bit test sequence for TXD1   gt  RXD1        ACCEN0D1.bit 15 0   16 bit test sequence for TXD2   gt  RXD2        ACCEN0D1.bit 31 16   16 bit test sequence for TXD3   gt  RXD3        ACCEN0D2.bit 15 0   16 bit test sequence for TXCLK   gt  RXCLK        ACCEN0D2.bit 31 16   16 bit test sequence for TCTL   gt  RCTL        ACCEN0D3.bit 15 0   no function ACCEN0D3.bit 31 16   no function LSB value will be applied first  MSB last in the 16 bit test data test        sequence. The value of all ACCEND0x registers shall remain stable while a RGMII IF        test operation is underway  i.e. if MAC TEST.BUSY is set to  1  .</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN11</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n If the I O Test Mode of RGMII interface is active  i.e. TEN bit in        MAC TEST register is set to   8217 1  8217    write access to all ACCEN0Dx registers        and from all master TAG IDs will be permanently enabled  including those        which are controlled by ACCENx registers . In this case the ACCEN0Dx        register bits will be reused to define the RGMII TD RD loop test        sequence as follows  ACCEN0D0.bit 15 0   16 bit test sequence for TXD0   gt  RXD0        ACCEN0D0.bit 31 16   16 bit test sequence for TXD1   gt  RXD1        ACCEN0D1.bit 15 0   16 bit test sequence for TXD2   gt  RXD2        ACCEN0D1.bit 31 16   16 bit test sequence for TXD3   gt  RXD3        ACCEN0D2.bit 15 0   16 bit test sequence for TXCLK   gt  RXCLK        ACCEN0D2.bit 31 16   16 bit test sequence for TCTL   gt  RCTL        ACCEN0D3.bit 15 0   no function ACCEN0D3.bit 31 16   no function LSB value will be applied first  MSB last in the 16 bit test data test        sequence. The value of all ACCEND0x registers shall remain stable while a RGMII IF        test operation is underway  i.e. if MAC TEST.BUSY is set to  1  .</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN12</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n If the I O Test Mode of RGMII interface is active  i.e. TEN bit in        MAC TEST register is set to   8217 1  8217    write access to all ACCEN0Dx registers        and from all master TAG IDs will be permanently enabled  including those        which are controlled by ACCENx registers . In this case the ACCEN0Dx        register bits will be reused to define the RGMII TD RD loop test        sequence as follows  ACCEN0D0.bit 15 0   16 bit test sequence for TXD0   gt  RXD0        ACCEN0D0.bit 31 16   16 bit test sequence for TXD1   gt  RXD1        ACCEN0D1.bit 15 0   16 bit test sequence for TXD2   gt  RXD2        ACCEN0D1.bit 31 16   16 bit test sequence for TXD3   gt  RXD3        ACCEN0D2.bit 15 0   16 bit test sequence for TXCLK   gt  RXCLK        ACCEN0D2.bit 31 16   16 bit test sequence for TCTL   gt  RCTL        ACCEN0D3.bit 15 0   no function ACCEN0D3.bit 31 16   no function LSB value will be applied first  MSB last in the 16 bit test data test        sequence. The value of all ACCEND0x registers shall remain stable while a RGMII IF        test operation is underway  i.e. if MAC TEST.BUSY is set to  1  .</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN13</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n If the I O Test Mode of RGMII interface is active  i.e. TEN bit in        MAC TEST register is set to   8217 1  8217    write access to all ACCEN0Dx registers        and from all master TAG IDs will be permanently enabled  including those        which are controlled by ACCENx registers . In this case the ACCEN0Dx        register bits will be reused to define the RGMII TD RD loop test        sequence as follows  ACCEN0D0.bit 15 0   16 bit test sequence for TXD0   gt  RXD0        ACCEN0D0.bit 31 16   16 bit test sequence for TXD1   gt  RXD1        ACCEN0D1.bit 15 0   16 bit test sequence for TXD2   gt  RXD2        ACCEN0D1.bit 31 16   16 bit test sequence for TXD3   gt  RXD3        ACCEN0D2.bit 15 0   16 bit test sequence for TXCLK   gt  RXCLK        ACCEN0D2.bit 31 16   16 bit test sequence for TCTL   gt  RCTL        ACCEN0D3.bit 15 0   no function ACCEN0D3.bit 31 16   no function LSB value will be applied first  MSB last in the 16 bit test data test        sequence. The value of all ACCEND0x registers shall remain stable while a RGMII IF        test operation is underway  i.e. if MAC TEST.BUSY is set to  1  .</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN14</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n If the I O Test Mode of RGMII interface is active  i.e. TEN bit in        MAC TEST register is set to   8217 1  8217    write access to all ACCEN0Dx registers        and from all master TAG IDs will be permanently enabled  including those        which are controlled by ACCENx registers . In this case the ACCEN0Dx        register bits will be reused to define the RGMII TD RD loop test        sequence as follows  ACCEN0D0.bit 15 0   16 bit test sequence for TXD0   gt  RXD0        ACCEN0D0.bit 31 16   16 bit test sequence for TXD1   gt  RXD1        ACCEN0D1.bit 15 0   16 bit test sequence for TXD2   gt  RXD2        ACCEN0D1.bit 31 16   16 bit test sequence for TXD3   gt  RXD3        ACCEN0D2.bit 15 0   16 bit test sequence for TXCLK   gt  RXCLK        ACCEN0D2.bit 31 16   16 bit test sequence for TCTL   gt  RCTL        ACCEN0D3.bit 15 0   no function ACCEN0D3.bit 31 16   no function LSB value will be applied first  MSB last in the 16 bit test data test        sequence. The value of all ACCEND0x registers shall remain stable while a RGMII IF        test operation is underway  i.e. if MAC TEST.BUSY is set to  1  .</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN15</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n If the I O Test Mode of RGMII interface is active  i.e. TEN bit in        MAC TEST register is set to   8217 1  8217    write access to all ACCEN0Dx registers        and from all master TAG IDs will be permanently enabled  including those        which are controlled by ACCENx registers . In this case the ACCEN0Dx        register bits will be reused to define the RGMII TD RD loop test        sequence as follows  ACCEN0D0.bit 15 0   16 bit test sequence for TXD0   gt  RXD0        ACCEN0D0.bit 31 16   16 bit test sequence for TXD1   gt  RXD1        ACCEN0D1.bit 15 0   16 bit test sequence for TXD2   gt  RXD2        ACCEN0D1.bit 31 16   16 bit test sequence for TXD3   gt  RXD3        ACCEN0D2.bit 15 0   16 bit test sequence for TXCLK   gt  RXCLK        ACCEN0D2.bit 31 16   16 bit test sequence for TCTL   gt  RCTL        ACCEN0D3.bit 15 0   no function ACCEN0D3.bit 31 16   no function LSB value will be applied first  MSB last in the 16 bit test data test        sequence. The value of all ACCEND0x registers shall remain stable while a RGMII IF        test operation is underway  i.e. if MAC TEST.BUSY is set to  1  .</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN16</name>
