J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MAC_CONFIGURATION</name>
					<description>MAC Configuration Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RE</name>
							<description>Receiver Enable   RE. When this bit is set  the Rx state machine of the MAC is enabled for        receiving packets from the GMII or MII interface. When this bit is        reset  the MAC Rx state machine is disabled after it completes the        reception of the current packet. The Rx state machine does not receive        any more packets from the GMII or MII interface. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TE</name>
							<description>Transmitter Enable   TE. When this bit is set  the Tx state machine of the MAC is enabled for        transmission on the GMII or MII interface. When this bit is reset  the        MAC Tx state machine is disabled after it completes the transmission of        the current packet. The Tx state machine does not transmit any more        packets. Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRELEN</name>
							<description>Preamble Length for Transmit packets   PRELEN. These bits control the number of preamble bytes that are added to the        beginning of every Tx packet. The preamble reduction occurs only when        the MAC is operating in the full duplex mode. Value After Reset  0x0</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DC</name>
							<description>Deferral Check   DC. When this bit is set  the deferral check function is enabled in the MAC. The MAC issues a Packet Abort status  along with the excessive deferral error bit set in the Tx packet status  when the Tx state machine is deferred for more than 24 288 bit times in 10 or 100 Mbps mode. If the MAC is configured for 1000 2500 Mbps operation  the threshold for deferral is 155 680 bits times. Deferral begins when the transmitter is ready to transmit  but it is prevented because of an active carrier sense signal  CRS  on GMII or MII. The defer time is not cumulative. For example  if the transmitter defers for 10 000 bit times because the CRS signal is active and the CRS signal becomes inactive  the transmitter transmits and collision happens. Because of collision  the transmitter needs to back off and then defer again after back off completion. In such a scenario  the deferral timer is reset to 0  and it is restarted. When this bit is reset  the deferral check function is disabled and the MAC defers until the CRS signal goes inactive. Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BL</name>
							<description>Back Off Limit   BL. The back off limit determines the random integer number  r  of slot time delays  4 096 bit times for 1000 2500 Mbps  512 bit times for 10 100 Mbps  for which the MAC waits before rescheduling a transmission attempt during retries after a collision. where n   retransmission attempt The random integer r takes the value in the range 0  lt   r  lt  2 k Value After Reset  0x0</description>
							<lsb>5</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DR</name>
							<description>Disable Retry   DR. When this bit is set  the MAC attempts only one transmission. When a collision occurs on the GMII or MII interface  the MAC ignores the current packet transmission and reports a Packet Abort with excessive collision error in the Tx packet status. When this bit is reset  the MAC retries based on the settings of the BL field. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DCRS</name>
							<description>Disable Carrier Sense During Transmission   DCRS. When this bit is set  the MAC transmitter ignores the  G MII CRS signal during packet transmission in the half duplex mode. As a result  no errors are generated because of Loss of Carrier or No Carrier during transmission. When this bit is reset  the MAC transmitter generates errors because of Carrier Sense. The MAC can even abort the transmission. Value After Reset  0x0</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DO</name>
							<description>Disable Receive Own   DO. When this bit is set  the MAC disables the reception of packets when the gmii txen o is asserted in the half duplex mode. When this bit is reset  the MAC receives all packets given by the PHY. Value After Reset  0x0</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ECRSFD</name>
							<description>Enable Carrier Sense Before Transmission in Full Duplex Mode   ECRSFD. When this bit is set  the MAC transmitter checks the CRS signal before        packet transmission in the full duplex mode. The MAC starts the        transmission only when the CRS signal is low. When this bit is reset  the MAC transmitter ignores the status of the        CRS signal. Value After Reset  0x0</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LM</name>
							<description>Loopback Mode   LM. When this bit is set  the MAC operates in the loopback mode at GMII or        MII. The  G MII Rx clock input  clk rx i  is required for the loopback        to work properly. This is because the Tx clock is not internally looped        back. Value After Reset  0x0</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DM</name>
							<description>Duplex Mode   DM. When this bit is set  the MAC operates in the full duplex mode in which        it can transmit and receive simultaneously. Value After Reset  0x0</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FES</name>
							<description>Speed   FES. This bit selects the speed mode  The mac speed o 0  signal reflects the value of this bit. Value After Reset  0x0</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PS</name>
							<description>Port Select   PS. This bit selects the Ethernet line speed. This bit  along with Bit 14  selects the exact line speed. In the 10 100        Mbps only  always 1  or 1000 Mbps only  always 0  configurations  this        bit is read only  RO  with appropriate value. In default 10 100 1000        Mbps configurations  this bit is read write  R W . The mac speed o 1         signal reflects the value of this bit. Value After Reset  0x0</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>JE</name>
							<description>Jumbo Packet Enable   JE. When this bit is set  the MAC allows jumbo packets of 9 018 bytes  9 022        bytes for VLAN tagged packets  without reporting a giant packet error in        the Rx packet status. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>JD</name>
							<description>Jabber Disable   JD. When this bit is set  the MAC disables the jabber timer on the        transmitter. The MAC can transfer packets of up to 16 383 bytes. When this bit is reset  if the application sends more than 2 048 bytes        of data  10 240 if JE is set high  during transmission  the MAC does not        send rest of the bytes in that packet. Value After Reset  0x0</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BE</name>
							<description>Packet Burst Enable   BE. When this bit is set  the MAC allows packet bursting during transmission in the GMII half duplex mode. Value After Reset  0x0</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WD</name>
							<description>Watchdog Disable   WD. When this bit is set  the MAC disables the watchdog timer on the        receiver. The MAC can receive packets of up to 16 383 bytes. When this bit is reset  the MAC does not allow more than 2 048 bytes         10 240 if JE is set high  of the packet being received. The MAC cuts        off any bytes received after 2 048 bytes. Value After Reset  0x0</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ACS</name>
							<description>Automatic Pad or CRC Stripping   ACS. When this bit is set  the MAC strips the Pad or FCS field on the        incoming packets only if the value of the length field is less than        1 536 bytes. All received packets with length field greater than or        equal to 1 536 bytes are passed to the application without stripping the        Pad or FCS field. When this bit is reset  the MAC passes all incoming packets to the        application  without any modification. Note   For information about how the        settings of CST bit and this bit impact the packet length  see the        Table  Packet Length based on the CST and ACS Bit . Value After Reset  0x0</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CST</name>
							<description>CRC stripping for Type packets   CST. When this bit is set  the last four bytes  FCS  of all packets of Ether        type  type field greater than 1 536  are stripped and dropped before        forwarding the packet to the application. Note   For information about how the        settings of the ACS bit and this bit impact the packet length  see the        Table  Packet Length based on the CST and ACS Bits. Value After Reset  0x0</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>S2KP</name>
							<description>IEEE 802.3as Support for 2K Packets   S2KP. When this bit is set  the MAC considers all packets with up to 2 000        bytes length as normal packets. When the JE bit is not set  the MAC        considers all received packets of size more than 2K bytes as Giant        packets. When this bit is reset and the JE bit is not set  the MAC considers all        received packets of size more than 1 518 bytes  1 522 bytes for tagged         as giant packets. For more information about how the setting of this bit        and the JE bit impact the Giant packet status  see the table  Giant        Packet Status based on S2KP and JE Bits. Note   When the JE bit is set  setting this        bit has no effect on the giant packet status. Value After Reset  0x0</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GPSLCE</name>
							<description>Giant Packet Size Limit Control Enable   GPSLCE. When this bit is set  the MAC considers the value in GPSL field in        MAC Ext Configuration register to declare a received packet as Giant        packet. This field must be programmed to more than 1 518 bytes.        Otherwise  the MAC considers 1 518 bytes as giant packet limit. When this bit is reset  the MAC considers a received packet as Giant        packet when its size is greater than 1 518 bytes  1522 bytes for tagged        packet . The watchdog timeout limit  Jumbo Packet Enable and 2K Packet Enable        have higher precedence over this bit  that is the MAC considers a        received packet as Giant packet when its size is greater than 9 018        bytes  9 022 bytes for tagged packet  with Jumbo Packet Enabled and        greater than 2 000 bytes with 2K Packet Enabled. The watchdog timeout         if enabled  terminates the received packet when watchdog limit is        reached. Therefore  the programmed giant packet limit should be less        than the watchdog limit to get the giant packet status. Value After Reset  0x0</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IPG</name>
							<description>Inter Packet Gap   IPG. These bits control the minimum IPG between packets during transmission. LOST SEQUENCE DEFINITION This range of minimum IPG is valid in full duplex mode. In the half duplex mode  the minimum IPG can be configured only for        64 bit times  IPG   100 . Lower values are not considered. When a JAM pattern is being transmitted because of backpressure        activation  the MAC does not consider the minimum IPG. The above function  IPG less than 96 bit times  is valid only when        EIPGEN bit in MAC Ext Configuration register is reset. When EIPGEN is        set  then the minimum IPG  greater than 96 bit times  is controlled as        per the description given in EIPG field in MAC Ext Configuration        register. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IPC</name>
							<description>Checksum Offload   IPC. When set  this bit enables the IPv4 header checksum checking and IPv4 or IPv6 TCP  UDP  or ICMP payload checksum checking. When this bit is reset  the COE function in the receiver is disabled. The Layer 3 and Layer 4 Packet Filter and Enable Split Header features automatically selects the IPC Full Checksum Offload Engine on the Receive side. When any of these features are enabled  you must set the IPC bit. Value After Reset  0x0</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SARC</name>
							<description>Source Address Insertion or Replacement Control   SARC. This field controls the source address insertion or replacement for all transmitted packets. Bit 30 specifies which MAC Address register  0 or 1  is used for source address insertion or replacement based on the values of Bits 29 28   Note   Changes to this field take effect only on the start of a packet. If you write to this register field when a packet is being transmitted  only the subsequent packet can use the updated value  that is  the current packet does not use the updated value. Value After Reset  0x0</description>
							<lsb>28</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_EXT_CONFIGURATION</name>
					<description>MAC Extended Configuration Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>GPSL</name>
							<description>Giant Packet Size Limit   GPSL. If the received packet size is greater than the value programmed in this field in units of bytes  the MAC declares the received packet as Giant packet. The value programmed in this field must be greater than or equal to 1 518 bytes. Any other programmed value is considered as 1 518 bytes. For VLAN tagged packets  the MAC adds 4 bytes to the programmed value. When the Enable Double VLAN Processing option is selected  the MAC adds 8 bytes to the programmed value for double VLAN tagged packets. The value in this field is applicable when the GPSLCE bit is set in MAC Configuration register. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DCRCC</name>
							<description>Disable CRC Checking for Received Packets   DCRCC. When this bit is set  the MAC receiver does not check the CRC field in the received packets. When this bit is reset  the MAC receiver always checks the CRC field in the received packets. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SPEN</name>
							<description>Slow Protocol Detection Enable   SPEN. When this bit is set  MAC processes the Slow Protocol packets  Ether Type 0x8809  and provides the Rx status. The MAC discards the Slow Protocol packets with invalid sub types. When this bit is reset  the MAC forwards all error free Slow Protocol packets to the application. The MAC considers such packets as normal Type packets. Value After Reset  0x0</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>USP</name>
							<description>Unicast Slow Protocol Packet Detect   USP. When this bit is set  the MAC detects the Slow Protocol packets with unicast address of the station specified in the MAC Address0 High and MAC Address0 Low registers. The MAC also detects the Slow Protocol packets with the Slow Protocols multicast address  01 80 C2 00 00 02 . When this bit is reset  the MAC detects only Slow Protocol packets with the Slow Protocol multicast address specified in the IEEE 802.3 2008  Section 5. Value After Reset  0x0</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HDSMS</name>
							<description>Maximum Size for Splitting the Header Data   HDSMS. These bits indicate the maximum header size allowed for splitting the header data in the received packet  101   111 Reserved If the Enable Split Header Structure option is not selected  these bits are reserved and read only  RO . Value After Reset  0x0</description>
							<lsb>20</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EIPGEN</name>
							<description>Extended Inter Packet Gap Enable   EIPGEN. When this bit is set  the MAC interprets EIPG field and IPG field in MAC Configuration register together as minimum IPG greater than 96 bit times in steps of 8 bit times. When this bit is reset  the MAC ignores EIPG field and interprets IPG field in MAC Configuration register as minimum IPG less than or equal to 96 bit times in steps of 8 bit times. Note  The extended Inter Packet Gap feature must be enabled when operating in Full Duplex mode only. There may be undesirable effects on back pressure function and frame transmission if it is enabled in Half Duplex mode. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EIPG</name>
							<description>Extended Inter Packet Gap   EIPG. The value in this field is applicable when the EIPGEN bit is set. This field  as Most Significant bits   along with IPG field in MAC Configuration register  gives the minimum IPG greater than 96 bit times in steps of 8 bit times   EIPG  IPG  8 h00   104 bit times 8 h01   112 bit times 8 h02   120 bit times                         8 hFF   2144 bit times Value After Reset  0x0</description>
							<lsb>25</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FHE</name>
							<description>Flexible Header Enable. When this is set then it is expected that all the incoming packets from the Line to have 4B Flexible Header in the Rx path  except for the pause and PFC packets . Similarly  in the Tx path all the packets from application are expected to have 4B Flexible header. The position of the Flexible Header is always fixed at 12Bytes from the beginning of the packet  after MAC DA SA .</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
