J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MAC_PACKET_FILTER</name>
					<description>MAC Packet Filter Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PR</name>
							<description>Promiscuous Mode   PR. When this bit is set  the Address Filtering module passes all incoming packets irrespective of the destination or source address. The SA or DA Filter Fails status bits of the Rx Status Word are always cleared when PR is set. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DAIF</name>
							<description>DA Inverse Filtering   DAIF. When this bit is set  the Address Check block operates in inverse filtering mode for the DA address comparison for both unicast and multicast packets. When this bit is reset  normal filtering of packets is performed. Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PM</name>
							<description>Pass All Multicast   PM. When this bit is set  it indicates that all received packets with a multicast destination address  first bit in the destination address field is  1   are passed. Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DBF</name>
							<description>Disable Broadcast Packets   DBF. When this bit is set  the AFM module blocks all incoming broadcast packets. In addition  it overrides all other filter settings. When this bit is reset  the AFM module passes all received broadcast packets. Value After Reset  0x0</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PCF</name>
							<description>Pass Control Packets   PCF. These bits control the forwarding of all control packets  including unicast and multicast Pause packets . Value After Reset  0x0</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SAIF</name>
							<description>SA Inverse Filtering   SAIF. When this bit is set  the Address Check block operates in the inverse filtering mode for SA address comparison. If the SA of a packet matches the values programmed in the SA registers  it is marked as failing the SA Address filter. When this bit is reset  if the SA of a packet does not match the values programmed in the SA registers  it is marked as failing the SA Address filter. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SAF</name>
							<description>Source Address Filter Enable   SAF. When this bit is set  the MAC compares the SA field of the received packets with the values programmed in the enabled SA registers. If the comparison fails  the MAC drops the packet. When this bit is reset  the MAC forwards the received packet to the application with updated SAF bit of the Rx Status depending on the SA address comparison. Note   According to the IEEE specification  Bit 47 of the SA is reserved. However  in DWC ether qos  the MAC compares all 48 bits. The software driver should take this into consideration while programming the MAC address registers for SA. Value After Reset  0x0</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VTFE</name>
							<description>VLAN Tag Filter Enable   VTFE. When this bit is set  the MAC drops the VLAN tagged packets that do not match the VLAN Tag. When this bit is reset  the MAC forwards all packets irrespective of the match status of the VLAN Tag. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RA</name>
							<description>Receive All   RA. When this bit is set  the MAC Receiver module passes all received packets to the application  irrespective of whether they pass the address filter or not. The result of the SA or DA filtering is updated  pass or fail  in the corresponding bit in the Rx Status Word. When this bit is reset  the Receiver module passes only those packets to the application that pass the SA or DA address filter. Value After Reset  0x0</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_WATCHDOG_TIMEOUT</name>
					<description>MAC Watchdog Timeout Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>12</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>WTO</name>
							<description>Watchdog Timeout   WTO. When the PWE bit is set and the WD bit of the MAC Configuration register is reset  this field is used as watchdog timeout for a received packet. If the length of a received packet exceeds the value of this field  such packet is terminated and declared as an error packet. Encoding is as follows  LOST SEQUENCE DEFINITION Note   When the PWE bit is set  the value in this field should be more than 1 522  0x05F2 . Otherwise  the IEEE 802.3 specified valid tagged packets are declared as error packets and then dropped. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PWE</name>
							<description>Programmable Watchdog Enable   PWE. When this bit is set and the WD bit of the MAC Configuration register is reset  the WTO field is used as watchdog timeout for a received packet. When this bit is cleared  the watchdog timeout for a received packet is controlled by setting of WD and JE bits in MAC Configuration register. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_VLAN_TAG_CTRL</name>
					<description>MAC VLAN Tag Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>80</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>OB</name>
							<description>Operation Busy   OB. This bit is set along with a read or write command for initiating the indirect access to per VLAN Tag Filter register. This bit is              reset when the read or write command to per VLAN Tag Filter indirect access register is complete.The next indirect register access can be initiated only after              this bit is reset. During a write operation  the bit is reset only after the data has been written into the Per VLAN Tag register.              During a read operation  the data should be read from the MAC VLAN Tag Data register only after this bit is reset. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CT</name>
							<description>Command Type   CT. This bit indicates if the current register access is a read or a write. When set  it indicate a read operation. When reset  it indicates a write operation. Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OFS</name>
							<description>Offset   OFS. This field holds the address offset of the MAC VLAN Tag Filter Register which the application is trying to access. The width of the field depends on the number of MAC VLAN Tag Registers enabled. Value After Reset  0x0</description>
							<lsb>2</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VTIM</name>
							<description>VLAN Tag Inverse Match Enable   VTIM. When this bit is set  this bit enables the VLAN Tag inverse matching.        The packets without matching VLAN Tag are marked as matched. When reset         this bit enables the VLAN Tag perfect matching. The packets with matched        VLAN Tag are marked as matched. Value After Reset  0x0</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ESVL</name>
							<description>Enable S VLAN   ESVL. When this bit is set  the MAC transmitter and receiver consider the S VLAN packets  Type   0x88A8  as valid VLAN tagged packets. Value After Reset  0x0</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EVLS</name>
							<description>Enable VLAN Tag Stripping on Receive   EVLS. This field indicates the stripping operation on the outer VLAN Tag in received packet  Value After Reset  0x0</description>
							<lsb>21</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EVLRXS</name>
							<description>Enable VLAN Tag in Rx status   EVLRXS. When this bit is set  MAC provides the outer VLAN Tag in the Rx status. When this bit is reset  the MAC does not provide the outer VLAN Tag in Rx status. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VTHM</name>
							<description>VLAN Tag Hash Table Match Enable   VTHM. When this bit is set  the most significant four bits of CRC of VLAN Tag               ones complement of most significant four bits of CRC of VLAN Tag when ETV bit is reset               are used to index the content of the MAC VLAN Hash Table register. A value of 1 in the              VLAN Hash Table register  corresponding to the index  indicates that the packet matched the VLAN hash table. When the ETV bit is set  the CRC of the 12 bit VLAN Identifier  VID  is used for comparison. When the ETV bit is reset  the ones complement of the CRC of the 16 bit VLAN tag is used for comparison. When this bit is reset  the VLAN Hash Match operation is not performed. Value After Reset  0x0</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EDVLP</name>
							<description>Enable Double VLAN Processing   EDVLP. When this bit is set  the MAC enables processing of up to two VLAN Tags on Tx and Rx  if present . When this bit is reset  the MAC enables processing of up to one VLAN Tag on Tx and Rx  if present . Value After Reset  0x0</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RES_27</name>
							<description>Reserved   RES 27. Value After Reset  0x0</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EIVLS</name>
							<description>Enable Inner VLAN Tag Stripping on Receive   EIVLS. This field indicates the stripping operation on inner VLAN Tag in received packet  Value After Reset  0x0</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EIVLRXS</name>
							<description>Enable Inner VLAN Tag in Rx Status   EIVLRXS. When this bit is set  the MAC provides the inner VLAN Tag in the Rx status. When this bit is reset  the MAC does not provide the inner VLAN Tag in Rx status. Value After Reset  0x0</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_VLAN_TAG_DATA</name>
					<description>MAC VLAN Tag Data Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>84</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>VID</name>
							<description>VLAN Tag ID   VID. This field holds the VLAN Tag value which is used by the MAC for perfect comparison. It is valid when VLAN Tag Enable is set. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VEN</name>
							<description>VLAN Tag Enable   VEN. This bit is used to enable or disable the VLAN Tag. When this bit is        set  the MAC compares the VLAN Tag of received packet with the VLAN Tag        ID. When this bit is reset  no comparison is performed irrespective of        the programming of the other fields. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETV</name>
							<description>12bits or 16bits VLAN comparison   ETV. This bit is valid only when VEN of the Filter is set. When this bit is set  a 12 bit VLAN identifier is used for comparing and filtering instead of the complete 16 bit VLAN tag. Bits  11 0  of VLAN tag are compared with the corresponding field in the received VLAN tagged packet. Value After Reset  0x0</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DOVLTC</name>
							<description>Disable VLAN Type Comparison   DOVLTC. This bit is valid only when VLAN Tag Enable of the Filter is set. When        this bit is set  the MAC does not check whether the VLAN Tag specified        by the Enable Inner VLAN Tag Comparison bit is of type S VLAN or C VLAN.        When this bit is reset  the MAC filters or matches the VLAN Tag        specified by the Enable Inner VLAN Tag Comparison bit only when VLAN Tag        type is similar to the one specified by the Enable S VLAN Match for        received Frames bit. Value After Reset  0x0</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ERSVLM</name>
							<description>Enable S VLAN Match for received Frames   ERSVLM. This bit is valid only when VLAN Tag Enable of the Filter is set. When        this bit is set  the MAC receiver enables filtering or matching for        S VLAN  Type   0x88A8  packets. When this bit is reset  the MAC receiver        enables filtering or matching for C VLAN  Type   0x8100  packets. Value After Reset  0x0</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ERIVLT</name>
							<description>Enable Inner VLAN Tag Comparison   ERIVLT. This bit is valid only when VLAN Tag Enable of the Filter is set. When this bit and the EDVLP field are set  the MAC receiver enables operation on the inner VLAN Tag  if present . When this bit is reset  the MAC receiver enables operation on the outer VLAN Tag  if present . Value After Reset  0x0</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DMACHEN</name>
							<description>DMA Channel Number Enable   DMACHEN. This bit is the Enable for the DMA Channel Number value programmed in the field DMACH. When this bit is reset  the Routing does not occur based on VLAN Filter result. The frame is routed based on DA Based DMA Channel Routing. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DMACHN</name>
							<description>DMA Channel Number   DMACHN. The DMA Channel number to which the VLAN Tagged Frame is to be routed if it passes this VLAN Tag Filter is programmed in this field. If the Routing based on VLAN Tag Filter is not necessary  this field need not be programmed. Value After Reset  0x0</description>
							<lsb>25</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_VLAN_TAG_FILTER_i</name>
					<description>MAC VLAN Tag Filter Register
 resetvalue={Application Reset:0x0}</description>
					<alternateRegister>MAC_VLAN_TAG_DATA</alternateRegister>
					<addressOffset>84</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>VID</name>
							<description>VLAN Tag ID   VID. This field holds the VLAN Tag value which is used by the MAC for perfect comparison. It is valid when VLAN Tag Enable is set. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VEN</name>
							<description>VLAN Tag Enable   VEN. This bit is used to enable or disable the VLAN Tag. When this bit is        set  the MAC compares the VLAN Tag of received packet with the VLAN Tag        ID. When this bit is reset  no comparison is performed irrespective of        the programming of the other fields. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETV</name>
							<description>12bits or 16bits VLAN comparison   ETV. This bit is valid only when VEN of the Filter is set. When this bit is set  a 12 bit VLAN identifier is used for comparing and filtering instead of the complete 16 bit VLAN tag. Bits  11 0  of VLAN tag are compared with the corresponding field in the received VLAN tagged packet. Value After Reset  0x0</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DOVLTC</name>
							<description>Disable VLAN Type Comparison   DOVLTC. This bit is valid only when VLAN Tag Enable of the Filter is set. When        this bit is set  the MAC does not check whether the VLAN Tag specified        by the Enable Inner VLAN Tag Comparison bit is of type S VLAN or C VLAN.        When this bit is reset  the MAC filters or matches the VLAN Tag        specified by the Enable Inner VLAN Tag Comparison bit only when VLAN Tag        type is similar to the one specified by the Enable S VLAN Match for        received Frames bit. Value After Reset  0x0</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ERSVLM</name>
							<description>Enable S VLAN Match for received Frames   ERSVLM. This bit is valid only when VLAN Tag Enable of the Filter is set. When        this bit is set  the MAC receiver enables filtering or matching for        S VLAN  Type   0x88A8  packets. When this bit is reset  the MAC receiver        enables filtering or matching for C VLAN  Type   0x8100  packets. Value After Reset  0x0</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ERIVLT</name>
							<description>Enable Inner VLAN Tag Comparison   ERIVLT. This bit is valid only when VLAN Tag Enable of the Filter is set. When this bit and the EDVLP field are set  the MAC receiver enables operation on the inner VLAN Tag  if present . When this bit is reset  the MAC receiver enables operation on the outer VLAN Tag  if present . Value After Reset  0x0</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DMACHEN</name>
							<description>DMA Channel Number Enable   DMACHEN. This bit is the Enable for the DMA Channel Number value programmed in the field DMACH. When this bit is reset  the Routing does not occur based on VLAN Filter result. The frame is routed based on DA Based DMA Channel Routing. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DMACHN</name>
							<description>DMA Channel Number   DMACHN. The DMA Channel number to which the VLAN Tagged Frame is to be routed if it passes this VLAN Tag Filter is programmed in this field. If the Routing based on VLAN Tag Filter is not necessary  this field need not be programmed. Value After Reset  0x0</description>
							<lsb>25</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_VLAN_HASH_TABLE</name>
					<description>MAC VLAN Hash Table Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>88</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>VLHT</name>
							<description>VLAN Hash Table   VLHT. This field contains the 16 bit VLAN Hash Table. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
