J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MAC_VLAN_INCL</name>
					<description>MAC VLAN Tag Inclusion or Replacement Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>96</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>VLT</name>
							<description>VLAN Tag for Transmit Packets   VLT. This field contains the value of the VLAN tag to be inserted or        replaced. The value must only be changed when the transmit lines are        inactive or during the initialization phase. Bits 15 13  are the User Priority field  Bit 12 is the CFI DEI field         and Bits 11 0  are the VID field in the VLAN tag. The following list describes the bits of this field  Bits 15 13   User Priority Bit 12  Canonical Format Indicator  CFI  or Drop Eligible Indicator           DEI  Bits 11 0   VLAN Identifier  VID  field of VLAN tag Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VLC</name>
							<description>VLAN Tag Control in Transmit Packets   VLC. Note   Changes to this field take effect        only on the start of a packet. If you write this register field when a        packet is being transmitted  only the subsequent packet can use the        updated value  that is  the current packet does not use the updated        value. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VLP</name>
							<description>VLAN Priority Control   VLP. When this bit is set  the control bits 17 16  are used for VLAN        deletion  insertion  or replacement. When this bit is reset  the        mti vlan ctrl i control input is used and bits 17 16  are ignored. Value After Reset  0x0</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CSVL</name>
							<description>C VLAN or S VLAN   CSVL. When this bit is set  S VLAN type  0x88A8  is inserted or replaced in        the 13th and 14th bytes of transmitted packets. When this bit is reset         C VLAN type  0x8100  is inserted or replaced in the 13th and 14th bytes        of transmitted packets. Value After Reset  0x0</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VLTI</name>
							<description>VLAN Tag Input   VLTI. When this bit is set  it indicates that the VLAN tag to be inserted or        replaced in Tx packet should be taken from  The Tx descriptor Value After Reset  0x0</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CBTI</name>
							<description>Channel based tag insertion   CBTI. When this bit is set  outer VLAN tag is inserted for every packets transmitted by the MAC.        The tag value is taken from the queue channel specific VLAN tag register. The VLTI  VLP  VLC and VLT fields of this register        are ignored when this bit is set. When this bit is set  a write operation to byte 3 of this register initiates the read write access to the indirect register. When reset outer VLAN operation is based on the setting of VLTI  VLP  VLC and VLT fields of this register Value After Reset  0x0</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ADDR</name>
							<description>Address   ADDR. This field selects one of the queue channel specific VLAN Inclusion        register for read write access This doesn  8217 t have any effect when CBTI is reset Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RDWR</name>
							<description>Read write control   RDWR. This bit controls the read or write operation for indirectly accessing        the queue channel specific VLAN Inclusion register. When set indicates write operation and when reset indicates read        operation This doesn  8217 t have any effect when CBTI is reset Value After Reset  0x0</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BUSY</name>
							<description>Busy   BUSY. Value After Reset  0x0</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_VLAN_INCL_Q_i</name>
					<description>MAC VLAN Tag Inclusion or Replacement Register per Queue
 resetvalue={Application Reset:0x0}</description>
					<alternateRegister>MAC_VLAN_INCL</alternateRegister>
					<addressOffset>96</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>VLT</name>
							<description>VLAN Tag for Transmit Packets   VLT. This field contains the value of the VLAN tag to be inserted. The value must only be changed when the transmit lines are inactive or during the initialization phase. Bits 15 13  are the User Priority field  Bit 12 is the CFI DEI field  and Bits 11 0  are the VID field in the VLAN tag. The following list describes the bits of this field  Bits 15 13   User Priority Bit 12  Canonical Format Indicator  CFI  or Drop Eligible Indicator  DEI  Bits 11 0   VLAN Identifier  VID  field of VLAN tag Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CSVL</name>
							<description>C VLAN or S VLAN   CSVL. When this bit is set  S VLAN type  0x88A8  is inserted in the 13th and 14th bytes of transmitted packets. When this bit is reset  C VLAN type  0x8100  is inserted in the 13th and 14th bytes of transmitted packets. Value After Reset  0x0</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_INNER_VLAN_INCL_i</name>
					<description>MAC Inner VLAN Tag Inclusion or Replacement Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>100</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>VLT</name>
							<description>VLAN Tag for Transmit Packets   VLT. This field contains the value of the VLAN tag to be inserted or        replaced. The value must only be changed when the transmit lines are        inactive or during the initialization phase. Bits 15 13  are the User Priority field  Bit 12 is the CFI DEI field         and Bits 11 0  are the VID field in the VLAN tag. The following list describes the bits of this field  Bits 15 13   User Priority Bit 12  Canonical Format Indicator  CFI  or Drop Eligible Indicator           DEI  Bits 11 0   VLAN Identifier  VID  field of VLAN tag Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VLC</name>
							<description>VLAN Tag Control in Transmit Packets   VLC. The MAC removes the VLAN type  bytes 17 and 18  and VLAN tag  bytes 19 and 20  of all transmitted packets with VLAN tags. The MAC inserts VLT in bytes 19 and 20 of the packet after inserting the Type value  0x8100 or 0x88a8  in bytes 17 and 18. This operation is performed on all transmitted packets  irrespective of whether they already have a VLAN tag. The MAC replaces VLT in bytes 19 and 20 of all VLAN type transmitted packets  Bytes 17 and 18 are 0x8100 or 0x88a8 . Note   Changes to this field take effect only on the start of a packet. If you write this register field when a packet is being transmitted  only the subsequent packet can use the updated value  that is  the current packet does not use the updated value. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VLP</name>
							<description>VLAN Priority Control   VLP. When this bit is set  the VLC field is used for VLAN deletion  insertion  or replacement. When this bit is reset  the mti vlan ctrl i control input is used and the VLC field is ignored. Value After Reset  0x0</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CSVL</name>
							<description>C VLAN or S VLAN   CSVL. When this bit is set  S VLAN type  0x88A8  is inserted or replaced in the 13th and 14th bytes of transmitted packets. When this bit is reset  C VLAN type  0x8100  is inserted or replaced in the 13th and 14th bytes of transmitted packets. Value After Reset  0x0</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VLTI</name>
							<description>VLAN Tag Input   VLTI. When this bit is set  it indicates that the VLAN tag to be inserted or replaced in Tx packet should be taken from  The Tx descriptor Value After Reset  0x0</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_Q0_TX_FLOW_CTRL</name>
					<description>MAC Queue 0 TX Flow Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>112</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FCB_BPA</name>
							<description>Flow Control Busy or Backpressure Activate   FCB BPA. This bit initiates a Pause packet in the full duplex mode and activates the backpressure function in the half duplex mode if the TFE bit is set. Full Duplex Mode  In the full duplex mode  this bit should be read as 1 b0 before writing to this register. To initiate a Pause packet  the application must set this bit to 1 b1. During Control packet transfer  this bit continues to be set to indicate that a packet transmission is in progress. When Pause packet transmission is complete  the MAC resets this bit to 1 b0. You should not write to this register until this bit is cleared. Half  Duplex Mode  When this bit is set  and TFE bit is set  in the half duplex mode  the MAC asserts the backpressure. During backpressure  when the MAC receives a new packet  the transmitter starts sending a JAM pattern resulting in a collision. This control register bit is logically ORed with the mti flowctrl i input signal for the backpressure function. When the MAC is configured for the full duplex mode  the BPA is automatically disabled. Access restriction applies. Setting 1 sets. Self cleared. Setting 0 has no effect. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TFE</name>
							<description>Transmit Flow Control Enable   TFE. Full Duplex Mode  In the full duplex mode  when this bit is set  the MAC enables the flow control operation to Tx Pause packets. When this bit is reset  the flow control operation in the MAC is disabled  and the MAC does not transmit any Pause packets. Half  Duplex Mode  In the half duplex mode  when this bit is set  the MAC enables the backpressure operation. When this bit is reset  the backpressure feature is disabled. Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PLT</name>
							<description>Pause Low Threshold   PLT. This field configures the threshold of the Pause timer at which the input flow control signal mti flowctrl i  or sbd flowctrl i  is checked for automatic retransmission of the Pause packet. The threshold values should be always less than the Pause Time configured in Bits 31 16 . For example  if PT   100H  256 slot times   and PLT   001  a second Pause packet is automatically transmitted if the mti flowctrl i signal is asserted at 228  256 28  slot times after the first Pause packet is transmitted. The following list provides the threshold values for different values  110   111 Reserved The slot time is defined as the time taken to transmit 512 bits  64 bytes  on the GMII or MII interface. This  approximate  computation is based on the packet size  64  1518  2000  9018  16384  or 32768    2 Pause Packet Size   IPG in Slot Times. Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DZPQ</name>
							<description>Disable Zero Quanta Pause   DZPQ. When this bit is set  it disables the automatic generation of the zero quanta Pause packets on de assertion of the flow control signal from the FIFO layer  MTL or external sideband flow control signal sbd flowctrl i or mti flowctrl i . When this bit is reset  normal operation with automatic zero quanta Pause packet generation is enabled. Value After Reset  0x0</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PT</name>
							<description>Pause Time   PT. This field holds the value to be used in the Pause Time field in the Tx control packet. If the Pause Time bits are configured to be double synchronized to the  G MII clock domain  consecutive writes to this register should be performed only after at least four clock cycles in the destination clock domain. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_RX_FLOW_CTRL</name>
					<description>MAC Receive Flow Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>144</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RFE</name>
							<description>Receive Flow Control Enable   RFE. When this bit is set and the MAC is operating in full duplex mode  the MAC decodes the received Pause packet and disables its transmitter for a specified  Pause  time. When this bit is reset or the MAC is operating in half duplex mode  the decode function of the Pause packet is disabled. When PFC is enabled  flow control is enabled for PFC packets. The MAC decodes the received PFC packet and disables the Transmit queue  with matching priorities  for a duration of received Pause time. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UP</name>
							<description>Unicast Pause Packet Detect   UP. A pause packet is processed when it has the unique multicast address specified in the IEEE 802.3. When this bit is set  the MAC can also detect Pause packets with unicast address of the station. This unicast address should be as specified in MAC Address0 High and MAC Address0 Low. When this bit is reset  the MAC only detects Pause packets with unique multicast address. Note   The MAC does not process a Pause packet if the multicast address is different from the unique multicast address. This is also applicable to the received PFC packet when the Priority Flow Control  PFC  is enabled. The unique multicast address  0x01 80 C2 00 00 01  is as specified in IEEE 802.1 Qbb 2011. Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_RXQ_CTRL4</name>
					<description>MAC Receive Queue Control 4 register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>148</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>UFFQE</name>
							<description>Unicast Address Filter Fail Packets Queuing Enable    UFFQE. When this bit is set  the Unicast packets which fail the Destination or        Source address filter is routed to the Rx Queue Number programmed in the        UFFQ. When this bit is reset  the Unicast packets which fail the        Destination or Source address filter is routed based on other routing        options. This bit is valid only when the RA bit of the MAC Packet Filter        register is set. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UFFQ</name>
							<description>Unicast Address Filter Fail Packets Queue   UFFQ. This field holds the Rx queue number to which the Unicast packets        failing the Destination or Source Address filter are routed to. This        field is valid only when the UFFQE bit is set. Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MFFQE</name>
							<description>Multicast Address Filter Fail Packets Queuing Enable    MFFQE. When this bit is set  the Multicast packets which fail the Destination        or Source address filter is routed to the Rx Queue Number programmed in        the MFFQ. When this bit is reset  the Multicast packets which fail the        Destination or Source address filter is routed based on other routing        options. This bit is valid only when the RA bit of the MAC Packet Filter        register is set. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MFFQ</name>
							<description>Multicast Address Filter Fail Packets Queue   MFFQ. This field holds the Rx queue number to which the Multicast packets        failing the Destination or Source Address filter are routed to. This        field is valid only when the MFFQE bit is set. Value After Reset  0x0</description>
							<lsb>9</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VFFQE</name>
							<description>VLAN Tag Filter Fail Packets Queuing Enable    VFFQE. When this bit is set  the tagged packets which fail the Destination or Source address filter or fail the VLAN tag filter  are routed to the Rx Queue Number programmed in the VFFQ. When this bit is reset  the tagged packets which fail the Destination or Source address filter or fail the VLAN tag filter are routed based on other routing options. This bit is valid only when the RA bit of the MAC Packet Filter register is set.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VFFQ</name>
							<description>VLAN Tag Filter Fail Packets Queue   VFFQ. This field holds the Rx queue number to which the tagged packets failing the Destination or Source Address filter  and UFFQE MFFQE not enabled  or failing the VLAN tag filter must be routed to. This field is valid only when the VFFQE bit is set. Value After Reset  0x0</description>
							<lsb>17</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_RXQ_CTRL0</name>
					<description>MAC Receive Queue Control 0 Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>160</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXQ0EN</name>
							<description>Receive Queue 0 Enable   RXQ0EN. This field indicates whether Rx Queue 0 is enabled for AV or DCB. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXQ1EN</name>
							<description>Receive Queue 1 Enable   RXQ1EN. This field is similar to the RXQ0EN field. Value After Reset  0x0</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXQ2EN</name>
							<description>Receive Queue 2 Enable   RXQ2EN. This field is similar to the RXQ0EN field. Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXQ3EN</name>
							<description>Receive Queue 3 Enable   RXQ3EN. This field is similar to the RXQ0EN field. Value After Reset  0x0</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
