J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MAC_RXQ_CTRL1</name>
					<description>MAC Receive Queue Control 1 Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>164</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>AVCPQ</name>
							<description>AV Untagged Control Packets Queue   AVCPQ. This field specifies the Receive queue on which the received AV tagged and untagged control packets are routed  The AV tagged  when TACPQE bit is set  and untagged control packets are routed to Receive queue specified by this field. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PTPQ</name>
							<description>PTP Packets Queue   PTPQ. This field specifies the Rx queue on which the PTP packets sent over the        Ethernet payload  not over IPv4 or IPv6  are routed. When the AV8021ASMEN bit of MAC Timestamp Control register is set  only        untagged PTP over Ethernet packets are routed on an Rx Queue. If the bit        is not set  then based on programming of TPQC field  both tagged and        untagged PTPoE packets can be routed to this Rx Queue. Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UPQ</name>
							<description>Untagged Packet Queue   UPQ. This field indicates the Rx Queue to which Untagged Packets are to be routed. Any Rx Queue enabled for Generic DCB AV traffic can be used to route the Untagged Packets. LOST SEQUENCE DEFINITION Value After Reset  0x0</description>
							<lsb>12</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MCBCQ</name>
							<description>Multicast and Broadcast Queue   MCBCQ. This field specifies the Rx Queue onto which Multicast or Broadcast Packets are routed. Any Rx Queue enabled for Generic DCB AV traffic can be used to route the Multicast or Broadcast Packets. LOST SEQUENCE DEFINITION Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MCBCQEN</name>
							<description>Multicast and Broadcast Queue Enable   MCBCQEN. This bit specifies that Multicast or Broadcast packets routing to the Rx Queue is enabled and the Multicast or Broadcast packets must be routed to Rx Queue specified in MCBCQ field. Value After Reset  0x0</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TACPQE</name>
							<description>Tagged AV Control Packets Queuing Enable.   TACPQE. When set  the MAC routes the received Tagged AV Control packets to the Rx queue specified by AVCPQ field. When reset  the MAC routes the received Tagged AV Control packets based on the tag priority matching the PSRQ fields in MAC RxQ Ctrl2 register. Value After Reset  0x0</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TPQC</name>
							<description>Tagged PTP over Ethernet Packets Queuing Control   MFFQE. This field controls the routing of the VLAN Tagged PTPoE packets. The        following programmable options are allowed.   8226  2 b00  VLAN Tagged PTPoE        packets are routed as generic VLAN Tagged packet  based on PSRQ for only        non AV enabled Rx Queues .   8226  2 b01  VLAN Tagged PTPoE packets are routed        to Rx Queue specified by PTPQ field  That Rx Queue can be enabled for AV        or non AV traffic .   8226  2 b10  VLAN Tagged PTPoE packets are routed to        only AV enabled Rx Queues based on PSRQ.   8226  2 b11  Reserved Value After        Reset  0x0</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_RXQ_CTRL2</name>
					<description>MAC Receive Queue Control 2 Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>168</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PSRQ0</name>
							<description>Priorities Selected in the Receive Queue 0   PSRQ0. This field decides the priorities assigned to Rx Queue 0. All packets with priorities that match the values set in this field are routed to Rx Queue 0. For example  if PSRQ0 5  is set  packets with USP field equal to 5 are routed to Rx Queue 0. The software must ensure that the content of this field is mutually exclusive to the PSRQ fields for other queues  that is  the same priority is not mapped to multiple Rx queues. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PSRQ1</name>
							<description>Priorities Selected in the Receive Queue 1   PSRQ1. This field decides the priorities assigned to Rx Queue 1. All packets with priorities that match the values set in this field are routed to Rx Queue 1. For example  if PSRQ1 4  is set  packets with USP field equal to 4 are routed to Rx Queue 1. The software must ensure that the content of this field is mutually exclusive to the PSRQ fields for other queues  that is  the same priority is not mapped to multiple Rx queues. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PSRQ2</name>
							<description>Priorities Selected in the Receive Queue 2   PSRQ2. This field decides the priorities assigned to Rx Queue 2. All packets with priorities that match the values set in this field are routed to Rx Queue 2. For example  if PSRQ2 1  0  are set  packets with USP field equal to 1 or 0 are routed to Rx Queue 2. The software must ensure that the content of this field is mutually exclusive to the PSRQ fields for other queues  that is  the same priority is not mapped to multiple Rx queues. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PSRQ3</name>
							<description>Priorities Selected in the Receive Queue 3   PSRQ3. This field decides the priorities assigned to Rx Queue 3. All packets with priorities that match the values set in this field are routed to Rx Queue 3. For example  if PSRQ3 6  3  are set  packets with USP field equal to 3 or 6 are routed to Rx Queue 3. The software must ensure that the content of this field is mutually exclusive to the PSRQ fields for other queues  that is  the same priority is not mapped to multiple Rx queues. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_INTERRUPT_STATUS</name>
					<description>MAC Interrupt Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>176</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RGSMIIIS</name>
							<description>RGMII or SMII Interrupt Status   RGSMIIIS. This bit is set because of any change in value of the Link Status of        RGMII or SMII interface  LNKSTS bit in MAC PHYIF Control Status        register . This bit is cleared when the MAC PHYIF Control Status        register is read  or LNKSTS bit of MAC PHYIF Control Status register is        written to 1 when RCWE bit of MAC CSR SW Ctrl register is set . Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PHYIS</name>
							<description>PHY Interrupt   PHYIS. This bit is set when rising edge is detected on the phy intr i input.        This bit is cleared when this register is read  or this bit is written to 1 when RCWE bit of MAC CSR SW Ctrl register is set . Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PMTIS</name>
							<description>PMT Interrupt Status   PMTIS. This bit is set when a Magic packet or Wake on LAN packet is received in        the powerdown mode  RWKPRCVD and MGKPRCVD bits in MAC PMT Control Status        register . This bit is cleared when corresponding interrupt source bit        are cleared because of a Read operation to the MAC PMT Control Status        register  or corresponding interrupt source bit of        MAC PMT Control Status register is written to 1 when RCWE bit of        MAC CSR SW Ctrl register is set . Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LPIIS</name>
							<description>LPI Interrupt Status   LPIIS. When the Energy Efficient Ethernet feature is enabled  this bit is set        for any LPI state entry or exit in the MAC Transmitter or Receiver. This        bit is cleared when the corresponding interrupt source bit of        MAC LPI Control Status register is read  or corresponding interrupt        source bit of MAC LPI Control Status register is written to 1 when RCWE        bit of MAC CSR SW Ctrl register is set . Value After Reset  0x0</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MMCIS</name>
							<description>MMC Interrupt Status   MMCIS. This bit is set high when Bit 11  Bit 10  or Bit 9 is set high. This bit is cleared only when all these bits are low. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MMCRXIS</name>
							<description>MMC Receive Interrupt Status   MMCRXIS. This bit is set high when an interrupt is generated in the MMC Receive Interrupt Register. This bit is cleared when all bits in this interrupt register are cleared. Value After Reset  0x0</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MMCTXIS</name>
							<description>MMC Transmit Interrupt Status   MMCTXIS. This bit is set high when an interrupt is generated in the MMC Transmit Interrupt Register. This bit is cleared when all bits in this interrupt register are cleared. Value After Reset  0x0</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MMCRXIPIS</name>
							<description>MMC Receive Checksum Offload Interrupt Status   MMCRXIPIS. This bit is set high when an interrupt is generated in the MMC Receive Checksum Offload Interrupt Register. This bit is cleared when all bits in this interrupt register are cleared. Value After Reset  0x0</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSIS</name>
							<description>Timestamp Interrupt Status   TSIS. If the Timestamp feature is enabled  this bit is set when any of the        following conditions is true  The system time value is equal to or exceeds the value specified in          the Target Time High and Low registers. There is an overflow in the Seconds register. The Target Time Error occurred  that is  programmed target time          already elapsed. In configurations other than EQOS CORE  when drop transmit status is        enabled in MTL  this bit is set when the captured transmit timestamp is        updated in the MAC Tx Timestamp Status Nanoseconds and        Mac TxTimestamp Status Seconds registers. This bit is cleared when the corresponding interrupt source bit is read         or corresponding interrupt source bit is written to 1 when RCWE bit of        MAC CSR SW Ctrl register is set  in the MAC Timestamp Status register. Value After Reset  0x0</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXSTSIS</name>
							<description>Transmit Status Interrupt   TXSTSIS. This bit indicates the status of transmitted packets. This bit is set        when any of the following bits is set in the MAC Rx Tx Status register  Excessive Collision  EXCOL  Late Collision  LCOL  Excessive Deferral  EXDEF  Loss of Carrier  LCARR  No Carrier  NCARR  Jabber Timeout  TJT  This bit is cleared when the corresponding interrupt source bit is read         or corresponding interrupt source bit is written to 1 when RCWE bit of        MAC CSR SW Ctrl register is set  in the MAC Rx Tx Status register. Value After Reset  0x0</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXSTSIS</name>
							<description>Receive Status Interrupt   RXSTSIS. This bit indicates the status of received packets. This bit is set when        the RWT bit is set in the MAC Rx Tx Status register. This bit is cleared        when the corresponding interrupt source bit is read  or corresponding        interrupt source bit is written to 1 when RCWE bit of MAC CSR SW Ctrl        register is set  in the MAC Rx Tx Status register. Value After Reset  0x0</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MDIOIS</name>
							<description>MDIO Interrupt Status   MDIOIS. This bit indicates an interrupt event after the completion of MDIO operation. To reset this bit         the application has to read this bit Write 1 to this bit when RCWE bit of MAC CSR SW Ctrl register is set.       Access restriction applies. Clears on read  or write of 1 when RCWE bit in MAC CSR SW Ctrl register is set .        Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_INTERRUPT_ENABLE</name>
					<description>MAC Interrupt Enable Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>180</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RGSMIIIE</name>
							<description>RGMII or SMII Interrupt Enable   RGSMIIIE. When this bit is set  it enables the assertion of the interrupt signal because of the setting of RGSMIIIS bit in MAC Interrupt Status register. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PHYIE</name>
							<description>PHY Interrupt Enable   PHYIE. When this bit is set  it enables the assertion of the interrupt signal because of the setting of PHYIS bit in MAC Interrupt Status register. Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PMTIE</name>
							<description>PMT Interrupt Enable   PMTIE. When this bit is set  it enables the assertion of the interrupt signal        because of the setting of PMTIS bit in MAC Interrupt Status register. Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LPIIE</name>
							<description>LPI Interrupt Enable   LPIIE. When this bit is set  it enables the assertion of the interrupt signal because of the setting of LPIIS bit in MAC Interrupt Status register. Value After Reset  0x0</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSIE</name>
							<description>Timestamp Interrupt Enable   TSIE. When this bit is set  it enables the assertion of the interrupt signal because of the setting of TSIS bit in MAC Interrupt Status register. Value After Reset  0x0</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXSTSIE</name>
							<description>Transmit Status Interrupt Enable   TXSTSIE. When this bit is set  it enables the assertion of the interrupt signal because of the setting of TXSTSIS bit in the MAC Interrupt Status register. Value After Reset  0x0</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXSTSIE</name>
							<description>Receive Status Interrupt Enable   RXSTSIE. When this bit is set  it enables the assertion of the interrupt signal        because of the setting of RXSTSIS bit in the MAC Interrupt Status        register. Value After Reset  0x0</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MDIOIE</name>
							<description>MDIO Interrupt Enable   MDIOIE. MDIO Interrupt Enable  When this bit is set  it enables the assertion of        the interrupt when MDIOIS field is set in the MAC Interrupt Status        register. Value After Reset  0x0</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_RX_TX_STATUS</name>
					<description>MAC Receive Transmit Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>184</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TJT</name>
							<description>Transmit Jabber Timeout   TJT. This bit indicates that the Transmit Jabber Timer expired which happens when the packet size exceeds 2 048 bytes  10 240 bytes when the Jumbo packet is enabled  and JD bit is reset in the MAC Configuration register. This bit is set when the packet size exceeds 16 383 bytes and the JD bit is set in the MAC Configuration register. Access restriction applies. Clears on read  or write of 1 when RCWE bit in MAC CSR SW Ctrl register is set . Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>NCARR</name>
							<description>No Carrier   NCARR. When the DTXSTS bit is set in the MTL Operation Mode register  this bit        indicates that the carrier signal from the PHY is not present at the end        of preamble transmission. Access restriction applies. Clears on read  or write of 1 when RCWE bit        in MAC CSR SW Ctrl register is set . Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LCARR</name>
							<description>Loss of Carrier   LCARR. When the DTXSTS bit is set in the MTL Operation Mode register  this bit        indicates that the loss of carrier occurred during packet transmission         that is  the phy crs i signal was inactive for one or more transmission        clock periods during packet transmission. This bit is valid only for        packets transmitted without collision. Access restriction applies. Clears on read  or write of 1 when RCWE bit in        MAC CSR SW Ctrl register is set . Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EXDEF</name>
							<description>Excessive Deferral   EXDEF. When the DTXSTS bit is set in the MTL Operation Mode register and the DC        bit is set in the MAC Configuration register  this bit indicates that        the transmission ended because of excessive deferral of over 24 288 bit        times  155 680 in 1000 2500 Mbps mode or when Jumbo packet is enabled . Access restriction applies. Clears on read  or write of 1 when RCWE bit        in MAC CSR SW Ctrl register is set . Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LCOL</name>
							<description>Late Collision   LCOL. When the DTXSTS bit is set in the MTL Operation Mode register  this bit        indicates that the packet transmission aborted because a collision        occurred after the collision window  64 bytes including Preamble in MII        mode  512 bytes including Preamble and Carrier Extension in GMII mode . This bit is not valid if the Underflow error occurs. This bit is        reserved in the EQOS CORE configurations and also in configurations with        full duplex mode. Access restriction applies. Clears on read  or write of 1 when RCWE bit        in MAC CSR SW Ctrl register is set . Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EXCOL</name>
							<description>Excessive Collisions   EXCOL. When the DTXSTS bit is set in the MTL Operation Mode register  this bit        indicates that the transmission aborted after 16 successive collisions        while attempting to transmit the current packet. If the DR bit is set in        the MAC Configuration register  this bit is set after the first        collision and the packet transmission is aborted. Access restriction applies. Clears on read  or write of 1 when RCWE bit        in MAC CSR SW Ctrl register is set . Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RWT</name>
							<description>Receive Watchdog Timeout   RWT. This bit is set when a packet with length greater than 2 048 bytes is received  10  240 bytes when Jumbo Packet mode is enabled  and the WD bit is reset in the MAC Configuration register. This bit is set when a packet with length greater than 16 383 bytes is received and the WD bit is set in the MAC Configuration register. Access restriction applies. Clears on read  or write of 1 when RCWE bit in MAC CSR SW Ctrl register is set . Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
