J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MAC_PMT_CONTROL_STATUS</name>
					<description>MAC PMT Control and Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>192</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PWRDWN</name>
							<description>Power Down   PWRDWN. When this bit is set  the MAC receiver drops all received packets until it receives the expected magic packet or remote wake up packet. This bit is then self cleared and the power down mode is disabled. The software can clear this bit before the expected magic packet or remote wake up packet is received. The packets received by the MAC after this bit is cleared are forwarded to the application. This bit must only be set when the Magic Packet Enable  Global Unicast  or Remote Wake Up Packet Enable bit is set high. Note   You can gate off the CSR clock during the power down mode. However  when the CSR clock is gated off  you cannot perform any read or write operations on this register. Therefore  the Software cannot clear this bit. Access restriction applies. Setting 1 sets. Self cleared. Setting 0 has no effect. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MGKPKTEN</name>
							<description>Magic Packet Enable   MGKPKTEN. When this bit is set  a power management event is generated when the MAC receives a magic packet. Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RWKPKTEN</name>
							<description>Remote Wake Up Packet Enable   RWKPKTEN. When this bit is set  a power management event is generated when the MAC receives a remote wake up packet. Value After Reset  0x0</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MGKPRCVD</name>
							<description>Magic Packet Received   MGKPRCVD. When this bit is set  it indicates that the power management event is        generated because of the reception of a magic packet. This bit is        cleared when this register is read. Access restriction applies. Clears on read  or write of 1 when RCWE bit        in MAC CSR SW Ctrl register is set . Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RWKPRCVD</name>
							<description>Remote Wake Up Packet Received   RWKPRCVD. When this bit is set  it indicates that the power management event is generated because of the reception of a remote wake up packet. This bit is cleared when this register is read. Access restriction applies. Clears on read  or write of 1 when RCWE bit in MAC CSR SW Ctrl register is set . Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>GLBLUCAST</name>
							<description>Global Unicast   GLBLUCAST. When this bit set  any unicast packet filtered by the MAC  DAF  address recognition is detected as a remote wake up packet. Value After Reset  0x0</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RWKPFE</name>
							<description>Remote Wake up Packet Forwarding Enable   RWKPFE. When this bit is set along with RWKPKTEN  the MAC receiver drops all received frames until it receives the expected Wake up frame. All frames after that event including the received wake up frame are forwarded to application. This bit is then self cleared on receiving the wake up packet. The application can also clear this bit before the expected wake up frame is received. In such cases  the MAC reverts to the default behavior where packets received are forwarded to the application. This bit must only be set when RWKPKTEN is set high and PWRDWN is set low. The setting of this bit has no effect when PWRDWN is set high. Note  If Magic Packet Enable and Wake Up Frame Enable are both set along with setting of this bit and Magic Packet is received prior to wake up frame  this bit is self cleared on receiving Magic Packet  the received Magic packet is dropped  and all frames after received Magic Packet are forwarded to application. Access restriction applies. Setting 1 sets. Self cleared. Setting 0 has no effect. Value After Reset  0x0</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RWKPTR</name>
							<description>Remote Wake up FIFO Pointer   RWKPTR. This field gives the current value  0 to 7  of the Remote Wake up Packet        Filter register pointer. When the value of this pointer is equal to 7         the contents of the Remote Wake up Packet Filter Register are        transferred to the clk rx i domain when a Write occurs to that register. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RWKFILTRST</name>
							<description>Remote Wake Up Packet Filter Register Pointer Reset   RWKFILTRST. When this bit is set  the remote wake up packet filter register pointer is reset to 3 b000. It is automatically cleared after 1 clock cycle. Access restriction applies. Setting 1 sets. Self cleared. Setting 0 has no effect. Value After Reset  0x0</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_RWK_PACKET_FILTER</name>
					<description>MAC Wake up Packet Filter Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>196</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>WKUPFRMFTR</name>
							<description>RWK Packet Filter   WKUPFRMFTR. This field contains the various controls of RWK Packet filter. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RWK_FILTER_COMMAND_0</name>
					<description>MAC Wake up Filter Command 0 Register
 resetvalue={Application Reset:0x0}</description>
					<alternateRegister>MAC_RWK_PACKET_FILTER</alternateRegister>
					<addressOffset>196</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>Filter0_Command</name>
							<description>Filter0 Command. The 4 bit filter command controls the filter operation. Bit 3 specifies the address type  defining the destination address type of the pattern. When the bit is set  the pattern applies to only multicast packets  when the bit is reset  the pattern applies only to unicast packet. Bit 2  Inverse Mode   when set  reverses the logic of the CRC16 hash function signal  to reject a packet with matching CRC 16 value. Bit 2  along with Bit 1  allows a MAC to reject a subset of remote wake up packets by creating filter logic such as  Pattern 1 AND NOT Pattern 2 . Bit 1  And Previous  implements the Boolean logic. When set  the result of the current entry is logically ANDed with the result of the previous filter. This AND logic allows a filter pattern longer than 32 bytes by splitting the mask among two  three  or four filters. This depends on the number of filters that have the And Previous bit set. Bit 0 is the enable for filter. If Bit 0 is not set  filter is disabled. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>Filter1_Command</name>
							<description>Filter1 Command. The 4 bit filter command controls the filter operation. Bit 3 specifies the address type  defining the destination address type of the pattern. When the bit is set  the pattern applies to only multicast packets  when the bit is reset  the pattern applies only to unicast packet. Bit 2  Inverse Mode   when set  reverses the logic of the CRC16 hash function signal  to reject a packet with matching CRC 16 value. Bit 2  along with Bit 1  allows a MAC to reject a subset of remote wake up packets by creating filter logic such as  Pattern 1 AND NOT Pattern 2 . Bit 1  And Previous  implements the Boolean logic. When set  the result of the current entry is logically ANDed with the result of the previous filter. This AND logic allows a filter pattern longer than 32 bytes by splitting the mask among two  three  or four filters. This depends on the number of filters that have the And Previous bit set. Bit 0 is the enable for filter. If Bit 0 is not set  filter is disabled. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>Filter2_Command</name>
							<description>Filter2 Command. The 4 bit filter command controls the filter operation. Bit 3 specifies the address type  defining the destination address type of the pattern. When the bit is set  the pattern applies to only multicast packets  when the bit is reset  the pattern applies only to unicast packet. Bit 2  Inverse Mode   when set  reverses the logic of the CRC16 hash function signal  to reject a packet with matching CRC 16 value. Bit 2  along with Bit 1  allows a MAC to reject a subset of remote wake up packets by creating filter logic such as  Pattern 1 AND NOT Pattern 2 . Bit 1  And Previous  implements the Boolean logic. When set  the result of the current entry is logically ANDed with the result of the previous filter. This AND logic allows a filter pattern longer than 32 bytes by splitting the mask among two  three  or four filters. This depends on the number of filters that have the And Previous bit set. Bit 0 is the enable for filter. If Bit 0 is not set  filter is disabled. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>Filter3_Command</name>
							<description>Filter3 Command. The 4 bit filter command controls the filter operation. Bit 3 specifies the address type  defining the destination address type of the pattern. When the bit is set  the pattern applies to only multicast packets  when the bit is reset  the pattern applies only to unicast packet. Bit 2  Inverse Mode   when set  reverses the logic of the CRC16 hash function signal  to reject a packet with matching CRC 16 value. Bit 2  along with Bit 1  allows a MAC to reject a subset of remote wake up packets by creating filter logic such as  Pattern 1 AND NOT Pattern 2 . Bit 1  And Previous  implements the Boolean logic. When set  the result of the current entry is logically ANDed with the result of the previous filter. This AND logic allows a filter pattern longer than 32 bytes by splitting the mask among two  three  or four filters. This depends on the number of filters that have the And Previous bit set. Bit 0 is the enable for filter. If Bit 0 is not set  filter is disabled. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RWK_FILTER_OFFSET_0</name>
					<description>MAC Wake up Filter Offset 0 Register
 resetvalue={Application Reset:0x0}</description>
					<alternateRegister>MAC_RWK_PACKET_FILTER</alternateRegister>
					<addressOffset>196</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>Filter0_Offset</name>
							<description>Filter0 Offset. This filter offset defines the offset  within the packet  from which the filter examines the packets. This 8 bit pattern offset is the offset for the filter first byte to be examined. The minimum allowed offset is 12  which refers to the 13th byte of the packet. The offset value 0 refers to the first byte of the packet. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>Filter1_Offset</name>
							<description>Filter1 Offset. This filter offset defines the offset  within the packet  from which the filter examines the packets. This 8 bit pattern offset is the offset for the filter first byte to be examined. The minimum allowed offset is 12  which refers to the 13th byte of the packet. The offset value 0 refers to the first byte of the packet. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>Filter2_Offset</name>
							<description>Filter2 Offset. This filter offset defines the offset  within the packet  from which the filter examines the packets. This 8 bit pattern offset is the offset for the filter first byte to be examined. The minimum allowed offset is 12  which refers to the 13th byte of the packet. The offset value 0 refers to the first byte of the packet. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>Filter3_Offset</name>
							<description>Filter3 Offset. This filter offset defines the offset  within the packet  from which the filter examines the packets. This 8 bit pattern offset is the offset for the filter first byte to be examined. The minimum allowed offset is 12  which refers to the 13th byte of the packet. The offset value 0 refers to the first byte of the packet. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RWK_FILTER_CRC_i</name>
					<description>MAC Wake up Filter CRC Register
 resetvalue={Application Reset:0x0}</description>
					<alternateRegister>MAC_RWK_PACKET_FILTER</alternateRegister>
					<addressOffset>196</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>Filter0_CRC</name>
							<description>Filter0 CRC. This filter CRC 16 contains the CRC 16 value of the pattern. The 16 bit CRC calculation uses the following polynomial  G x    x 16   x 15   x 2   1 Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>Filter1_CRC</name>
							<description>Filter1 CRC. This filter CRC 16 contains the CRC 16 value of the pattern. The 16 bit CRC calculation uses the following polynomial  G x    x 16   x 15   x 2   1 Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RWK_FILTER_BYTE_MASK_i</name>
					<description>MAC Wake up Filter Byte Mask register
 resetvalue={Application Reset:0x0}</description>
					<alternateRegister>MAC_RWK_PACKET_FILTER</alternateRegister>
					<addressOffset>196</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>Filteri_Byte_Mask</name>
							<description>Filter 32 bit Mask   Filteri Byte Mask. Each bit in this mask corresponds to one byte in the detected packet. If        the bit is 1   the corresponding byte is taken into the CRC16        calculation. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_LPI_CONTROL_STATUS</name>
					<description>MAC LPI Control and Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>208</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TLPIEN</name>
							<description>Transmit LPI Entry   TLPIEN. When this bit is set  it indicates that the MAC Transmitter has entered        the LPI state because of the setting of the LPIEN bit. This bit is        cleared by a read into this register  or this bit is written to 1 when        RCWE bit in MAC CSR SW Ctrl register is set . Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TLPIEX</name>
							<description>Transmit LPI Exit   TLPIEX. When this bit is set  it indicates that the MAC transmitter exited the        LPI state after the application cleared the LPIEN bit and the LPI TW        Timer has expired. This bit is cleared by a read into this register  or        this bit is written to 1 when RCWE bit in MAC CSR SW Ctrl register is        set . Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RLPIEN</name>
							<description>Receive LPI Entry   RLPIEN. When this bit is set  it indicates that the MAC Receiver has received an        LPI pattern and entered the LPI state. This bit is cleared by a read        into this register  or this bit is written to 1 when RCWE bit in        MAC CSR SW Ctrl register is set . Note   This bit may not be set if the MAC        stops receiving the LPI pattern for a very short duration  such as  less        than three clock cycles of CSR clock. Value After Reset  0x0</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RLPIEX</name>
							<description>Receive LPI Exit   RLPIEX. When this bit is set  it indicates that the MAC Receiver has stopped receiving the LPI pattern on the GMII or MII interface  exited the LPI state  and resumed the normal reception. This bit is cleared by a read into this register  or this bit is written to 1 when RCWE bit in MAC CSR SW Ctrl register is set . Note   This bit may not be set if the MAC stops receiving the LPI pattern for a very short duration  such as  less than three clock cycles of CSR clock. Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TLPIST</name>
							<description>Transmit LPI State   TLPIST. When this bit is set  it indicates that the MAC is transmitting the LPI pattern on the GMII or MII interface. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RLPIST</name>
							<description>Receive LPI State   RLPIST. When this bit is set  it indicates that the MAC is receiving the LPI pattern on the GMII or MII interface. Value After Reset  0x0</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LPIEN</name>
							<description>LPI Enable   LPIEN. When this bit is set  it instructs the MAC Transmitter to enter the LPI state. When this bit is reset  it instructs the MAC to exit the LPI state and resume normal transmission. This bit is cleared when the LPITXA bit is set and the MAC exits the LPI state because of the arrival of a new packet for transmission. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PLS</name>
							<description>PHY Link Status   PLS. This bit indicates the link status of the PHY. The MAC Transmitter asserts the LPI pattern only when the link status is up  OKAY  at least for the time indicated by the LPI LS TIMER. When this bit is set  the link is considered to be okay  UP  and when this bit is reset  the link is considered to be down. Value After Reset  0x0</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PLSEN</name>
							<description>PHY Link Status Enable   PLSEN. This bit enables the link status received on the RGMII  SGMII  or SMII Receive paths to be used for activating the LPI LS TIMER. When this bit is set  the MAC uses the link status bits of the MAC PHYIF Control Status register and the PLS bit for the LPI LS Timer trigger. When this bit is reset  the MAC ignores the link status bits of the MAC PHYIF Control Status register and takes only the PLS bit. Value After Reset  0x0</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LPITXA</name>
							<description>LPI Tx Automate   LPITXA. This bit controls the behavior of the MAC when it is entering or coming out of the LPI mode on the Transmit side. This bit is not functional in the EQOS CORE configurations in which the Tx clock gating is done during the LPI mode. If the LPITXA and LPIEN bits are set to 1  the MAC enters the LPI mode only after all outstanding packets  in the core  and pending packets  in the application interface  have been transmitted. The MAC comes out of the LPI mode when the application sends any packet for transmission or the application issues a Tx FIFO Flush command. In addition  the MAC automatically clears the LPIEN bit when it exits the LPI state. If Tx FIFO Flush is set in the FTQ bit of MTL TxQ0 Operation Mode register  when the MAC is in the LPI mode  it exits the LPI mode. When this bit is 0  the LPIEN bit directly controls behavior of the MAC when it is entering or coming out of the LPI mode. Value After Reset  0x0</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LPIATE</name>
							<description>LPI Timer Enable   LPIATE. This bit controls the automatic entry of the MAC Transmitter into and        exit out of the LPI state. When LPIATE  LPITXA and LPIEN bits are set         the MAC Transmitter enters LPI state only when the complete MAC TX data        path is IDLE for a period indicated by the MAC LPI Entry Timer register.        After entering LPI state  if the data path becomes non IDLE  due to a        new packet being accepted for transmission   the Transmitter exits LPI        state but does not clear LPIEN bit. This enables the re entry into LPI        state when it is IDLE again. When LPIATE is 0  the LPI Auto timer is        disabled and MAC Transmitter enters LPI state based on the settings of        LPITXA and LPIEN bit descriptions. Value After Reset  0x0</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LPITCSE</name>
							<description>LPI Tx Clock Stop Enable   LPITCSE. When this bit is set  the MAC asserts sbd tx clk gating ctrl o signal high after it enters Tx LPI mode to indicate that the Tx clock to MAC can be stopped. When this bit is reset  the MAC does not assert sbd tx clk gating ctrl o signal high after it enters Tx LPI mode. If RGMII Interface is selected  the Tx clock is required for transmitting the LPI pattern. The Tx Clock cannot be gated and so the LPITCSE bit cannot be programmed. Value After Reset  0x0</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
