J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MAC_LPI_TIMERS_CONTROL</name>
					<description>MAC LPI Timers Control Register
 resetvalue={Application Reset:0x3E80000}</description>
					<addressOffset>212</addressOffset>
					<size>32</size>
					<resetValue>65536000</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TWT</name>
							<description>LPI TW Timer   TWT. This field specifies the minimum time  in microseconds  for which the MAC waits after it stops transmitting the LPI pattern to the PHY and before it resumes the normal transmission. The TLPIEX status bit is set after the expiry of this timer. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LST</name>
							<description>LPI LS Timer   LST. This field specifies the minimum time  in milliseconds  for which the link status from the PHY should be up  OKAY  before the LPI pattern can be transmitted to the PHY. The MAC does not transmit the LPI pattern even when the LPIEN bit is set unless the LPI LS Timer reaches the programmed terminal count. The default value of the LPI LS Timer is 1000  1 sec  as defined in the IEEE standard. Value After Reset 0x3e8</description>
							<lsb>16</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_LPI_ENTRY_TIMER</name>
					<description>MAC LPI Entry Timer Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>216</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LPIET</name>
							<description>LPI Entry Timer   LPIET. This field specifies the time in microseconds the MAC waits to enter LPI mode  after it has transmitted all the frames. This field is valid and used only when LPITE and LPITXA are set to 1. Bits  2 0  are read only so that the granularity of this timer is in steps of 8 micro seconds. Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_1US_TIC_COUNTER</name>
					<description>MAC One Microsecond Tic Counter Register
 resetvalue={Application Reset:0x63}</description>
					<addressOffset>220</addressOffset>
					<size>32</size>
					<resetValue>99</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TIC_1US_CNTR</name>
							<description>1US TIC Counter   TIC 1US CNTR. The application must program this counter so that the number of clock        cycles of CSR clock is 1us.  Subtract 1 from the value before        programming . For example if the CSR clock is 100MHz then this field        needs to be programmed to value 100   1   99  which is 0x63 . This is        required to generate the 1US events that are used to update some of the        EEE related counters. Value After Reset  0x63</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_PHYIF_CONTROL_STATUS</name>
					<description>MAC PHY Interface Control and Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>248</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TC</name>
							<description>Transmit Configuration in RGMII  SGMII  or SMII   TC. When set  this bit enables the transmission of duplex mode  link speed  and link up or down information to the PHY in the RGMII  SMII  or SGMII port. When this bit is reset  no such information is driven to the PHY. The details of this feature are provided in the following sections   Reduced Gigabit Media Independent Interface   Serial Media Independent Interface   Serial Gigabit Media Independent Interface  Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LUD</name>
							<description>Link Up or Down   LUD. This bit indicates whether the link is up or down during transmission of configuration in the RGMII  SGMII  or SMII interface  Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LNKMOD</name>
							<description>Link Mode   LNKMOD. This bit indicates the current mode of operation of the link  Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LNKSPEED</name>
							<description>Link Speed   LNKSPEED. This bit indicates the current speed of the link  Value After Reset  0x0</description>
							<lsb>17</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LNKSTS</name>
							<description>Link Status   LNKSTS. This bit indicates whether the link is up  1 b1  or down  1 b0 . Value After Reset  0x0</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_VERSION</name>
					<description>MAC Version Register
 resetvalue={Application Reset:0x1042,Application Reset:0x1050}</description>
					<addressOffset>272</addressOffset>
					<size>32</size>
					<resetValue>4160</resetValue>
					<resetMask>4294967277</resetMask>
					<fields>
						<field>
							<name>SNPSVER</name>
							<description>Synopsys defined Version   SNPSVER. IP Version</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>USERVER</name>
							<description>User defined Version  configured with coreConsultant    USERVER. Value After Reset  0x10</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_DEBUG</name>
					<description>MAC Debug Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>276</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RPESTS</name>
							<description>MAC GMII or MII Receive Protocol Engine Status   RPESTS. When this bit is set  it indicates that the MAC GMII or MII receive protocol engine is actively receiving data  and it is not in the Idle state. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RFCFCSTS</name>
							<description>MAC Receive Packet Controller FIFO Status   RFCFCSTS. When this bit is set  this field indicates the active state of the small        FIFO Read and Write controllers of the MAC Receive Packet Controller        module. Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TPESTS</name>
							<description>MAC GMII or MII Transmit Protocol Engine Status   TPESTS. When this bit is set  it indicates that the MAC GMII or MII transmit protocol engine is actively transmitting data  and it is not in the Idle state. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TFCSTS</name>
							<description>MAC Transmit Packet Controller Status   TFCSTS. This field indicates the state of the MAC Transmit Packet Controller        module  Status of the previous packet OR IPG or backoff period to be over Value After Reset  0x0</description>
							<lsb>17</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_HW_FEATURE0</name>
					<description>MAC Hardware Feature Register 0
 resetvalue={Application Reset:0x0A7D71F7}</description>
					<addressOffset>284</addressOffset>
					<size>32</size>
					<resetValue>175993335</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MIISEL</name>
							<description>10 or 100 Mbps Support   MIISEL. This bit is set to 1 when 10 100 Mbps is selected as the Mode of Operation Value After Reset  0x1</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>GMIISEL</name>
							<description>1000 Mbps Support   GMIISEL. This bit is set to 1 when 1000 Mbps is selected as the Mode of Operation Value After Reset  0x1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HDSEL</name>
							<description>Half duplex Support   HDSEL. This bit is set to 1 when the half duplex mode is selected Value After Reset  0x1</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PCSSEL</name>
							<description>PCS Registers  TBI  SGMII  or RTBI PHY interface    PCSSEL. This bit is set to 1 when the TBI  SGMII  or RTBI PHY interface option is selected Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>VLHASH</name>
							<description>VLAN Hash Filter Selected   VLHASH. This bit is set to 1 when the Enable VLAN Hash Table Based Filtering option is selected Value After Reset  0x1</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SMASEL</name>
							<description>SMA  MDIO  Interface   SMASEL. This bit is set to 1 when the Enable Station Management  MDIO Interface  option is selected Value After Reset  0x1</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RWKSEL</name>
							<description>PMT Remote Wake up Packet Enable   RWKSEL. This bit is set to 1 when the Enable Remote Wake Up Packet Detection option is selected Value After Reset  0x1</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MGKSEL</name>
							<description>PMT Magic Packet Enable   MGKSEL. This bit is set to 1 when the Enable Magic Packet Detection option is selected Value After Reset  0x1</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MMCSEL</name>
							<description>RMON Module Enable   MMCSEL. This bit is set to 1 when the Enable MAC Management Counters  MMC  option is selected Value After Reset  0x1</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ARPOFFSEL</name>
							<description>ARP Offload Enabled   ARPOFFSEL. This bit is set to 1 when the Enable IPv4 ARP Offload option is selected Value After Reset  0x0</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSSEL</name>
							<description>IEEE 1588 2008 Timestamp Enabled   TSSEL. This bit is set to 1 when the Enable IEEE 1588 Timestamp Support option is selected Value After Reset  0x1</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EEESEL</name>
							<description>Energy Efficient Ethernet Enabled   EEESEL. This bit is set to 1 when the Enable Energy Efficient Ethernet  EEE  option is selected Value After Reset  0x1</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXCOESEL</name>
							<description>Transmit Checksum Offload Enabled   TXCOESEL. This bit is set to 1 when the Enable Transmit TCP IP Checksum Insertion option is selected Value After Reset  0x1</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXCOESEL</name>
							<description>Receive Checksum Offload Enabled   RXCOESEL. This bit is set to 1 when the Enable Receive TCP IP Checksum Check option is selected Value After Reset  0x1</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDMACADRSEL</name>
							<description>MAC Addresses 1 31 Selected   ADDMACADRSEL. This bit is set to 1 when the Enable Additional 1 31 MAC Address Registers option is selected Value After Reset  0x1f</description>
							<lsb>18</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MACADR32SEL</name>
							<description>MAC Addresses 32 63 Selected   MACADR32SEL. This bit is set to 1 when the Enable Additional 32 MAC Address Registers  32 63  option is selected Value After Reset  0x0</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MACADR64SEL</name>
							<description>MAC Addresses 64 127 Selected   MACADR64SEL. This bit is set to 1 when the Enable Additional 64 MAC Address Registers  64 127  option is selected Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSSTSSEL</name>
							<description>Timestamp System Time Source   TSSTSSEL. This bit indicates the source of the Timestamp system time  This bit is set to 1 when the Enable IEEE 1588 Timestamp Support option is selected Value After Reset  0x1</description>
							<lsb>25</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SAVLANINS</name>
							<description>Source Address or VLAN Insertion Enable   SAVLANINS. This bit is set to 1 when the Enable SA and VLAN Insertion on Tx option is selected Value After Reset  0x1</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ACTPHYSEL</name>
							<description>Active PHY Selected   ACTPHYSEL. When you have multiple PHY interfaces in your configuration  this field indicates the sampled value of phy intf sel i during reset de assertion  All Others  Reserved Value After Reset  0x0</description>
							<lsb>28</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_HW_FEATURE1</name>
					<description>MAC Hardware Feature Register 1
 resetvalue={Application Reset:0x0922966}</description>
					<addressOffset>288</addressOffset>
					<size>32</size>
					<resetValue>9578854</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXFIFOSIZE</name>
							<description>MTL Receive FIFO Size   RXFIFOSIZE. This field contains the configured value of MTL Rx FIFO in bytes expressed as Log to base 2 minus 7  that is  Log2 RXFIFO SIZE   7  01100   11111 Reserved Value After Reset  0x6</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SPRAM</name>
							<description>Single Port RAM Enable   SPRAM. This bit is set to 1 when the Use single port RAM Feature is selected. Value After Reset  0x1</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXFIFOSIZE</name>
							<description>MTL Transmit FIFO Size   TXFIFOSIZE. This field contains the configured value of MTL Tx FIFO in bytes expressed as Log to base 2 minus 7  that is  Log2 TXFIFO SIZE   7  01011   11111 Reserved Value After Reset  0x5</description>
							<lsb>6</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OSTEN</name>
							<description>One Step Timestamping Enable   OSTEN. This bit is set to 1 when the Enable One Step Timestamp Feature is selected. Value After Reset  0x1</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PTOEN</name>
							<description>PTP Offload Enable   PTOEN. This bit is set to 1 when the Enable PTP Timestamp Offload Feature is selected. Value After Reset  0x0</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ADVTHWORD</name>
							<description>IEEE 1588 High Word Register Enable   ADVTHWORD. This bit is set to 1 when the Add IEEE 1588 Higher Word Register option is selected Value After Reset  0x1</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDR64</name>
							<description>Address Width.   ADDR64. This field indicates the configured address width  Value After Reset  0x0</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DCBEN</name>
							<description>DCB Feature Enable   DCBEN. This bit is set to 1 when the Enable Data Center Bridging option is selected Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SPHEN</name>
							<description>Split Header Feature Enable   SPHEN. This bit is set to 1 when the Enable Split Header Structure option is selected Value After Reset  0x1</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSOEN</name>
							<description>TCP Segmentation Offload Enable   TSOEN. This bit is set to 1 when the Enable TCP Segmentation Offloading for TCP IP Packets option is selected Value After Reset  0x0</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DBGMEMA</name>
							<description>DMA Debug Registers Enable   DBGMEMA. This bit is set to 1 when the Debug Mode Enable option is selected Value After Reset  0x0</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AVSEL</name>
							<description>AV Feature Enable   AVSEL. This bit is set to 1 when the Enable Audio Video Bridging option is selected. Value After Reset  0x1</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RAVSEL</name>
							<description>Rx Side Only AV Feature Enable   RAVSEL. This bit is set to 1 when the Enable Audio Video Bridging option on Rx Side Only is selected. Value After Reset  0x0</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>POUOST</name>
							<description>One Step for PTP over UDP IP Feature Enable   POUOST. This bit is set to 1 when the Enable One step timestamp for PTP over UDP IP feature is selected. Value After Reset  0x1</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HASHTBLSZ</name>
							<description>Hash Table Size   HASHTBLSZ. This field indicates the size of the hash table  Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>L3L4FNUM</name>
							<description>Total number of L3 or L4 Filters   L3L4FNUM. This field indicates the total number of L3 or L4 filters  LOST SEQUENCE DEFINITION Value After Reset  0x0</description>
							<lsb>27</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_HW_FEATURE2</name>
					<description>MAC Hardware Feature Register 2
 resetvalue={Application Reset:0x10C30C3}</description>
					<addressOffset>292</addressOffset>
					<size>32</size>
					<resetValue>17576131</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXQCNT</name>
							<description>Number of MTL Receive Queues   RXQCNT. This field indicates the number of MTL Receive queues  LOST SEQUENCE DEFINITION Value After Reset  0x3</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXQCNT</name>
							<description>Number of MTL Transmit Queues   TXQCNT. This field indicates the number of MTL Transmit queues  LOST SEQUENCE DEFINITION Value After Reset  0x3</description>
							<lsb>6</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXCHCNT</name>
							<description>Number of DMA Receive Channels   RXCHCNT. This field indicates the number of DMA Receive channels  LOST SEQUENCE DEFINITION Value After Reset  0x3</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXCHCNT</name>
							<description>Number of DMA Transmit Channels   TXCHCNT. This field indicates the number of DMA Transmit channels  LOST SEQUENCE DEFINITION Value After Reset  0x3</description>
							<lsb>18</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PPSOUTNUM</name>
							<description>Number of PPS Outputs   PPSOUTNUM. This field indicates the number of PPS outputs  101   111 Reserved Value After Reset  0x1</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AUXSNAPNUM</name>
							<description>Number of Auxiliary Snapshot Inputs   AUXSNAPNUM. This field indicates the number of auxiliary snapshot inputs  101   111 Reserved Value After Reset  0x0</description>
							<lsb>28</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_HW_FEATURE3</name>
					<description>MAC Hardware Feature Register 3
 resetvalue={Application Reset:0x320032}</description>
					<addressOffset>296</addressOffset>
					<size>32</size>
					<resetValue>3276850</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>NRVF</name>
							<description>Number of Extended VLAN Tag Filters Enabled   NRVF. This field indicates the Number of Extended VLAN Tag Filters selected  110   111 Reserved Value After Reset  0x2</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CBTISEL</name>
							<description>Queue Channel based VLAN tag insertion on Tx Enable   CBTISEL. This bit is set to 1 when the Enable Queue Channel based VLAN tag        insertion on Tx Feature is selected. Value After Reset  0x1</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DVLAN</name>
							<description>DVLAN. Value After Reset  0x1</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
