J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MAC_MDIO_ADDRESS</name>
					<description>MAC MDIO Address Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>512</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>GB</name>
							<description>GMII Busy   GB. The application sets this bit to instruct the SMA to initiate a Read or Write access to the MDIO slave. The MAC clears this bit after the MDIO frame transfer is completed. Hence the software must not write or change any of the fields in MAC MDIO Address and MAC MDIO Data registers as long as this bit is set. For write transfers  the application must first write 16 bit data in the GDl field  and also RA field when C45E is set  in MAC MDIO Data register before setting this bit. When C45E is set  it should also write into the RA field of MAC MDIO Data register before initiating a read transfer. When a read transfer is completed  GB 0   the data read from the PHY register is valid in the GD field of the MAC MDIO Data register. Note   Even if the addressed PHY is not present  there is no change in the functionality of this bit. Access restriction applies. Setting 1 sets. Self cleared. Setting 0 has no effect. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>C45E</name>
							<description>Clause 45 PHY Enable   C45E. When this bit is set  Clause 45 capable PHY is connected to MDIO. When this bit is reset  Clause 22 capable PHY is connected to MDIO. Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GOC_0</name>
							<description>GMII Operation Command 0   GOC 0. This is the lower bit of the operation command to the PHY or RevMII. When in SMA mode  MDIO master  this bit along with GOC 1 determines the operation to be performed to the PHY. When only RevMII is selected in configuration this bit is read only and tied to 1. Value After Reset  0x0</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GOC_1</name>
							<description>GMII Operation Command 1   GOC 1. This bit is higher bit of the operation command to the PHY or RevMII  GOC 1 and GOC O is encoded as follows  00 Reserved 01 Write 10 Post Read Increment Address for Clause 45 PHY 11 Read When Clause 22 PHY or RevMII is enabled  only Write and Read commands are valid. Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SKAP</name>
							<description>Skip Address Packet   SKAP. When this bit is set  the SMA does not send the address packets before read  write  or post read increment address packets. This bit is valid only when C45E is set. Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CR</name>
							<description>CSR Clock Range   CR. The CSR Clock Range selection determines the frequency of the MDC clock according to the CSR clock frequency used in your design  0110   0111 Reserved The suggested range of CSR clock frequency applicable for each value  when Bit 11   0  ensures that the MDC clock is approximately between 1.0 MHz to 2.5 MHz frequency range. When Bit 11 is set  you can achieve a higher frequency of the MDC clock than the frequency limit of 2.5 MHz  specified in the IEEE 802.3  and program a clock divider of lower value. For example  when CSR clock is of 100 MHz frequency and you program these bits as 1010  the resultant MDC clock is of 12.5 MHz which is above the range specified in IEEE 802.3. Program the following values only if the interfacing chips support faster MDC clocks  These bits are not used for accessing RevMII. These bits are read only if the RevMII interface is selected as single PHY interface. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NTC</name>
							<description>Number of Trailing Clocks   NTC. This field controls the number of trailing clock cycles generated on        gmii mdc o  MDC  after the end of transmission of MDIO frame. The valid        values can be from 0 to 7. Programming the value to 3 h3 indicates that        there are additional three clock cycles on the MDC line after the end of        MDIO frame transfer. Value After Reset  0x0</description>
							<lsb>12</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RDA</name>
							<description>Register Device Address   RDA. These bits select the PHY register in selected Clause 22 PHY device. These bits select the Device  MMD  in selected Clause 45 capable PHY. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PA</name>
							<description>Physical Layer Address   PA. This field indicates which Clause 22 PHY devices  out of 32 devices  the MAC is accessing. This field indicates which Clause 45 capable PHYs  out of 32 PHYs  the MAC is accessing. Value After Reset  0x0</description>
							<lsb>21</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BTB</name>
							<description>Back to Back transactions   BTB. When this bit is set and the NTC has value greater than 0  then the MAC informs the completion of a read or write command at the end of frame transfer  before the trailing clocks are transmitted . The software can thus initiate the next command which is executed immediately irrespective of the number trailing clocks generated for the previous frame. When this bit is reset  then the read write command completion  GB is cleared  only after the trailing clocks are generated. In this mode  it is ensured that the NTC is always generated after each frame. This bit must not be set when NTC 0. Value After Reset  0x0</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PSE</name>
							<description>Preamble Suppression Enable   PSE. When this bit is set  the SMA  suppresses the 32 bit preamble and transmits MDIO frames with only 1 preamble bit. When this bit is 0  the MDIO frame always has 32 bits of preamble as defined in the IEEE specifications. Value After Reset  0x0</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_MDIO_DATA</name>
					<description>MAC MDIO Data Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>516</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>GD</name>
							<description>GMII Data   GD. This field contains the 16 bit data value read from the PHY or RevMII        after a Management Read operation or the 16 bit data value to be written        to the PHY or RevMII before a Management Write operation. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RA</name>
							<description>Register Address   RA. This field is valid only when C45E is set. It contains the Register Address in the PHY to which the MDIO frame is intended for. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_CSR_SW_CTRL</name>
					<description>MAC CSR Software Controls Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>560</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RCWE</name>
							<description>Register Clear on Write 1 Enable   RCWE . When this bit is set  the access mode of some register fields changes to Clear on Write 1  the application needs to set that respective bit to 1 to clear it. When this bit is reset  the access mode of these register fields remain as Clear on Read. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEEN</name>
							<description>Slave Error Response Enable   SEEN. When this bit is set  the MAC responds with Slave Error for accesses to        reserved registers in CSR space. When this bit is reset  the MAC        responds with Okay response to any register accessed from CSR space. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_EXT_CFG1</name>
					<description>MAC Extended Configuration Register 1
 resetvalue={Application Reset:0x2}</description>
					<addressOffset>568</addressOffset>
					<size>32</size>
					<resetValue>2</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SPLOFST</name>
							<description>Split Offset   SPLOFST. These bits indicate the value of offset from the beginning of Length Type field at which header              split should take place when the appropriate SPLM is selected. The reset value of this field is 2 bytes indicating a split              at L2 header. Value is in terms ofbytes.</description>
							<lsb>0</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SPLM</name>
							<description>Split Mode   SPLM. These bits indicate the mode of splitting the incoming Rx packets. They are</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS0_HIGH</name>
					<description>MAC Address 0 High Register
 resetvalue={Application Reset:0x08000FFFF}</description>
					<addressOffset>768</addressOffset>
					<size>32</size>
					<resetValue>2147549183</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRHI</name>
							<description>MAC Address0 47 32    ADDRHI. This field contains the upper 16 bits  47 32  of the first 6 byte MAC address. The MAC uses this field for filtering the received packets and inserting the MAC address in the Transmit Flow Control  Pause  Packets. Value After Reset  0xffff</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DCS</name>
							<description>DMA Channel Select   DCS. If the PDC bit of MAC Ext Configuration register is not set  This field contains the binary representation of the DMA Channel number to which an Rx packet whose DA matches the MAC Address0 content is routed. If the PDC bit of MAC Ext Configuration register is set  This field contains the one hot representation of one or more DMA Channel numbers to which an Rx packet whose DA matches the MAC Address0 content is routed.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE</name>
							<description>Address Enable   AE. This bit is always set to 1. Value After Reset  0x1</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS0_LOW</name>
					<description>MAC Address 0 Low Register
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
					<addressOffset>772</addressOffset>
					<size>32</size>
					<resetValue>4294967295</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRLO</name>
							<description>MAC Address0 31 0    ADDRLO. This field contains the lower 32 bits of the first 6 byte MAC address.        The MAC uses this field for filtering the received packets and inserting        the MAC address in the Transmit Flow Control  Pause  Packets. Value After Reset  0xffffffff</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS1_HIGH</name>
					<description>MAC Address 31 High Register
 resetvalue={Application Reset:0x0FFFF}</description>
					<addressOffset>776</addressOffset>
					<size>32</size>
					<resetValue>65535</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRHI</name>
							<description>MAC Address1  47 32    ADDRHI. This field contains the upper 16 bits 47 32  of the second 6 byte MAC address. Value After Reset  0xffff</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DCS</name>
							<description>DMA Channel Select   DCS. If the PDC bit of MAC Ext Configuration register is not set  This field contains the binary representation of the DMA Channel number to which an Rx packet whose DA matches the MAC Address0 content is routed. If the PDC bit of MAC Ext Configuration register is set  This field contains the one hot representation of one or more DMA Channel numbers to which an Rx packet whose DA matches the MAC Address0 content is routed.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MBC</name>
							<description>Mask Byte Control   MBC. These bits are mask control bits for comparing each of the MAC Address bytes. When set high  the MAC does not compare the corresponding byte of received DA or SA with the contents of MAC Address1 registers. Each bit controls the masking of the bytes as follows  Bit 29  Register 194 15 8  Bit 28  Register 194 7 0  Bit 27  Register 195 31 24    Bit 24  Register 195 7 0  You can filter a group of addresses  known as group address filtering  by masking one or more bytes of the address. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SA</name>
							<description>Source Address   SA. When this bit is set  the MAC Address1 47 0  is used to compare with the SA fields of the received packet. When this bit is reset  the MAC Address1 47 0  is used to compare with the DA fields of the received packet. Value After Reset  0x0</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE</name>
							<description>Address Enable   AE. When this bit is set  the address filter module uses the second MAC address for perfect filtering. When this bit is reset  the address filter module ignores the address for filtering. Value After Reset  0x0</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS2_HIGH</name>
					<description>MAC Address 31 High Register
 resetvalue={Application Reset:0x0FFFF}</description>
					<addressOffset>784</addressOffset>
					<size>32</size>
					<resetValue>65535</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRHI</name>
							<description>MAC Address1  47 32    ADDRHI. This field contains the upper 16 bits 47 32  of the second 6 byte MAC address. Value After Reset  0xffff</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DCS</name>
							<description>DMA Channel Select   DCS. If the PDC bit of MAC Ext Configuration register is not set  This field contains the binary representation of the DMA Channel number to which an Rx packet whose DA matches the MAC Address0 content is routed. If the PDC bit of MAC Ext Configuration register is set  This field contains the one hot representation of one or more DMA Channel numbers to which an Rx packet whose DA matches the MAC Address0 content is routed.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MBC</name>
							<description>Mask Byte Control   MBC. These bits are mask control bits for comparing each of the MAC Address bytes. When set high  the MAC does not compare the corresponding byte of received DA or SA with the contents of MAC Address1 registers. Each bit controls the masking of the bytes as follows  Bit 29  Register 194 15 8  Bit 28  Register 194 7 0  Bit 27  Register 195 31 24    Bit 24  Register 195 7 0  You can filter a group of addresses  known as group address filtering  by masking one or more bytes of the address. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SA</name>
							<description>Source Address   SA. When this bit is set  the MAC Address1 47 0  is used to compare with the SA fields of the received packet. When this bit is reset  the MAC Address1 47 0  is used to compare with the DA fields of the received packet. Value After Reset  0x0</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE</name>
							<description>Address Enable   AE. When this bit is set  the address filter module uses the second MAC address for perfect filtering. When this bit is reset  the address filter module ignores the address for filtering. Value After Reset  0x0</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS3_HIGH</name>
					<description>MAC Address 31 High Register
 resetvalue={Application Reset:0x0FFFF}</description>
					<addressOffset>792</addressOffset>
					<size>32</size>
					<resetValue>65535</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRHI</name>
							<description>MAC Address1  47 32    ADDRHI. This field contains the upper 16 bits 47 32  of the second 6 byte MAC address. Value After Reset  0xffff</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DCS</name>
							<description>DMA Channel Select   DCS. If the PDC bit of MAC Ext Configuration register is not set  This field contains the binary representation of the DMA Channel number to which an Rx packet whose DA matches the MAC Address0 content is routed. If the PDC bit of MAC Ext Configuration register is set  This field contains the one hot representation of one or more DMA Channel numbers to which an Rx packet whose DA matches the MAC Address0 content is routed.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MBC</name>
							<description>Mask Byte Control   MBC. These bits are mask control bits for comparing each of the MAC Address bytes. When set high  the MAC does not compare the corresponding byte of received DA or SA with the contents of MAC Address1 registers. Each bit controls the masking of the bytes as follows  Bit 29  Register 194 15 8  Bit 28  Register 194 7 0  Bit 27  Register 195 31 24    Bit 24  Register 195 7 0  You can filter a group of addresses  known as group address filtering  by masking one or more bytes of the address. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SA</name>
							<description>Source Address   SA. When this bit is set  the MAC Address1 47 0  is used to compare with the SA fields of the received packet. When this bit is reset  the MAC Address1 47 0  is used to compare with the DA fields of the received packet. Value After Reset  0x0</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE</name>
							<description>Address Enable   AE. When this bit is set  the address filter module uses the second MAC address for perfect filtering. When this bit is reset  the address filter module ignores the address for filtering. Value After Reset  0x0</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS4_HIGH</name>
					<description>MAC Address 31 High Register
 resetvalue={Application Reset:0x0FFFF}</description>
					<addressOffset>800</addressOffset>
					<size>32</size>
					<resetValue>65535</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRHI</name>
							<description>MAC Address1  47 32    ADDRHI. This field contains the upper 16 bits 47 32  of the second 6 byte MAC address. Value After Reset  0xffff</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DCS</name>
							<description>DMA Channel Select   DCS. If the PDC bit of MAC Ext Configuration register is not set  This field contains the binary representation of the DMA Channel number to which an Rx packet whose DA matches the MAC Address0 content is routed. If the PDC bit of MAC Ext Configuration register is set  This field contains the one hot representation of one or more DMA Channel numbers to which an Rx packet whose DA matches the MAC Address0 content is routed.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MBC</name>
							<description>Mask Byte Control   MBC. These bits are mask control bits for comparing each of the MAC Address bytes. When set high  the MAC does not compare the corresponding byte of received DA or SA with the contents of MAC Address1 registers. Each bit controls the masking of the bytes as follows  Bit 29  Register 194 15 8  Bit 28  Register 194 7 0  Bit 27  Register 195 31 24    Bit 24  Register 195 7 0  You can filter a group of addresses  known as group address filtering  by masking one or more bytes of the address. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SA</name>
							<description>Source Address   SA. When this bit is set  the MAC Address1 47 0  is used to compare with the SA fields of the received packet. When this bit is reset  the MAC Address1 47 0  is used to compare with the DA fields of the received packet. Value After Reset  0x0</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE</name>
							<description>Address Enable   AE. When this bit is set  the address filter module uses the second MAC address for perfect filtering. When this bit is reset  the address filter module ignores the address for filtering. Value After Reset  0x0</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
