J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MAC_ADDRESS13_HIGH</name>
					<description>MAC Address 31 High Register
 resetvalue={Application Reset:0x0FFFF}</description>
					<addressOffset>872</addressOffset>
					<size>32</size>
					<resetValue>65535</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRHI</name>
							<description>MAC Address1  47 32    ADDRHI. This field contains the upper 16 bits 47 32  of the second 6 byte MAC address. Value After Reset  0xffff</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DCS</name>
							<description>DMA Channel Select   DCS. If the PDC bit of MAC Ext Configuration register is not set  This field contains the binary representation of the DMA Channel number to which an Rx packet whose DA matches the MAC Address0 content is routed. If the PDC bit of MAC Ext Configuration register is set  This field contains the one hot representation of one or more DMA Channel numbers to which an Rx packet whose DA matches the MAC Address0 content is routed.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MBC</name>
							<description>Mask Byte Control   MBC. These bits are mask control bits for comparing each of the MAC Address bytes. When set high  the MAC does not compare the corresponding byte of received DA or SA with the contents of MAC Address1 registers. Each bit controls the masking of the bytes as follows  Bit 29  Register 194 15 8  Bit 28  Register 194 7 0  Bit 27  Register 195 31 24    Bit 24  Register 195 7 0  You can filter a group of addresses  known as group address filtering  by masking one or more bytes of the address. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SA</name>
							<description>Source Address   SA. When this bit is set  the MAC Address1 47 0  is used to compare with the SA fields of the received packet. When this bit is reset  the MAC Address1 47 0  is used to compare with the DA fields of the received packet. Value After Reset  0x0</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE</name>
							<description>Address Enable   AE. When this bit is set  the address filter module uses the second MAC address for perfect filtering. When this bit is reset  the address filter module ignores the address for filtering. Value After Reset  0x0</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS14_HIGH</name>
					<description>MAC Address 31 High Register
 resetvalue={Application Reset:0x0FFFF}</description>
					<addressOffset>880</addressOffset>
					<size>32</size>
					<resetValue>65535</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRHI</name>
							<description>MAC Address1  47 32    ADDRHI. This field contains the upper 16 bits 47 32  of the second 6 byte MAC address. Value After Reset  0xffff</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DCS</name>
							<description>DMA Channel Select   DCS. If the PDC bit of MAC Ext Configuration register is not set  This field contains the binary representation of the DMA Channel number to which an Rx packet whose DA matches the MAC Address0 content is routed. If the PDC bit of MAC Ext Configuration register is set  This field contains the one hot representation of one or more DMA Channel numbers to which an Rx packet whose DA matches the MAC Address0 content is routed.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MBC</name>
							<description>Mask Byte Control   MBC. These bits are mask control bits for comparing each of the MAC Address bytes. When set high  the MAC does not compare the corresponding byte of received DA or SA with the contents of MAC Address1 registers. Each bit controls the masking of the bytes as follows  Bit 29  Register 194 15 8  Bit 28  Register 194 7 0  Bit 27  Register 195 31 24    Bit 24  Register 195 7 0  You can filter a group of addresses  known as group address filtering  by masking one or more bytes of the address. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SA</name>
							<description>Source Address   SA. When this bit is set  the MAC Address1 47 0  is used to compare with the SA fields of the received packet. When this bit is reset  the MAC Address1 47 0  is used to compare with the DA fields of the received packet. Value After Reset  0x0</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE</name>
							<description>Address Enable   AE. When this bit is set  the address filter module uses the second MAC address for perfect filtering. When this bit is reset  the address filter module ignores the address for filtering. Value After Reset  0x0</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS15_HIGH</name>
					<description>MAC Address 31 High Register
 resetvalue={Application Reset:0x0FFFF}</description>
					<addressOffset>888</addressOffset>
					<size>32</size>
					<resetValue>65535</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRHI</name>
							<description>MAC Address1  47 32    ADDRHI. This field contains the upper 16 bits 47 32  of the second 6 byte MAC address. Value After Reset  0xffff</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DCS</name>
							<description>DMA Channel Select   DCS. If the PDC bit of MAC Ext Configuration register is not set  This field contains the binary representation of the DMA Channel number to which an Rx packet whose DA matches the MAC Address0 content is routed. If the PDC bit of MAC Ext Configuration register is set  This field contains the one hot representation of one or more DMA Channel numbers to which an Rx packet whose DA matches the MAC Address0 content is routed.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MBC</name>
							<description>Mask Byte Control   MBC. These bits are mask control bits for comparing each of the MAC Address bytes. When set high  the MAC does not compare the corresponding byte of received DA or SA with the contents of MAC Address1 registers. Each bit controls the masking of the bytes as follows  Bit 29  Register 194 15 8  Bit 28  Register 194 7 0  Bit 27  Register 195 31 24    Bit 24  Register 195 7 0  You can filter a group of addresses  known as group address filtering  by masking one or more bytes of the address. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SA</name>
							<description>Source Address   SA. When this bit is set  the MAC Address1 47 0  is used to compare with the SA fields of the received packet. When this bit is reset  the MAC Address1 47 0  is used to compare with the DA fields of the received packet. Value After Reset  0x0</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE</name>
							<description>Address Enable   AE. When this bit is set  the address filter module uses the second MAC address for perfect filtering. When this bit is reset  the address filter module ignores the address for filtering. Value After Reset  0x0</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS16_HIGH</name>
					<description>MAC Address 31 High Register
 resetvalue={Application Reset:0x0FFFF}</description>
					<addressOffset>896</addressOffset>
					<size>32</size>
					<resetValue>65535</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRHI</name>
							<description>MAC Address1  47 32    ADDRHI. This field contains the upper 16 bits 47 32  of the second 6 byte MAC address. Value After Reset  0xffff</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DCS</name>
							<description>DMA Channel Select   DCS. If the PDC bit of MAC Ext Configuration register is not set  This field contains the binary representation of the DMA Channel number to which an Rx packet whose DA matches the MAC Address0 content is routed. If the PDC bit of MAC Ext Configuration register is set  This field contains the one hot representation of one or more DMA Channel numbers to which an Rx packet whose DA matches the MAC Address0 content is routed.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MBC</name>
							<description>Mask Byte Control   MBC. These bits are mask control bits for comparing each of the MAC Address bytes. When set high  the MAC does not compare the corresponding byte of received DA or SA with the contents of MAC Address1 registers. Each bit controls the masking of the bytes as follows  Bit 29  Register 194 15 8  Bit 28  Register 194 7 0  Bit 27  Register 195 31 24    Bit 24  Register 195 7 0  You can filter a group of addresses  known as group address filtering  by masking one or more bytes of the address. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SA</name>
							<description>Source Address   SA. When this bit is set  the MAC Address1 47 0  is used to compare with the SA fields of the received packet. When this bit is reset  the MAC Address1 47 0  is used to compare with the DA fields of the received packet. Value After Reset  0x0</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE</name>
							<description>Address Enable   AE. When this bit is set  the address filter module uses the second MAC address for perfect filtering. When this bit is reset  the address filter module ignores the address for filtering. Value After Reset  0x0</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS17_HIGH</name>
					<description>MAC Address 31 High Register
 resetvalue={Application Reset:0x0FFFF}</description>
					<addressOffset>904</addressOffset>
					<size>32</size>
					<resetValue>65535</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRHI</name>
							<description>MAC Address1  47 32    ADDRHI. This field contains the upper 16 bits 47 32  of the second 6 byte MAC address. Value After Reset  0xffff</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DCS</name>
							<description>DMA Channel Select   DCS. If the PDC bit of MAC Ext Configuration register is not set  This field contains the binary representation of the DMA Channel number to which an Rx packet whose DA matches the MAC Address0 content is routed. If the PDC bit of MAC Ext Configuration register is set  This field contains the one hot representation of one or more DMA Channel numbers to which an Rx packet whose DA matches the MAC Address0 content is routed.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MBC</name>
							<description>Mask Byte Control   MBC. These bits are mask control bits for comparing each of the MAC Address bytes. When set high  the MAC does not compare the corresponding byte of received DA or SA with the contents of MAC Address1 registers. Each bit controls the masking of the bytes as follows  Bit 29  Register 194 15 8  Bit 28  Register 194 7 0  Bit 27  Register 195 31 24    Bit 24  Register 195 7 0  You can filter a group of addresses  known as group address filtering  by masking one or more bytes of the address. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SA</name>
							<description>Source Address   SA. When this bit is set  the MAC Address1 47 0  is used to compare with the SA fields of the received packet. When this bit is reset  the MAC Address1 47 0  is used to compare with the DA fields of the received packet. Value After Reset  0x0</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE</name>
							<description>Address Enable   AE. When this bit is set  the address filter module uses the second MAC address for perfect filtering. When this bit is reset  the address filter module ignores the address for filtering. Value After Reset  0x0</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS18_HIGH</name>
					<description>MAC Address 31 High Register
 resetvalue={Application Reset:0x0FFFF}</description>
					<addressOffset>912</addressOffset>
					<size>32</size>
					<resetValue>65535</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRHI</name>
							<description>MAC Address1  47 32    ADDRHI. This field contains the upper 16 bits 47 32  of the second 6 byte MAC address. Value After Reset  0xffff</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DCS</name>
							<description>DMA Channel Select   DCS. If the PDC bit of MAC Ext Configuration register is not set  This field contains the binary representation of the DMA Channel number to which an Rx packet whose DA matches the MAC Address0 content is routed. If the PDC bit of MAC Ext Configuration register is set  This field contains the one hot representation of one or more DMA Channel numbers to which an Rx packet whose DA matches the MAC Address0 content is routed.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MBC</name>
							<description>Mask Byte Control   MBC. These bits are mask control bits for comparing each of the MAC Address bytes. When set high  the MAC does not compare the corresponding byte of received DA or SA with the contents of MAC Address1 registers. Each bit controls the masking of the bytes as follows  Bit 29  Register 194 15 8  Bit 28  Register 194 7 0  Bit 27  Register 195 31 24    Bit 24  Register 195 7 0  You can filter a group of addresses  known as group address filtering  by masking one or more bytes of the address. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SA</name>
							<description>Source Address   SA. When this bit is set  the MAC Address1 47 0  is used to compare with the SA fields of the received packet. When this bit is reset  the MAC Address1 47 0  is used to compare with the DA fields of the received packet. Value After Reset  0x0</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE</name>
							<description>Address Enable   AE. When this bit is set  the address filter module uses the second MAC address for perfect filtering. When this bit is reset  the address filter module ignores the address for filtering. Value After Reset  0x0</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS19_HIGH</name>
					<description>MAC Address 31 High Register
 resetvalue={Application Reset:0x0FFFF}</description>
					<addressOffset>920</addressOffset>
					<size>32</size>
					<resetValue>65535</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRHI</name>
							<description>MAC Address1  47 32    ADDRHI. This field contains the upper 16 bits 47 32  of the second 6 byte MAC address. Value After Reset  0xffff</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DCS</name>
							<description>DMA Channel Select   DCS. If the PDC bit of MAC Ext Configuration register is not set  This field contains the binary representation of the DMA Channel number to which an Rx packet whose DA matches the MAC Address0 content is routed. If the PDC bit of MAC Ext Configuration register is set  This field contains the one hot representation of one or more DMA Channel numbers to which an Rx packet whose DA matches the MAC Address0 content is routed.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MBC</name>
							<description>Mask Byte Control   MBC. These bits are mask control bits for comparing each of the MAC Address bytes. When set high  the MAC does not compare the corresponding byte of received DA or SA with the contents of MAC Address1 registers. Each bit controls the masking of the bytes as follows  Bit 29  Register 194 15 8  Bit 28  Register 194 7 0  Bit 27  Register 195 31 24    Bit 24  Register 195 7 0  You can filter a group of addresses  known as group address filtering  by masking one or more bytes of the address. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SA</name>
							<description>Source Address   SA. When this bit is set  the MAC Address1 47 0  is used to compare with the SA fields of the received packet. When this bit is reset  the MAC Address1 47 0  is used to compare with the DA fields of the received packet. Value After Reset  0x0</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE</name>
							<description>Address Enable   AE. When this bit is set  the address filter module uses the second MAC address for perfect filtering. When this bit is reset  the address filter module ignores the address for filtering. Value After Reset  0x0</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS20_HIGH</name>
					<description>MAC Address 31 High Register
 resetvalue={Application Reset:0x0FFFF}</description>
					<addressOffset>928</addressOffset>
					<size>32</size>
					<resetValue>65535</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRHI</name>
							<description>MAC Address1  47 32    ADDRHI. This field contains the upper 16 bits 47 32  of the second 6 byte MAC address. Value After Reset  0xffff</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DCS</name>
							<description>DMA Channel Select   DCS. If the PDC bit of MAC Ext Configuration register is not set  This field contains the binary representation of the DMA Channel number to which an Rx packet whose DA matches the MAC Address0 content is routed. If the PDC bit of MAC Ext Configuration register is set  This field contains the one hot representation of one or more DMA Channel numbers to which an Rx packet whose DA matches the MAC Address0 content is routed.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MBC</name>
							<description>Mask Byte Control   MBC. These bits are mask control bits for comparing each of the MAC Address bytes. When set high  the MAC does not compare the corresponding byte of received DA or SA with the contents of MAC Address1 registers. Each bit controls the masking of the bytes as follows  Bit 29  Register 194 15 8  Bit 28  Register 194 7 0  Bit 27  Register 195 31 24    Bit 24  Register 195 7 0  You can filter a group of addresses  known as group address filtering  by masking one or more bytes of the address. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SA</name>
							<description>Source Address   SA. When this bit is set  the MAC Address1 47 0  is used to compare with the SA fields of the received packet. When this bit is reset  the MAC Address1 47 0  is used to compare with the DA fields of the received packet. Value After Reset  0x0</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE</name>
							<description>Address Enable   AE. When this bit is set  the address filter module uses the second MAC address for perfect filtering. When this bit is reset  the address filter module ignores the address for filtering. Value After Reset  0x0</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
