J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MAC_ADDRESS21_LOW</name>
					<description>MAC Address 31 Low Register
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
					<addressOffset>940</addressOffset>
					<size>32</size>
					<resetValue>4294967295</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRLO</name>
							<description>MAC Address1  31 0    ADDRLO. This field contains the lower 32 bits of second 6 byte MAC address. The        content of this field is undefined until loaded by the application after        the initialization process. Value After Reset  0xffffffff</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS22_LOW</name>
					<description>MAC Address 31 Low Register
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
					<addressOffset>948</addressOffset>
					<size>32</size>
					<resetValue>4294967295</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRLO</name>
							<description>MAC Address1  31 0    ADDRLO. This field contains the lower 32 bits of second 6 byte MAC address. The        content of this field is undefined until loaded by the application after        the initialization process. Value After Reset  0xffffffff</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS23_LOW</name>
					<description>MAC Address 31 Low Register
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
					<addressOffset>956</addressOffset>
					<size>32</size>
					<resetValue>4294967295</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRLO</name>
							<description>MAC Address1  31 0    ADDRLO. This field contains the lower 32 bits of second 6 byte MAC address. The        content of this field is undefined until loaded by the application after        the initialization process. Value After Reset  0xffffffff</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS24_LOW</name>
					<description>MAC Address 31 Low Register
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
					<addressOffset>964</addressOffset>
					<size>32</size>
					<resetValue>4294967295</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRLO</name>
							<description>MAC Address1  31 0    ADDRLO. This field contains the lower 32 bits of second 6 byte MAC address. The        content of this field is undefined until loaded by the application after        the initialization process. Value After Reset  0xffffffff</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS25_LOW</name>
					<description>MAC Address 31 Low Register
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
					<addressOffset>972</addressOffset>
					<size>32</size>
					<resetValue>4294967295</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRLO</name>
							<description>MAC Address1  31 0    ADDRLO. This field contains the lower 32 bits of second 6 byte MAC address. The        content of this field is undefined until loaded by the application after        the initialization process. Value After Reset  0xffffffff</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS26_LOW</name>
					<description>MAC Address 31 Low Register
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
					<addressOffset>980</addressOffset>
					<size>32</size>
					<resetValue>4294967295</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRLO</name>
							<description>MAC Address1  31 0    ADDRLO. This field contains the lower 32 bits of second 6 byte MAC address. The        content of this field is undefined until loaded by the application after        the initialization process. Value After Reset  0xffffffff</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS27_LOW</name>
					<description>MAC Address 31 Low Register
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
					<addressOffset>988</addressOffset>
					<size>32</size>
					<resetValue>4294967295</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRLO</name>
							<description>MAC Address1  31 0    ADDRLO. This field contains the lower 32 bits of second 6 byte MAC address. The        content of this field is undefined until loaded by the application after        the initialization process. Value After Reset  0xffffffff</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS28_LOW</name>
					<description>MAC Address 31 Low Register
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
					<addressOffset>996</addressOffset>
					<size>32</size>
					<resetValue>4294967295</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRLO</name>
							<description>MAC Address1  31 0    ADDRLO. This field contains the lower 32 bits of second 6 byte MAC address. The        content of this field is undefined until loaded by the application after        the initialization process. Value After Reset  0xffffffff</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS29_LOW</name>
					<description>MAC Address 31 Low Register
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
					<addressOffset>1004</addressOffset>
					<size>32</size>
					<resetValue>4294967295</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRLO</name>
							<description>MAC Address1  31 0    ADDRLO. This field contains the lower 32 bits of second 6 byte MAC address. The        content of this field is undefined until loaded by the application after        the initialization process. Value After Reset  0xffffffff</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS30_LOW</name>
					<description>MAC Address 31 Low Register
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
					<addressOffset>1012</addressOffset>
					<size>32</size>
					<resetValue>4294967295</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRLO</name>
							<description>MAC Address1  31 0    ADDRLO. This field contains the lower 32 bits of second 6 byte MAC address. The        content of this field is undefined until loaded by the application after        the initialization process. Value After Reset  0xffffffff</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS31_LOW</name>
					<description>MAC Address 31 Low Register
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
					<addressOffset>1020</addressOffset>
					<size>32</size>
					<resetValue>4294967295</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDRLO</name>
							<description>MAC Address1  31 0    ADDRLO. This field contains the lower 32 bits of second 6 byte MAC address. The        content of this field is undefined until loaded by the application after        the initialization process. Value After Reset  0xffffffff</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MMC_CONTROL</name>
					<description>MMC Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1792</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CNTRST</name>
							<description>Counters Reset   CNTRST. When this bit is set  all counters are reset. This bit is cleared automatically after 1 clock cycle. Access restriction applies. Self cleared. Setting 0 clears. Setting 1 sets. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTSTOPRO</name>
							<description>Counter Stop Rollover   CNTSTOPRO. When this bit is set  the counter does not roll over to zero after reaching the maximum value. Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RSTONRD</name>
							<description>Reset on Read   RSTONRD. When this bit is set  the MMC counters are reset to zero after Read  self clearing after reset . The counters are cleared when the least significant byte lane  Bits 7 0   is read. Value After Reset  0x0</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTFREEZ</name>
							<description>MMC Counter Freeze   CNTFREEZ. When this bit is set  it freezes all MMC counters to their current value. Until this bit is reset to 0  no MMC counter is updated because of any transmitted or received packet. If any MMC counter is read with the Reset on Read bit set  then that counter is also cleared in this mode. Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTPRST</name>
							<description>Counters Preset   CNTPRST. When this bit is set  all counters are initialized or preset to almost full or almost half according to the CNTPRSTLVL bit. This bit is cleared automatically after 1 clock cycle. This bit  along with the CNTPRSTLVL bit  is useful for debugging and testing the assertion of interrupts because of MMC counter becoming half full or full. Access restriction applies. Self cleared. Setting 0 clears. Setting 1 sets. Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTPRSTLVL</name>
							<description>Full Half Preset   CNTPRSTLVL. When this bit is low and the CNTPRST bit is set  all MMC counters get preset to almost half value. All octet counters get preset to 0x7FFF F800  Half 2KBytes  and all packet counters gets preset to 0x7FFF FFF0  Half 16 . When this bit is high and the CNTPRST bit is set  all MMC counters get preset to almost full value. All octet counters get preset to 0xFFFF F800  Full 2KBytes  and all packet counters gets preset to 0xFFFF FFF0  Full 16 . For 16 bit counters  the almost half preset values are 0x7800 and 0x7FF0 for the respective octet and packet counters. Similarly  the almost full preset values for the 16 bit counters are 0xF800 and 0xFFF0. Value After Reset  0x0</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UCDBC</name>
							<description>Update MMC Counters for Dropped Broadcast Packets   UCDBC. When set  the MAC updates all related MMC Counters for Broadcast packets that are dropped because of the setting of the DBF bit of MAC Packet Filter register. When reset  the MMC Counters are not updated for dropped Broadcast packets. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
