J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MMC_RX_INTERRUPT</name>
					<description>MMC Receive Interrupts Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1796</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXGBPKTIS</name>
							<description>MMC Receive Good Bad Packet Counter Interrupt Status   RXGBPKTIS. This bit is set when the rxpacketcount gb counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXGBOCTIS</name>
							<description>MMC Receive Good Bad Octet Counter Interrupt Status   RXGBOCTIS. This bit is set when the rxoctetcount gb counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXGOCTIS</name>
							<description>MMC Receive Good Octet Counter Interrupt Status   RXGOCTIS. This bit is set when the rxoctetcount g counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXBCGPIS</name>
							<description>MMC Receive Broadcast Good Packet Counter Interrupt Status   RXBCGPIS. This bit is set when the rxbroadcastpackets g counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXMCGPIS</name>
							<description>MMC Receive Multicast Good Packet Counter Interrupt Status   RXMCGPIS. This bit is set when the rxmulticastpackets g counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXCRCERPIS</name>
							<description>MMC Receive CRC Error Packet Counter Interrupt Status   RXCRCERPIS. This bit is set when the rxcrcerror counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXALGNERPIS</name>
							<description>MMC Receive Alignment Error Packet Counter Interrupt Status   RXALGNERPIS. This bit is set when the rxalignmenterror counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXRUNTPIS</name>
							<description>MMC Receive Runt Packet Counter Interrupt Status   RXRUNTPIS. This bit is set when the rxrunterror counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXJABERPIS</name>
							<description>MMC Receive Jabber Error Packet Counter Interrupt Status   RXJABERPIS. This bit is set when the rxjabbererror counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXUSIZEGPIS</name>
							<description>MMC Receive Undersize Good Packet Counter Interrupt Status   RXUSIZEGPIS. This bit is set when the rxundersize g counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXOSIZEGPIS</name>
							<description>MMC Receive Oversize Good Packet Counter Interrupt Status   RXOSIZEGPIS. This bit is set when the rxoversize g counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RX64OCTGBPIS</name>
							<description>MMC Receive 64 Octet Good Bad Packet Counter Interrupt Status   RX64OCTGBPIS. This bit is set when the rx64octets gb counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RX65T127OCTGBPIS</name>
							<description>MMC Receive 65 to 127 Octet Good Bad Packet Counter Interrupt Status   RX65T127OCTGBPIS. This bit is set when the rx65to127octets gb counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RX128T255OCTGBPIS</name>
							<description>MMC Receive 128 to 255 Octet Good Bad Packet Counter Interrupt Status   RX128T255OCTGBPIS. This bit is set when the rx128to255octets gb counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RX256T511OCTGBPIS</name>
							<description>MMC Receive 256 to 511 Octet Good Bad Packet Counter Interrupt Status   RX256T511OCTGBPIS. This bit is set when the rx256to511octets gb counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RX512T1023OCTGBPIS</name>
							<description>MMC Receive 512 to 1023 Octet Good Bad Packet Counter Interrupt Status   RX512T1023OCTGBPIS. This bit is set when the rx512to1023octets gb counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RX1024TMAXOCTGBPIS</name>
							<description>MMC Receive 1024 to Maximum Octet Good Bad Packet Counter Interrupt Status   RX1024TMAXOCTGBPIS. This bit is set when the rx1024tomaxoctets gb counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXUCGPIS</name>
							<description>MMC Receive Unicast Good Packet Counter Interrupt Status   RXUCGPIS. This bit is set when the rxunicastpackets g counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXLENERPIS</name>
							<description>MMC Receive Length Error Packet Counter Interrupt Status   RXLENERPIS. This bit is set when the rxlengtherror counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXORANGEPIS</name>
							<description>MMC Receive Out Of Range Error Packet Counter Interrupt Status.   RXORANGEPIS. This bit is set when the rxoutofrangetype counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXPAUSPIS</name>
							<description>MMC Receive Pause Packet Counter Interrupt Status   RXPAUSPIS. This bit is set when the rxpausepackets counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXFOVPIS</name>
							<description>MMC Receive FIFO Overflow Packet Counter Interrupt Status   RXFOVPIS. This bit is set when the rxfifooverflow counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXVLANGBPIS</name>
							<description>MMC Receive VLAN Good Bad Packet Counter Interrupt Status   RXVLANGBPIS. This bit is set when the rxvlanpackets gb counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXWDOGPIS</name>
							<description>MMC Receive Watchdog Error Packet Counter Interrupt Status   RXWDOGPIS. This bit is set when the rxwatchdog error counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXRCVERRPIS</name>
							<description>MMC Receive Error Packet Counter Interrupt Status   RXRCVERRPIS. This bit is set when the rxrcverror counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXCTRLPIS</name>
							<description>MMC Receive Control Packet Counter Interrupt Status   RXCTRLPIS. This bit is set when the rxctrlpackets g counter reaches half of the        maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXLPIUSCIS</name>
							<description>MMC Receive LPI microsecond counter interrupt status   RXLPIUSCIS. This bit is set when the Rx LPI USEC Cntr counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXLPITRCIS</name>
							<description>MMC Receive LPI transition counter interrupt status   RXLPITRCIS. This bit is set when the Rx LPI Tran Cntr counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
