J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MMC_TX_INTERRUPT</name>
					<description>MMC Transmit Interrupts Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1800</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXGBOCTIS</name>
							<description>MMC Transmit Good Bad Octet Counter Interrupt Status   TXGBOCTIS. This bit is set when the txoctetcount gb counter reaches half of the        maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXGBPKTIS</name>
							<description>MMC Transmit Good Bad Packet Counter Interrupt Status   TXGBPKTIS. This bit is set when the txpacketcount gb counter reaches half of the        maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXBCGPIS</name>
							<description>MMC Transmit Broadcast Good Packet Counter Interrupt Status   TXBCGPIS. This bit is set when the txbroadcastpackets g counter reaches half of        the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXMCGPIS</name>
							<description>MMC Transmit Multicast Good Packet Counter Interrupt Status   TXMCGPIS. This bit is set when the txmulticastpackets g counter reaches half of        the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TX64OCTGBPIS</name>
							<description>MMC Transmit 64 Octet Good Bad Packet Counter Interrupt Status   TX64OCTGBPIS. This bit is set when the tx64octets gb counter reaches half of the        maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TX65T127OCTGBPIS</name>
							<description>MMC Transmit 65 to 127 Octet Good Bad Packet Counter Interrupt Status   TX65T127OCTGBPIS. This bit is set when the tx65to127octets gb counter reaches half the        maximum value  and also when it reaches the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TX128T255OCTGBPIS</name>
							<description>MMC Transmit 128 to 255 Octet Good Bad Packet Counter Interrupt Status   TX128T255OCTGBPIS. This bit is set when the tx128to255octets gb counter reaches half of the        maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TX256T511OCTGBPIS</name>
							<description>MMC Transmit 256 to 511 Octet Good Bad Packet Counter Interrupt Status   TX256T511OCTGBPIS. This bit is set when the tx256to511octets gb counter reaches half of the        maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TX512T1023OCTGBPIS</name>
							<description>MMC Transmit 512 to 1023 Octet Good Bad Packet Counter Interrupt Status   TX512T1023OCTGBPIS. This bit is set when the tx512to1023octets gb counter reaches half of        the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TX1024TMAXOCTGBPIS</name>
							<description>MMC Transmit 1024 to Maximum Octet Good Bad Packet Counter Interrupt Status   TX1024TMAXOCTGBPIS. This bit is set when the tx1024tomaxoctets gb counter reaches half of        the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXUCGBPIS</name>
							<description>MMC Transmit Unicast Good Bad Packet Counter Interrupt Status   TXUCGBPIS. This bit is set when the txunicastpackets gb counter reaches half of the        maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXMCGBPIS</name>
							<description>MMC Transmit Multicast Good Bad Packet Counter Interrupt Status   TXMCGBPIS. The bit is set when the txmulticastpackets gb counter reaches half of        the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXBCGBPIS</name>
							<description>MMC Transmit Broadcast Good Bad Packet Counter Interrupt Status   TXBCGBPIS. This bit is set when the txbroadcastpackets gb counter reaches half of        the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXUFLOWERPIS</name>
							<description>MMC Transmit Underflow Error Packet Counter Interrupt Status   TXUFLOWERPIS. This bit is set when the txunderflowerror counter reaches half of the        maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXSCOLGPIS</name>
							<description>MMC Transmit Single Collision Good Packet Counter Interrupt Status   TXSCOLGPIS. This bit is set when the txsinglecol g counter reaches half of the        maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXMCOLGPIS</name>
							<description>MMC Transmit Multiple Collision Good Packet Counter Interrupt Status   TXMCOLGPIS. This bit is set when the txmulticol g counter reaches half of the        maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXDEFPIS</name>
							<description>MMC Transmit Deferred Packet Counter Interrupt Status   TXDEFPIS. This bit is set when the txdeferred counter reaches half of the maximum        value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXLATCOLPIS</name>
							<description>MMC Transmit Late Collision Packet Counter Interrupt Status   TXLATCOLPIS. This bit is set when the txlatecol counter reaches half of the maximum        value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXEXCOLPIS</name>
							<description>MMC Transmit Excessive Collision Packet Counter Interrupt Status   TXEXCOLPIS. This bit is set when the txexesscol counter reaches half of the maximum        value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXCARERPIS</name>
							<description>MMC Transmit Carrier Error Packet Counter Interrupt Status   TXCARERPIS. This bit is set when the txcarriererror counter reaches half of the        maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXGOCTIS</name>
							<description>MMC Transmit Good Octet Counter Interrupt Status   TXGOCTIS. This bit is set when the txoctetcount g counter reaches half of the        maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXGPKTIS</name>
							<description>MMC Transmit Good Packet Counter Interrupt Status   TXGPKTIS. This bit is set when the txpacketcount g counter reaches half of the        maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXEXDEFPIS</name>
							<description>MMC Transmit Excessive Deferral Packet Counter Interrupt Status   TXEXDEFPIS. This bit is set when the txexcessdef counter reaches half of the maximum        value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXPAUSPIS</name>
							<description>MMC Transmit Pause Packet Counter Interrupt Status   TXPAUSPIS. This bit is set when the txpausepacketserror counter reaches half of the        maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXVLANGPIS</name>
							<description>MMC Transmit VLAN Good Packet Counter Interrupt Status   TXVLANGPIS. This bit is set when the txvlanpackets g counter reaches half of the        maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXOSIZEGPIS</name>
							<description>MMC Transmit Oversize Good Packet Counter Interrupt Status   TXOSIZEGPIS. This bit is set when the txoversize g counter reaches half of the        maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXLPIUSCIS</name>
							<description>MMC Transmit LPI microsecond counter interrupt status   TXLPIUSCIS. This bit is set when the Tx LPI USEC Cntr counter reaches half of the        maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXLPITRCIS</name>
							<description>MMC Transmit LPI transition counter interrupt status   TXLPITRCIS. This bit is set when the Tx LPI Tran Cntr counter reaches half of the        maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal        event. Value After Reset  0x0</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
