J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MMC_RX_INTERRUPT_MASK</name>
					<description>MMC Receive Interrupts Mask Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1804</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXGBPKTIM</name>
							<description>MMC Receive Good Bad Packet Counter Interrupt Mask   RXGBPKTIM. Setting this bit masks the interrupt when the rxpacketcount gb counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXGBOCTIM</name>
							<description>MMC Receive Good Bad Octet Counter Interrupt Mask   RXGBOCTIM. Setting this bit masks the interrupt when the rxoctetcount gb counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXGOCTIM</name>
							<description>MMC Receive Good Octet Counter Interrupt Mask   RXGOCTIM. Setting this bit masks the interrupt when the rxoctetcount g counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXBCGPIM</name>
							<description>MMC Receive Broadcast Good Packet Counter Interrupt Mask   RXBCGPIM. Setting this bit masks the interrupt when the rxbroadcastpackets g counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXMCGPIM</name>
							<description>MMC Receive Multicast Good Packet Counter Interrupt Mask   RXMCGPIM. Setting this bit masks the interrupt when the rxmulticastpackets g counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXCRCERPIM</name>
							<description>MMC Receive CRC Error Packet Counter Interrupt Mask   RXCRCERPIM. Setting this bit masks the interrupt when the rxcrcerror counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXALGNERPIM</name>
							<description>MMC Receive Alignment Error Packet Counter Interrupt Mask   RXALGNERPIM. Setting this bit masks the interrupt when the rxalignmenterror counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXRUNTPIM</name>
							<description>MMC Receive Runt Packet Counter Interrupt Mask   RXRUNTPIM. Setting this bit masks the interrupt when the rxrunterror counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXJABERPIM</name>
							<description>MMC Receive Jabber Error Packet Counter Interrupt Mask   RXJABERPIM. Setting this bit masks the interrupt when the rxjabbererror counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXUSIZEGPIM</name>
							<description>MMC Receive Undersize Good Packet Counter Interrupt Mask   RXUSIZEGPIM. Setting this bit masks the interrupt when the rxundersize g counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXOSIZEGPIM</name>
							<description>MMC Receive Oversize Good Packet Counter Interrupt Mask   RXOSIZEGPIM. Setting this bit masks the interrupt when the rxoversize g counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RX64OCTGBPIM</name>
							<description>MMC Receive 64 Octet Good Bad Packet Counter Interrupt Mask   RX64OCTGBPIM. Setting this bit masks the interrupt when the rx64octets gb counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RX65T127OCTGBPIM</name>
							<description>MMC Receive 65 to 127 Octet Good Bad Packet Counter Interrupt Mask   RX65T127OCTGBPIM. Setting this bit masks the interrupt when the rx65to127octets gb counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RX128T255OCTGBPIM</name>
							<description>MMC Receive 128 to 255 Octet Good Bad Packet Counter Interrupt Mask   RX128T255OCTGBPIM. Setting this bit masks the interrupt when the rx128to255octets gb counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RX256T511OCTGBPIM</name>
							<description>MMC Receive 256 to 511 Octet Good Bad Packet Counter Interrupt Mask   RX256T511OCTGBPIM. Setting this bit masks the interrupt when the rx256to511octets gb counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RX512T1023OCTGBPIM</name>
							<description>MMC Receive 512 to 1023 Octet Good Bad Packet Counter Interrupt Mask   RX512T1023OCTGBPIM. Setting this bit masks the interrupt when the rx512to1023octets gb counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RX1024TMAXOCTGBPIM</name>
							<description>MMC Receive 1024 to Maximum Octet Good Bad Packet Counter Interrupt Mask.   RX1024TMAXOCTGBPIM. Setting this bit masks the interrupt when the rx1024tomaxoctets gb counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXUCGPIM</name>
							<description>MMC Receive Unicast Good Packet Counter Interrupt Mask   RXUCGPIM. Setting this bit masks the interrupt when the rxunicastpackets g counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXLENERPIM</name>
							<description>MMC Receive Length Error Packet Counter Interrupt Mask   RXLENERPIM. Setting this bit masks the interrupt when the rxlengtherror counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXORANGEPIM</name>
							<description>MMC Receive Out Of Range Error Packet Counter Interrupt Mask   RXORANGEPIM. Setting this bit masks the interrupt when the rxoutofrangetype counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXPAUSPIM</name>
							<description>MMC Receive Pause Packet Counter Interrupt Mask   RXPAUSPIM. Setting this bit masks the interrupt when the rxpausepackets counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXFOVPIM</name>
							<description>MMC Receive FIFO Overflow Packet Counter Interrupt Mask   RXFOVPIM. Setting this bit masks the interrupt when the rxfifooverflow counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXVLANGBPIM</name>
							<description>MMC Receive VLAN Good Bad Packet Counter Interrupt Mask   RXVLANGBPIM. Setting this bit masks the interrupt when the rxvlanpackets gb counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXWDOGPIM</name>
							<description>MMC Receive Watchdog Error Packet Counter Interrupt Mask   RXWDOGPIM. Setting this bit masks the interrupt when the rxwatchdog counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXRCVERRPIM</name>
							<description>MMC Receive Error Packet Counter Interrupt Mask   RXRCVERRPIM. Setting this bit masks the interrupt when the rxrcverror counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXCTRLPIM</name>
							<description>MMC Receive Control Packet Counter Interrupt Mask   RXCTRLPIM. Setting this bit masks the interrupt when the rxctrlpackets g counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXLPIUSCIM</name>
							<description>MMC Receive LPI microsecond counter interrupt Mask   RXLPIUSCIM. Setting this bit masks the interrupt when the Rx LPI USEC Cntr counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXLPITRCIM</name>
							<description>MMC Receive LPI transition counter interrupt Mask   RXLPITRCIM. Setting this bit masks the interrupt when the Rx LPI Tran Cntr counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MMC_TX_INTERRUPT_MASK</name>
					<description>MMC Transmit Interrupts Mask Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1808</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXGBOCTIM</name>
							<description>MMC Transmit Good Bad Octet Counter Interrupt Mask   TXGBOCTIM. Setting this bit masks the interrupt when the txoctetcount gb counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXGBPKTIM</name>
							<description>MMC Transmit Good Bad Packet Counter Interrupt Mask   TXGBPKTIM. Setting this bit masks the interrupt when the txpacketcount gb counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXBCGPIM</name>
							<description>MMC Transmit Broadcast Good Packet Counter Interrupt Mask   TXBCGPIM. Setting this bit masks the interrupt when the txbroadcastpackets g counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXMCGPIM</name>
							<description>MMC Transmit Multicast Good Packet Counter Interrupt Mask   TXMCGPIM. Setting this bit masks the interrupt when the txmulticastpackets g counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TX64OCTGBPIM</name>
							<description>MMC Transmit 64 Octet Good Bad Packet Counter Interrupt Mask   TX64OCTGBPIM. Setting this bit masks the interrupt when the tx64octets gb counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TX65T127OCTGBPIM</name>
							<description>MMC Transmit 65 to 127 Octet Good Bad Packet Counter Interrupt Mask   TX65T127OCTGBPIM. Setting this bit masks the interrupt when the tx65to127octets gb counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TX128T255OCTGBPIM</name>
							<description>MMC Transmit 128 to 255 Octet Good Bad Packet Counter Interrupt Mask   TX128T255OCTGBPIM. Setting this bit masks the interrupt when the tx128to255octets gb counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TX256T511OCTGBPIM</name>
							<description>MMC Transmit 256 to 511 Octet Good Bad Packet Counter Interrupt Mask   TX256T511OCTGBPIM. Setting this bit masks the interrupt when the tx256to511octets gb counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TX512T1023OCTGBPIM</name>
							<description>MMC Transmit 512 to 1023 Octet Good Bad Packet Counter Interrupt Mask   TX512T1023OCTGBPIM. Setting this bit masks the interrupt when the tx512to1023octets gb counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TX1024TMAXOCTGBPIM</name>
							<description>MMC Transmit 1024 to Maximum Octet Good Bad Packet Counter Interrupt Mask   TX1024TMAXOCTGBPIM. Setting this bit masks the interrupt when the tx1024tomaxoctets gb counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXUCGBPIM</name>
							<description>MMC Transmit Unicast Good Bad Packet Counter Interrupt Mask   TXUCGBPIM. Setting this bit masks the interrupt when the txunicastpackets gb counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXMCGBPIM</name>
							<description>MMC Transmit Multicast Good Bad Packet Counter Interrupt Mask   TXMCGBPIM. Setting this bit masks the interrupt when the txmulticastpackets gb counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXBCGBPIM</name>
							<description>MMC Transmit Broadcast Good Bad Packet Counter Interrupt Mask   TXBCGBPIM. Setting this bit masks the interrupt when the txbroadcastpackets gb counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXUFLOWERPIM</name>
							<description>MMC Transmit Underflow Error Packet Counter Interrupt Mask   TXUFLOWERPIM. Setting this bit masks the interrupt when the txunderflowerror counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXSCOLGPIM</name>
							<description>MMC Transmit Single Collision Good Packet Counter Interrupt Mask   TXSCOLGPIM. Setting this bit masks the interrupt when the txsinglecol g counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXMCOLGPIM</name>
							<description>MMC Transmit Multiple Collision Good Packet Counter Interrupt Mask   TXMCOLGPIM. Setting this bit masks the interrupt when the txmulticol g counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXDEFPIM</name>
							<description>MMC Transmit Deferred Packet Counter Interrupt Mask   TXDEFPIM. Setting this bit masks the interrupt when the txdeferred counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXLATCOLPIM</name>
							<description>MMC Transmit Late Collision Packet Counter Interrupt Mask   TXLATCOLPIM. Setting this bit masks the interrupt when the txlatecol counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXEXCOLPIM</name>
							<description>MMC Transmit Excessive Collision Packet Counter Interrupt Mask   TXEXCOLPIM. Setting this bit masks the interrupt when the txexcesscol counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXCARERPIM</name>
							<description>MMC Transmit Carrier Error Packet Counter Interrupt Mask   TXCARERPIM. Setting this bit masks the interrupt when the txcarriererror counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXGOCTIM</name>
							<description>MMC Transmit Good Octet Counter Interrupt Mask   TXGOCTIM. Setting this bit masks the interrupt when the txoctetcount g counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXGPKTIM</name>
							<description>MMC Transmit Good Packet Counter Interrupt Mask   TXGPKTIM. Setting this bit masks the interrupt when the txpacketcount g counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXEXDEFPIM</name>
							<description>MMC Transmit Excessive Deferral Packet Counter Interrupt Mask   TXEXDEFPIM. Setting this bit masks the interrupt when the txexcessdef counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXPAUSPIM</name>
							<description>MMC Transmit Pause Packet Counter Interrupt Mask   TXPAUSPIM. Setting this bit masks the interrupt when the txpausepackets counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXVLANGPIM</name>
							<description>MMC Transmit VLAN Good Packet Counter Interrupt Mask   TXVLANGPIM. Setting this bit masks the interrupt when the txvlanpackets g counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXOSIZEGPIM</name>
							<description>MMC Transmit Oversize Good Packet Counter Interrupt Mask   TXOSIZEGPIM. Setting this bit masks the interrupt when the txoversize g counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXLPIUSCIM</name>
							<description>MMC Transmit LPI microsecond counter interrupt Mask   TXLPIUSCIM. Setting this bit masks the interrupt when the Tx LPI USEC Cntr counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXLPITRCIM</name>
							<description>MMC Transmit LPI transition counter interrupt Mask   TXLPITRCIM. Setting this bit masks the interrupt when the Tx LPI Tran Cntr counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_OCTET_COUNT_GOOD_BAD</name>
					<description>Good And Bad Transmitted Octet Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1812</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXOCTGB</name>
							<description>Tx Octet Count Good Bad   TXOCTGB. This field indicates the number of bytes transmitted  exclusive of preamble and retried bytes  in good and bad packets. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
