J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>TX_PACKET_COUNT_GOOD_BAD</name>
					<description>Good And Bad Transmitted Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1816</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXPKTGB</name>
							<description>Tx Packet Count Good Bad   TXPKTGB. This field indicates the number of good and bad packets transmitted  exclusive of retried packets. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_BROADCAST_PACKETS_GOOD</name>
					<description>Good Transmitted Broadcast Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1820</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXBCASTG</name>
							<description>Tx Broadcast Packets Good   TXBCASTG. This field indicates the number of good broadcast packets transmitted. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_MULTICAST_PACKETS_GOOD</name>
					<description>Good Transmitted Multicast Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1824</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXMCASTG</name>
							<description>Tx Multicast Packets Good   TXMCASTG. This field indicates the number of good multicast packets transmitted. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_64OCTETS_PACKETS_GOOD_BAD</name>
					<description>Good And Bad 64 Octets Packets Transmitted Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1828</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TX64OCTGB</name>
							<description>Tx 64Octets Packets Good Bad   TX64OCTGB. This field indicates the number of good and bad packets transmitted with length 64 bytes  exclusive of preamble and retried packets. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_65TO127OCTETS_PACKETS_GOOD_BAD</name>
					<description>Good And Bad 65to127 Octets Packets Transmitted Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1832</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TX65_127OCTGB</name>
							<description>Tx 65To127Octets Packets Good Bad   TX65 127OCTGB. This field indicates the number of good and bad packets transmitted with length between 65 and 127  inclusive  bytes  exclusive of preamble and retried packets. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_128TO255OCTETS_PACKETS_GOOD_BAD</name>
					<description>Good And Bad 128to255 Octets Packets Transmitted Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1836</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TX128_255OCTGB</name>
							<description>Tx 128To255Octets Packets Good Bad   TX128 255OCTGB. This field indicates the number of good and bad packets transmitted with length between 128 and 255  inclusive  bytes  exclusive of preamble and retried packets. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_256TO511OCTETS_PACKETS_GOOD_BAD</name>
					<description>Good And Bad 256to511 Octets Packets Transmitted Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1840</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TX256_511OCTGB</name>
							<description>Tx 256To511Octets Packets Good Bad   TX256 511OCTGB. This field indicates the number of good and bad packets transmitted with length between 256 and 511  inclusive  bytes  exclusive of preamble and retried packets. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_512TO1023OCTETS_PACKETS_GOOD_BAD</name>
					<description>Good And Bad 512to1023 Octets Packets Transmitted Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1844</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TX512_1023OCTGB</name>
							<description>Tx 512To1023Octets Packets Good Bad   TX512 1023OCTGB. This field indicates the number of good and bad packets transmitted with length between 512 and 1023  inclusive  bytes  exclusive of preamble and retried packets. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD</name>
					<description>Good And Bad 1024toMax Octets Packets Transmitted Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1848</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TX1024_MAXOCTGB</name>
							<description>Tx 1024ToMaxOctets Packets Good Bad   TX1024 MAXOCTGB. This field indicates the number of good and bad packets transmitted with length between 1024 and maxsize  inclusive  bytes  exclusive of preamble and retried packets. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_UNICAST_PACKETS_GOOD_BAD</name>
					<description>Good Transmitted Unicat Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1852</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXUCASTGB</name>
							<description>Tx Unicast Packets Good Bad   TXUCASTGB. This field indicates the number of good and bad unicast packets transmitted. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_MULTICAST_PACKETS_GOOD_BAD</name>
					<description>Good And Bad Transmitted Multicast Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1856</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXMCASTGB</name>
							<description>Tx Multicast Packets Good Bad   TXMCASTGB. This field indicates the number of good and bad multicast packets transmitted. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_BROADCAST_PACKETS_GOOD_BAD</name>
					<description>Good And Bad Transmitted Broadcast Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1860</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXBCASTGB</name>
							<description>Tx Broadcast Packets Good Bad   TXBCASTGB. This field indicates the number of good and bad broadcast packets transmitted. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_UNDERFLOW_ERROR_PACKETS</name>
					<description>Transmitted Underflow Error Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1864</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXUNDRFLW</name>
							<description>Tx Underflow Error Packets   TXUNDRFLW. This field indicates the number of packets aborted because of packets underflow error. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_SINGLE_COLLISION_GOOD_PACKETS</name>
					<description>Good Transmitted Single Collision Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1868</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXSNGLCOLG</name>
							<description>Tx Single Collision Good Packets   TXSNGLCOLG. This field indicates the number of successfully transmitted packets after a single collision in the half duplex mode. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_MULTIPLE_COLLISION_GOOD_PACKETS</name>
					<description>Transmitted Multiple Collision Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1872</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXMULTCOLG</name>
							<description>Tx Multiple Collision Good Packets   TXMULTCOLG. This field indicates the number of successfully transmitted packets after multiple collisions in the half duplex mode. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_DEFERRED_PACKETS</name>
					<description>Transmitted Deferred Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1876</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXDEFRD</name>
							<description>Tx Deferred Packets   TXDEFRD. This field indicates the number of successfully transmitted after a deferral in the half duplex mode. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_LATE_COLLISION_PACKETS</name>
					<description>Transmitted Late Collision Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1880</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXLATECOL</name>
							<description>Tx Late Collision Packets   TXLATECOL. This field indicates the number of packets aborted because of late collision error. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_EXCESSIVE_COLLISION_PACKETS</name>
					<description>Transmitted Excessive Collision Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1884</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXEXSCOL</name>
							<description>Tx Excessive Collision Packets   TXEXSCOL. This field indicates the number of packets aborted because of excessive  16  collision errors. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_CARRIER_ERROR_PACKETS</name>
					<description>Transmitted Carrier Error Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1888</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXCARR</name>
							<description>Tx Carrier Error Packets   TXCARR. This field indicates the number of packets aborted because of carrier sense error  no carrier or loss of carrier . Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_OCTET_COUNT_GOOD</name>
					<description>Good Transmitted Octet Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1892</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXOCTG</name>
							<description>Tx Octet Count Good   TXOCTG. This field indicates the number of bytes transmitted  exclusive of preamble  only in good packets. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_PACKET_COUNT_GOOD</name>
					<description>Good Transmitted Packet Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1896</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXPKTG</name>
							<description>Tx Packet Count Good   TXPKTG. This field indicates the number of good packets transmitted. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_EXCESSIVE_DEFERRAL_ERROR</name>
					<description>Transmitted Excessive Deferral Error Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1900</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXEXSDEF</name>
							<description>Tx Excessive Deferral Error   TXEXSDEF. This field indicates the number of packets aborted because of excessive deferral error  deferred for more than two max sized packet times . Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_PAUSE_PACKETS</name>
					<description>Transmitted Pause Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1904</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXPAUSE</name>
							<description>Tx Pause Packets   TXPAUSE. This field indicates the number of good Pause packets transmitted. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_VLAN_PACKETS_GOOD</name>
					<description>Good Transmitted VLAN Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1908</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXVLANG</name>
							<description>Tx VLAN Packets Good   TXVLANG. This field provides the number of good VLAN packets transmitted. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_OSIZE_PACKETS_GOOD</name>
					<description>Good Transmitted Osize Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1912</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXOSIZG</name>
							<description>Tx OSize Packets Good   TXOSIZG. This field indicates the number of packets transmitted without errors and with length greater than the maxsize  1 518 or 1 522 bytes for VLAN tagged packets  2000 bytes if enabled in S2KP bit of the MAC Configuration register . Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_PACKETS_COUNT_GOOD_BAD</name>
					<description>Good And Bad Received Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1920</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXPKTGB</name>
							<description>Rx Packets Count Good Bad   RXPKTGB. This field indicates the number of good and bad packets received. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_OCTET_COUNT_GOOD_BAD</name>
					<description>Good And Bad Received Octet Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1924</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXOCTGB</name>
							<description>Rx Octet Count Good Bad   RXOCTGB. This field indicates the number of bytes received  exclusive of preamble  in good and bad packets. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_OCTET_COUNT_GOOD</name>
					<description>Good Received Octet Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1928</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXOCTG</name>
							<description>Rx Octet Count Good   RXOCTG. This field indicates the number of bytes received  exclusive of preamble  only in good packets. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_BROADCAST_PACKETS_GOOD</name>
					<description>Good Received Broadcast Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1932</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXBCASTG</name>
							<description>Rx Broadcast Packets Good   RXBCASTG. This field indicates the number of good broadcast packets received. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_MULTICAST_PACKETS_GOOD</name>
					<description>Good Received Multicast Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1936</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXMCASTG</name>
							<description>Rx Multicast Packets Good   RXMCASTG. This field indicates the number of good multicast packets received. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_CRC_ERROR_PACKETS</name>
					<description>Received CRC Error Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1940</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXCRCERR</name>
							<description>Rx CRC Error Packets   RXCRCERR. This field indicates the number of packets received with CRC error. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_ALIGNMENT_ERROR_PACKETS</name>
					<description>Received Alignment Error Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1944</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXALGNERR</name>
							<description>Rx Alignment Error Packets   RXALGNERR. This field indicates the number of packets received with alignment  dribble  error. It is valid only in 10 100 mode. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_RUNT_ERROR_PACKETS</name>
					<description>Received Runtime Error Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1948</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXRUNTERR</name>
							<description>Rx Runt Error Packets   RXRUNTERR. This field indicates the number of packets received with runt  length less than 64 bytes and CRC error  error. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_JABBER_ERROR_PACKETS</name>
					<description>Received Jabber Error Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1952</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXJABERR</name>
							<description>Rx Jabber Error Packets   RXJABERR. This field indicates the number of giant packets received with length  including CRC  greater than 1 518 bytes  1 522 bytes for VLAN tagged  and with CRC error. If Jumbo Packet mode is enabled  packets of length greater than 9 018 bytes  9 022 bytes for VLAN tagged  are considered as giant packets. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
