J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>RX_UNDERSIZE_PACKETS_GOOD</name>
					<description>Good Received Undersized Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1956</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXUNDERSZG</name>
							<description>Rx Undersize Packets Good   RXUNDERSZG. This field indicates the number of packets received with length less than 64 bytes  without any errors. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_OVERSIZE_PACKETS_GOOD</name>
					<description>Good Received Oversized Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1960</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXOVERSZG</name>
							<description>Rx Oversize Packets Good   RXOVERSZG. This field indicates the number of packets received without errors  with length greater than the maxsize  1 518 bytes or 1 522 bytes for VLAN tagged packets  2000 bytes if enabled in the S2KP bit of the MAC Configuration register . Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_64OCTETS_PACKETS_GOOD_BAD</name>
					<description>Good And Bad 64 Octets Packets Received Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1964</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RX64OCTGB</name>
							<description>Rx 64 Octets Packets Good Bad   RX64OCTGB. This field indicates the number of good and bad packets received with length 64 bytes  exclusive of the preamble. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_65TO127OCTETS_PACKETS_GOOD_BAD</name>
					<description>Good And Bad 65to127 Octets Packets Received Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1968</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RX65_127OCTGB</name>
							<description>Rx 65 127 Octets Packets Good Bad   RX65 127OCTGB. This field indicates the number of good and bad packets received with length between 65 and 127  inclusive  bytes  exclusive of the preamble. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_128TO255OCTETS_PACKETS_GOOD_BAD</name>
					<description>Good And Bad 128to255 Octets Packets Received Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1972</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RX128_255OCTGB</name>
							<description>Rx 128 255 Octets Packets Good Bad   RX128 255OCTGB. This field indicates the number of good and bad packets received with length between 128 and 255  inclusive  bytes  exclusive of the preamble. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_256TO511OCTETS_PACKETS_GOOD_BAD</name>
					<description>Good And Bad 256to511 Octets Packets Received Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1976</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RX256_511OCTGB</name>
							<description>Rx 256 511 Octets Packets Good Bad   RX256 511OCTGB. This field indicates the number of good and bad packets received with length between 256 and 511  inclusive  bytes  exclusive of the preamble. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_512TO1023OCTETS_PACKETS_GOOD_BAD</name>
					<description>Good And Bad 512to1023 Octets Packets Received Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1980</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RX512_1023OCTGB</name>
							<description>RX 512 1023 Octets Packets Good Bad   RX512 1023OCTGB. This field indicates the number of good and bad packets received with length between 512 and 1023  inclusive  bytes  exclusive of the preamble. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD</name>
					<description>Good And Bad 1024toMax Octets Packets Received Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1984</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RX1024_MAXOCTGB</name>
							<description>Rx 1024 Max Octets Good Bad   RX1024 MAXOCTGB. This field indicates the number of good and bad packets received with length between 1024 and maxsize  inclusive  bytes  exclusive of the preamble. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_UNICAST_PACKETS_GOOD</name>
					<description>Good Received Unicat Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1988</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXUCASTG</name>
							<description>Rx Unicast Packets Good   RXUCASTG. This field indicates the number of good unicast packets received. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_LENGTH_ERROR_PACKETS</name>
					<description>Received Length Error Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1992</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXLENERR</name>
							<description>Rx Length Error Packets   RXLENERR. This field indicates the number of packets received with length error  Length Type field not equal to packet size   for all packets with valid length field. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_OUT_OF_RANGE_TYPE_PACKETS</name>
					<description>Received Out Of Range Type Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1996</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXOUTOFRNG</name>
							<description>Rx Out of Range Type Packet   RXOUTOFRNG. This field indicates the number of packets received with length field not equal to the valid packet size  greater than 1 500 but less than 1 536 . Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_PAUSE_PACKETS</name>
					<description>Received Pause Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2000</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXPAUSEPKT</name>
							<description>Rx Pause Packets   RXPAUSEPKT. This field indicates the number of good and valid Pause packets received. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_FIFO_OVERFLOW_PACKETS</name>
					<description>Received FIFO Overflow Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2004</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXFIFOOVFL</name>
							<description>Rx FIFO Overflow Packets   RXFIFOOVFL. This field indicates the number of missed received packets because of FIFO overflow. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_VLAN_PACKETS_GOOD_BAD</name>
					<description>Good And Bad Received VLAN Packets Count Registerv
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2008</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXVLANPKTGB</name>
							<description>Rx VLAN Packets Good Bad   RXVLANPKTGB. This field indicates the number of good and bad VLAN packets received. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_WATCHDOG_ERROR_PACKETS</name>
					<description>Received Watchdog Error Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2012</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXWDGERR</name>
							<description>Rx Watchdog Error Packets   RXWDGERR. This field indicates the number of packets received with error because of watchdog timeout error  packets with a data load larger than 2 048 bytes  when JE and WD bits are reset in MAC Configuration register   10 240 bytes  when JE bit is set and WD bit is reset in MAC Configuration register   16 384 bytes  when WD bit is set in MAC Configuration register  or the value programmed in the MAC Watchdog Timeout register . Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_RECEIVE_ERROR_PACKETS</name>
					<description>Received Receive Error Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2016</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXRCVERR</name>
							<description>Rx Receive Error Packets   RXRCVERR. This field indicates the number of packets received with Receive error or Packet Extension error on the GMII or MII interface. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_CONTROL_PACKETS_GOOD</name>
					<description>Good Received Control Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2020</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXCTRLG</name>
							<description>Rx Control Packets Good   RXCTRLG. This field indicates the number of good control packets received. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_LPI_USEC_CNTR</name>
					<description>Transmitted LPI Microseconds Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2028</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXLPIUSC</name>
							<description>Tx LPI Microseconds Counter   TXLPIUSC. This field indicates the number of microseconds Tx LPI is asserted. For every Tx LPI Entry and Exit  the Timer value can have an error of     1 microsecond. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_LPI_TRAN_CNTR</name>
					<description>Transmitted LPI Transition Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2032</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXLPITRC</name>
							<description>Tx LPI Transition counter   TXLPITRC. This field indicates the number of times Tx LPI Entry has occurred. Even if Tx LPI Entry occurs in Automate Mode  because of LPITXA bit set in the LPI Control and Status register   the counter will increment. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_LPI_USEC_CNTR</name>
					<description>Received Microseconds LPI Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2036</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXLPIUSC</name>
							<description>Rx LPI Microseconds Counter   RXLPIUSC. This field indicates the number of microseconds Rx LPI is asserted. For every Rx LPI Entry and Exit  the Timer value can have an error of     1 microsecond. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_LPI_TRAN_CNTR</name>
					<description>Received LPI Transition Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2040</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXLPITRC</name>
							<description>Rx LPI Transition counter   RXLPITRC. This field indicates the number of times Rx LPI Entry has occurred. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
