J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MMC_IPC_RX_INTERRUPT_MASK</name>
					<description>MMC IPC Receive Interrupts Mask Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2048</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXIPV4GPIM</name>
							<description>MMC Receive IPV4 Good Packet Counter Interrupt Mask   RXIPV4GPIM. Setting this bit masks the interrupt when the rxipv4 gd pkts counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV4HERPIM</name>
							<description>MMC Receive IPV4 Header Error Packet Counter Interrupt Mask   RXIPV4HERPIM. Setting this bit masks the interrupt when the rxipv4 hdrerr pkts counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV4NOPAYPIM</name>
							<description>MMC Receive IPV4 No Payload Packet Counter Interrupt Mask   RXIPV4NOPAYPIM. Setting this bit masks the interrupt when the rxipv4 nopay pkts counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV4FRAGPIM</name>
							<description>MMC Receive IPV4 Fragmented Packet Counter Interrupt Mask   RXIPV4FRAGPIM. Setting this bit masks the interrupt when the rxipv4 frag pkts counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV4UDSBLPIM</name>
							<description>MMC Receive IPV4 UDP Checksum Disabled Packet Counter Interrupt Mask   RXIPV4UDSBLPIM. Setting this bit masks the interrupt when the rxipv4 udsbl pkts counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV6GPIM</name>
							<description>MMC Receive IPV6 Good Packet Counter Interrupt Mask   RXIPV6GPIM. Setting this bit masks the interrupt when the rxipv6 gd pkts counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV6HERPIM</name>
							<description>MMC Receive IPV6 Header Error Packet Counter Interrupt Mask   RXIPV6HERPIM. Setting this bit masks the interrupt when the rxipv6 hdrerr pkts counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV6NOPAYPIM</name>
							<description>MMC Receive IPV6 No Payload Packet Counter Interrupt Mask   RXIPV6NOPAYPIM. Setting this bit masks the interrupt when the rxipv6 nopay pkts counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXUDPGPIM</name>
							<description>MMC Receive UDP Good Packet Counter Interrupt Mask   RXUDPGPIM. Setting this bit masks the interrupt when the rxudp gd pkts counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXUDPERPIM</name>
							<description>MMC Receive UDP Error Packet Counter Interrupt Mask   RXUDPERPIM. Setting this bit masks the interrupt when the rxudp err pkts counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXTCPGPIM</name>
							<description>MMC Receive TCP Good Packet Counter Interrupt Mask   RXTCPGPIM. Setting this bit masks the interrupt when the rxtcp gd pkts counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXTCPERPIM</name>
							<description>MMC Receive TCP Error Packet Counter Interrupt Mask   RXTCPERPIM. Setting this bit masks the interrupt when the rxtcp err pkts counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXICMPGPIM</name>
							<description>MMC Receive ICMP Good Packet Counter Interrupt Mask   RXICMPGPIM. Setting this bit masks the interrupt when the rxicmp gd pkts counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXICMPERPIM</name>
							<description>MMC Receive ICMP Error Packet Counter Interrupt Mask   RXICMPERPIM. Setting this bit masks the interrupt when the rxicmp err pkts counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV4GOIM</name>
							<description>MMC Receive IPV4 Good Octet Counter Interrupt Mask   RXIPV4GOIM. Setting this bit masks the interrupt when the rxipv4 gd octets counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV4HEROIM</name>
							<description>MMC Receive IPV4 Header Error Octet Counter Interrupt Mask   RXIPV4HEROIM. Setting this bit masks the interrupt when the rxipv4 hdrerr octets counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV4NOPAYOIM</name>
							<description>MMC Receive IPV4 No Payload Octet Counter Interrupt Mask   RXIPV4NOPAYOIM. Setting this bit masks the interrupt when the rxipv4 nopay octets counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV4FRAGOIM</name>
							<description>MMC Receive IPV4 Fragmented Octet Counter Interrupt Mask   RXIPV4FRAGOIM. Setting this bit masks the interrupt when the rxipv4 frag octets counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV4UDSBLOIM</name>
							<description>MMC Receive IPV4 UDP Checksum Disabled Octet Counter Interrupt Mask   RXIPV4UDSBLOIM. Setting this bit masks the interrupt when the rxipv4 udsbl octets counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV6GOIM</name>
							<description>MMC Receive IPV6 Good Octet Counter Interrupt Mask   RXIPV6GOIM. Setting this bit masks the interrupt when the rxipv6 gd octets counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV6HEROIM</name>
							<description>MMC Receive IPV6 Good Octet Counter Interrupt Mask   RXIPV6HEROIM. Setting this bit masks the interrupt when the rxipv6 hdrerr octets counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV6NOPAYOIM</name>
							<description>MMC Receive IPV6 Header Error Octet Counter Interrupt Mask   RXIPV6NOPAYOIM. Setting this bit masks the interrupt when the rxipv6 nopay octets counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXUDPGOIM</name>
							<description>MMC Receive IPV6 No Payload Octet Counter Interrupt Mask   RXUDPGOIM. Setting this bit masks the interrupt when the rxudp gd octets counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXUDPEROIM</name>
							<description>MMC Receive UDP Good Octet Counter Interrupt Mask   RXUDPEROIM. Setting this bit masks the interrupt when the rxudp err octets counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXTCPGOIM</name>
							<description>MMC Receive TCP Good Octet Counter Interrupt Mask   RXTCPGOIM. Setting this bit masks the interrupt when the rxtcp gd octets counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXTCPEROIM</name>
							<description>MMC Receive TCP Error Octet Counter Interrupt Mask   RXTCPEROIM. Setting this bit masks the interrupt when the rxtcp err octets counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXICMPGOIM</name>
							<description>MMC Receive ICMP Good Octet Counter Interrupt Mask   RXICMPGOIM. Setting this bit masks the interrupt when the rxicmp gd octets counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXICMPEROIM</name>
							<description>MMC Receive ICMP Error Octet Counter Interrupt Mask   RXICMPEROIM. Setting this bit masks the interrupt when the rxicmp err octets counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
