J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MMC_IPC_RX_INTERRUPT</name>
					<description>MMC IPC Receive Interrupts Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2056</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXIPV4GPIS</name>
							<description>MMC Receive IPV4 Good Packet Counter Interrupt Status   RXIPV4GPIS. This bit is set when the rxipv4 gd pkts counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV4HERPIS</name>
							<description>MMC Receive IPV4 Header Error Packet Counter Interrupt Status   RXIPV4HERPIS. This bit is set when the rxipv4 hdrerr pkts counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV4NOPAYPIS</name>
							<description>MMC Receive IPV4 No Payload Packet Counter Interrupt Status   RXIPV4NOPAYPIS. This bit is set when the rxipv4 nopay pkts counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV4FRAGPIS</name>
							<description>MMC Receive IPV4 Fragmented Packet Counter Interrupt Status   RXIPV4FRAGPIS. This bit is set when the rxipv4 frag pkts counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV4UDSBLPIS</name>
							<description>MMC Receive IPV4 UDP Checksum Disabled Packet Counter Interrupt Status   RXIPV4UDSBLPIS. This bit is set when the rxipv4 udsbl pkts counter reaches half of the maximum value or the maximum value. Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV6GPIS</name>
							<description>MMC Receive IPV6 Good Packet Counter Interrupt Status   RXIPV6GPIS. This bit is set when the rxipv6 gd pkts counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV6HERPIS</name>
							<description>MMC Receive IPV6 Header Error Packet Counter Interrupt Status   RXIPV6HERPIS. This bit is set when the rxipv6 hdrerr pkts counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV6NOPAYPIS</name>
							<description>MMC Receive IPV6 No Payload Packet Counter Interrupt Status   RXIPV6NOPAYPIS. This bit is set when the rxipv6 nopay pkts counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXUDPGPIS</name>
							<description>MC Receive UDP Good Packet Counter Interrupt Status   RXUDPGPIS. This bit is set when the rxudp gd pkts counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXUDPERPIS</name>
							<description>MMC Receive UDP Error Packet Counter Interrupt Status   RXUDPERPIS. This bit is set when the rxudp err pkts counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXTCPGPIS</name>
							<description>MMC Receive TCP Good Packet Counter Interrupt Status   RXTCPGPIS. This bit is set when the rxtcp gd pkts counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXTCPERPIS</name>
							<description>MMC Receive TCP Error Packet Counter Interrupt Status   RXTCPERPIS. This bit is set when the rxtcp err pkts counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXICMPGPIS</name>
							<description>MMC Receive ICMP Good Packet Counter Interrupt Status   RXICMPGPIS. This bit is set when the rxicmp gd pkts counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXICMPERPIS</name>
							<description>MMC Receive ICMP Error Packet Counter Interrupt Status   RXICMPERPIS. This bit is set when the rxicmp err pkts counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV4GOIS</name>
							<description>MMC Receive IPV4 Good Octet Counter Interrupt Status   RXIPV4GOIS. This bit is set when the rxipv4 gd octets counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV4HEROIS</name>
							<description>MMC Receive IPV4 Header Error Octet Counter Interrupt Status   RXIPV4HEROIS. This bit is set when the rxipv4 hdrerr octets counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV4NOPAYOIS</name>
							<description>MMC Receive IPV4 No Payload Octet Counter Interrupt Status   RXIPV4NOPAYOIS. This bit is set when the rxipv4 nopay octets counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV4FRAGOIS</name>
							<description>MMC Receive IPV4 Fragmented Octet Counter Interrupt Status   RXIPV4FRAGOIS. This bit is set when the rxipv4 frag octets counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV4UDSBLOIS</name>
							<description>MMC Receive IPV4 UDP Checksum Disabled Octet Counter Interrupt Status   RXIPV4UDSBLOIS. This bit is set when the rxipv4 udsbl octets counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV6GOIS</name>
							<description>MMC Receive IPV6 Good Octet Counter Interrupt Status   RXIPV6GOIS. This bit is set when the rxipv6 gd octets counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV6HEROIS</name>
							<description>MMC Receive IPV6 Header Error Octet Counter Interrupt Status   RXIPV6HEROIS. This bit is set when the rxipv6 hdrerr octets counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV6NOPAYOIS</name>
							<description>MMC Receive IPV6 No Payload Octet Counter Interrupt Status   RXIPV6NOPAYOIS. This bit is set when the rxipv6 nopay octets counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXUDPGOIS</name>
							<description>MMC Receive UDP Good Octet Counter Interrupt Status   RXUDPGOIS. This bit is set when the rxudp gd octets counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXUDPEROIS</name>
							<description>MMC Receive UDP Error Octet Counter Interrupt Status   RXUDPEROIS. This bit is set when the rxudp err octets counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXTCPGOIS</name>
							<description>MMC Receive TCP Good Octet Counter Interrupt Status   RXTCPGOIS. This bit is set when the rxtcp gd octets counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXTCPEROIS</name>
							<description>MMC Receive TCP Error Octet Counter Interrupt Status   RXTCPEROIS. This bit is set when the rxtcp err octets counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXICMPGOIS</name>
							<description>MMC Receive ICMP Good Octet Counter Interrupt Status   RXICMPGOIS. This bit is set when the rxicmp gd octets counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXICMPEROIS</name>
							<description>MMC Receive ICMP Error Octet Counter Interrupt Status   RXICMPEROIS. This bit is set when the rxicmp err octets counter reaches half of the maximum value or the maximum value. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV4_GOOD_PACKETS</name>
					<description>Good Received RxIPv4 Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2064</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXIPV4GDPKT</name>
							<description>RxIPv4 Good Packets   RXIPV4GDPKT. This field indicates the number of good IPv4 datagrams received with the TCP  UDP  or ICMP payload. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV4_HEADER_ERROR_PACKETS</name>
					<description>Received IPv4 Header Error Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2068</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXIPV4HDRERRPKT</name>
							<description>RxIPv4 Header Error Packets   RXIPV4HDRERRPKT. This field indicates the number of IPv4 datagrams received with header  checksum  length  or version mismatch  errors. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV4_NO_PAYLOAD_PACKETS</name>
					<description>Received IPv4 No Payload Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2072</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXIPV4NOPAYPKT</name>
							<description>RxIPv4 Payload Packets   RXIPV4NOPAYPKT. This field indicates the number of IPv4 datagram packets received that did not have a TCP  UDP  or ICMP payload. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV4_FRAGMENTED_PACKETS</name>
					<description>Received IPv4 Fragmented Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2076</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXIPV4FRAGPKT</name>
							<description>RxIPv4 Fragmented Packets   RXIPV4FRAGPKT. This field indicates the number of good IPv4 datagrams received with fragmentation. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV4_UDP_CHECKSUM_DISABLED_PACKETS</name>
					<description>Received IPv4 UPD Checksum Disabled Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2080</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXIPV4UDSBLPKT</name>
							<description>RxIPv4 UDP Checksum Disabled Packets   RXIPV4UDSBLPKT. This field indicates the number of good IPv4 datagrams received that had a UDP payload with checksum disabled. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV6_GOOD_PACKETS</name>
					<description>Good Received RxIPv6 Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2084</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXIPV6GDPKT</name>
							<description>RxIPv6 Good Packets   RXIPV6GDPKT. This field indicates the number of good IPv6 datagrams received with the TCP  UDP  or ICMP payload. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV6_HEADER_ERROR_PACKETS</name>
					<description>Received IPv6 Header Error Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2088</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXIPV6HDRERRPKT</name>
							<description>RxIPv6 Header Error Packets   RXIPV6HDRERRPKT. This field indicates the number of IPv6 datagrams received with header  length or version mismatch  errors. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV6_NO_PAYLOAD_PACKETS</name>
					<description>Received IPv6 No Payload Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2092</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXIPV6NOPAYPKT</name>
							<description>RxIPv6 Payload Packets   RXIPV6NOPAYPKT. This field indicates the number of IPv6 datagram packets received that did not have a TCP  UDP  or ICMP payload. This includes all IPv6 datagrams with fragmentation or security extension headers. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXUDP_GOOD_PACKETS</name>
					<description>Good Received UDP Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2096</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXUDPGDPKT</name>
							<description>RxUDP Good Packets   RXUDPGDPKT. This field indicates the number of good IP datagrams received with a good UDP payload. This counter is not updated when the RxIPv4 UDP Checksum Disabled Packets counter is incremented. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXUDP_ERROR_PACKETS</name>
					<description>Received UDP Error Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2100</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXUDPERRPKT</name>
							<description>RxUDP Error Packets   RXUDPERRPKT. This field indicates the number of good IP datagrams received whose UDP payload has a checksum error. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXTCP_GOOD_PACKETS</name>
					<description>Good Received TCP Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2104</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXTCPGDPKT</name>
							<description>RxTCP Good Packets   RXTCPGDPKT. This field indicates the number of good IP datagrams received with a good TCP payload. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXTCP_ERROR_PACKETS</name>
					<description>Received TCP Error Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2108</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXTCPERRPKT</name>
							<description>RxTCP Error Packets   RXTCPERRPKT. This field indicates the number of good IP datagrams received whose TCP payload has a checksum error. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXICMP_GOOD_PACKETS</name>
					<description>Good Received ICMP Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2112</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXICMPGDPKT</name>
							<description>RxICMP Good Packets   RXICMPGDPKT. This field indicates the number of good IP datagrams received with a good ICMP payload. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXICMP_ERROR_PACKETS</name>
					<description>Received ICMP Error Packets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2116</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXICMPERRPKT</name>
							<description>RxICMP Error Packets   RXICMPERRPKT. This field indicates the number of good IP datagrams received whose ICMP payload has a checksum error. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV4_GOOD_OCTETS</name>
					<description>Good Received IPV4 Octets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2128</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXIPV4GDOCT</name>
							<description>RxIPv4 Good Octets   RXIPV4GDOCT. This field indicates the number of bytes received in good IPv4 datagrams encapsulating TCP  UDP  or ICMP data.  Ethernet header  FCS  pad  or IP pad bytes are not included in this counter. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
