J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>RXIPV4_HEADER_ERROR_OCTETS</name>
					<description>Received IPV4 Header Error Octets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2132</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXIPV4HDRERROCT</name>
							<description>RxIPv4 Header Error Octets   RXIPV4HDRERROCT. This field indicates the number of bytes received in IPv4 datagrams with header errors  checksum  length  version mismatch . The value in the Length field of IPv4 header is used to update this counter.  Ethernet header  FCS  pad  or IP pad bytes are not included in this counter. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV4_NO_PAYLOAD_OCTETS</name>
					<description>Received IPV4 No Payload Octets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2136</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXIPV4NOPAYOCT</name>
							<description>RxIPv4 Payload Octets   RXIPV4NOPAYOCT. This field indicates the number of bytes received in IPv4 datagrams that did not have a TCP  UDP  or ICMP payload. The value in the Length field of IPv4 header is used to update this counter.  Ethernet header  FCS  pad  or IP pad bytes are not included in this counter. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV4_FRAGMENTED_OCTETS</name>
					<description>Received IPV4 Fragmented Octets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2140</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXIPV4FRAGOCT</name>
							<description>RxIPv4 Fragmented Octets   RXIPV4FRAGOCT. This field indicates the number of bytes received in fragmented IPv4 datagrams. The value in the Length field of IPv4 header is used to update this counter.  Ethernet header  FCS  pad  or IP pad bytes are not included in this counter. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS</name>
					<description>Received IPV4 UPD Checksum Disabled Octets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2144</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXIPV4UDSBLOCT</name>
							<description>RxIPv4 UDP Checksum Disable Octets   RXIPV4UDSBLOCT. This field indicates the number of bytes received in a UDP segment that had the UDP checksum disabled. This counter does not count IP Header bytes.  Ethernet header  FCS  pad  or IP pad bytes are not included in this counter. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV6_GOOD_OCTETS</name>
					<description>Good Received IPV6 Octets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2148</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXIPV6GDOCT</name>
							<description>RxIPv6 Good Octets   RXIPV6GDOCT. This field indicates the number of bytes received in good IPv6 datagrams encapsulating TCP  UDP  or ICMP data.  Ethernet header  FCS  pad  or IP pad bytes are not included in this counter. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV6_HEADER_ERROR_OCTETS</name>
					<description>Received IPV6 Header Error Octets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2152</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXIPV6HDRERROCT</name>
							<description>RxIPv6 Header Error Octets   RXIPV6HDRERROCT. This field indicates the number of bytes received in IPv6 datagrams with header errors  length  version mismatch . The value in the Length field of IPv6 header is used to update this counter.  Ethernet header  FCS  pad  or IP pad bytes are not included in this counter. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV6_NO_PAYLOAD_OCTETS</name>
					<description>Received IPV6 No Payload Octets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2156</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXIPV6NOPAYOCT</name>
							<description>RxIPv6 Payload Octets   RXIPV6NOPAYOCT. This field indicates the number of bytes received in IPv6 datagrams that did not have a TCP  UDP  or ICMP payload. The value in the Length field of IPv6 header is used to update this counter.  Ethernet header  FCS  pad  or IP pad bytes are not included in this counter. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXUDP_GOOD_OCTETS</name>
					<description>Good Received UDP Octets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2160</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXUDPGDOCT</name>
							<description>RxUDP Good Octets   RXUDPGDOCT. This field indicates the number of bytes received in a good UDP segment. This counter does not count IP header bytes. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXUDP_ERROR_OCTETS</name>
					<description>Received UDP Error Octets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2164</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXUDPERROCT</name>
							<description>RxUDP Error Octets   RXUDPERROCT. This field indicates the number of bytes received in a UDP segment that had checksum errors. This counter does not count IP header bytes. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXTCP_GOOD_OCTETS</name>
					<description>Good Received TCP Octets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2168</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXTCPGDOCT</name>
							<description>RxTCP Good Octets   RXTCPGDOCT. This field indicates the number of bytes received in a good TCP segment. This counter does not count IP header bytes. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXTCP_ERROR_OCTETS</name>
					<description>Received TCP Error Octets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2172</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXTCPERROCT</name>
							<description>RxTCP Error Octets   RXTCPERROCT. This field indicates the number of bytes received in a TCP segment that had checksum errors. This counter does not count IP header bytes. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXICMP_GOOD_OCTETS</name>
					<description>Good Received ICMP Octets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2176</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXICMPGDOCT</name>
							<description>RxICMP Good Octets   RXICMPGDOCT. This field indicates the number of bytes received in a good ICMP segment. This counter does not count IP header bytes. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXICMP_ERROR_OCTETS</name>
					<description>Received ICMP Error Octets Count Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2180</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXICMPERROCT</name>
							<description>RxICMP Error Octets   RXICMPERROCT. This field indicates the number of bytes received in a ICMP segment that had checksum errors. This counter does not count IP header bytes. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_TIMESTAMP_CONTROL</name>
					<description>MAC Timestamp Control Register
 resetvalue={Application Reset:0x2000}</description>
					<addressOffset>2816</addressOffset>
					<size>32</size>
					<resetValue>8192</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TSENA</name>
							<description>Enable Timestamp   TSENA. When this bit is set  the timestamp is added for Transmit and Receive packets. When disabled  timestamp is not added for transmit and receive packets and the Timestamp Generator is also suspended. You need to initialize the Timestamp  system time  after enabling this mode. On the Receive side  the MAC processes the 1588 packets only if this bit is set. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSCFUPDT</name>
							<description>Fine or Coarse Timestamp Update   TSCFUPDT. When this bit is set  the Fine method is used to update system timestamp. When this bit is reset  Coarse method is used to update the system timestamp. Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSINIT</name>
							<description>Initialize Timestamp   TSINIT. When this bit is set  the system time is initialized  overwritten  with the value specified in the MAC Register 80  System Time Seconds Update Register  and MAC Register 81  System Time Nanoseconds Update Register . This bit should be zero before it is updated. This bit is reset when the initialization is complete. The Timestamp Higher Word register  if enabled during core configuration  can only be initialized. Access restriction applies. Setting 1 sets. Self cleared. Setting 0 has no effect. Value After Reset  0x0</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSUPDT</name>
							<description>Update Timestamp   TSUPDT. When this bit is set  the system time is updated  added or subtracted  with the value specified in MAC System Time Seconds Update and MAC System Time Nanoseconds Update. This bit should be zero before updating it. This bit is reset when the update is complete in hardware. The Timestamp Higher Word register  if enabled during core configuration  is not updated. Access restriction applies. Setting 1 sets. Self cleared. Setting 0 has no effect. Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSADDREG</name>
							<description>Update Addend Register   TSADDREG. When this bit is set  the content of the Timestamp Addend register is updated in the PTP block for fine correction. This bit is cleared when the update is complete. This bit should be zero before it is set. Access restriction applies. Setting 1 sets. Self cleared. Setting 0 has no effect. Value After Reset  0x0</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSENALL</name>
							<description>Enable Timestamp for All Packets   TSENALL. When this bit is set  the timestamp snapshot is enabled for all packets received by the MAC. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSCTRLSSR</name>
							<description>Timestamp Digital or Binary Rollover Control   TSCTRLSSR. When this bit is set  the Timestamp Low register rolls over after 0x3B9A C9FF value  that is  1 nanosecond accuracy  and increments the timestamp  High  seconds. When this bit is reset  the rollover value of sub second register is 0x7FFF FFFF. The sub second increment must be programmed correctly depending on the PTP reference clock frequency and the value of this bit. Value After Reset  0x0</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSVER2ENA</name>
							<description>Enable PTP Packet Processing for Version 2 Format   TSVER2ENA. When this bit is set  the IEEE 1588 version 2 format is used to process the PTP packets. When this bit is reset  the IEEE 1588 version 1 format is used to process the PTP packets. The IEEE 1588 formats are described in  PTP Processing and Control . Value After Reset  0x0</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSIPENA</name>
							<description>Enable Processing of PTP over Ethernet Packets   TSIPENA. When this bit is set  the MAC receiver processes the PTP packets encapsulated directly in the Ethernet packets. When this bit is reset  the MAC ignores the PTP over Ethernet packets. Value After Reset  0x0</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSIPV6ENA</name>
							<description>Enable Processing of PTP Packets Sent over IPv6 UDP   TSIPV6ENA. When this bit is set  the MAC receiver processes the PTP packets encapsulated in IPv6 UDP packets. When this bit is clear  the MAC ignores the PTP transported over IPv6 UDP packets. Value After Reset  0x0</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSIPV4ENA</name>
							<description>Enable Processing of PTP Packets Sent over IPv4 UDP   TSIPV4ENA. When this bit is set  the MAC receiver processes the PTP packets encapsulated in IPv4 UDP packets. When this bit is reset  the MAC ignores the PTP transported over IPv4 UDP packets. This bit is set by default. Value After Reset  0x1</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSEVNTENA</name>
							<description>Enable Timestamp Snapshot for Event Messages   TSEVNTENA. When this bit is set  the timestamp snapshot is taken only for event        messages  SYNC  Delay Req  Pdelay Req  or Pdelay Resp . When this bit is        reset  the snapshot is taken for all messages except Announce         Management  and Signaling. For more information about the timestamp        snapshots  see Timestamp Snapshot Dependency on Register Bits Table. Value After Reset  0x0</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSMSTRENA</name>
							<description>Enable Snapshot for Messages Relevant to Master   TSMSTRENA. When this bit is set  the snapshot is taken only for the messages that are relevant to the master node. Otherwise  the snapshot is taken for the messages relevant to the slave node. Value After Reset  0x0</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SNAPTYPSEL</name>
							<description>Select PTP packets for Taking Snapshots   SNAPTYPSEL. These bits  along with Bits 15 and 14  decide the set of PTP packet types for which snapshot needs to be taken. The encoding is given in Timestamp Snapshot Dependency on Register Bits Table. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSENMACADDR</name>
							<description>Enable MAC Address for PTP Packet Filtering   TSENMACADDR. When this bit is set  the DA MAC address  that matches any MAC Address        register  is used to filter the PTP packets when PTP is directly sent        over Ethernet. When this bit is set  received PTP packets with DA containing a special        multicast or unicast address that matches the one programmed in MAC        address registers are considered for processing as indicated below  when        PTP is directly sent over Ethernet. For normal time stamping operation  MAC address registers 0 to 31 is        considered for unicast destination address matching. For PTP offload  only MAC address register 0 is considered for unicast        destination address matching. Value After Reset  0x0</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CSC</name>
							<description>Enable checksum correction during OST for PTP over UDP IPv4 packets   CSC. When this bit is set  the last two bytes of PTP message sent over UDP IPv4 is updated to keep the UDP checksum correct  for changes made to origin timestamp and or correction field as part of one step timestamp operation. The application shall form the packet with these two dummy bytes. When reset  no updates are done to keep the UDP checksum correct. The application shall form the packet with UDP checksum set to 0. Value After Reset  0x0</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXTSSTSM</name>
							<description>Transmit Timestamp Status Mode   TXTSSTSM. When this bit is set  the MAC overwrites the earlier transmit timestamp        status even if it is not read by the software. The MAC indicates this by        setting the TXTSSMIS bit of the MAC TxTimestamp Status Nanoseconds        register. When this bit is reset  the MAC ignores the timestamp status of current        packet if the timestamp status of previous packet is not read by the        software. The MAC indicates this by setting the TXTSSMIS bit of the        MAC TxTimestamp Status Nanoseconds register. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AV8021ASMEN</name>
							<description>AV 802.1AS Mode Enable   AV8021ASMEN. When this bit is set  the MAC processes only untagged PTP over Ethernet packets for providing PTP status and capturing timestamp snapshots  that is  IEEE 802.1AS mode of operation. When PTP offload feature is enabled  for the purpose of PTP offload  the transport specific field in the PTP header is generated and checked based on the value of this bit. Value After Reset  0x0</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_SUB_SECOND_INCREMENT</name>
					<description>MAC Sub Second Increment Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2820</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SNSINC</name>
							<description>Sub nanosecond Increment Value   SNSINC. This field contains the sub nanosecond increment value  represented in        nanoseconds multiplied by 2 8. This value is accumulated with the sub nanoseconds field of the        subsecond register. For example  when TSCTRLSSR field in the MAC Timestamp Control register        is set. and if the required increment is 5.3ns  then SSINC should be        0x05 and SNSINC should be 0x4C. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SSINC</name>
							<description>Sub second Increment Value   SSINC. The value programmed in this field is accumulated every clock cycle  of clk ptp i  with the contents of the sub second register. For example  when the PTP clock is 50 MHz  period is 20 ns   you should program 20  0x14  when the System Time Nanoseconds register has an accuracy of 1 ns  Bit 9  TSCTRLSSR  is set in MAC Timestamp Control . When TSCTRLSSR is clear  the Nanoseconds register has a resolution of  0.465 ns. In this case  you should program a value of 43  0x2B  which is derived by 20 ns 0.465. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_SYSTEM_TIME_SECONDS</name>
					<description>MAC System Time Seconds Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2824</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TSS</name>
							<description>Timestamp Second   TSS. The value in this field indicates the current value in seconds of the System Time maintained by the MAC. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_SYSTEM_TIME_NANOSECONDS</name>
					<description>MAC System Time Nanoseconds Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2828</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TSSS</name>
							<description>Timestamp Sub Seconds   TSSS. The value in this field has the sub second representation of time  with an accuracy of 0.46 ns. When Bit 9 is set in MAC Timestamp Control  each bit represents 1 ns. The maximum value is 0x3B9A C9FF after which it rolls over to zero. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
