J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MAC_SYSTEM_TIME_SECONDS_UPDATE</name>
					<description>MAC System Time Seconds Update Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2832</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TSS</name>
							<description>Timestamp Seconds   TSS. The value in this field is the seconds part of the update. When ADDSUB is reset  this field must be programmed with the seconds part of the update value. When ADDSUB is set  this field must be programmed with the complement of the seconds part of the update value. For example  if 2.000000001 seconds need to be subtracted from the system time  the TSS field in the MAC Timestamp Seconds Update register must be 0xFFFF FFFE  that is  2 32   2 . Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_SYSTEM_TIME_NANOSECONDS_UPDATE</name>
					<description>MAC System Time Nanoseconds Update Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2836</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TSSS</name>
							<description>Timestamp Sub Seconds   TSSS. The value in this field is the sub seconds part of the update. When ADDSUB is reset  this field must be programmed with the sub seconds part of the update value  with an accuracy based on the TSCTRLSSR bit of the MAC Timestamp Control register. When ADDSUB is set  this field must be programmed with the complement of the sub seconds part of the update value as described below. When TSCTRLSSR bit in MAC Timestamp Control is set  the programmed value must be 10 9    lt sub second value gt . When TSCTRLSSR bit in MAC Timestamp Control is reset  the programmed value must be 2 31    lt sub second value gt . When the TSCTRLSSR bit is reset in the MAC Timestamp Control register  each bit represents an accuracy of 0.46 ns. When the TSCTRLSSR bit is set in the MAC Timestamp Control register  each bit represents 1 ns and the programmed value should not exceed 0x3B9A C9FF. For example  if 2.000000001 seconds need to be subtracted from the system time  then the TSSS field in the MAC Timestamp Nanoseconds Update register must be 0x7FFF FFFF  that is  2 31   1   when TSCTRLSSR bit in MAC Timestamp Control is reset and 0x3B9A C9FF  that is  10 9   1   when TSCTRLSSR bit in MAC Timestamp Control is set. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ADDSUB</name>
							<description>Add or Subtract Time   ADDSUB. When this bit is set  the time value is subtracted with the contents of the update register. When this bit is reset  the time value is added with the contents of the update register. Value After Reset  0x0</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_TIMESTAMP_ADDEND</name>
					<description>MAC Timestamp Addend Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2840</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TSAR</name>
							<description>Timestamp Addend Register   TSAR. This field indicates the 32 bit time value to be added to the Accumulator register to achieve time synchronization. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS</name>
					<description>MAC System Time Higher Word Seconds Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2844</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TSHWR</name>
							<description>Timestamp Higher Word Register   TSHWR. This field contains the most significant 16 bits of timestamp seconds value. This register is optional. You can add this register by selecting the Add IEEE 1588 Higher Word Register option. This register is directly written to initialize the value and it is incremented when there is an overflow from 32 bits of the System Time Seconds register. Access restriction applies. Updated based on the event. Setting 1 sets. Setting 0 clears. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_TIMESTAMP_STATUS</name>
					<description>MAC Timestamp Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2848</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TSSOVF</name>
							<description>Timestamp Seconds Overflow   TSSOVF. When this bit is set  it indicates that the seconds value of the        timestamp  when supporting version 2 format  has overflowed beyond        32 hFFFF FFFF. Access restriction applies. Clears on read  or this bit is written to 1        when RCWE bit in MAC CSR SW Ctrl register is set . Self set to 1 on        internal event. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSTARGT0</name>
							<description>Timestamp Target Time Reached   TSTARGT0. When set  this bit indicates that the value of system time is greater        than or equal to the value specified in the MAC PPS0 Target Time Seconds        and MAC PPS0 Target Time Nanoseconds registers. Access restriction applies. Clears on read  or this bit is written to 1        when RCWE bit in MAC CSR SW Ctrl register is set . Self set to 1 on        internal event. Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSTRGTERR0</name>
							<description>Timestamp Target Time Error   TSTRGTERR0. This bit is set when the latest target time programmed in the        MAC PPS0 Target Time Seconds and MAC PPS0 Target Time Nanoseconds registers elapses. This bit is cleared when the application reads this        bit. Access restriction applies. Clears on read  or this bit is written to 1        when RCWE bit in MAC CSR SW Ctrl register is set . Self set to 1 on        internal event. Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSTARGT1</name>
							<description>Timestamp Target Time Reached for Target Time PPS1   TSTARGT1. When set  this bit indicates that the value of system time is greater        than or equal to the value specified in the MAC PPS1 Target Time Seconds        and MAC PPS1 Target Time Nanoseconds registers. Access restriction applies. Clears on read  or this bit is written to 1        when RCWE bit in MAC CSR SW Ctrl register is set . Self set to 1 on        internal event. Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSTRGTERR1</name>
							<description>Timestamp Target Time Error   TSTRGTERR1. This bit is set when the latest target time programmed in the        MAC PPS1 Target Time Seconds and MAC PPS1 Target Time Nanoseconds        registers elapses. This bit is cleared when the application reads this        bit. Access restriction applies. Clears on read  or this bit is written to 1        when RCWE bit in MAC CSR SW Ctrl register is set . Self set to 1 on        internal event. Value After Reset  0x0</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSTARGT2</name>
							<description>Timestamp Target Time Reached for Target Time PPS2   TSTARGT2. When set  this bit indicates that the value of system time is greater        than or equal to the value specified in the MAC PPS2 Target Time Seconds        and MAC PPS2 Target Time Nanoseconds registers. Access restriction applies. Clears on read  or this bit is written to 1        when RCWE bit in MAC CSR SW Ctrl register is set . Self set to 1 on        internal event. Value After Reset  0x0</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSTRGTERR2</name>
							<description>Timestamp Target Time Error   TSTRGTERR2. This bit is set when the latest target time programmed in the        MAC PPS2 Target Time Seconds and MAC PPS2 Target Time Nanoseconds        registers elapses. This bit is cleared when the application reads this        bit. Access restriction applies. Clears on read  or this bit is written to 1        when RCWE bit in MAC CSR SW Ctrl register is set . Self set to 1 on        internal event. Value After Reset  0x0</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSTARGT3</name>
							<description>Timestamp Target Time Reached for Target Time PPS3   TSTARGT3. When this bit is set  it indicates that the value of system time is        greater than or equal to the value specified in the        MAC PPS3 Target Time Seconds and MAC PPS3 Target Time Nanoseconds        registers. Access restriction applies. Clears on read  or this bit is written to 1        when RCWE bit in MAC CSR SW Ctrl register is set . Self set to 1 on        internal event. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSTRGTERR3</name>
							<description>Timestamp Target Time Error   TSTRGTERR3. This bit is set when the latest target time programmed in the        MAC PPS3 Target Time Seconds and MAC PPS3 Target Time Nanoseconds        registers elapses. This bit is cleared when the application reads this        bit. Access restriction applies. Clears on read  or this bit is written to 1        when RCWE bit in MAC CSR SW Ctrl register is set . Self set to 1 on        internal event. Value After Reset  0x0</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXTSSIS</name>
							<description>Tx Timestamp Status Interrupt Status   TXTSSIS. When drop transmit status is enabled in        MTL  this bit is set when the captured transmit timestamp is updated in        the MAC Tx Timestamp Status Nanoseconds and        MAC Tx Timestamp Status Seconds registers. When PTP offload feature is enabled  this bit is set when the captured        transmit timestamp is updated in the MAC Tx Timestamp Status Nanoseconds        and MAC Tx Timestamp Status Seconds registers  for PTO generated Delay        Request and Pdelay request packets. This bit is cleared when the MAC Tx Timestamp Status Seconds register is        read  or write to MAC Tx Timestamp Status Seconds register when RCWE bit        of MAC CSR SW Ctrl register is set . Value After Reset  0x0</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_TX_TIMESTAMP_STATUS_NANOSECONDS</name>
					<description>MAC Transmit Timestamp Nanoseconds Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2864</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXTSSLO</name>
							<description>Transmit Timestamp Status Low   TXTSSLO. This field contains the 31 bits of the Nanoseconds field of the Transmit packet s captured timestamp. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXTSSMIS</name>
							<description>Transmit Timestamp Status Missed   TXTSSMIS. When this bit is set  it indicates one of the following  The timestamp of the current packet is ignored if TXTSSTSM bit of the MAC Timestamp Control register is reset The timestamp of the previous packet is overwritten with timestamp of the current packet if TXTSSTSM bit of the MAC Timestamp Control register is set. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_TX_TIMESTAMP_STATUS_SECONDS</name>
					<description>MAC Transmit Timestamp Seconds Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2868</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXTSSHI</name>
							<description>Transmit Timestamp Status High   TXTSSHI. This field contains the lower 32 bits of the Seconds field of Transmit packet s captured timestamp. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_TIMESTAMP_INGRESS_ASYM_CORR</name>
					<description>MAC Timestamp Ingress Asymmetry Correction Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2896</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>OSTIAC</name>
							<description>One Step Timestamp Ingress Asymmetry Correction   OSTIAC. This field contains the ingress path asymmetry value to be added to correctionField of Pdelay Resp PTP packet. The programmed value should be in units of nanoseconds and multiplied by 2 16. For example  2.5 ns is represented as 0x00028000. The value can also be negative  which is represented in 2 s complement form with bit 31 representing the sign bit. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_TIMESTAMP_EGRESS_ASYM_CORR</name>
					<description>MAC Timestamp Egress Asymmetry Correction Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2900</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>OSTEAC</name>
							<description>One Step Timestamp Egress Asymmetry Correction   OSTEAC. This field contains the egress path asymmetry value to be subtracted from correctionField of Pdelay Resp PTP packet. The programmed value must be the negated value in units of nanoseconds multiplied by 2 16. For example  if the required correction is  2.5 ns  the programmed value must be 0xFFFD 8000  which is the 2 s complement of 0x0002 8000 2.5   216 . Similarly  if the required correction is  3.3 ns  the programmed value is 0x0003 4CCC  3.3   216 . Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND</name>
					<description>MAC Timestamp Ingress Correction Nanoseconds Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2904</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TSIC</name>
							<description>Timestamp Ingress Correction   TSIC. This field contains the ingress path correction value as defined by the Ingress Correction expression. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND</name>
					<description>MAC Timestamp Egress Correction Nanoseconds Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2908</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TSEC</name>
							<description>Timestamp Egress Correction   TSEC. This field contains the nanoseconds part of the egress path correction value as defined by the Egress Correction expression. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC</name>
					<description>MAC Timestamp Ingress Correction Subnanoseconds Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2912</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TSICSNS</name>
							<description>Timestamp Ingress Correction  sub nanoseconds   TSICSNS. This field contains the sub nanoseconds part of the ingress path correction value as defined by the  Ingress Correction  expression. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC</name>
					<description>MAC Timestamp Egress Correction Subnanoseconds Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2916</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TSECSNS</name>
							<description>Timestamp Egress Correction  sub nanoseconds   TSECSNS. This field contains the sub nanoseconds part of the egress path correction value as defined by the  Egress Correction  expression. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_PPS_CONTROL</name>
					<description>MAC PPS Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2928</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PPSCTRL_PPSCMD</name>
							<description>Flexible PPS Output  ptp pps o 0   Control   PPSCTRL PPSCMD. This field controls the frequency of the PPS0 output  ptp pps o 0   signal. The default value of PPSCTRL is 0000  and the PPS output is 1 pulse  of width clk ptp i  every second. For other values of PPSCTRL  the PPS output becomes a generated clock of following frequencies  LOST SEQUENCE DEFINITION Access restriction applies. Setting 1 sets. Self cleared. Setting 0 has no effect. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PPSEN0</name>
							<description>Flexible PPS Output Mode Enable   PPSEN0. When this bit is set  Bits 3 0  function as PPSCMD. When this bit is reset  Bits 3 0  function as PPSCTRL  Fixed PPS mode . Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TRGTMODSEL0</name>
							<description>Target Time Register Mode for PPS0 Output   TRGTMODSEL0. This field indicates the Target Time registers         MAC PPS0 Target Time Seconds and MAC PPS0 Target Time Nanoseconds  mode        for PPS0 output signal  Value After Reset  0x0</description>
							<lsb>5</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_PPS0_TARGET_TIME_SECONDS</name>
					<description>MAC PPS 0 Target Time Seconds Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2944</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TSTRH0</name>
							<description>PPS Target Time Seconds Register   TSTRH0. This field stores the time in seconds. When the timestamp value matches or exceeds both Target Timestamp registers  the MAC starts or stops the PPS signal output and generates an interrupt  if enabled  based on Target Time mode selected for the corresponding PPS output in the MAC PPS Control register. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_PPS0_TARGET_TIME_NANOSECONDS</name>
					<description>MAC PPS 0 Target Time Nanoeconds Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2948</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TTSL0</name>
							<description>Target Time Low for PPS Register   TTSL0. This register stores the time in  signed  nanoseconds. When the value of the timestamp matches the value in both Target Timestamp registers  the MAC starts or stops the PPS signal output and generates an interrupt  if enabled  based on the TRGTMODSEL0 field  Bits  6 5   in MAC PPS Control. When the TSCTRLSSR bit is reset in the MAC Timestamp Control register  this value should be  time in ns   0.465 . The actual start or stop time of the PPS signal output may have an error margin up to one unit of sub second increment value. When the TSCTRLSSR bit is set in the MAC Timestamp Control register  this value should not exceed 0x3B9A C9FF. The actual start or stop time of the PPS signal output may have an error margin up to one unit of sub second increment value. Access restriction applies. Setting 1 sets. Self cleared. Setting 0 has no effect. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TRGTBUSY0</name>
							<description>PPS Target Time Register Busy   TRGTBUSY0. The MAC sets this bit when the PPSCMD0 field in the MAC PPS Control register is programmed to 010 or 011. Programming the PPSCMD0 field to 010 or 011 instructs the MAC to synchronize the Target Time Registers to the PTP clock domain. The MAC clears this bit after synchronizing the Target Time Registers to the PTP clock domain The application must not update the Target Time Registers when this bit is read as 1. Otherwise  the synchronization of the previous programmed time gets corrupted. Value After Reset  0x0</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
