J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MAC_PPS0_INTERVAL</name>
					<description>MAC PPS 0 Interval Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2952</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PPSINT0</name>
							<description>PPS Output Signal Interval   PPSINT0. These bits store the interval between the rising edges of PPS0 signal output. The interval is stored in terms of number of units of sub second increment value. You need to program one value less than the required interval. For example  if the PTP reference clock is 50 MHz  period of 20 ns   and desired interval between the rising edges of PPS0 signal output is 100 ns  that is  5 units of sub second increment value   you should program value 4  5 1  in this register. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_PPS0_WIDTH</name>
					<description>MAC PPS 0 Width Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>2956</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PPSWIDTH0</name>
							<description>PPS Output Signal Width   PPSWIDTH0. These bits store the width between the rising edge and corresponding falling edge of PPS0 signal output. The width is stored in terms of number of units of sub second increment value. You need to program one value less than the required interval. For example  if PTP reference clock is 50 MHz  period of 20 ns   and width between the rising and corresponding falling edges of PPS0 signal output is 80 ns  that is  four units of sub second increment value   you should program value 3  4 1  in this register. Note   The value programmed in this register must be lesser than the value programmed in MAC PPS0 Interval. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MTL_OPERATION_MODE</name>
					<description>MTL Operation Mode Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3072</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DTXSTS</name>
							<description>Drop Transmit Status   DTXSTS. When this bit is set  the Tx packet status received from the MAC is dropped in the MTL. When this bit is reset  the Tx packet status received from the MAC is forwarded to the application. Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RAA</name>
							<description>Receive Arbitration Algorithm   RAA. This field is used to select the arbitration algorithm for the Rx side. Queue 0 has the lowest priority and the last queue has the highest priority. Value After Reset  0x0</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SCHALG</name>
							<description>Tx Scheduling Algorithm   SCHALG. This field indicates the algorithm for Tx scheduling  Value After Reset  0x0</description>
							<lsb>5</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTPRST</name>
							<description>Counters Preset   CNTPRST. When this bit is set  MTL TxQ 0 7  Underflow register is initialized preset to 12 h7F0. Missed Packet and Overflow Packet counters in MTL RxQ 0 7  Missed Packet Overflow Cnt register is initialized preset to 12 h7F0. Access restriction applies. Setting 1 sets. Self cleared. Setting 0 has no effect. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTCLR</name>
							<description>Counters Reset   CNTCLR. When this bit is set  all counters are reset. This bit is cleared        automatically after 1 clock cycle. If this bit is set along with CNTPRESET bit  CNTPRESET has precedence. Access restriction applies. Setting 1 sets. Self cleared. Setting 0 has        no effect. Value After Reset  0x0</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MTL_INTERRUPT_STATUS</name>
					<description>MTL Interrupt Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3104</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>Q0IS</name>
							<description>Queue 0 Interrupt status   Q0IS. This bit indicates that there is an interrupt from Queue 0. To reset this bit  the application must read Queue 0 Interrupt Control and Status register to get the exact cause of the interrupt and clear its source. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>Q1IS</name>
							<description>Queue 1 Interrupt status   Q1IS. This bit indicates that there is an interrupt from Queue 1. To reset this bit  the application must read the MTL Q1 Interrupt Control Status register to get the exact cause of the interrupt and clear its source. Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>Q2IS</name>
							<description>Queue 2 Interrupt status   Q2IS. This bit indicates that there is an interrupt from Queue 2. To reset this bit  the application must read the MTL Q2 Interrupt Control Status register to get the exact cause of the interrupt and clear its source. Value After Reset  0x0</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>Q3IS</name>
							<description>Queue 3 Interrupt status   Q3IS. This bit indicates that there is an interrupt from Queue 3. To reset this bit  the application must read the MTL Q3 Interrupt Control Status register to get the exact cause of the interrupt and clear its source. Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MTL_RXQ_DMA_MAP0</name>
					<description>MTL Receive Queue and DMA Channel Mapping 0 Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3120</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>Q0MDMACH</name>
							<description>Queue 0 Mapped to DMA Channel   Q0MDMACH. This field controls the routing of the packet received in Queue 0 to the DMA channel  This field is valid when the Q0DDMACH field is reset. The width of this field depends on the number of RX DMA channels and not all the values may be valid in some configurations. For example  if the number of RX DMA channels selected is 2  only 000 and 001 are valid  the other bits are reserved. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>Q0DDMACH</name>
							<description>Queue 0 Enabled for DA based DMA Channel Selection   Q0DDMACH. When set  this bit indicates that the packets received in Queue 0 are routed to a particular DMA channel as decided in the MAC Receiver based on the DMA channel number programmed in the L3 L4 filter registers  or the Ethernet DA address. When reset  this bit indicates that the packets received in Queue 0 are routed to the DMA Channel programmed in the Q0MDMACH field. Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>Q1MDMACH</name>
							<description>Queue 1 Mapped to DMA Channel   Q1MDMACH. This field controls the routing of the received packet in Queue 1 to the DMA channel  This field is valid when the Q1DDMACH field is reset. The width of this field depends on the number of RX DMA channels and not all the values may be valid in some configurations. For example  if the number of RX DMA channels selected is 2  only 000 and 001 are valid  the other bits are reserved. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>Q1DDMACH</name>
							<description>Queue 1 Enabled for DA based DMA Channel Selection   Q1DDMACH. When set  this bit indicates that the packets received in Queue 1 are routed to a particular DMA channel as decided in the MAC Receiver based on the DMA channel number programmed in the L3 L4 filter registers  or the Ethernet DA address. When reset  this bit indicates that the packets received in Queue 1 are routed to the DMA Channel programmed in the Q1MDMACH field  Bits 10 8  . Value After Reset  0x0</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>Q2MDMACH</name>
							<description>Queue 2 Mapped to DMA Channel   Q2MDMACH. This field controls the routing of the received packet in Queue 2 to the DMA channel  This field is valid when the Q2DDMACH field is reset. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>Q2DDMACH</name>
							<description>Queue 2 Enabled for DA based DMA Channel Selection   Q2DDMACH. When set  this bit indicates that the packets received in Queue 2 are routed to a particular DMA channel as decided in the MAC Receiver based on the DMA channel number programmed in the L3 L4 filter registers  or the Ethernet DA address. When reset  this bit indicates that the packets received in Queue 2 are routed to the DMA Channel programmed in the Q2MDMACH field  Bits 18 16  . Value After Reset  0x0</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>Q3MDMACH</name>
							<description>Queue 3 Mapped to DMA Channel   Q3MDMACH. This field controls the routing of the received packet in Queue 3 to the DMA channel  This field is valid when the Q3DDMACH field is reset. The width of this field depends on the number of RX DMA channels and not all the values may be valid in some configurations. For example  if the number of RX DMA channels selected is 2  only 000 and 001 are valid  the others are reserved Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>Q3DDMACH</name>
							<description>Queue 3 Enabled for Dynamic  per packet  DMA Channel Selection   Q3DDMACH. When set  this bit indicates that the packets received in Queue 3 are routed to a particular DMA channel as decided in the MAC Receiver based on the DMA channel number programmed in the L3 L4 filter registers  or the Ethernet DA address. When reset  this bit indicates that the packets received in Queue 3 are routed to the DMA Channel programmed in the Q3MDMACH field  Bits 26 24  . Value After Reset  0x0</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MTL_TXQ1_OPERATION_MODE</name>
					<description>MTL Queue 3 Transmit Operation Mode Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3392</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FTQ</name>
							<description>Flush Transmit Queue   FTQ. When this bit is set  the Tx queue controller logic is reset to its default values. Therefore  all the data in the Tx queue is lost or flushed. This bit is internally reset when the flushing operation is complete. Until this bit is reset  you should not write to the MTL TxQ1 Operation Mode register. The data which is already accepted by the MAC transmitter is not flushed. It is scheduled for transmission and results in underflow and runt packet transmission. Note   The flush operation is complete only when the Tx queue is empty and the application has accepted the pending Tx Status of all transmitted packets. To complete this flush operation  the PHY Tx clock  clk tx i  should be active. Access restriction applies. Setting 1 sets. Self cleared. Setting 0 has no effect. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSF</name>
							<description>Transmit Store and Forward   TSF. When this bit is set  the transmission starts when a full packet resides in the MTL Tx queue. When this bit is set  the TTC values specified in Bits 6 4  of this register are ignored. This bit should be changed only when the transmission is stopped. Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXQEN</name>
							<description>Transmit Queue Enable   TXQEN. This field is used to enable disable the transmit queue 0. Note   In multiple Tx queues configuration  all the queues are disabled by default. Enable the Tx queue by programming this field. Value After Reset  0x0</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TTC</name>
							<description>Transmit Threshold Control   TTC. These bits control the threshold level of the MTL Tx Queue. The transmission starts when the packet size within the MTL Tx Queue is larger than the threshold. In addition  full packets with length less than the threshold are also transmitted. These bits are used only when the TSF bit is reset. Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TQS</name>
							<description>Transmit Queue Size   TQS. This field indicates the size of the allocated Transmit queues in blocks        of 256 bytes. The TQS field is read write only if the number of Tx        Queues more than one  the reset value is 0x0 and indicates size of 256        bytes. When the number of Tx Queues is one  the field is read only and        the configured TX FIFO size in blocks of 256 bytes is reflected in the        reset value. The width of this field depends on the Tx memory size        selected in your configuration. For example  if the memory size is 2048         the width of this field is 3 bits  LOG2 2048 256    LOG2 8    3 bits Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MTL_TXQ1_UNDERFLOW</name>
					<description>MTL Queue 3 Transmit Underflow Counter Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3396</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>UFFRMCNT</name>
							<description>Underflow Packet Counter   UFFRMCNT. This field indicates the number of packets aborted by the controller because of Tx Queue Underflow. This counter is incremented each time the MAC aborts outgoing packet because of underflow. The counter is cleared when this register is read with mci be i 0  at 1 b1. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>UFCNTOVF</name>
							<description>Overflow Bit for Underflow Packet Counter   UFCNTOVF. This bit is set every time the Tx queue Underflow Packet Counter field overflows  that is  it has crossed the maximum count. In such a scenario  the overflow packet counter is reset to all zeros and this bit indicates that the rollover happened. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MTL_TXQ1_DEBUG</name>
					<description>MTL Queue 3 Transmit Debug Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3400</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXQPAUSED</name>
							<description>Transmit Queue in Pause   TXQPAUSED. When this bit is high and the Rx flow control is enabled  it indicates that the Tx Queue is in the Pause condition  in the full duplex only mode  because of the following  Reception of the PFC packet for the priorities assigned to the Tx Queue when PFC is enabled Reception of 802.3x Pause packet when PFC is disabled Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRCSTS</name>
							<description>MTL Tx Queue Read Controller Status   TRCSTS. This field indicates the state of the Tx Queue Read Controller  Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TWCSTS</name>
							<description>MTL Tx Queue Write Controller Status   TWCSTS. When high  this bit indicates that the MTL Tx Queue Write Controller is active  and it is transferring the data to the Tx Queue. Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXQSTS</name>
							<description>MTL Tx Queue Not Empty Status   TXQSTS. When this bit is high  it indicates that the MTL Tx Queue is not empty and some data is left for transmission. Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXSTSFSTS</name>
							<description>MTL Tx Status FIFO Full Status   TXSTSFSTS. When high  this bit indicates that the MTL Tx Status FIFO is full. Therefore  the MTL cannot accept any more packets for transmission. Value After Reset  0x0</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PTXQ</name>
							<description>Number of Packets in the Transmit Queue   PTXQ. This field indicates the current number of packets in the Tx Queue. When the DTXSTS bit of MTL Operation Mode register is set to 1  this field does not reflect the number of packets in the Transmit queue. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>STXSTSF</name>
							<description>Number of Status Words in Tx Status FIFO of Queue   STXSTSF. This field indicates the current number of status in the Tx Status FIFO of this queue. When the DTXSTS bit of MTL Operation Mode register is set to 1  this field does not reflect the number of status words in Tx Status FIFO. Value After Reset  0x0</description>
							<lsb>20</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MTL_TXQ1_ETS_CONTROL</name>
					<description>MTL Queue 3 Transmit ETS Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3408</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>AVALG</name>
							<description>AV Algorithm   AVALG. When Queue 1 is programmed for AV  this field configures the scheduling algorithm for this queue  This bit when set  indicates credit based shaper algorithm  CBS  is selected for Queue 1 traffic. When reset  strict priority is selected. Value After Reset  0x0</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC</name>
							<description>Credit Control   CC. When this bit is set  the accumulated credit parameter in the credit based shaper algorithm logic is not reset to zero when there is positive credit and no packet to transmit in Channel 1. The credit accumulates even when there is no packet waiting in Channel 1 and another channel is transmitting. When this bit is reset  the accumulated credit parameter in the credit based shaper algorithm logic is set to zero when there is positive credit and no packet to transmit in Channel 1. When there is no packet waiting in Channel 1 and other channel is transmitting  no credit is accumulated. Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SLC</name>
							<description>Slot Count   SLC. If the credit based shaper algorithm is enabled  the software can        program the number of slots  of duration programmed in        DMA CH n  Slot Interval register if present or 125us  over which the        average transmitted bits per slot  provided in the MTL TxQ n  ETS Status        register  need to be computed for Queue. The encoding is as follows  101   111 Reserved Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MTL_TXQ1_ETS_STATUS</name>
					<description>MTL Queue 3 Transmit ETS Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3412</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ABS</name>
							<description>Average Bits per Slot   ABS. This field contains the average transmitted bits per slot. If AV operation is enabled  this field is computed over number of slots         programmed in the SLC field of MTL TxQ n  ETS CONTROL register. When        Enable Slot Interval feature is selected  the maximum value of this        field is 0x6 4000 in 100 Mbps  0x3E 8000 in 1000 Mbps and 9C 4000 in        2500 Mbps mode respectively. Otherwise  the maximum value of this field        is 0x30D4 in 100 Mbs  0x1E848 in 1000 Mbps and 0x4C4B4 in 2500 Mbps        respectively. When the DCB operation is enabled for Queue  this field is        computed over every 10 million bit times slot  4 ms in 2500 Mbps  10 ms        in 1000 Mbps  100 ms in 100 Mbps . The maximum value is 0x989680. This        field is reserved in configurations with only one transmit queue. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
