J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MTL_TXQ2_LOCREDIT</name>
					<description>MTL Queue 3 Transmit LoCredit Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3492</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LC</name>
							<description>loCredit Value   LC. When AV operation is enabled  this field contains the loCredit value required for the credit based shaper algorithm. This is the minimum value that can be accumulated in the credit parameter. This is specified in bits scaled by 1 024. The maximum value to be programmed corresponds to twice the maxFrameSize transmitted from this queue. If the maxFrameSize is 8192 bytes  then  8192 2    8   1024   134 217 728 or 0x0800 0000. Because it is a negative value  the programmed value is 2 s complement of the value  that is  0x1800 0000. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MTL_TXQ3_OPERATION_MODE</name>
					<description>MTL Queue 3 Transmit Operation Mode Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3520</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FTQ</name>
							<description>Flush Transmit Queue   FTQ. When this bit is set  the Tx queue controller logic is reset to its default values. Therefore  all the data in the Tx queue is lost or flushed. This bit is internally reset when the flushing operation is complete. Until this bit is reset  you should not write to the MTL TxQ1 Operation Mode register. The data which is already accepted by the MAC transmitter is not flushed. It is scheduled for transmission and results in underflow and runt packet transmission. Note   The flush operation is complete only when the Tx queue is empty and the application has accepted the pending Tx Status of all transmitted packets. To complete this flush operation  the PHY Tx clock  clk tx i  should be active. Access restriction applies. Setting 1 sets. Self cleared. Setting 0 has no effect. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSF</name>
							<description>Transmit Store and Forward   TSF. When this bit is set  the transmission starts when a full packet resides in the MTL Tx queue. When this bit is set  the TTC values specified in Bits 6 4  of this register are ignored. This bit should be changed only when the transmission is stopped. Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXQEN</name>
							<description>Transmit Queue Enable   TXQEN. This field is used to enable disable the transmit queue 0. Note   In multiple Tx queues configuration  all the queues are disabled by default. Enable the Tx queue by programming this field. Value After Reset  0x0</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TTC</name>
							<description>Transmit Threshold Control   TTC. These bits control the threshold level of the MTL Tx Queue. The transmission starts when the packet size within the MTL Tx Queue is larger than the threshold. In addition  full packets with length less than the threshold are also transmitted. These bits are used only when the TSF bit is reset. Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TQS</name>
							<description>Transmit Queue Size   TQS. This field indicates the size of the allocated Transmit queues in blocks        of 256 bytes. The TQS field is read write only if the number of Tx        Queues more than one  the reset value is 0x0 and indicates size of 256        bytes. When the number of Tx Queues is one  the field is read only and        the configured TX FIFO size in blocks of 256 bytes is reflected in the        reset value. The width of this field depends on the Tx memory size        selected in your configuration. For example  if the memory size is 2048         the width of this field is 3 bits  LOG2 2048 256    LOG2 8    3 bits Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MTL_TXQ3_UNDERFLOW</name>
					<description>MTL Queue 3 Transmit Underflow Counter Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3524</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>UFFRMCNT</name>
							<description>Underflow Packet Counter   UFFRMCNT. This field indicates the number of packets aborted by the controller because of Tx Queue Underflow. This counter is incremented each time the MAC aborts outgoing packet because of underflow. The counter is cleared when this register is read with mci be i 0  at 1 b1. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>UFCNTOVF</name>
							<description>Overflow Bit for Underflow Packet Counter   UFCNTOVF. This bit is set every time the Tx queue Underflow Packet Counter field overflows  that is  it has crossed the maximum count. In such a scenario  the overflow packet counter is reset to all zeros and this bit indicates that the rollover happened. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MTL_TXQ3_DEBUG</name>
					<description>MTL Queue 3 Transmit Debug Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3528</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXQPAUSED</name>
							<description>Transmit Queue in Pause   TXQPAUSED. When this bit is high and the Rx flow control is enabled  it indicates that the Tx Queue is in the Pause condition  in the full duplex only mode  because of the following  Reception of the PFC packet for the priorities assigned to the Tx Queue when PFC is enabled Reception of 802.3x Pause packet when PFC is disabled Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRCSTS</name>
							<description>MTL Tx Queue Read Controller Status   TRCSTS. This field indicates the state of the Tx Queue Read Controller  Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TWCSTS</name>
							<description>MTL Tx Queue Write Controller Status   TWCSTS. When high  this bit indicates that the MTL Tx Queue Write Controller is active  and it is transferring the data to the Tx Queue. Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXQSTS</name>
							<description>MTL Tx Queue Not Empty Status   TXQSTS. When this bit is high  it indicates that the MTL Tx Queue is not empty and some data is left for transmission. Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXSTSFSTS</name>
							<description>MTL Tx Status FIFO Full Status   TXSTSFSTS. When high  this bit indicates that the MTL Tx Status FIFO is full. Therefore  the MTL cannot accept any more packets for transmission. Value After Reset  0x0</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PTXQ</name>
							<description>Number of Packets in the Transmit Queue   PTXQ. This field indicates the current number of packets in the Tx Queue. When the DTXSTS bit of MTL Operation Mode register is set to 1  this field does not reflect the number of packets in the Transmit queue. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>STXSTSF</name>
							<description>Number of Status Words in Tx Status FIFO of Queue   STXSTSF. This field indicates the current number of status in the Tx Status FIFO of this queue. When the DTXSTS bit of MTL Operation Mode register is set to 1  this field does not reflect the number of status words in Tx Status FIFO. Value After Reset  0x0</description>
							<lsb>20</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MTL_TXQ3_ETS_CONTROL</name>
					<description>MTL Queue 3 Transmit ETS Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3536</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>AVALG</name>
							<description>AV Algorithm   AVALG. When Queue 1 is programmed for AV  this field configures the scheduling algorithm for this queue  This bit when set  indicates credit based shaper algorithm  CBS  is selected for Queue 1 traffic. When reset  strict priority is selected. Value After Reset  0x0</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CC</name>
							<description>Credit Control   CC. When this bit is set  the accumulated credit parameter in the credit based shaper algorithm logic is not reset to zero when there is positive credit and no packet to transmit in Channel 1. The credit accumulates even when there is no packet waiting in Channel 1 and another channel is transmitting. When this bit is reset  the accumulated credit parameter in the credit based shaper algorithm logic is set to zero when there is positive credit and no packet to transmit in Channel 1. When there is no packet waiting in Channel 1 and other channel is transmitting  no credit is accumulated. Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SLC</name>
							<description>Slot Count   SLC. If the credit based shaper algorithm is enabled  the software can        program the number of slots  of duration programmed in        DMA CH n  Slot Interval register if present or 125us  over which the        average transmitted bits per slot  provided in the MTL TxQ n  ETS Status        register  need to be computed for Queue. The encoding is as follows  101   111 Reserved Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MTL_TXQ3_ETS_STATUS</name>
					<description>MTL Queue 3 Transmit ETS Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3540</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ABS</name>
							<description>Average Bits per Slot   ABS. This field contains the average transmitted bits per slot. If AV operation is enabled  this field is computed over number of slots         programmed in the SLC field of MTL TxQ n  ETS CONTROL register. When        Enable Slot Interval feature is selected  the maximum value of this        field is 0x6 4000 in 100 Mbps  0x3E 8000 in 1000 Mbps and 9C 4000 in        2500 Mbps mode respectively. Otherwise  the maximum value of this field        is 0x30D4 in 100 Mbs  0x1E848 in 1000 Mbps and 0x4C4B4 in 2500 Mbps        respectively. When the DCB operation is enabled for Queue  this field is        computed over every 10 million bit times slot  4 ms in 2500 Mbps  10 ms        in 1000 Mbps  100 ms in 100 Mbps . The maximum value is 0x989680. This        field is reserved in configurations with only one transmit queue. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MTL_TXQ3_QUANTUM_WEIGHT</name>
					<description>MTL Queue 3 Transmit Quantum or Weights Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3544</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ISCQW</name>
							<description>idleSlopeCredit  Quantum or Weights   ISCQW. idleSlopeCredit When AV feature is enabled  this field contains the idleSlopeCredit value required for the creditbased shaper algorithm for Queue 1. This is the rate of change of credit in bits per cycle  40 ns for 100 Mbps  8 ns for 1000 Mbps  3.2 ns for 2500 Mbps  when the credit is increasing. The software should program this field with computed credit in bits per cycle scaled by 1 024. The maximum value is portTransmitRate  that is  0x2000 in 1000 2500 Mbps mode and 0x1000 in 100 Mbps mode. Bits 20 14  must be written to zero. Quantum When the DCB operation is enabled with DWRR algorithm for Queue 1 traffic  this field contains the quantum value in bytes to be added to credit during every queue scanning cycle. The maximum value is 0x1312D0 bytes. Weights When DCB operation is enabled with WFQ algorithm for Queue 1 traffic  this field contains the weight for this queue. The maximum value is 0x3FFF where weight of 0 indicates 100  bandwidth. Bits 20 14  must be written to zero. The higher the programmed weights lesser the bandwidth allocated for the particular Transmit Queue. This is because the weights are used to compute the packet finish time  weights packet size . Lesser the finish time  higher the probability of the packet getting scheduled first and using more bandwidth. When DCB operation or generic queueing operation is enabled with WRR algorithm for Queue 1 traffic  this field contains the weight for this queue. The maximum value is 0x64. Bits  20 7  must be written to zero. Note 1  In multiple Queue configuration this field in respective per queue register must be programmed to some non zero value when multiple queues are enabled or single queue other than Q0 is enabled. This field need not be programmed when only Q0 is enabled. In general  when WRR algorithm is selected a non zero value must be programmed on both Receive and Transmit. In Receive  the register is MTL Operation Mode register. Note 2  For WFQ algorithm  higher the programmed weights lesser the bandwidth allocated for that Transmit Queue. The finish time is not a function of particular packet alone but it is as per the formula   previous finish time of particular Transmit Queue    weights packet size   Note 3  The weights programmed do not correspond to the number of packets but the fraction of bandwidth or time allocated for particular queue w.r.t. total BW or time. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MTL_TXQ3_SENDSLOPECREDIT</name>
					<description>MTL Queue 3 Transmit SendSlopeCredit Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3548</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SSC</name>
							<description>sendSlopeCredit Value   SSC. When AV operation is enabled  this field contains the sendSlopeCredit        value required for credit based shaper algorithm for Queue 1. This is        the rate of change of credit in bits per cycle  40 ns for 100 Mbps and 8        ns 1000 Mbps  when the credit is decreasing. The software should program        this field with computed credit in bits per cycle scaled by 1 024. The        maximum value is portTransmitRate  that is  0x2000 in 1000 Mbps mode and        0x1000 in 100 Mbps mode. This field should be programmed with absolute        sendSlopeCredit value. The credit based shaper logic subtracts it from        the accumulated credit when Channel 1 is selected for transmission. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MTL_TXQ3_HICREDIT</name>
					<description>MTL Queue 3 Transmit HiCredit Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3552</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>HC</name>
							<description>hiCredit Value   HC. When the AV feature is enabled  this field contains the hiCredit value required for the credit based shaper algorithm. This is the maximum value that can be accumulated in the credit parameter. This is specified in bits scaled by 1 024. The maximum value is maxInterferenceSize  that is  best effort maximum packet size  16 384 bytes or 131 072 bits . The value to be specified is 131 072   1 024   134 217 728 or 0x0800 0000. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MTL_TXQ3_LOCREDIT</name>
					<description>MTL Queue 3 Transmit LoCredit Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3556</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LC</name>
							<description>loCredit Value   LC. When AV operation is enabled  this field contains the loCredit value required for the credit based shaper algorithm. This is the minimum value that can be accumulated in the credit parameter. This is specified in bits scaled by 1 024. The maximum value to be programmed corresponds to twice the maxFrameSize transmitted from this queue. If the maxFrameSize is 8192 bytes  then  8192 2    8   1024   134 217 728 or 0x0800 0000. Because it is a negative value  the programmed value is 2 s complement of the value  that is  0x1800 0000. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MTL_Q1_INTERRUPT_CONTROL_STATUS</name>
					<description>MTL Queue 3 Interrupt Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3436</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXUNFIS</name>
							<description>Transmit Queue Underflow Interrupt Status   TXUNFIS. This bit indicates that the Transmit Queue had an underflow while transmitting the packet. Transmission is suspended and an Underflow Error TDES3 2  is set. This bit is cleared when the application writes 1 to this bit. Access restriction applies. Self set to 1 on internal event. Setting 1 clears. Setting 0 has no effect. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ABPSIS</name>
							<description>Average Bits Per Slot Interrupt Status   ABPSIS. When set  this bit indicates that the MAC has updated the ABS value. This bit is cleared when the application writes 1 to this bit. Access restriction applies. Self set to 1 on internal event. Setting 1 clears. Setting 0 has no effect. Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXUIE</name>
							<description>Transmit Queue Underflow Interrupt Enable   TXUIE. When this bit is set  the Transmit Queue Underflow interrupt is enabled. When this bit is reset  the Transmit Queue Underflow interrupt is disabled. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ABPSIE</name>
							<description>Average Bits Per Slot Interrupt Enable   ABPSIE. When this bit is set  the MAC asserts the sbd intr o or mci intr o interrupt when the average bits per slot status is updated. When this bit is cleared  the interrupt is not asserted for such an event. Value After Reset  0x0</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXOVFIS</name>
							<description>Receive Queue Overflow Interrupt Status   RXOVFIS. This bit indicates that the Receive Queue had an overflow while receiving the packet. If a partial packet is transferred to the application  the overflow status is set in RDES3 21 . This bit is cleared when the application writes 1 to this bit. Access restriction applies. Self set to 1 on internal event. Setting 1 clears. Setting 0 has no effect. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXOIE</name>
							<description>Receive Queue Overflow Interrupt Enable   RXOIE. When this bit is set  the Receive Queue Overflow interrupt is enabled. When this bit is reset  the Receive Queue Overflow interrupt is disabled. Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
