J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MTL_RXQ2_OPERATION_MODE</name>
					<description>MTL Queue 3 Receive Operation Mode Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3504</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RTC</name>
							<description>Receive Queue Threshold Control   RTC. These bits control the threshold level of the MTL Rx queue  in bytes   The received packet is transferred to the application or DMA when the packet size within the MTL Rx queue is larger than the threshold. In addition  full packets with length less than the threshold are automatically transferred. This field is valid only when the RSF bit is zero. This field is ignored when the RSF bit is set to 1. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FUP</name>
							<description>Forward Undersized Good Packets   FUP. When this bit is set  the Rx queue forwards the undersized good packets  packets with no error and length less than 64 bytes   including pad bytes and CRC. When this bit is reset  the Rx queue drops all packets of less than 64 bytes  unless a packet is already transferred because of the lower value of Rx Threshold  for example  RTC   01. Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FEP</name>
							<description>Forward Error Packets   FEP. When this bit is reset  the Rx queue drops packets with error status  CRC error  GMII ER  watchdog timeout  or overflow . However  if the start byte  write  pointer of a packet is already transferred to the read controller side  in Threshold mode   the packet is not dropped. When this bit is set  all packets except the runt error packets are forwarded to the application or DMA. If the RSF bit is set and the Rx queue overflows when a partial packet is written  the packet is dropped irrespective of the setting of this bit. However  if the RSF bit is reset and the Rx queue overflows when a partial packet is written  a partial packet may be forwarded to the application or DMA. Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RSF</name>
							<description>Receive Queue Store and Forward   RSF. When this bit is set  the DWC ether qos reads a packet from the Rx queue only after the complete packet has been written to it  ignoring the RTC field of this register. When this bit is reset  the Rx queue operates in the Threshold  cut through  mode  subject to the threshold specified by the RTC field of this register. Value After Reset  0x0</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIS_TCP_EF</name>
							<description>Disable Dropping of TCP IP Checksum Error Packets   DIS TCP EF. When this bit is set  the MAC does not drop the packets which only have the errors detected by the Receive Checksum Offload engine. Such packets have errors only in the encapsulated payload. There are no errors  including FCS error  in the Ethernet packet received by the MAC. When this bit is reset  all error packets are dropped if the FEP bit is reset. Value After Reset  0x0</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EHFC</name>
							<description>Enable Hardware Flow Control   EHFC. When this bit is set  the flow control signal operation  based on the fill level of Rx queue  is enabled. When reset  the flow control operation is disabled. This bit is not used  reserved and always reset  when the Rx queue is less than 4 KB. Value After Reset  0x0</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RFA</name>
							<description>Threshold for Activating Flow Control  in half duplex and full duplex   RFA. These bits control the threshold  fill level of Rx queue  at which the flow control is activated  For more information on encoding for this field  see RFD. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RFD</name>
							<description>Threshold for Deactivating Flow Control  in half duplex and full duplex modes    RFD. These bits control the threshold  fill level of Rx queue  at which the flow control is de asserted after activation  LOST SEQUENCE DEFINITION The de assertion is effective only after flow control is asserted. Note  The value must be programmed in such a way to make sure that the threshold is a positive number. When the EHFC is set high  these values are applicable only when the Rx queue size determined by the RQS field of this register  is equal to or greater than 4 KB. For a given queue size  the values ranges between 0 and the encoding for FULL minus  QSIZE   0.5 KB  and all other values are illegal. Here the term FULL and QSIZE refers to the queue size determined by the RQS field of this register. The width of this field depends on RX FIFO size selected during the configuration. Remaining bits are reserved and read only. Value After Reset  0x0</description>
							<lsb>14</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RQS</name>
							<description>Receive Queue Size   RQS. This field indicates the size of the allocated Receive queues in blocks        of 256 bytes. The RQS field is read write only if the number of Rx        Queues more than one and the reset value is 0x0 and indicates size of        256 bytes. When the number of Rx Queues is one  the field is read only and the        configured RX FIFO size in blocks of 256 bytes is reflected in the reset        value. The width of this field depends on the Rx memory size selected in your        configuration. For example  if the memory size is 2048  the width of        this field is 3 bits  LOG2 2048 256    LOG2 8    3 bits Value After Reset  0x0</description>
							<lsb>20</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MTL_RXQ2_MISSED_PACKET_OVERFLOW_CNT</name>
					<description>MTL Queue 3 Receive Missed Packet and Overflow Counter Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3508</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>OVFPKTCNT</name>
							<description>Overflow Packet Counter   OVFPKTCNT. This field indicates the number of packets discarded by the DWC ether qos because of Receive queue overflow. This counter is incremented each time the DWC ether qos discards an incoming packet because of overflow. This counter is reset when this register is read with mci be i 0  at 1 b1. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OVFCNTOVF</name>
							<description>Overflow Counter Overflow Bit   OVFCNTOVF. When set  this bit indicates that the Rx Queue Overflow Packet Counter field crossed the maximum limit. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MISPKTCNT</name>
							<description>Missed Packet Counter   MISPKTCNT. This field indicates the number of packets missed by the DWC ether qos because the application asserted ari pkt flush i   for this queue. This counter is reset when this register is read with mci be i 0  at 1b1. This counter is incremented by 1 when the DMA discards the packet because of buffer unavailability. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MISCNTOVF</name>
							<description>Missed Packet Counter Overflow Bit   MISCNTOVF. When set  this bit indicates that the Rx Queue Missed Packet Counter crossed the maximum limit. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MTL_RXQ2_DEBUG</name>
					<description>MTL Queue 3 Receive Debug Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3512</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RWCSTS</name>
							<description>MTL Rx Queue Write Controller Active Status   RWCSTS. When high  this bit indicates that the MTL Rx queue Write controller is        active  and it is transferring a received packet to the Rx Queue. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RRCSTS</name>
							<description>MTL Rx Queue Read Controller State   RRCSTS. This field gives the state of the Rx queue Read controller  Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXQSTS</name>
							<description>MTL Rx Queue Fill Level Status   RXQSTS. This field gives the status of the fill level of the Rx Queue  Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PRXQ</name>
							<description>Number of Packets in Receive Queue   PRXQ. This field indicates the current number of packets in the Rx Queue. The theoretical maximum value for this field is 256KB 16B   16K Packets  that is  Max Queue Size Min Packet Size. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MTL_RXQ2_CONTROL</name>
					<description>MTL Queue 3 Receive Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3516</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXQ_WEGT</name>
							<description>Receive Queue Weight   RXQ WEGT. This field indicates the weight assigned to the Rx Queue 0. The weight is used as the number of continuous PBL or packets requests  depending on the RXQ FRM ARBIT  allocated to the queue in one arbitration cycle. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXQ_FRM_ARBIT</name>
							<description>Receive Queue Packet Arbitration   RXQ FRM ARBIT. When this bit is set  the DWC ether qos drives the packet data to the ARI interface such that the entire packet data of currently selected queue is transmitted before switching to other queue. When this bit is reset  the DWC ether qos drives the packet data to the ARI interface such that the following amount of data of currently selected queue is transmitted before switching to other queue  PBL amount of data  indicated by ari qN pbl i    or Complete data of a packet The status and the timestamp are not a part of the PBL data. Therefore  the DWC ether qos drives the complete status  including timestamp status  during first PBL request for the packet  in store and forward mode  or the last PBL request for the packet  in Threshold mode . Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MTL_RXQ3_OPERATION_MODE</name>
					<description>MTL Queue 3 Receive Operation Mode Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3568</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RTC</name>
							<description>Receive Queue Threshold Control   RTC. These bits control the threshold level of the MTL Rx queue  in bytes   The received packet is transferred to the application or DMA when the packet size within the MTL Rx queue is larger than the threshold. In addition  full packets with length less than the threshold are automatically transferred. This field is valid only when the RSF bit is zero. This field is ignored when the RSF bit is set to 1. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FUP</name>
							<description>Forward Undersized Good Packets   FUP. When this bit is set  the Rx queue forwards the undersized good packets  packets with no error and length less than 64 bytes   including pad bytes and CRC. When this bit is reset  the Rx queue drops all packets of less than 64 bytes  unless a packet is already transferred because of the lower value of Rx Threshold  for example  RTC   01. Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FEP</name>
							<description>Forward Error Packets   FEP. When this bit is reset  the Rx queue drops packets with error status  CRC error  GMII ER  watchdog timeout  or overflow . However  if the start byte  write  pointer of a packet is already transferred to the read controller side  in Threshold mode   the packet is not dropped. When this bit is set  all packets except the runt error packets are forwarded to the application or DMA. If the RSF bit is set and the Rx queue overflows when a partial packet is written  the packet is dropped irrespective of the setting of this bit. However  if the RSF bit is reset and the Rx queue overflows when a partial packet is written  a partial packet may be forwarded to the application or DMA. Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RSF</name>
							<description>Receive Queue Store and Forward   RSF. When this bit is set  the DWC ether qos reads a packet from the Rx queue only after the complete packet has been written to it  ignoring the RTC field of this register. When this bit is reset  the Rx queue operates in the Threshold  cut through  mode  subject to the threshold specified by the RTC field of this register. Value After Reset  0x0</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIS_TCP_EF</name>
							<description>Disable Dropping of TCP IP Checksum Error Packets   DIS TCP EF. When this bit is set  the MAC does not drop the packets which only have the errors detected by the Receive Checksum Offload engine. Such packets have errors only in the encapsulated payload. There are no errors  including FCS error  in the Ethernet packet received by the MAC. When this bit is reset  all error packets are dropped if the FEP bit is reset. Value After Reset  0x0</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EHFC</name>
							<description>Enable Hardware Flow Control   EHFC. When this bit is set  the flow control signal operation  based on the fill level of Rx queue  is enabled. When reset  the flow control operation is disabled. This bit is not used  reserved and always reset  when the Rx queue is less than 4 KB. Value After Reset  0x0</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RFA</name>
							<description>Threshold for Activating Flow Control  in half duplex and full duplex   RFA. These bits control the threshold  fill level of Rx queue  at which the flow control is activated  For more information on encoding for this field  see RFD. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RFD</name>
							<description>Threshold for Deactivating Flow Control  in half duplex and full duplex modes    RFD. These bits control the threshold  fill level of Rx queue  at which the flow control is de asserted after activation  LOST SEQUENCE DEFINITION The de assertion is effective only after flow control is asserted. Note  The value must be programmed in such a way to make sure that the threshold is a positive number. When the EHFC is set high  these values are applicable only when the Rx queue size determined by the RQS field of this register  is equal to or greater than 4 KB. For a given queue size  the values ranges between 0 and the encoding for FULL minus  QSIZE   0.5 KB  and all other values are illegal. Here the term FULL and QSIZE refers to the queue size determined by the RQS field of this register. The width of this field depends on RX FIFO size selected during the configuration. Remaining bits are reserved and read only. Value After Reset  0x0</description>
							<lsb>14</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RQS</name>
							<description>Receive Queue Size   RQS. This field indicates the size of the allocated Receive queues in blocks        of 256 bytes. The RQS field is read write only if the number of Rx        Queues more than one and the reset value is 0x0 and indicates size of        256 bytes. When the number of Rx Queues is one  the field is read only and the        configured RX FIFO size in blocks of 256 bytes is reflected in the reset        value. The width of this field depends on the Rx memory size selected in your        configuration. For example  if the memory size is 2048  the width of        this field is 3 bits  LOG2 2048 256    LOG2 8    3 bits Value After Reset  0x0</description>
							<lsb>20</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MTL_RXQ3_MISSED_PACKET_OVERFLOW_CNT</name>
					<description>MTL Queue 3 Receive Missed Packet and Overflow Counter Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3572</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>OVFPKTCNT</name>
							<description>Overflow Packet Counter   OVFPKTCNT. This field indicates the number of packets discarded by the DWC ether qos because of Receive queue overflow. This counter is incremented each time the DWC ether qos discards an incoming packet because of overflow. This counter is reset when this register is read with mci be i 0  at 1 b1. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OVFCNTOVF</name>
							<description>Overflow Counter Overflow Bit   OVFCNTOVF. When set  this bit indicates that the Rx Queue Overflow Packet Counter field crossed the maximum limit. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MISPKTCNT</name>
							<description>Missed Packet Counter   MISPKTCNT. This field indicates the number of packets missed by the DWC ether qos because the application asserted ari pkt flush i   for this queue. This counter is reset when this register is read with mci be i 0  at 1b1. This counter is incremented by 1 when the DMA discards the packet because of buffer unavailability. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MISCNTOVF</name>
							<description>Missed Packet Counter Overflow Bit   MISCNTOVF. When set  this bit indicates that the Rx Queue Missed Packet Counter crossed the maximum limit. Access restriction applies. Clears on read. Self set to 1 on internal event. Value After Reset  0x0</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MTL_RXQ3_DEBUG</name>
					<description>MTL Queue 3 Receive Debug Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3576</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RWCSTS</name>
							<description>MTL Rx Queue Write Controller Active Status   RWCSTS. When high  this bit indicates that the MTL Rx queue Write controller is        active  and it is transferring a received packet to the Rx Queue. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RRCSTS</name>
							<description>MTL Rx Queue Read Controller State   RRCSTS. This field gives the state of the Rx queue Read controller  Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXQSTS</name>
							<description>MTL Rx Queue Fill Level Status   RXQSTS. This field gives the status of the fill level of the Rx Queue  Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PRXQ</name>
							<description>Number of Packets in Receive Queue   PRXQ. This field indicates the current number of packets in the Rx Queue. The theoretical maximum value for this field is 256KB 16B   16K Packets  that is  Max Queue Size Min Packet Size. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
