J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>MTL_RXQ3_CONTROL</name>
					<description>MTL Queue 3 Receive Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>3580</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXQ_WEGT</name>
							<description>Receive Queue Weight   RXQ WEGT. This field indicates the weight assigned to the Rx Queue 0. The weight is used as the number of continuous PBL or packets requests  depending on the RXQ FRM ARBIT  allocated to the queue in one arbitration cycle. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXQ_FRM_ARBIT</name>
							<description>Receive Queue Packet Arbitration   RXQ FRM ARBIT. When this bit is set  the DWC ether qos drives the packet data to the ARI interface such that the entire packet data of currently selected queue is transmitted before switching to other queue. When this bit is reset  the DWC ether qos drives the packet data to the ARI interface such that the following amount of data of currently selected queue is transmitted before switching to other queue  PBL amount of data  indicated by ari qN pbl i    or Complete data of a packet The status and the timestamp are not a part of the PBL data. Therefore  the DWC ether qos drives the complete status  including timestamp status  during first PBL request for the packet  in store and forward mode  or the last PBL request for the packet  in Threshold mode . Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMA_MODE</name>
					<description>DMA Bus Mode Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4096</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SWR</name>
							<description>Software Reset   SWR. When this bit is set  the MAC and the DMA controller reset the logic and        all internal registers of the DMA  MTL  and MAC. This bit is        automatically cleared after the reset operation is complete in all        DWC ether qos clock domains. Before reprogramming any DWC ether qos        register  a value of zero should be read in this bit. This bit must be        read at least 4 CSR clock cycles after it is written to 1. Note   The reset operation is complete only        when all resets in all active clock domains are de asserted. Therefore         it is essential that all PHY inputs clocks  applicable for the selected        PHY interface  are present for software reset completion. The time to        complete the software reset operation depends on the frequency of the        slowest active clock. Access restriction applies. Setting 1 sets. Self cleared. Setting 0 has        no effect. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DA</name>
							<description>DMA Tx or Rx Arbitration Scheme   DA. This bit specifies the arbitration scheme between the Transmit and Receive paths of all channels  The priority between the paths is according to the priority specified in Bits 14 12  and the priority weight is specified in the TXPR bit. The Tx path has priority over the Rx path when the TXPR bit is set. Otherwise  the Rx path has priority over the Tx path. Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TAA</name>
							<description>Transmit Arbitration Algorithm   TAA. This field is used to select the arbitration algorithm for the Transmit        side when multiple Tx DMAs are selected. 011   111 Reserved Value After Reset  0x0</description>
							<lsb>2</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ARBC</name>
							<description>Arbitration Control   ARBC. When this bit is reset to 0  the DMA arbitrates as soon as the current burst transaction is completed. So  in this mode  the arbiter will miss the next subsequent request from the same DMA since there are inherent delays between the completion of 1 transfer request and the next transaction request generated from the same DMA. Consequently  the WRR ratio becomes 1 1 irrespective of the programmed ratio. When this bit is set to 1  the DMA arbitration is delayed for a few clock cycles after the completion of current transaction so that the next request from the same DMA can be considered. This allows the arbiter to maintain WRR ratio as programmed.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXPR</name>
							<description>Transmit Priority   TXPR. When set  this bit indicates that the Tx DMA has higher priority than        the Rx DMA during arbitration for the system side bus. Value After Reset  0x0</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PR</name>
							<description>Priority Ratio   PR. These bits control the priority ratio in weighted round robin arbitration between the Rx DMA and Tx DMA. These bits are valid only when the DA bit is reset. The priority ratio is Rx Tx or Tx Rx depending on whether the TXPR bit is reset or set. Value After Reset  0x0</description>
							<lsb>12</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INTM</name>
							<description>Interrupt Mode   INTM. This field defines the interrupt mode of DWC ether qos. The behavior of the following outputs changes depending on the following        settings  sbd perch tx intr o    Transmit Per Channel Interrupt  sbd perch rx intr o    Receive Per Channel Interrupt  sbd intr o  Common Interrupt  It also changes the behavior of the RI TI bits in the DMA CH0 Status.        For more details please refer Table  quot DWC ether qos Transfer Complete        Interrupt Behavior quot . Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMA_SYSBUS_MODE</name>
					<description>DMA System Bus Mode Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4100</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FB</name>
							<description>Fixed Burst Length   FB. When this bit is set to 1  the AHB master  initiates burst transfers of specified length  INCRx or SINGLE . When this bit is set to 0  the AHB master initiates transfers of unspecified length  INCR  or SINGLE transfers. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AAL</name>
							<description>Address Aligned Beats   AAL. When this bit is set to 1  the EQOS AXI or EQOS AHB master performs address aligned burst transfers on Read and Write channels. Value After Reset  0x0</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MB</name>
							<description>Mixed Burst   MB. When this bit is set high and the FB bit is low  the AHB master performs undefined bursts transfers  INCR  for burst length of 16 or more. For burst length of 16 or less  the AHB master performs fixed burst transfers  INCRx and SINGLE . Value After Reset  0x0</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RB</name>
							<description>Rebuild INCRx Burst   RB. When this bit is set high and the AHB master gets SPLIT  RETRY  or Early Burst Termination  EBT  response  the AHB master interface rebuilds the pending beats of any initiated burst transfer with INCRx and SINGLE transfers. By default  the AHB master interface rebuilds pending beats of an EBT with an unspecified  INCR  burst. Value After Reset  0x0</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMA_INTERRUPT_STATUS</name>
					<description>DMA Interrupt Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4104</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DC0IS</name>
							<description>DMA Channel 0 Interrupt Status   DC0IS. This bit indicates an interrupt event in DMA Channel 0. To reset this bit to 1 b0  the software must read the corresponding register in DMA Channel 0 to get the exact cause of the interrupt and clear its source. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DC1IS</name>
							<description>DMA Channel 1 Interrupt Status   DC1IS. This bit indicates an interrupt event in DMA Channel 1. To reset this bit to 1 b0  the software must read the corresponding register in DMA Channel 1 to get the exact cause of the interrupt and clear its source. Value After Reset  0x0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DC2IS</name>
							<description>DMA Channel 2 Interrupt Status   DC2IS. This bit indicates an interrupt event in DMA Channel 2. To reset this bit to 1 b0  the software must read the corresponding register in DMA Channel 2 to get the exact cause of the interrupt and clear its source. Value After Reset  0x0</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DC3IS</name>
							<description>DMA Channel 3 Interrupt Status   DC3IS. This bit indicates an interrupt event in DMA Channel 3. To reset this bit to 1 b0  the software must read the corresponding register in DMA Channel 3 to get the exact cause of the interrupt and clear its source. Value After Reset  0x0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MTLIS</name>
							<description>MTL Interrupt Status   MTLIS. This bit indicates an interrupt event in the MTL. To reset this bit to 1 b0  the software must read the corresponding register in the MTL to get the exact cause of the interrupt and clear its source. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MACIS</name>
							<description>MAC Interrupt Status   MACIS. This bit indicates an interrupt event in the MAC. To reset this bit to 1 b0  the software must read the corresponding register in the MAC to get the exact cause of the interrupt and clear its source. Value After Reset  0x0</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMA_DEBUG_STATUS0</name>
					<description>DMA Debug Status 0 Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4108</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>AXWHSTS</name>
							<description>AHB Master Status   AXWHSTS. When high  this bit indicates that the AHB master FSMs are in the non idle state. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RPS0</name>
							<description>DMA Channel 0 Receive Process State   RPS0. This field indicates the Rx DMA FSM state for Channel 0  The MSB of this field always returns 0. This field does not generate an interrupt. Value After Reset  0x0</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TPS0</name>
							<description>DMA Channel 0 Transmit Process State   TPS0. This field indicates the Tx DMA FSM state for Channel 0  The MSB of this field always returns 0. This field does not generate an interrupt. Value After Reset  0x0</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RPS1</name>
							<description>DMA Channel 1 Receive Process State   RPS1. This field indicates the Rx DMA FSM state for Channel 1. This field is similar to the RPS0 field. Value After Reset  0x0</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TPS1</name>
							<description>DMA Channel 1 Transmit Process State   TPS1. This field indicates the Tx DMA FSM state for Channel 1. This field is similar to the TPS0 field. Value After Reset  0x0</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RPS2</name>
							<description>DMA Channel 2 Receive Process State   RPS2. This field indicates the Rx DMA FSM state for Channel 2. This field is similar to the RPS0 field Value After Reset  0x0</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TPS2</name>
							<description>DMA Channel 2 Transmit Process State   TPS2. This field indicates the Tx DMA FSM state for Channel 2. This field is similar to the TPS0 field. Value After Reset  0x0</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMA_DEBUG_STATUS1</name>
					<description>DMA Debug Status 1 Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4112</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RPS3</name>
							<description>DMA Channel 3 Receive Process State   RPS3. This field indicates the Rx DMA FSM state for Channel 3. This field is similar to the RPS6 field. Value After Reset  0x0</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TPS3</name>
							<description>DMA Channel 3 Transmit Process State   TPS3. This field indicates the Tx DMA FSM state for Channel 3. This field is similar to the TPS6 field. Value After Reset  0x0</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CLC</name>
					<description>Clock Control Register
 resetvalue={Application Reset:0x3}</description>
					<addressOffset>8192</addressOffset>
					<size>32</size>
					<resetValue>3</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit   DISR. Used for enable disable control of the module.  The disable request is delayed internally until all pending transactions on the master  SRI  and slave  SPB  interface are completed.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit   DISS. Bit indicates the current status of the module.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Module Identification Register
 resetvalue={Application Reset:0x0E9C000}</description>
					<addressOffset>8196</addressOffset>
					<size>32</size>
					<resetValue>15319040</resetValue>
					<resetMask>4294967040</resetMask>
					<fields>
						<field>
							<name>MODREV</name>
							<description>Module Revision Number   MODREV. This bit field defines the module revision number. The value of a module        revision starts with 01 H  first        revision . To be incremented eg. 2 for GMAC QoS</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODTYPE</name>
							<description>Module Type   MODTYPE. This bit field defines the module as a 32 bit module  C0 H</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODNUM</name>
							<description>Module Number Value   MODNUM. This bit field defines the module identification number for the Mod Name   00E9 H</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
