J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>GPCTL</name>
					<description>General Purpose Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>8200</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ALTI0</name>
							<description>Alternate Input Select   ALTI10. Selects the alternate input for channel y. If no signal is connected to an alternate input  it is connected to GND. If for one product no signal is connected to an alternate input  it is connected to GND internally at module entity level. This allows to leave some signals unconnected in the application  i.e. RXER  CRS  COL  and save pins and external connection to GND. Map of signals demultiplexed by ALTI bit fields  ALTI0  MDIO ALTI1  RXCLK  REFCLK ALTI2  CRS ALTI3  COL ALTI4  RXDV  CRSDV  RCTL ALTI5  RXER ALTI6  RXD0 ALTI7  RXD1 ALTI8  RXD2 ALTI9  RXD3 ALTI10  TXCLK</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ALTI1</name>
							<description>Alternate Input Select   ALTI10. Selects the alternate input for channel y. If no signal is connected to an alternate input  it is connected to GND. If for one product no signal is connected to an alternate input  it is connected to GND internally at module entity level. This allows to leave some signals unconnected in the application  i.e. RXER  CRS  COL  and save pins and external connection to GND. Map of signals demultiplexed by ALTI bit fields  ALTI0  MDIO ALTI1  RXCLK  REFCLK ALTI2  CRS ALTI3  COL ALTI4  RXDV  CRSDV  RCTL ALTI5  RXER ALTI6  RXD0 ALTI7  RXD1 ALTI8  RXD2 ALTI9  RXD3 ALTI10  TXCLK</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ALTI2</name>
							<description>Alternate Input Select   ALTI10. Selects the alternate input for channel y. If no signal is connected to an alternate input  it is connected to GND. If for one product no signal is connected to an alternate input  it is connected to GND internally at module entity level. This allows to leave some signals unconnected in the application  i.e. RXER  CRS  COL  and save pins and external connection to GND. Map of signals demultiplexed by ALTI bit fields  ALTI0  MDIO ALTI1  RXCLK  REFCLK ALTI2  CRS ALTI3  COL ALTI4  RXDV  CRSDV  RCTL ALTI5  RXER ALTI6  RXD0 ALTI7  RXD1 ALTI8  RXD2 ALTI9  RXD3 ALTI10  TXCLK</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ALTI3</name>
							<description>Alternate Input Select   ALTI10. Selects the alternate input for channel y. If no signal is connected to an alternate input  it is connected to GND. If for one product no signal is connected to an alternate input  it is connected to GND internally at module entity level. This allows to leave some signals unconnected in the application  i.e. RXER  CRS  COL  and save pins and external connection to GND. Map of signals demultiplexed by ALTI bit fields  ALTI0  MDIO ALTI1  RXCLK  REFCLK ALTI2  CRS ALTI3  COL ALTI4  RXDV  CRSDV  RCTL ALTI5  RXER ALTI6  RXD0 ALTI7  RXD1 ALTI8  RXD2 ALTI9  RXD3 ALTI10  TXCLK</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ALTI4</name>
							<description>Alternate Input Select   ALTI10. Selects the alternate input for channel y. If no signal is connected to an alternate input  it is connected to GND. If for one product no signal is connected to an alternate input  it is connected to GND internally at module entity level. This allows to leave some signals unconnected in the application  i.e. RXER  CRS  COL  and save pins and external connection to GND. Map of signals demultiplexed by ALTI bit fields  ALTI0  MDIO ALTI1  RXCLK  REFCLK ALTI2  CRS ALTI3  COL ALTI4  RXDV  CRSDV  RCTL ALTI5  RXER ALTI6  RXD0 ALTI7  RXD1 ALTI8  RXD2 ALTI9  RXD3 ALTI10  TXCLK</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ALTI5</name>
							<description>Alternate Input Select   ALTI10. Selects the alternate input for channel y. If no signal is connected to an alternate input  it is connected to GND. If for one product no signal is connected to an alternate input  it is connected to GND internally at module entity level. This allows to leave some signals unconnected in the application  i.e. RXER  CRS  COL  and save pins and external connection to GND. Map of signals demultiplexed by ALTI bit fields  ALTI0  MDIO ALTI1  RXCLK  REFCLK ALTI2  CRS ALTI3  COL ALTI4  RXDV  CRSDV  RCTL ALTI5  RXER ALTI6  RXD0 ALTI7  RXD1 ALTI8  RXD2 ALTI9  RXD3 ALTI10  TXCLK</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ALTI6</name>
							<description>Alternate Input Select   ALTI10. Selects the alternate input for channel y. If no signal is connected to an alternate input  it is connected to GND. If for one product no signal is connected to an alternate input  it is connected to GND internally at module entity level. This allows to leave some signals unconnected in the application  i.e. RXER  CRS  COL  and save pins and external connection to GND. Map of signals demultiplexed by ALTI bit fields  ALTI0  MDIO ALTI1  RXCLK  REFCLK ALTI2  CRS ALTI3  COL ALTI4  RXDV  CRSDV  RCTL ALTI5  RXER ALTI6  RXD0 ALTI7  RXD1 ALTI8  RXD2 ALTI9  RXD3 ALTI10  TXCLK</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ALTI7</name>
							<description>Alternate Input Select   ALTI10. Selects the alternate input for channel y. If no signal is connected to an alternate input  it is connected to GND. If for one product no signal is connected to an alternate input  it is connected to GND internally at module entity level. This allows to leave some signals unconnected in the application  i.e. RXER  CRS  COL  and save pins and external connection to GND. Map of signals demultiplexed by ALTI bit fields  ALTI0  MDIO ALTI1  RXCLK  REFCLK ALTI2  CRS ALTI3  COL ALTI4  RXDV  CRSDV  RCTL ALTI5  RXER ALTI6  RXD0 ALTI7  RXD1 ALTI8  RXD2 ALTI9  RXD3 ALTI10  TXCLK</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ALTI8</name>
							<description>Alternate Input Select   ALTI10. Selects the alternate input for channel y. If no signal is connected to an alternate input  it is connected to GND. If for one product no signal is connected to an alternate input  it is connected to GND internally at module entity level. This allows to leave some signals unconnected in the application  i.e. RXER  CRS  COL  and save pins and external connection to GND. Map of signals demultiplexed by ALTI bit fields  ALTI0  MDIO ALTI1  RXCLK  REFCLK ALTI2  CRS ALTI3  COL ALTI4  RXDV  CRSDV  RCTL ALTI5  RXER ALTI6  RXD0 ALTI7  RXD1 ALTI8  RXD2 ALTI9  RXD3 ALTI10  TXCLK</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ALTI9</name>
							<description>Alternate Input Select   ALTI10. Selects the alternate input for channel y. If no signal is connected to an alternate input  it is connected to GND. If for one product no signal is connected to an alternate input  it is connected to GND internally at module entity level. This allows to leave some signals unconnected in the application  i.e. RXER  CRS  COL  and save pins and external connection to GND. Map of signals demultiplexed by ALTI bit fields  ALTI0  MDIO ALTI1  RXCLK  REFCLK ALTI2  CRS ALTI3  COL ALTI4  RXDV  CRSDV  RCTL ALTI5  RXER ALTI6  RXD0 ALTI7  RXD1 ALTI8  RXD2 ALTI9  RXD3 ALTI10  TXCLK</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ALTI10</name>
							<description>Alternate Input Select   ALTI10. Selects the alternate input for channel y. If no signal is connected to an alternate input  it is connected to GND. If for one product no signal is connected to an alternate input  it is connected to GND internally at module entity level. This allows to leave some signals unconnected in the application  i.e. RXER  CRS  COL  and save pins and external connection to GND. Map of signals demultiplexed by ALTI bit fields  ALTI0  MDIO ALTI1  RXCLK  REFCLK ALTI2  CRS ALTI3  COL ALTI4  RXDV  CRSDV  RCTL ALTI5  RXER ALTI6  RXD0 ALTI7  RXD1 ALTI8  RXD2 ALTI9  RXD3 ALTI10  TXCLK</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EPR</name>
							<description>External Phy Interface RMII Mode Bit   EPR. Used to select the phy interface during module reset of MAC triggered by        setting SWR bit of DMA Mode  160 Register. Note that the status of this bit is latched in during module reset only. Drives eth phy rmii o   phy inff sel i 2 0 .</description>
							<lsb>22</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ACCEN0</name>
					<description>Access Enable Register 0
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
					<addressOffset>8204</addressOffset>
					<size>32</size>
					<resetValue>4294967295</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EN0</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN1</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN2</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN3</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN4</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN5</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN6</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN7</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN8</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN9</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN10</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN11</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN12</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN13</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN14</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN15</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN16</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN17</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN18</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN19</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN20</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN21</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN22</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN23</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN24</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN25</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN26</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN27</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN28</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN29</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN30</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN31</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRST0</name>
					<description>Kernel Reset Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>8212</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>Kernel Reset   RST. This reset bit can be used to request for a kernel reset. The kernel        reset will be executed if the reset bits of both kernel registers are        set and both  master and slave interface are idle. The RST bit will be cleared  re set to   180 0  180   by the BPI FPI after the        kernel reset was executed.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RSTSTAT</name>
							<description>Kernel Reset Status   RSTSTAT. This bit indicates wether a kernel reset was executed or not. This bit        is set by the BPI FPI after the execution of a kernel reset in the same        clock cycle both reset bits. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related KRSTCLR register.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRST1</name>
					<description>Kernel Reset Register 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>8216</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>Kernel Reset   RST. This reset bit can be used to request for a kernel reset. The kernel        reset will be executed if the reset bits of both kernel reset registers        is set and both  master and slave interface are idle. The RST bit will be cleared  re set to   180 0  180   by the BPI FPI after the        kernel reset was executed.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRSTCLR</name>
					<description>Kernel Reset Status Clear Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>8220</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CLR</name>
							<description>Kernel Reset Status Clear   CLR. Read always as 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SKEWCTL</name>
					<description>Skew Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>8256</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXCFG</name>
							<description>TX Clock delay control for RGMII Mode   TXCFG. Used to specify the receive timing skew in RGMII mode using integrated        delay generation on TXCLK. In MII and RMII mode  this is not active.        Skew is  TXCFG   222 22  ps. If cleared  skew is 0  default  skew        generation switched off .</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXCFG</name>
							<description>RX Clock delay control for RGMII Mode   RXCFG. Used to specify the receive timing skew in RGMII mode using integrated        delay generation on RXCLK. In MII and RMII mode  this is not active.        Skew is  RXCFG   222 22  ps. If cleared  skew is 0  default  skew        generation switched off .</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
