J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>I2C0</name>
			<version>100</version>
			<description>I2C</description>
			<baseAddress>4027318272</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>65568</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CLC1</name>
					<description>Clock Control 1 Register
 resetvalue={Application Reset:0x3}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>3</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit   DISR. Used for enable disable control of the module.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit   DISS. Bit indicates the current status of the module.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SPEN</name>
							<description>Module Suspend Enable Bit for OCDS   SPEN</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EDIS</name>
							<description>External Request Disable   EDIS. This bit is not used in TC39x and should always be written with 0.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SBWE</name>
							<description>Module Suspend Bit Write Enable for OCDS   SBWE. This bit is always read as 0.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FSOE</name>
							<description>Fast Switch Off Enable   FSOE</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RMC</name>
							<description>Clock Divider for Standard Run Mode   RMC. Max. 8 bit divider value If RMC is set to 0 the module is disabled. As long as the new divider value RMC is not valid  reading register          returns 0000 00XX H</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Module Identification Register
 resetvalue={Application Reset:0x5705}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>22277</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision Number   MOD REV. This bit field defines the revision number.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number   MOD NUMBER. This bit field defines the module identification number.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RUNCTRL</name>
					<description>RUN Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>16</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Enable I2C bus Interface   RUN</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ENDDCTRL</name>
					<description>End Data Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>20</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SETRSC</name>
							<description>Set Restart Condition   SETRSC. This bit is always read as 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SETEND</name>
							<description>Set End of Transmission   SETEND. This bit is always read as 0. Do not write 1 to this bit when bus is free. This will cause an abort          after the first byte when a new transfer is started.  This            8217 command  8217  is buffered internally and gets valid after the next byte is          transferred. </description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FDIVCFG</name>
					<description>Fractional Divider Configuration Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>24</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DEC</name>
							<description>Decrement Value of Fractional Divider   DEC. For standard fast mode  see CROSSREFERENCE .</description>
							<lsb>0</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INC</name>
							<description>Increment Value of Fractional Divider   INC. For standard fast mode  see CROSSREFERENCE .</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FDIVHIGHCFG</name>
					<description>Fractional Divider High speed Mode Configuration Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>28</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DEC</name>
							<description>Decrement Value of Fractional Divider   DEC. For high speed mode  see CROSSREFERENCE .</description>
							<lsb>0</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INC</name>
							<description>Increment Value of Fractional Divider   INC. For high speed mode  see CROSSREFERENCE .</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ADDRCFG</name>
					<description>Address Configuration Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>32</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADR</name>
							<description>I2C bus Device Address   ADR. This bit field determines the address of the device when addressed as a slave.  Watch out for reserved addresses by referring to I2C bus spec V2.1.  Depending on setting of TBAM  this is either a 7 bit address  bits  7 1   or a 10 bit address  bits  9 0  .</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TBAM</name>
							<description>Ten Bit Address Mode   TBAM. When this bit is zero  only bits 7 down to 1 of the ADR field are          valid.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GCE</name>
							<description>General Call Enable   GCE</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MCE</name>
							<description>Master Code Enable   MCE</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MnS</name>
							<description>Master   not Slave   MnS</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SONA</name>
							<description>Stop on Not acknowledge   SONA. After successful transmission of a master code  during high speed          mode  SONA is not considered till a stop condition is manually          generated by SETEND.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SOPE</name>
							<description>Stop on Packet End   SOPE. This bit field should be used only in Master Mode. In slave mode         should always be 0. If device works as receiver a not acknowledge is always generated         on package end. After successful transmission of a master code  during high speed         mode  SOPE is not considered till a stop condition is manually generated by SETEND.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUSSTAT</name>
					<description>Bus Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>36</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>BS</name>
							<description>Bus Status   BS. Shows the current status on the I2C bus.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RnW</name>
							<description>Read not Write   RnW. Set by hardware automatically after address byte has been sent received.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FIFOCFG</name>
					<description>FIFO Configuration Register
 resetvalue={Application Reset:0x22}</description>
					<addressOffset>40</addressOffset>
					<size>32</size>
					<resetValue>34</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXBS</name>
							<description>RX Burst Size   RXBS. Some DMA controllers do not support a burst size of 2 words.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXBS</name>
							<description>TX Burst Size   TXBS. Some DMA controllers do not support a burst size of 2 words.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXFA</name>
							<description>RX FIFO Alignment   RXFA. Use byte alignment wherever it is possible.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXFA</name>
							<description>TX FIFO Alignment   TXFA. Use byte alignment wherever it is possible.</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXFC</name>
							<description>RX FIFO Flow Control   RXFC</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXFC</name>
							<description>TX FIFO Flow Control   TXFC</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CRBC</name>
							<description>Clear Request Behavior Configuration   CRBC. Used to configure the clear request behavior for the FIFO data request.        Can only be used for single request and must be set to   8220 0  8221  when burst        accesses are used in the system  eg. when TX RXBS  gt  0 </description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MRPSCTRL</name>
					<description>Maximum Received Packet Size Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>44</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MRPS</name>
							<description>Maximum Received Packet Size   MRPS. Length in characters of packet to be received  write value range  0         unlimited size  to 16383 Reading returns the written value as long as the previous packet has not        been read completely from the FIFO. After that  MRPS is loaded to an        internal register  reading returns 0 and a new value can be written.</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RPSSTAT</name>
					<description>Received Packet Size Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>48</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RPS</name>
							<description>Received Packet Size   RPS. Length in characters of the received packet  0 to 16383 </description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TPSCTRL</name>
					<description>Transmit Packet Size Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>52</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TPS</name>
							<description>Transmit Packet Size   TPS. Length in characters of the transmit packet  write value range  1 to        16383 Reading returns the written value as long as it is not loaded to an        internal counter. After that  reading returns 0 and a new value can be        written.</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FFSSTAT</name>
					<description>Filled FIFO Stages Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>56</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FFS</name>
							<description>Filled FIFO Stages   FFS. Number of filled FIFO stages  0 to 8 </description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMCFG</name>
					<description>Timing Configuration Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>64</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SDA_DEL_HD_DAT</name>
							<description>SDA Delay Stages for Data Hold Time in Standard and Fast modes   SDA DEL HD DAT. SDA delay stages for data hold time in standard and fast modes. SDA delay from SCL falling edge but will also affect SDA Setup time          relative to next SCL rising edge</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HS_SDA_DEL_HD_DAT</name>
							<description>SDA Delay Stages for Data Hold Time in High speed Mode   HS SDA DEL HD DAT. SDA delay stages for data hold time in HS mode. SDA delay from SCL falling edge but will also affect SDA Setup time          relative to next SCL rising edge</description>
							<lsb>6</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SCL_DEL_HD_STA</name>
							<description>SCL Delay Stages for Hold Time Start  Restart  Bit   SCL DEL HD STA</description>
							<lsb>9</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN_SCL_LOW_LEN</name>
							<description>Enable Direct Configuration of SCL Low Period Length in Fast Mode   EN SCL LOW LEN</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FS_SCL_LOW</name>
							<description>Set Fast Mode SCL Low Period Timing   FS SCL LOW. The internal duration of the SCL low time with respect to the period        length as defined by the baudrate setting  can be enlarged for the Fast        Speed Mode  in order to meet the asymmetric duty cycle requirements from        the standard. The detailed formulas are given in the functional specification.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HS_SDA_DEL</name>
							<description>SDA Delay Stages for Start Stop bit in High speed Mode   HS SDA DEL</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SCL_LOW_LEN</name>
							<description>SCL Low Length in Fast Mode   SCL LOW LEN. If enabled by EN SCL LOW LEN setting  this field determines the        extension of the SCL low time. In case of INC  160    160 1  the low time is        extended by the number of kernel clk cycles. In general  there is a more        complex formula  as given in the functional specification. The total period time is not changed  i.e.  the SCL high period is        reduced accordingly. Setting SCL low time to period length or higher is        not supported and would lead to unpredictable results. 00</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRIRQSM</name>
					<description>Error Interrupt Request Source Mask Register
 resetvalue={Application Reset:0x0F}</description>
					<addressOffset>96</addressOffset>
					<size>32</size>
					<resetValue>15</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXF_UFL</name>
							<description>RX FIFO Underflow   RXF UFL</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXF_OFL</name>
							<description>RX FIFO Overflow   RXF OFL</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXF_UFL</name>
							<description>TX FIFO Underflow   TXF UFL</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXF_OFL</name>
							<description>TX FIFO Overflow   TXF OFL</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRIRQSS</name>
					<description>Error Interrupt Request Source Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>100</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXF_UFL</name>
							<description>RX FIFO Underflow   RXF UFL. The FIFO has detected an RX FIFO underflow.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXF_OFL</name>
							<description>RX FIFO Overflow   RXF OFL. The I2C kernel has detected a RX FIFO overflow</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXF_UFL</name>
							<description>TX FIFO Underflow   TXF UFL. The I2C kernel has detected a TX FIFO underflow.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXF_OFL</name>
							<description>TX FIFO Overflow   TXF OFL. The FIFO has detected a TX FIFO overflow.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRIRQSC</name>
					<description>Error Interrupt Request Source Clear Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>104</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXF_UFL</name>
							<description>RX FIFO Underflow   RXF UFL</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RXF_OFL</name>
							<description>RX FIFO Overflow   RXF OFL</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TXF_UFL</name>
							<description>TX FIFO Underflow   TXF UFL</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TXF_OFL</name>
							<description>TX FIFO Overflow   TXF OFL</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PIRQSM</name>
					<description>Protocol Interrupt Request Source Mask Register
 resetvalue={Application Reset:0x7F}</description>
					<addressOffset>112</addressOffset>
					<size>32</size>
					<resetValue>127</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>AM</name>
							<description>Address Match   AM</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GC</name>
							<description>General Call   GC</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MC</name>
							<description>Master Code   MC</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AL</name>
							<description>Arbitration Lost   AL</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NACK</name>
							<description>Not acknowledge Received   NACK</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TX_END</name>
							<description>Transmission End   TX END</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RX</name>
							<description>Receive Mode   RX</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
