J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>PIRQSS</name>
					<description>Protocol Interrupt Request Source Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>116</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>AM</name>
							<description>Address Match   AM. Device  in master or slave mode  is addressed by remote master  matching        device address . Accordingly  bit field BS in register BUSSTAT is set to 11 .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>GC</name>
							<description>General Call   GC. Remote master has transmitted a general call.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MC</name>
							<description>Master Code   MC. Remote master has transmitted a master call.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AL</name>
							<description>Arbitration Lost   AL. Device  master mode  lost the control on the I2C bus due to losing        arbitration procedure. Accordingly  bit field BS in register BUSSTAT is set to 01 .</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>NACK</name>
							<description>Not acknowledge Received   NACK. When working as transmitter this interrupt indicates a not acknowledge        from the remote receiver. The SW has to decide what further steps have        to be taken.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TX_END</name>
							<description>Transmission End   TX END. The device has ended the data transfer properly  after stop condition        has been put on the bus or the MASTER RESTART state has been entered. </description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RX</name>
							<description>Receive Mode   RX. I2C kernel indicates switching from transmitting data to receiving data.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PIRQSC</name>
					<description>Protocol Interrupt Request Source Clear Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>120</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>AM</name>
							<description>Address Match   AM</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>GC</name>
							<description>General Call   GC</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MC</name>
							<description>Master Code   MC</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>AL</name>
							<description>Arbitration Lost   AL</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NACK</name>
							<description>Not acknowledge Received   NACK</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TX_END</name>
							<description>Transmission End   TX END</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RX</name>
							<description>Receive Mode   RX</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RIS</name>
					<description>Raw Interrupt Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>128</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LSREQ_INT</name>
							<description>Last Single Request Interrupt   LSREQ INT</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SREQ_INT</name>
							<description>Single Request Interrupt   SREQ INT</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LBREQ_INT</name>
							<description>Last Burst Request Interrupt   LBREQ INT</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>BREQ_INT</name>
							<description>Burst Request Interrupt   BREQ INT</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>I2C_ERR_INT</name>
							<description>I2C Error Interrupt   I2C ERR INT. This is the combined bit for indication of FIFO errors due to overflow        and underflow.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>I2C_P_INT</name>
							<description>I2C Protocol Interrupt   I2C P INT. This is the combined bit for indication of a protocol event in the I2C        kernel.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IMSC</name>
					<description>Interrupt Mask Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>132</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LSREQ_INT</name>
							<description>Last Single Request Interrupt   LSREQ INT</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SREQ_INT</name>
							<description>Single Request Interrupt   SREQ INT</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LBREQ_INT</name>
							<description>Last Burst Request Interrupt   LBREQ INT</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BREQ_INT</name>
							<description>Burst Request Interrupt   BREQ INT</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>I2C_ERR_INT</name>
							<description>I2C Error Interrupt   I2C ERR INT</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>I2C_P_INT</name>
							<description>I2C Protocol Interrupt   I2C P INT</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MIS</name>
					<description>Masked Interrupt Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>136</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LSREQ_INT</name>
							<description>Last Single Request Interrupt   LSREQ INT</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SREQ_INT</name>
							<description>Single Request Interrupt   SREQ INT</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LBREQ_INT</name>
							<description>Last Burst Request Interrupt   LBREQ INT</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>BREQ_INT</name>
							<description>Burst Request Interrupt   BREQ INT</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>I2C_ERR_INT</name>
							<description>I2C Error Interrupt   I2C ERR INT. This is the combined bit for indication of FIFO errors due to overflow and underflow.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>I2C_P_INT</name>
							<description>I2C Protocol Interrupt   I2C P INT. This is the combined bit for indication of a protocol event in the I2C kernel.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ICR</name>
					<description>Interrupt Clear Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>140</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LSREQ_INT</name>
							<description>Last Single Request Interrupt   LSREQ INT</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SREQ_INT</name>
							<description>Single Request Interrupt   SREQ INT</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LBREQ_INT</name>
							<description>Last Burst Request Interrupt   LBREQ INT</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>BREQ_INT</name>
							<description>Burst Request Interrupt   BREQ INT</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ISR</name>
					<description>Interrupt Set Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>144</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LSREQ_INT</name>
							<description>Last Single Request Interrupt   LSREQ INT</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SREQ_INT</name>
							<description>Single Request Interrupt   SREQ INT</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LBREQ_INT</name>
							<description>Last Burst Request Interrupt   LBREQ INT</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>BREQ_INT</name>
							<description>Burst Request Interrupt   BREQ INT</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>I2C_ERR_INT</name>
							<description>I2C Error Interrupt   I2C ERR INT</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>I2C_P_INT</name>
							<description>I2C Protocol Interrupt   I2C P INT</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXD</name>
					<description>Transmission Data Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>32768</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXD</name>
							<description>Transmission Data   TXD. Characters to be transmitted</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXD</name>
					<description>Reception Data Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>49152</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RXD</name>
							<description>Reception Data   RXD. Received characters</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CLC</name>
					<description>Clock Control Register
 resetvalue={Application Reset:0x3}</description>
					<addressOffset>65536</addressOffset>
					<size>32</size>
					<resetValue>3</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit   DISR. Used for enable disable control of the module.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit   DISS. Bit indicates the current status of the module.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MODID</name>
					<description>Module Identification Register
 resetvalue={Application Reset:0x0C2C000}</description>
					<addressOffset>65540</addressOffset>
					<size>32</size>
					<resetValue>12763136</resetValue>
					<resetMask>4294967040</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision Number   MOD REV. This bit field defines the module revision number. The value of a module revision starts with 01H  first revision .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type   MOD TYPE. The bit field is set to C0H which defines the module as a 32 bit module.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number Value   MOD NUMBER. This bit field defines a module identification number.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPCTL</name>
					<description>General Purpose Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>65544</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PISEL</name>
							<description>Port Input Select   PISEL. Used to select the input pins providing the serial data and clock input        signals  in the range of 0 to 7. In TC39x   not all PISEL          options are available. See Data Sheet.</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
