J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>MSC0</name>
			<version>100</version>
			<description>MSC</description>
			<baseAddress>4026541568</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>256</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CLC</name>
					<description>Clock Control Register
 resetvalue={Application Reset:0x3}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>3</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit   DISR. Used for enable disable control of the module.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit   DISS. Bit indicates the current status of the module.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EDIS</name>
							<description>Sleep Mode Enable Control   EDIS. Used to control module  8217 s sleep mode.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Module Identification Register
 resetvalue={Application Reset:0x28C010}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>2670608</resetValue>
					<resetMask>4294967280</resetMask>
					<fields>
						<field>
							<name>MODREV</name>
							<description>Module Revision Number   MODREV. This bit field defines the module revision number. The value of a module        revision starts with 01 H  first        revision .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODTYPE</name>
							<description>Module Type   MODTYPE. This bit field defines the module as a 32 bit module  C0 H</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODNUM</name>
							<description>Module Number Value   MODNUM. This bit field defines the module identification number for the MSC          0028 H</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FDR</name>
					<description>Fractional Divider Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>12</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>STEP</name>
							<description>Step Value   STEP. Reload or addition value for RESULT.</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DM</name>
							<description>Divider Mode   DM. DM selects normal or fractional divider mode.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RESULT</name>
							<description>Result Value   RESULT. Bit field for the addition result.</description>
							<lsb>16</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ENHW</name>
							<description>Enable Hardware Clock Control   ENHW. Controls operation of ECEN input and DISCLK bit.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISCLK</name>
							<description>Disable Clock   DISCLK. Hardware controlled disable for f MSC signal.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>USR</name>
					<description>Upstream Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>16</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>UFT</name>
							<description>Upstream Channel Frame Type   UFT. This bit determines the frame type used by the upstream channel for data        reception.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>URR</name>
							<description>Upstream Channel Receiving Rate   URR. This bit field determines the baud rate for the upstream channel.</description>
							<lsb>1</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PCTR</name>
							<description>Parity Control   PCTR. This bit determines the parity mode used by the upstream channel for        data reception.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SRDC</name>
							<description>Service Request Delay Control   SRDC. This bit determines the additional delay inserted by the upstream        channel when triggering the receive interrupt. Only the hardware        generated interrupt can be delayed. The software generated interrupt by        writing the ISC.SURDI bit is never delayed.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UC</name>
							<description>Upstream Counter   UC. This bit field indicates the content of the upstream counter that counts the bits during upstream channel reception.</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DSC</name>
					<description>Downstream Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>20</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TM</name>
							<description>Transmission Mode   TM. This bit selects the transmission mode of the downstream channel.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CP</name>
							<description>Command Pending   CP. This bit is set when the downstream command register DC is written. CP        is cleared when the first bit of the related command frame is sent out.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DP</name>
							<description>Data Pending   DP. In Triggered Mode  this bit is set when the set data pending bit ISC.SDP        is set by software. In Data Repetition Mode  this bit is set by hardware        at the last passive time frame. At the start of the data frame  DP is        cleared by hardware.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>NDBL</name>
							<description>Number of SRL Bits Shifted at Data Frames   NDBL. NDBL determines the number of shift register low part  SRL  bits that        are shifted out on SO during a data frame. Other bit combinations are        reserved  do not use these bit combinations.</description>
							<lsb>3</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDBH</name>
							<description>Number of SRH Bits Shifted at Data Frames   NDBH. NDBH determines the number of shift register high part  SRH  bits that        are shifted out on SO during a data frame. Other bit combinations are        reserved  do not use these bit combinations.</description>
							<lsb>8</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSELL</name>
							<description>Enable SRL Active Phase Selection Bit   ENSELL. This bit determines whether a low level selection bit is inserted at the        beginning of a data frame  8217 s SRL active phase.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSELH</name>
							<description>Enable SRH Active Phase Selection Bit   ENSELH. This bit determines whether a low level selection bit is inserted at the        beginning of a data frame  8217 s SRH active phase.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DSDIS</name>
							<description>Downstream Disable   DSDIS. This bit indicates the state of the downstream channel operation.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>NBC</name>
							<description>Number of Bits Shifted at Command Frames   NBC. This bit field determines how many bits of the SRL SRH shift registers        are shifted out during transmission of a command frame.</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PPD</name>
							<description>Passive Phase Length at Data Frames   PPD. This bit field determines the length of the passive phase of a data        frame.</description>
							<lsb>24</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DSS</name>
					<description>Downstream Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>24</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PFC</name>
							<description>Passive Time Frame Counter   PFC. In Data Repetition Mode  this bit field indicates the count of passive        time frames that are currently transmitted. In Triggered Mode PFC        remains at 0000 B .</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>NPTF</name>
							<description>Number Of Passive Time Frames   NPTF. This bit field indicates the number of passive time frames that are        inserted in Data Repetition Mode between two data frames.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DC</name>
							<description>Downstream Counter   DC. This bit field indicates the number of downstream shift clock periods        that have been elapsed since the start of the current frame. DC is reset        at the end of a downstream frame.</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DFA</name>
							<description>Data Frame Active   DFA. This bit indicates if a data frame is currently sent out  active phase only.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CFA</name>
							<description>Command Frame Active   CFA. This bit indicates if a command frame is currently sent out  active phase only.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DD</name>
					<description>Downstream Data Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>28</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DDL</name>
							<description>Downstream Data for SRL Shift Register   DDL. Contains the data bits to be transmitted during the SRL active phase of a data frame.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DDH</name>
							<description>Downstream Data for SRH Shift Register   DDH. Contains the data bits to be transmitted during the SRH active phase of a data frame.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DC</name>
					<description>Downstream Command Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>32</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DCL</name>
							<description>Downstream Command for SRL Shift Register   DCL. Contains the data bits to be transmitted during the SRL active phase of a command frame.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DCH</name>
							<description>Downstream Command for SRH Shift Register   DCH. Contains the data bits to be transmitted during the SRH active phase of a command frame.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DSDSL</name>
					<description>Downstream Select Data Source Low Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>36</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SL0</name>
							<description>Select Source for SRL   SL15. SLx determines which data source is used for the shift register bit SRL x  for data frame transmission.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL1</name>
							<description>Select Source for SRL   SL15. SLx determines which data source is used for the shift register bit SRL x  for data frame transmission.</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL2</name>
							<description>Select Source for SRL   SL15. SLx determines which data source is used for the shift register bit SRL x  for data frame transmission.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL3</name>
							<description>Select Source for SRL   SL15. SLx determines which data source is used for the shift register bit SRL x  for data frame transmission.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL4</name>
							<description>Select Source for SRL   SL15. SLx determines which data source is used for the shift register bit SRL x  for data frame transmission.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL5</name>
							<description>Select Source for SRL   SL15. SLx determines which data source is used for the shift register bit SRL x  for data frame transmission.</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL6</name>
							<description>Select Source for SRL   SL15. SLx determines which data source is used for the shift register bit SRL x  for data frame transmission.</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL7</name>
							<description>Select Source for SRL   SL15. SLx determines which data source is used for the shift register bit SRL x  for data frame transmission.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL8</name>
							<description>Select Source for SRL   SL15. SLx determines which data source is used for the shift register bit SRL x  for data frame transmission.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL9</name>
							<description>Select Source for SRL   SL15. SLx determines which data source is used for the shift register bit SRL x  for data frame transmission.</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL10</name>
							<description>Select Source for SRL   SL15. SLx determines which data source is used for the shift register bit SRL x  for data frame transmission.</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL11</name>
							<description>Select Source for SRL   SL15. SLx determines which data source is used for the shift register bit SRL x  for data frame transmission.</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL12</name>
							<description>Select Source for SRL   SL15. SLx determines which data source is used for the shift register bit SRL x  for data frame transmission.</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL13</name>
							<description>Select Source for SRL   SL15. SLx determines which data source is used for the shift register bit SRL x  for data frame transmission.</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL14</name>
							<description>Select Source for SRL   SL15. SLx determines which data source is used for the shift register bit SRL x  for data frame transmission.</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL15</name>
							<description>Select Source for SRL   SL15. SLx determines which data source is used for the shift register bit SRL x  for data frame transmission.</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DSDSH</name>
					<description>Downstream Select Data Source High Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>40</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SH0</name>
							<description>Select Source for SRH   SH15. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH1</name>
							<description>Select Source for SRH   SH15. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH2</name>
							<description>Select Source for SRH   SH15. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH3</name>
							<description>Select Source for SRH   SH15. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH4</name>
							<description>Select Source for SRH   SH15. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH5</name>
							<description>Select Source for SRH   SH15. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH6</name>
							<description>Select Source for SRH   SH15. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH7</name>
							<description>Select Source for SRH   SH15. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH8</name>
							<description>Select Source for SRH   SH15. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH9</name>
							<description>Select Source for SRH   SH15. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH10</name>
							<description>Select Source for SRH   SH15. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH11</name>
							<description>Select Source for SRH   SH15. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH12</name>
							<description>Select Source for SRH   SH15. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH13</name>
							<description>Select Source for SRH   SH15. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH14</name>
							<description>Select Source for SRH   SH15. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH15</name>
							<description>Select Source for SRH   SH15. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
