J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>ESR</name>
					<description>Emergency Stop Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>44</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ENL0</name>
							<description>Emergency Stop Enable for Bit 15 in SRL   ENL15. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL1</name>
							<description>Emergency Stop Enable for Bit 15 in SRL   ENL15. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL2</name>
							<description>Emergency Stop Enable for Bit 15 in SRL   ENL15. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL3</name>
							<description>Emergency Stop Enable for Bit 15 in SRL   ENL15. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL4</name>
							<description>Emergency Stop Enable for Bit 15 in SRL   ENL15. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL5</name>
							<description>Emergency Stop Enable for Bit 15 in SRL   ENL15. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL6</name>
							<description>Emergency Stop Enable for Bit 15 in SRL   ENL15. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL7</name>
							<description>Emergency Stop Enable for Bit 15 in SRL   ENL15. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL8</name>
							<description>Emergency Stop Enable for Bit 15 in SRL   ENL15. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL9</name>
							<description>Emergency Stop Enable for Bit 15 in SRL   ENL15. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL10</name>
							<description>Emergency Stop Enable for Bit 15 in SRL   ENL15. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL11</name>
							<description>Emergency Stop Enable for Bit 15 in SRL   ENL15. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL12</name>
							<description>Emergency Stop Enable for Bit 15 in SRL   ENL15. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL13</name>
							<description>Emergency Stop Enable for Bit 15 in SRL   ENL15. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL14</name>
							<description>Emergency Stop Enable for Bit 15 in SRL   ENL15. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL15</name>
							<description>Emergency Stop Enable for Bit 15 in SRL   ENL15. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH0</name>
							<description>Emergency Stop Enable for Bit 15 in SRH   ENH15. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH1</name>
							<description>Emergency Stop Enable for Bit 15 in SRH   ENH15. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH2</name>
							<description>Emergency Stop Enable for Bit 15 in SRH   ENH15. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH3</name>
							<description>Emergency Stop Enable for Bit 15 in SRH   ENH15. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH4</name>
							<description>Emergency Stop Enable for Bit 15 in SRH   ENH15. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH5</name>
							<description>Emergency Stop Enable for Bit 15 in SRH   ENH15. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH6</name>
							<description>Emergency Stop Enable for Bit 15 in SRH   ENH15. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH7</name>
							<description>Emergency Stop Enable for Bit 15 in SRH   ENH15. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH8</name>
							<description>Emergency Stop Enable for Bit 15 in SRH   ENH15. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH9</name>
							<description>Emergency Stop Enable for Bit 15 in SRH   ENH15. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH10</name>
							<description>Emergency Stop Enable for Bit 15 in SRH   ENH15. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH11</name>
							<description>Emergency Stop Enable for Bit 15 in SRH   ENH15. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH12</name>
							<description>Emergency Stop Enable for Bit 15 in SRH   ENH15. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH13</name>
							<description>Emergency Stop Enable for Bit 15 in SRH   ENH15. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH14</name>
							<description>Emergency Stop Enable for Bit 15 in SRH   ENH15. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH15</name>
							<description>Emergency Stop Enable for Bit 15 in SRH   ENH15. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>4</dimIncrement>
					<name>UDx[%s]</name>
					<description>Upstream Data Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>48</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description>Received Data   DATA. This bit field contains the 8 bit receive data.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>V</name>
							<description>Valid Bit   V. This bit is set by hardware when the received data is written to UDx. Writing bit C   1 clears V. If hardware setting and software clearing of the valid bit occur simultaneously  bit V will be cleared.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P</name>
							<description>Parity Bit   P. This flag contains the parity bit that has been received with the data frame.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>C</name>
							<description>Clear Bit   C. C is always read as 0.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LABF</name>
							<description>Lower Address Bit Field   LABF. This bit field contains the two address bits A 1 0  of the 4 bit address field  16 bit data frame . If 12 bit data frame is selected  LABF is always set to 00 B .</description>
							<lsb>19</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPF</name>
							<description>Internal Parity Flag   IPF. This bit contains the parity bit that has been calculated in the MSC during data frame reception.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PERR</name>
							<description>Parity Error   PERR. This bit indicates if a start bit error  parity error  or stop bit error occurred during frame reception.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ICR</name>
					<description>Interrupt Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>64</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EDIP</name>
							<description>Data Frame Interrupt Node Pointer   EDIP. EDIP selects the service request output line SRn  n   0 3  for the data frame interrupt.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EDIE</name>
							<description>Data Frame Interrupt Enable   EDIE. This bit field determines the enable conditions for the data frame interrupt.</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ECIP</name>
							<description>Command Frame Interrupt Node Pointer   ECIP. ECIP selects the service request output line SRn  n   0 3  for the command frame interrupt.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ECIE</name>
							<description>Command Frame Interrupt Enable   ECIE. This bit enables the command frame interrupt.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TFIP</name>
							<description>Time Frame Interrupt Pointer   TFIP. TFIP selects the service request output line SRn  n   0 3  for the time frame interrupt.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TFIE</name>
							<description>Time Frame Interrupt Enable   TFIE. This bit enables the time frame interrupt.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RDIP</name>
							<description>Receive Data Interrupt Pointer   RDIP. RDIP selects the service request output line SRn  n   0 3  for the receive data interrupt.</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RDIE</name>
							<description>Receive Data Interrupt Enable   RDIE. This bit field determines the enable conditions for the receive data interrupt.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ISR</name>
					<description>Interrupt Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>68</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DEDI</name>
							<description>Data Frame Interrupt Flag   DEDI. This flag is always set by hardware when a downstream channel data frame        interrupt is generated. DEDI can be set or cleared by software when        writing to register ISC with the appropriate bits ISC.SDEDI or ISC.CDEDI        set.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DECI</name>
							<description>Command Frame Interrupt Flag   DECI. This flag is always set by hardware when a downstream channel command        frame interrupt is generated  whether or not it is enabled. DECI can be        set or cleared by software when writing to register ISC with the        appropriate bits SDECI or CDECI set.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DTFI</name>
							<description>Time Frame Interrupt Flag   DTFI. This flag is always set by hardware when a downstream channel time frame        interrupt is generated  whether or not it is enabled. DTFI can be set or        cleared by software when writing to register ISC with the appropriate        bits SDTFI or CDTFI set.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>URDI</name>
							<description>Receive Data Interrupt Flag   URDI. This flag is always set by hardware when an upstream channel receive        data interrupt is generated  whether or not it is enabled. URDI can be        set or cleared by software when writing to register ISC with the        appropriate bits SURDI or CURDI set.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
