J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>ESRE</name>
					<description>Emergency Stop Extension Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>104</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ENL16</name>
							<description>Emergency Stop Enable for Bit 31 in SRL   ENL31. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit is of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL17</name>
							<description>Emergency Stop Enable for Bit 31 in SRL   ENL31. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit is of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL18</name>
							<description>Emergency Stop Enable for Bit 31 in SRL   ENL31. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit is of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL19</name>
							<description>Emergency Stop Enable for Bit 31 in SRL   ENL31. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit is of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL20</name>
							<description>Emergency Stop Enable for Bit 31 in SRL   ENL31. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit is of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL21</name>
							<description>Emergency Stop Enable for Bit 31 in SRL   ENL31. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit is of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL22</name>
							<description>Emergency Stop Enable for Bit 31 in SRL   ENL31. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit is of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL23</name>
							<description>Emergency Stop Enable for Bit 31 in SRL   ENL31. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit is of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL24</name>
							<description>Emergency Stop Enable for Bit 31 in SRL   ENL31. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit is of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL25</name>
							<description>Emergency Stop Enable for Bit 31 in SRL   ENL31. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit is of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL26</name>
							<description>Emergency Stop Enable for Bit 31 in SRL   ENL31. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit is of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL27</name>
							<description>Emergency Stop Enable for Bit 31 in SRL   ENL31. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit is of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL28</name>
							<description>Emergency Stop Enable for Bit 31 in SRL   ENL31. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit is of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL29</name>
							<description>Emergency Stop Enable for Bit 31 in SRL   ENL31. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit is of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL30</name>
							<description>Emergency Stop Enable for Bit 31 in SRL   ENL31. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit is of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL31</name>
							<description>Emergency Stop Enable for Bit 31 in SRL   ENL31. This bit enables the emergency stop feature selectively for each SRL bit. If the emergency stop condition is met and enabled  ENLx   1   the SRL x  bit is of the data register DD.DDL x  is used for the shift register load operation.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH16</name>
							<description>Emergency Stop Enable for Bit 31 in SRH   ENH31. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH17</name>
							<description>Emergency Stop Enable for Bit 31 in SRH   ENH31. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH18</name>
							<description>Emergency Stop Enable for Bit 31 in SRH   ENH31. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH19</name>
							<description>Emergency Stop Enable for Bit 31 in SRH   ENH31. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH20</name>
							<description>Emergency Stop Enable for Bit 31 in SRH   ENH31. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH21</name>
							<description>Emergency Stop Enable for Bit 31 in SRH   ENH31. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH22</name>
							<description>Emergency Stop Enable for Bit 31 in SRH   ENH31. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH23</name>
							<description>Emergency Stop Enable for Bit 31 in SRH   ENH31. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH24</name>
							<description>Emergency Stop Enable for Bit 31 in SRH   ENH31. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH25</name>
							<description>Emergency Stop Enable for Bit 31 in SRH   ENH31. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH26</name>
							<description>Emergency Stop Enable for Bit 31 in SRH   ENH31. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH27</name>
							<description>Emergency Stop Enable for Bit 31 in SRH   ENH31. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH28</name>
							<description>Emergency Stop Enable for Bit 31 in SRH   ENH31. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH29</name>
							<description>Emergency Stop Enable for Bit 31 in SRH   ENH31. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH30</name>
							<description>Emergency Stop Enable for Bit 31 in SRH   ENH31. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH31</name>
							<description>Emergency Stop Enable for Bit 31 in SRH   ENH31. This bit enables the emergency stop feature selectively for each SRH bit. If the emergency stop condition is met and enabled  ENHx   1   the SRH x  bit of the data register DD.DDH x  is used for the shift register load operation.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DSTE</name>
					<description>Downstream Timing Extension Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>108</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PPDE</name>
							<description>Passive Phase Length at Data Frames Extension   PPDE. Additional MSB bits extension of the PPD bit field.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PPCE</name>
							<description>Passive Phase Length at Control Frames Extension   PPCE. Additional MSB bits extension of the fixed length of 2 of the command        frames passive phase. The final length is 2  160    160 PPCE resulting in a range        of 2 to 65.</description>
							<lsb>2</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDD</name>
							<description>N Divider Downstream   NDD. Defines the division ratio in the range of 1 to 16.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PPCEM</name>
							<description>PPCE Extension Bit on the MSB Side   PPCEM. This bit is the MSB extension bit for the PPCE bit field  extending        command frame passive phase to the value of 127. The values of 128 and        129 are not allowed.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FM</name>
							<description>Fast Mode   FM. Activates the fast mode and writing to the ABRA FIFO with 100  160 MBaud        input baud rate  in order to provide 80MBaud output baud rate. It is        also recommended for baud rate of 26 67  160 MBaud  as defined in the CROSSREFERENCE .        FM 0 is the compatibility setting with the previous generations of the        MSC.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CX</name>
							<description>Command Extension Mode   CX. Activates 64 bit command frame feature.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UL1</name>
							<description>Unlock CX and FM for one write access   UL1. Write access with UL1  160    160 1 unlocks the CX and FM bit fields for the        current write access. Write accesses to these bit fields with UL1  160    160 0 do        not have any effect. Returns zero on read.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DDM</name>
					<description>Downstream Data Mirror Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>112</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DDLM</name>
							<description>Downstream Data Mirror for SRL Shift Register   DDLM. Contains the data bits to be transmitted during the SRL active phase of        a data frame.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>DDHM</name>
							<description>Downstream Data Mirror for SRH Shift Register   DDHM. Contains the data bits to be transmitted during the SRH active phase of        a data frame.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DDE</name>
					<description>Downstream Data Extension Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>116</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DDLE</name>
							<description>Downstream Data Extension for SRL Shift Register   DDLE. Contains the data bits to be transmitted during the SRL active phase of        a data frame.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DDHE</name>
							<description>Downstream Data Extension for SRH Shift Register   DDHE. Contains the data bits to be transmitted during the SRH active phase of        a data frame.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DCM</name>
					<description>Downstream Command Mirror Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>120</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DCLM</name>
							<description>Downstream Command Mirror of the DC.DCL Bit Field   DCLM. Contains alternate write location for the command bits to be transmitted during the SRL active phase of a command frame.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>DCHM</name>
							<description>Downstream Command Mirror of the DC.DCH Bit Field   DCHM. Contains the alternate write location for the command bits to be transmitted during the SRH active phase of a command frame.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DCE</name>
					<description>Downstream Command Extension Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>124</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DCEH</name>
							<description>Downstream Command Extension for SRH Shift Register   DCEH. Contains the data bits to be transmitted during the second half of the command frame in CX mode.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
