J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>ISC</name>
					<description>Interrupt Set Clear Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>72</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CDEDI</name>
							<description>Clear DEDI Flag   CDEDI</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CDECI</name>
							<description>Clear DECI Flag   CDECI</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CDTFI</name>
							<description>Clear DTFI Flag   CDTFI</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CURDI</name>
							<description>Clear URDI Flag   CURDI</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CDP</name>
							<description>Clear DP Flag   CDP</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CCP</name>
							<description>Clear CP Flag   CCP</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CDDIS</name>
							<description>Clear DSDIS Flag   CDDIS</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SDEDI</name>
							<description>Set DEDI Flag   SDEDI</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SDECI</name>
							<description>Set DECI Flag   SDECI</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SDTFI</name>
							<description>Set DTFI Flag   SDTFI</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SURDI</name>
							<description>Set URDI Flag   SURDI</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SDP</name>
							<description>Set DP Bit   SDP</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SCP</name>
							<description>Set CP Flag   SCP</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SDDIS</name>
							<description>Set DSDIS Flag   SDDIS</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OCR</name>
					<description>Output Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>76</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CLP</name>
							<description>FCLP Line Polarity   CLP</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SLP</name>
							<description>SOP Line Polarity   SLP</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CSLP</name>
							<description>Chip Selection Lines Polarity   CSLP. Bit CSLP is buffered during a frame transmission. This means that any        change of CSLP becomes valid first with the start of the next frame        transmission.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ILP</name>
							<description>SDI Line Polarity   ILP</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKCTRL</name>
							<description>Clock Control   CLKCTRL. This bit determines the activation of clock output FCL.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CSL</name>
							<description>Chip Enable Selection for ENL   CSL. This bit field selects the chip enable output ENx that becomes active        during the SRL active phase  ENL  160    160 1  of a data frame. The active level        of ENx is defined by bit CSLP.</description>
							<lsb>9</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CSH</name>
							<description>Chip Enable Selection for ENH   CSH. This bit field selects the chip enable output ENx that becomes active        during the SRH active phase  ENH  160    160 1  of a data frame. The active level        of ENx is defined by bit CSLP.</description>
							<lsb>11</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CSC</name>
							<description>Chip Enable Selection for ENC   CSC. This bit field selects the chip enable output ENx that becomes active        during the active phase  ENC  160    160 1  of a command frame. The active level        of ENx is defined by bit CSLP.</description>
							<lsb>13</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SDISEL</name>
							<description>Serial Data Input Selection   SDISEL. This bit field selects the source for the serial data input SDI of the        upstream channel.</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DSCE</name>
					<description>Downstream Control Enhanced Register 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>88</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>NDBHE</name>
							<description>Number of SRH Bits Shifted at Data Frames Extension   NDBHE. Additional MSB bit extension of the NDBH bit field. Adds 16 to the        resulting NDBH value if set.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDBLE</name>
							<description>Number of SRL Bits Shifted at Data Frames Extension   NDBLE. Additional MSB bit extension of the NDBL bit field. Adds 16 to the        resulting NDBL value if set.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EXEN</name>
							<description>Extension Enable   EXEN. Enables the extension bit fields.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CCF</name>
							<description>Command Command Flag   CCF. This bit flags that a second command frame has been written without data        frame to be sent in between. It is active only if CDCM 1. Otherwise it        is always low.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>INJENP0</name>
							<description>Injection Enable of the Pin 0 Signal   INJENP0. This bit selects if an external signal is injected in a data frame.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INJPOSP0</name>
							<description>Injection Position of the Pin 0 Signal   INJPOSP0. This bit selects the position of the injected external one bit signal         at the bit position in range of 0 to 63 in the data frame. If both PIN0POS and PIN1POS point to a same bit  PIN0POS has the higher        priority  that is PIN0 level will be visible in the data frame.</description>
							<lsb>17</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INJENP1</name>
							<description>Injection Enable of the Pin 1 Signal   INJENP1. This bit selects if an external signal is injected in a data frame.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INJPOSP1</name>
							<description>Injection Position of the Pin 1 Signal   INJPOSP1. This bit selects the position of the injected external one bit signal         at the bit position in range of 0 to 63 in the data frame.</description>
							<lsb>25</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CDCM</name>
							<description>Command Data Command in Data Repetition Mode   CDCM. This bit selects if a data frame is automatically inserted between two        consecutive command frame requests.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>USCE</name>
					<description>Upstream Control Enhanced Register 1
 resetvalue={Application Reset:0x0FF}</description>
					<addressOffset>92</addressOffset>
					<size>32</size>
					<resetValue>255</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>USTOPRE</name>
							<description>Upstream Time out Prescaler   USTOPRE. Prescaler for the upstream time out limit. Expressed in upstream bit        times. 2 n divider in the range of 1        to 16384. Write to this bit field triggers new start of the watchdog timer.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>USTOVAL</name>
							<description>Upstream Time out Value   USTOVAL. Upstream time out value for the N divider in the range of 1 to 16         expressed in number of upstream bit time lengths  the upstream bit time        is the reciprocal value of the upstream baud rate . Time out   BitTime          2  USTOPRE 1     USTOVAL 1 . Write to this bit field triggers new start of the watchdog timer.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>USTOEN</name>
							<description>Upstream Time out Interrupt Enable   USTOEN. Enable bit for the upstream time out interrupt. The Time out counter runs continuously independently of the USTOEN bit. The USTOEN enables only the interrupt generation.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>USTF</name>
							<description>Upstream Time out Flag   USTF. Signals an upstream timer event. If set by software  the interrupt is also triggered  if enabled. The watchdog timer runs continuously and sets the USTF flag at overflow  independently from the enable bit. Therefore this bit must be cleared with the same write access which enables the interrupt.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>USTC</name>
							<description>Upstream Time out Clear   USTC. Clears the USTF flag. Write only bit  reads as 0.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>USTS</name>
							<description>Upstream Time out Set   USTS. Sets the USTF flag. Write only bit  reads as 0.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>UTASR</name>
							<description>Upstream Time out Alternate Service Request   UTASR. Selects if the interrupt signal is routed to the alternate service request node. See CROSSREFERENCE .</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>USTOIP</name>
							<description>Upstream Time out Interrupt Node Pointer   USTOIP. USTOIP selects the service request output line SRn  n   0 3  for the time out interrupt.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DSDSLE</name>
					<description>Downstream Select Data Source Low Extension Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>96</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SL16</name>
							<description>Select Source for SRL   SL31. SLx determines which data source is used for the shift register bit SRL x  during data frame transmission.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL17</name>
							<description>Select Source for SRL   SL31. SLx determines which data source is used for the shift register bit SRL x  during data frame transmission.</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL18</name>
							<description>Select Source for SRL   SL31. SLx determines which data source is used for the shift register bit SRL x  during data frame transmission.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL19</name>
							<description>Select Source for SRL   SL31. SLx determines which data source is used for the shift register bit SRL x  during data frame transmission.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL20</name>
							<description>Select Source for SRL   SL31. SLx determines which data source is used for the shift register bit SRL x  during data frame transmission.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL21</name>
							<description>Select Source for SRL   SL31. SLx determines which data source is used for the shift register bit SRL x  during data frame transmission.</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL22</name>
							<description>Select Source for SRL   SL31. SLx determines which data source is used for the shift register bit SRL x  during data frame transmission.</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL23</name>
							<description>Select Source for SRL   SL31. SLx determines which data source is used for the shift register bit SRL x  during data frame transmission.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL24</name>
							<description>Select Source for SRL   SL31. SLx determines which data source is used for the shift register bit SRL x  during data frame transmission.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL25</name>
							<description>Select Source for SRL   SL31. SLx determines which data source is used for the shift register bit SRL x  during data frame transmission.</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL26</name>
							<description>Select Source for SRL   SL31. SLx determines which data source is used for the shift register bit SRL x  during data frame transmission.</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL27</name>
							<description>Select Source for SRL   SL31. SLx determines which data source is used for the shift register bit SRL x  during data frame transmission.</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL28</name>
							<description>Select Source for SRL   SL31. SLx determines which data source is used for the shift register bit SRL x  during data frame transmission.</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL29</name>
							<description>Select Source for SRL   SL31. SLx determines which data source is used for the shift register bit SRL x  during data frame transmission.</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL30</name>
							<description>Select Source for SRL   SL31. SLx determines which data source is used for the shift register bit SRL x  during data frame transmission.</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL31</name>
							<description>Select Source for SRL   SL31. SLx determines which data source is used for the shift register bit SRL x  during data frame transmission.</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DSDSHE</name>
					<description>Downstream Select Data Source High Extension Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>100</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SH16</name>
							<description>Select Source for SRH   SH31. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH17</name>
							<description>Select Source for SRH   SH31. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH18</name>
							<description>Select Source for SRH   SH31. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH19</name>
							<description>Select Source for SRH   SH31. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH20</name>
							<description>Select Source for SRH   SH31. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH21</name>
							<description>Select Source for SRH   SH31. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH22</name>
							<description>Select Source for SRH   SH31. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH23</name>
							<description>Select Source for SRH   SH31. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH24</name>
							<description>Select Source for SRH   SH31. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH25</name>
							<description>Select Source for SRH   SH31. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH26</name>
							<description>Select Source for SRH   SH31. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH27</name>
							<description>Select Source for SRH   SH31. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH28</name>
							<description>Select Source for SRH   SH31. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH29</name>
							<description>Select Source for SRH   SH31. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH30</name>
							<description>Select Source for SRH   SH31. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SH31</name>
							<description>Select Source for SRH   SH31. SHx determines which data source is used for the shift register bit SRH x  during data frame transmission.</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
