J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>CAN0</name>
			<version>100</version>
			<description>CAN</description>
			<baseAddress>4028628992</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>37120</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<cluster>
					<dim>4</dim>
					<dimIncrement>1024</dimIncrement>
					<name>N[%s]</name>
					<description>N</description>
					<addressOffset>33024</addressOffset>
					<register>
						<name>ACCENNODEi0</name>
						<description>Access Enable Register CAN Node 0 0
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>4294967295</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>EN0</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN1</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN2</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN3</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN4</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN5</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN6</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN7</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN8</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN9</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN10</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN11</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN12</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN13</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN14</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN15</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN16</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN17</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN18</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN19</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN20</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN21</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN22</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN23</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN24</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN25</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN26</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN27</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN28</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN29</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN30</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN31</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID y</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>STARTADRi</name>
						<description>Start Address Node 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>START</name>
								<description>Message RAM start   START. The address within the RAM area of the MCMCAN          of node i  where the message RAM to be protected starts</description>
								<lsb>2</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ENDADRi</name>
						<description>End Address Node 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>12</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>END</name>
								<description>Message RAM end   END. The address within the RAM area of the MCMCAN          of node i  where the message RAM to be protected ends</description>
								<lsb>2</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ISREGi</name>
						<description>Interrupt Signalling Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>16</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>REINT</name>
								<description>A message stored in a receive buffer interrupt   REINT</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RxF1F</name>
								<description>Receive FIFO1 is full interrupt   RxF1F</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RxF0F</name>
								<description>Receive FIFO0 is full interrupt   RxF0F</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RxF1N</name>
								<description>Receive FIFO1 got a new message interrupt   RxF1N</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RxF0N</name>
								<description>Receive FIFO0 got a new message interrupt   RxF0N</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RETI</name>
								<description>A receive timeout event interrupt   RETI</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TRAQ</name>
								<description>A transmission queue event interrupt   TRAQ</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TRACO</name>
								<description>A transmission control event interrupt   TRACO</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TEFIFO</name>
								<description>A Transmit Event FIFO Incident interrupt   TEFIFO</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>HPE</name>
								<description>A high priority event interrupt   HPE</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>WATI</name>
								<description>A watermark interrupt has been reached   WATI</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ALRT</name>
								<description>An alert interrupt   ALRT</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>MOER</name>
								<description>Module error interrupt   MOER</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SAFE</name>
								<description>The safety counter interrupt ELO   SAFE</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>BOFF</name>
								<description>Bus Off Interrupt   BOFF</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>LOI</name>
								<description>Last Error Interrupt   LOI</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GRINT1i</name>
						<description>Interrupt routing for Groups 1 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>20</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TEFIFO</name>
								<description>Transmit Event FIFO Incidents   TEFIFO. are mapped here. IR.TEFF  Transmit Event FIFO Full  and IR.TEFN         Transmit Event FIFO New Entry </description>
								<lsb>0</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>HPE</name>
								<description>High Priority Events   HPE. are mapped here  giving IR.HPM an interrupt level</description>
								<lsb>4</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WATI</name>
								<description>Watermark interrupts   WATI. are mapped here  IR.TEFW  Transmit FIFO warning interrupt reached          IR.RF1W  Receive FIFO 1 warning interrupt reached . IR.RF0W  Receive        FIFO 0 warning interrupt reached </description>
								<lsb>8</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ALRT</name>
								<description>ALERTS   ALRT. All kind of alerts are mapped here. IR.EW  warning status   IR.EP  error        passive   IR.TSW  timestamp wrap around   IR.TEFL  Transmit Event FIFO        Element Lost   IR.RF0L  Receive FIFO 0 Message Lost   IR.RF1L  Receive        FIFO 1 Message Lost . The        following TTCAN error messages and warnings are also shown here  TTIR.        CER  Configuration Error   TTIR.AW Application Watchdog  TTIR.WT  Watch        Trigger   TTIR.IWT Initialization Watch Trigger  TTIR.ELC  Error Level        Changed   TTIR.SE2  Scheduling Error 2   TTIR.SE1  Scheduling Error          TTIR.TXO  Tx Count Overflow   TTIR.TXU  TX Count Underflow   TTIR.GTE         Global Time Error   TTIR.GTD  Global Time Discontinuity  and TTIR.GTW         Global Time Wrap </description>
								<lsb>12</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MOER</name>
								<description>Module errors   MOER. IR.WDI  watchdog interrupt  and IR.MRAF  message RAM access failure  are        mapped here.</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SAFE</name>
								<description>Safety counter overflow   SAFE. The interrupt node for IR.ELO showing a safety counter overflow</description>
								<lsb>20</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BOFF</name>
								<description>Bus Off has been reached   BOFF. Mapped to IRi.BO flag indication the change in Bus Off status. To get        out of bus off  the CCCRn.INIT bit has to be reset.</description>
								<lsb>24</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>LOI</name>
								<description>Last Error Interrupts   LOI. The interrupt sources IR.PED  Protocol Error in Data Phase  and IR.PEA         Protocol Error in Arbitration Phase  are signalled here.</description>
								<lsb>28</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GRINT2i</name>
						<description>Interrupt routing for Groups 2 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>24</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>REINT</name>
								<description>Message stored in dedicated receive buffer interrupt  IR.DRX    REINT. is assigned to interrupt node.</description>
								<lsb>0</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RxF1F</name>
								<description>IR.RF1F   RxF1F. Receive FIFO1 full interrupt assigned to an interrupt node</description>
								<lsb>4</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RxF0F</name>
								<description>IR.RF0F   RxF0F. Receive FIFO0 full interrupt assigned to an interrupt node</description>
								<lsb>8</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RxF1N</name>
								<description>IR.RF1N   RxF1N. Receive FIFO1 new message assigned to an interrupt node</description>
								<lsb>12</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RxF0N</name>
								<description>IR.RF0N   RxF0N. Receive FIFO0 new message assigned to an interrupt node</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RETI</name>
								<description>Receive Timeouts   RETI. can be assigned here. IR.TOO  time out event  and TE  Timer Event </description>
								<lsb>20</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRAQ</name>
								<description>Transmission Queue Events   TRAQ. can be assigned here. IR.TFE Transmission FIFO Empty</description>
								<lsb>24</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRACO</name>
								<description>Interrupts of the transmission control   TRACO. can be assigned here. IR.TCF  Transmission Cancellation Finished  and        IR.TF  Transmission Completed . As        an additional information the copy of a local time event is shown here        with TTIR.SWT  Stop Watch Event . Further on the TTIR.TTMI Trigger Time        Event Internal  TTIR.RTMI  Register Time Mark   TTIR.SOG  Start of Gap          TTIR.CSM  Change of Synchronization Mode   TTIR.SMC  Start Matrix Cycle         and TTIR.SBC  Start of Basic Cycle  are shown here.</description>
								<lsb>28</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
