J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>ECRi</name>
						<description>Error Counter Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>320</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TEC</name>
								<description>Transmit Error Counter   TEC. Actual state of the Transmit Error Counter  values between 0 and 255 When CCCR.ASM is set  the CAN protocol controller does not increment          TEC and REC when a CAN protocol error is detected  but CEL is still          incremented.</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>REC</name>
								<description>Receive Error Counter   REC. Actual state of the Receive Error Counter  values between 0 and 127 When CCCR.ASM is set  the CAN protocol controller does not increment          TEC and REC when a CAN protocol error is detected  but CEL is still          incremented.</description>
								<lsb>8</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RP</name>
								<description>Receive Error Passive   RP</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CEL</name>
								<description>CAN Error Logging   CEL. The counter is incremented each time when a CAN protocol error causes        the Transmit Error Counter or the Receive Error Counter to be        incremented. It is reset by read access to CEL. The counter stops at        0xFF  the next increment of TEC or REC sets interrupt flag IR.ELO. The counter is reset on read  if the bit NPCRi.DELE is set for the node.</description>
								<lsb>16</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>PSRi</name>
						<description>Protocol Status Register 0
 resetvalue={Application Reset:0x707}</description>
						<addressOffset>324</addressOffset>
						<size>32</size>
						<resetValue>1799</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>LEC</name>
								<description>Last Error Code   LEC. The LEC indicates the type of the last error to occur on the CAN bus.        This field will be cleared to   8216 0  8217  when a message has been transferred         reception or transmission  without error. This bit field is set to 0x7        on read  if NPCRi.DELE is set. The Bus Off recovery sequence  see ISO11898 1  cannot be shortened by          setting or resetting CCCR.INIT. If the device goes Bus Off  it will          set CCCR.INIT of its own accord  stopping all bus activities. Once          CCCR.INIT has been cleared by the CPU  the device will then wait for          129 occurrences of Bus Idle  129   11 consecutive recessive bits           before resuming normal operation. At the end of the Bus Off recovery          sequence  the Error Management Counters will be reset. During the          waiting time after the resetting of CCCR.INIT  each time a sequence of          11 recessive bits has been monitored  a Bit0Error code is written to          PSR.LEC  enabling the CPU to readily check up whether the CAN bus is          stuck at dominant or continuously disturbed and to monitor the Bus Off          recovery sequence. ECR.REC is used to count these sequences.</description>
								<lsb>0</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ACT</name>
								<description>Activity   ACT. Monitors the module s CAN communication state. ACT is set to  00  by a Protocol Exception Event.</description>
								<lsb>3</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>EP</name>
								<description>Error Passive   EP</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>EW</name>
								<description>Warning Status   EW</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>BO</name>
								<description>Bus Off Status   BO</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>DLEC</name>
								<description>Data Phase Last Error Code   DLEC. Type of last error that occurred in the data phase of a CAN FD format        frame with its BRS flag set. Coding is the same as for LEC. This field        will be cleared to zero when a CAN FD format frame with its BRS flag set        has been transferred  reception or transmission  without error. This bit        field is set to 0x7 on read  if NPCRi.DELE is set. When a frame in CAN FD format has reached the data phase with BRS flag          set  the next CAN event  error or valid frame  will be shown in DLEC          instead of LEC. An error in a fixed stuff bit of a CAN FD CRC sequence          will be shown as a Form Error  not Stuff Error.</description>
								<lsb>8</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RESI</name>
								<description>ESI flag of last received CAN FD Message   RESI. This bit is set together with REDF  independent of acceptance filtering. This bit is reset after read access  if NPCRi.DELE is set.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RBRS</name>
								<description>BRS flag of last received CAN FD Message   RBRS. This bit is set together with REDF  independent of acceptance filtering. This bit is reset after read access  if NPCRi.DELE is set.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RFDF</name>
								<description>Received a CAN FD Message   RFDF. This bit is set independent of acceptance filtering. This bit is reset after read access  if NPCRi.DELE is set.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>PXE</name>
								<description>Protocol Exception Event   PXE. This bit is reset after read access  if NPCRi.DELE is set.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TDCV</name>
								<description>Transmitter Delay Compensation Value   TDCV. Position of the secondary sample point  defined by the sum of the        measured delay from TX to RX and TDCR.TDCO. The SSP position is  in the        data phase  the number of mtq between the start of the transmitted bit        and the secondary sample point. Valid values are 0 to 127 mtq.</description>
								<lsb>16</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TDCRi</name>
						<description>Transmitter Delay Compensation Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>328</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TDCF</name>
								<description>Transmitter Delay Compensation Filter Window Length   TDCF. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Defines the minimum value for the Secondary Sample        Point position  dominant edges on RX that would result in an earlier        Secondary Sample Point position are ignored for transmitter delay        measurement. This feature is enabled when TDCF is configured to a value        greater than TDCO. Valid values are from 0 to 127 mtq.</description>
								<lsb>0</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TDCO</name>
								<description>Transmitter Delay Compensation Offset   TDCO. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Offset value defining the distance between the        measured delay from TX to RX and the secondary sample point. Valid        values are 0 to 127 mtq. The duration of one mtq is equal to the fASYNi        clock period.</description>
								<lsb>8</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>IRi</name>
						<description>Interrupt Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>336</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RF0N</name>
								<description>Rx FIFO 0 New Message   RF0N</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RF0W</name>
								<description>Rx FIFO 0 Watermark Reached   RF0W</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RF0F</name>
								<description>Rx FIFO 0 Full   RF0F</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RF0L</name>
								<description>Rx FIFO 0 Message Lost   RF0L</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RF1N</name>
								<description>Rx FIFO 1 New Message   RF1N</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RF1W</name>
								<description>Rx FIFO 1 Watermark Reached   RF1W</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RF1F</name>
								<description>Rx FIFO 1 Full   RF1F</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RF1L</name>
								<description>Rx FIFO 1 Message Lost   RF1L</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>HPM</name>
								<description>High Priority Message   HPM</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TC</name>
								<description>Transmission Completed   TC</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TCF</name>
								<description>Transmission Cancellation Finished   TCF</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TFE</name>
								<description>Tx FIFO Empty   TFE</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TEFN</name>
								<description>Tx Event FIFO New Entry   TEFN</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TEFW</name>
								<description>Tx Event FIFO Watermark Reached   TEFW</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TEFF</name>
								<description>Tx Event FIFO Full   TEFF</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TEFL</name>
								<description>Tx Event FIFO Element Lost   TEFL</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TSW</name>
								<description>Timestamp Wraparound   TSW</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MRAF</name>
								<description>Message RAM Access Failure   MRAF. The flag is set  when the Rx Handler has not completed acceptance filtering or storage of an accepted          message until the arbitration field of the following message has been          received. In this case acceptance filtering or message storage is          aborted and the Rx Handler starts processing of the following message. was not able to write a message to the Message RAM. In this case          message storage is aborted. In both cases the FIFO put index is not updated resp. the New Data flag        for a dedicated Rx Buffer is not set  a partly stored message is        overwritten when the next message is stored to this location. The flag is also set when the Tx Handler was not able to read a message        from the Message RAM in time. In this case message transmission is        aborted. In case of a Tx Handler access failure the M CAN is switched into Restricted Operation Mode. To leave Restricted        Operation Mode  the Host CPU has to reset CCCR.ASM.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TOO</name>
								<description>Timeout Occurred   TOO</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DRX</name>
								<description>Message stored to Dedicated Rx Buffer   DRX. The flag is set whenever a received message has been stored into a        dedicated Rx Buffer.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ELO</name>
								<description>Error Logging Overflow   ELO</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EP</name>
								<description>Error Passive   EP</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EW</name>
								<description>Warning Status   EW</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BO</name>
								<description>Bus Off Status   BO</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WDI</name>
								<description>Watchdog Interrupt   WDI</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PEA</name>
								<description>Protocol Error in Arbitration Phase   PEA.  Nominal Bit Time is used </description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PED</name>
								<description>Protocol Error in Data Phase   PED.  Data Bit Time is used </description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>IEi</name>
						<description>Interrupt Enable 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>340</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RF0NE</name>
								<description>Rx FIFO 0 New Message Interrupt Enable   RF0NE</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RF0WE</name>
								<description>Rx FIFO 0 Watermark Reached Interrupt Enable   RF0WE</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RF0FE</name>
								<description>Rx FIFO 0 Full Interrupt Enable   RF0FE</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RF0LE</name>
								<description>Rx FIFO 0 Message Lost Interrupt Enable   RF0LE</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RF1NE</name>
								<description>Rx FIFO 1 New Message Interrupt Enable   RF1NE</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RF1WE</name>
								<description>Rx FIFO 1 Watermark Reached Interrupt Enable   RF1WE</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RF1FE</name>
								<description>Rx FIFO 1 Full Interrupt Enable   RF1FE</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RF1LE</name>
								<description>Rx FIFO 1 Message Lost Interrupt Enable   RF1LE</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>HPME</name>
								<description>High Priority Message Interrupt Enable   HPME</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TCE</name>
								<description>Transmission Completed Interrupt Enable   TCE</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TCFE</name>
								<description>Transmission Cancellation Finished Interrupt Enable   TCFE</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TFEE</name>
								<description>Tx FIFO Empty Interrupt Enable   TFEE</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TEFNE</name>
								<description>Tx Event FIFO New Entry Interrupt Enable   TEFNE</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TEFWE</name>
								<description>Tx Event FIFO Watermark Reached Interrupt Enable   TEFWE</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TEFFE</name>
								<description>Tx Event FIFO Full Interrupt Enable   TEFFE</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TEFLE</name>
								<description>Tx Event FIFO Element Lost Interrupt Enable   TEFLE</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TSWE</name>
								<description>Timestamp Wraparound Interrupt Enable   TSWE</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MRAFE</name>
								<description>Message RAM Access Failure Interrupt Enable   MRAFE</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TOOE</name>
								<description>Timeout Occurred Interrupt Enable   TOOE</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DRXE</name>
								<description>Message stored to Dedicated Rx Buffer Interrupt Enable   DRXE</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ELOE</name>
								<description>Error Logging Overflow Interrupt Enable   ELOE</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EPE</name>
								<description>Error Passive Interrupt Enable   EPE</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EWE</name>
								<description>Warning Status Interrupt Enable   EWE</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BOE</name>
								<description>Bus Off Status Interrupt Enable   BOE</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WDIE</name>
								<description>Watchdog Interrupt Enable   WDIE</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PEAE</name>
								<description>Protocol Error in Arbitration Phase Enable   PEAE</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PEDE</name>
								<description>Protocol Error in Data Phase Enable   PEDE</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>GFCi</name>
						<description>Global Filter Configuration 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>384</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RRFE</name>
								<description>Reject Remote Frames Extended   RRFE. This bitfield is CCE and INIT protected. Writes will only have effect  if both bits are set.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RRFS</name>
								<description>Reject Remote Frames Standard   RRFS. This bitfield is CCE and INIT protected. Writes will only have effect  if both bits are set.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ANFE</name>
								<description>Accept Non matching Frames Extended   ANFE. This bitfield is CCE and INIT protected. Writes will only have effect  if both bits are set. Defines how received messages with 29 bit IDs that do not match any element of the filter list are treated.</description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ANFS</name>
								<description>Accept Non matching Frames Standard   ANFS. This bitfield is CCE and INIT protected. Writes will only have effect  if both bits are set. Defines how received messages with 11 bit IDs that do not match any element of the filter list are treated.</description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
