J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>SIDFCi</name>
						<description>Standard ID Filter Configuration 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>388</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>FLSSA</name>
								<description>Filter List Standard Start Address   FLSSA. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Start address of standard Message ID filter list  32 bit word address .</description>
								<lsb>2</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>LSS</name>
								<description>List Size Standard   LSS. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set.</description>
								<lsb>16</lsb>
								<msb>23</msb>
								<access>read-write</access>
								<enumeratedValues>
									<enumeratedValue>
										<name>rest255</name>
										<description>128 Message ID filter elements</description>
										<value>255</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
						</fields>
					</register>
					<register>
						<name>XIDFCi</name>
						<description>Extended ID Filter Configuration 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>392</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>FLESA</name>
								<description>Filter List Extended Start Address   FLESA. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Start address of extended Message ID filter list  32 bit word addess .</description>
								<lsb>2</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>LSE</name>
								<description>List Size Extended   LSE. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set.</description>
								<lsb>16</lsb>
								<msb>22</msb>
								<access>read-write</access>
								<enumeratedValues>
									<enumeratedValue>
										<name>rest127</name>
										<description>64 extended Message ID filter elements</description>
										<value>127</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
						</fields>
					</register>
					<register>
						<name>XIDAMi</name>
						<description>Extended ID AND Mask 0
 resetvalue={Application Reset:0x1FFFFFFF}</description>
						<addressOffset>400</addressOffset>
						<size>32</size>
						<resetValue>536870911</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>EIDM</name>
								<description>Extended ID Mask   EIDM. This bitfield is CCE and INIT protected. Writes will only have effect  if both bits are set. For acceptance filtering of extended frames the Extended ID AND Mask is ANDed with the Message ID of a received frame. Intended for masking of 29 bit IDs in SAE J1939. With the reset value of all bits set to one the mask is not active.</description>
								<lsb>0</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>HPMSi</name>
						<description>High Priority Message Status 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>404</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>BIDX</name>
								<description>Buffer Index   BIDX. Index of Rx FIFO element to which the message was stored. Only valid when MSI 1     1 .</description>
								<lsb>0</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>MSI</name>
								<description>Message Storage Indicator   MSI</description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>FIDX</name>
								<description>Filter Index   FIDX. Index of matching filter element. Range is 0 to SIDFC.LSS  160    160 1        resp. XIDFC.LSE  160    160 1.</description>
								<lsb>8</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>FLST</name>
								<description>Filter List   FLST. Indicates the filter list of the matching filter element.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>NDAT1i</name>
						<description>New Data 1 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>408</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ND0</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND1</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND2</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND3</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND4</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND5</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND6</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND7</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND8</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND9</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND10</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND11</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND12</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND13</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND14</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND15</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND16</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND17</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND18</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND19</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND20</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND21</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND22</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND23</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND24</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND25</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND26</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND27</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND28</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND29</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND30</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND31</name>
								<description>New Data in Rx Buffer 31   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
