J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<cluster>
						<name>RX</name>
						<description>RX</description>
						<addressOffset>416</addressOffset>
						<register>
							<name>RXF0Ci</name>
							<description>Rx FIFO 0 Configuration 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>F0SA</name>
									<description>Rx FIFO 0 Start Address   F0SA. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Start address of Rx FIFO 0 in Message RAM  32 bit word address  see CROSSREFERENCE  .</description>
									<lsb>2</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>F0S</name>
									<description>Rx FIFO 0 Size   F0S. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set.</description>
									<lsb>16</lsb>
									<msb>22</msb>
									<access>read-write</access>
									<enumeratedValues>
										<enumeratedValue>
											<name>rest127</name>
											<description>64 Rx FIFO 0 elements</description>
											<value>127</value>
										</enumeratedValue>
									</enumeratedValues>
								</field>
								<field>
									<name>F0WM</name>
									<description>Rx FIFO 0 Watermark   F0WM. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set.</description>
									<lsb>24</lsb>
									<msb>30</msb>
									<access>read-write</access>
									<enumeratedValues>
										<enumeratedValue>
											<name>rest127</name>
											<description>Watermark interrupt disabled</description>
											<value>127</value>
										</enumeratedValue>
									</enumeratedValues>
								</field>
								<field>
									<name>F0OM</name>
									<description>FIFO 0 Operation Mode   F0OM. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. FIFO 0 can be operated in blocking or in overwrite mode  see CROSSREFERENCE  .</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>RXF0Si</name>
							<description>Rx FIFO 0 Status 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>4</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>F0FL</name>
									<description>Rx FIFO 0 Fill Level   F0FL. Number of elements stored in Rx FIFO 0  range 0 to 64.</description>
									<lsb>0</lsb>
									<msb>6</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>F0GI</name>
									<description>Rx FIFO 0 Get Index   F0GI. Rx FIFO 0 read index pointer  range 0 to 63.</description>
									<lsb>8</lsb>
									<msb>13</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>F0PI</name>
									<description>Rx FIFO 0 Put Index   F0PI. Rx FIFO 0 write index pointer  range 0 to 63.</description>
									<lsb>16</lsb>
									<msb>21</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>F0F</name>
									<description>Rx FIFO 0 Full   F0F</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>RF0L</name>
									<description>Rx FIFO 0 Message Lost   RF0L. This bit is a copy of interrupt flag IR.RF0L. When IR.RF0L is reset  this bit is also reset. Overwriting the oldest message when RXF0C.F0OM    1  will not set this flag.</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
						<register>
							<name>RXF0Ai</name>
							<description>Rx FIFO 0 Acknowledge 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>8</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>F0AI</name>
									<description>Rx FIFO 0 Acknowledge Index   F0AI. After the Host has read a message or a sequence of messages from Rx FIFO 0 it has to write the buffer index of the last element read from Rx FIFO 0 to F0AI. This will set the Rx FIFO 0 Get Index RXF0S.F0GI to F0AI   1 and update the FIFO 0 Fill Level RXF0S.F0FL.</description>
									<lsb>0</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>RXBCi</name>
							<description>Rx Buffer Configuration 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>12</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>RBSA</name>
									<description>Rx Buffer Start Address   RBSA. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Configures the start address of the Rx Buffers section in the Message        RAM  32 bit word address . Also        used to reference debug messages A  B  C.</description>
									<lsb>2</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>RXF1Ci</name>
							<description>Rx FIFO 1 Configuration 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>16</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>F1SA</name>
									<description>Rx FIFO 1 Start Address   F1SA. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Start address of Rx FIFO 1 in Message RAM  32 bit word address .</description>
									<lsb>2</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>F1S</name>
									<description>Rx FIFO 1 Size   F1S. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set.</description>
									<lsb>16</lsb>
									<msb>22</msb>
									<access>read-write</access>
									<enumeratedValues>
										<enumeratedValue>
											<name>rest127</name>
											<description>64 Rx FIFO 1 elements</description>
											<value>127</value>
										</enumeratedValue>
									</enumeratedValues>
								</field>
								<field>
									<name>F1WM</name>
									<description>Rx FIFO 1 Watermark   F1WM. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set.</description>
									<lsb>24</lsb>
									<msb>30</msb>
									<access>read-write</access>
									<enumeratedValues>
										<enumeratedValue>
											<name>rest127</name>
											<description>Watermark interrupt disabled</description>
											<value>127</value>
										</enumeratedValue>
									</enumeratedValues>
								</field>
								<field>
									<name>F1OM</name>
									<description>FIFO 1 Operation Mode   F1OM. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. FIFO 1 can be operated in blocking or in overwrite mode.</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>RXF1Si</name>
							<description>Rx FIFO 1 Status 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>20</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>F1FL</name>
									<description>Rx FIFO 1 Fill Level   F1FL. Number of elements stored in Rx FIFO 1  range 0 to 64.</description>
									<lsb>0</lsb>
									<msb>6</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>F1GI</name>
									<description>Rx FIFO 1 Get Index   F1GI. Rx FIFO 1 read index pointer  range 0 to 63.</description>
									<lsb>8</lsb>
									<msb>13</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>F1PI</name>
									<description>Rx FIFO 1 Put Index   F1PI. Rx FIFO 1 write index pointer  range 0 to 63.</description>
									<lsb>16</lsb>
									<msb>21</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>F1F</name>
									<description>Rx FIFO 1 Full   F1F</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>RF1L</name>
									<description>Rx FIFO 1 Message Lost   RF1L. This bit is a copy of interrupt flag IR.RF1L. When IR.RF1L is reset  this bit is also reset. Overwriting the oldest message when RXF1C.F1OM    1  will not set this flag.</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
						<register>
							<name>RXF1Ai</name>
							<description>Rx FIFO 1 Acknowledge 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>24</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>F1AI</name>
									<description>Rx FIFO 1 Acknowledge Index   F1AI. After the Host has read a message or a sequence of messages from Rx FIFO 1 it has to write the buffer index of the last element read from Rx FIFO 1 to F1AI. This will set the Rx FIFO 1 Get Index RXF1S.F1GI to F1AI   1 and update the FIFO 1 Fill Level RXF1S.F1FL</description>
									<lsb>0</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>RXESCi</name>
							<description>Rx Buffer FIFO Element Size Configuration 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>28</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>F0DS</name>
									<description>Rx FIFO 0 Data Field Size   F0DS. This bitfield is CCE and INIT protected. Writes will only have effect  if both bits are set. In case the data field size of an accepted CAN frame exceeds the data field size configured for the matching Rx Buffer or Rx FIFO  only the number of bytes as configured by RXESC are stored to the Rx Buffer resp. Rx FIFO element. The rest of the frame s data field is ignored.</description>
									<lsb>0</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>F1DS</name>
									<description>Rx FIFO 1 Data Field Size   F1DS. This bitfield is CCE and INIT protected. Writes will only have effect  if both bits are set.</description>
									<lsb>4</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>RBDS</name>
									<description>Rx Buffer Data Field Size   RBDS. This bitfield is CCE and INIT protected. Writes will only have effect  if both bits are set.</description>
									<lsb>8</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
					</cluster>
					<cluster>
						<name>TX</name>
						<description>TX</description>
						<addressOffset>448</addressOffset>
						<register>
							<name>TXBCi</name>
							<description>Tx Buffer Configuration 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>TBSA</name>
									<description>Tx Buffers Start Address   TBSA. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Start address of Tx Buffers section in Message RAM  32 bit word address .</description>
									<lsb>2</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>NDTB</name>
									<description>Number of Dedicated Transmit Buffers   NDTB. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Be aware that the sum of TFQS and NDTB may be not greater than 32.          There is no check for erroneous configurations. The Tx Buffers section          in the Message RAM starts with the dedicated Tx Buffers.</description>
									<lsb>16</lsb>
									<msb>21</msb>
									<access>read-write</access>
									<enumeratedValues>
										<enumeratedValue>
											<name>rest63</name>
											<description>32 Dedicated Tx Buffers</description>
											<value>63</value>
										</enumeratedValue>
									</enumeratedValues>
								</field>
								<field>
									<name>TFQS</name>
									<description>Transmit FIFO Queue Size   TFQS. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set.</description>
									<lsb>24</lsb>
									<msb>29</msb>
									<access>read-write</access>
									<enumeratedValues>
										<enumeratedValue>
											<name>rest63</name>
											<description>32 Tx Buffers used for Tx FIFO Queue</description>
											<value>63</value>
										</enumeratedValue>
									</enumeratedValues>
								</field>
								<field>
									<name>TFQM</name>
									<description>Tx FIFO Queue Mode   TFQM. This bitfield is CCE and INIT protected. Writes will only have effect  if both bits are set.</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TXFQSi</name>
							<description>Tx FIFO Queue Status 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>4</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>TFFL</name>
									<description>Tx FIFO Free Level   TFFL. Number of consecutive free Tx FIFO elements starting from TFGI  range 0        to 32. Read as zero when Tx Queue operation is configured  TXBC.TFQM            8216 1  8217   In case of mixed configurations where dedicated Tx Buffers are          combined with a Tx FIFO or a Tx Queue  the Put and Get Indices          indicate the number of the Tx Buffer starting with the first dedicated          Tx Buffers. Example  For a configuration of 12 dedicated Tx Buffers          and a Tx FIFO of 20 Buffers a Put Index of 15 points to the fourth          buffer of the Tx FIFO.</description>
									<lsb>0</lsb>
									<msb>5</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TFGI</name>
									<description>Tx FIFO Get Index   TFGI. Tx FIFO read index pointer  range 0 to 31. Read as zero when Tx Queue   operation is configured  TXBC.TFQM    1  .</description>
									<lsb>8</lsb>
									<msb>12</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TFQPI</name>
									<description>Tx FIFO Queue Put Index   TFQPI. Tx FIFO Queue write index pointer  range 0 to 31.</description>
									<lsb>16</lsb>
									<msb>20</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TFQF</name>
									<description>Tx FIFO Queue Full   TFQF</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TXESCi</name>
							<description>Tx Buffer Element Size Configuration 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>8</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>TBDS</name>
									<description>Tx Buffer Data Field Size   TBDS. This bitfield is CCE and INIT protected. Writes will only have effect  if both bits are set. In case the data length code DLC of a Tx Buffer element is configured to a value higher than the Tx Buffer data field size TXESC.TBDS  the bytes not defined by the Tx Buffer are transmitted as  0xCC   padding bytes .</description>
									<lsb>0</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
