J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
						<register>
							<name>TXBRPi</name>
							<description>Tx Buffer Request Pending 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>12</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>TRP0</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP1</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP2</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP3</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP4</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP5</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP6</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP7</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP8</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP9</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP10</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP11</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP12</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP13</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP14</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP15</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP16</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP17</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP18</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP19</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP20</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP21</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP22</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP23</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP24</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP25</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP26</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP27</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP28</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>28</lsb>
									<msb>28</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP29</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>29</lsb>
									<msb>29</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP30</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TRP31</name>
									<description>Transmission Request Pending Tx  Buffer 31   TRP</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TXBARi</name>
							<description>Tx Buffer Add Request 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>16</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>AR0</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR1</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR2</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR3</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR4</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR5</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR6</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR7</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR8</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR9</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR10</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR11</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR12</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR13</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR14</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR15</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR16</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR17</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR18</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR19</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR20</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR21</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR22</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR23</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR24</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR25</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR26</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR27</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR28</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>28</lsb>
									<msb>28</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR29</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>29</lsb>
									<msb>29</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR30</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AR31</name>
									<description>Add Request Tx Buffer 31   AR</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TXBCRi</name>
							<description>Tx Buffer Cancellation Request 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>20</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>CR0</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR1</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR2</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR3</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR4</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR5</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR6</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR7</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR8</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR9</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR10</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR11</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR12</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR13</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR14</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR15</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR16</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR17</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR18</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR19</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR20</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR21</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR22</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR23</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR24</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR25</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR26</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR27</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR28</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>28</lsb>
									<msb>28</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR29</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>29</lsb>
									<msb>29</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR30</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CR31</name>
									<description>Cancellation Request Tx Buffer 31   CR</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
