J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
						<register>
							<name>TXBCIEi</name>
							<description>Tx Buffer Cancellation Finished Interrupt Enable 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>36</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>CFIE0</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE1</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE2</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE3</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE4</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE5</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE6</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE7</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE8</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE9</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE10</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE11</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE12</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE13</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE14</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE15</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE16</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE17</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE18</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE19</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE20</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE21</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE22</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE23</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE24</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE25</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE26</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE27</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE28</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>28</lsb>
									<msb>28</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE29</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>29</lsb>
									<msb>29</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE30</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE31</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TXEFCi</name>
							<description>Tx Event FIFO Configuration 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>48</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>EFSA</name>
									<description>Event FIFO Start Address   EFSA. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Start address of Tx Event FIFO in Message RAM  32 bit word address .</description>
									<lsb>2</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EFS</name>
									<description>Event FIFO Size   EFS. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. The Tx Event FIFO elements are indexed from 0 to EFS   1</description>
									<lsb>16</lsb>
									<msb>21</msb>
									<access>read-write</access>
									<enumeratedValues>
										<enumeratedValue>
											<name>rest63</name>
											<description>32 Tx Event FIFO elements</description>
											<value>63</value>
										</enumeratedValue>
									</enumeratedValues>
								</field>
								<field>
									<name>EFWM</name>
									<description>Event FIFO Watermark   EFWM. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set.</description>
									<lsb>24</lsb>
									<msb>29</msb>
									<access>read-write</access>
									<enumeratedValues>
										<enumeratedValue>
											<name>rest63</name>
											<description>Watermark interrupt disabled</description>
											<value>63</value>
										</enumeratedValue>
									</enumeratedValues>
								</field>
							</fields>
						</register>
						<register>
							<name>TXEFSi</name>
							<description>Tx Event FIFO Status 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>52</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>EFFL</name>
									<description>Event FIFO Fill Level   EFFL. Number of elements stored in Tx Event FIFO  range 0 to 32.</description>
									<lsb>0</lsb>
									<msb>5</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>EFGI</name>
									<description>Event FIFO Get Index   EFGI. Tx Event FIFO read index pointer  range 0 to 31.</description>
									<lsb>8</lsb>
									<msb>12</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>EFPI</name>
									<description>Event FIFO Put Index   EFPI. Tx Event FIFO write index pointer  range 0 to 31.</description>
									<lsb>16</lsb>
									<msb>20</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>EFF</name>
									<description>Event FIFO Full   EFF</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TEFL</name>
									<description>Tx Event FIFO Element Lost   TEFL. This bit is a copy of interrupt flag IR.TEFL. When IR.TEFL is reset  this bit is also reset.</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TXEFAi</name>
							<description>Tx Event FIFO Acknowledge 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>56</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>EFAI</name>
									<description>Event FIFO Acknowledge Index   EFAI. After the Host has read an element or a sequence of elements from the Tx        Event FIFO it has to write the index of the last element read from Tx        Event FIFO to EFAI. This will set the Tx Event FIFO Get Index TXEFS.EFGI        to EFAI  160    160 1 and update the FIFO 0 Fill Level TXEFS.EFFL.</description>
									<lsb>0</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
					</cluster>
					<cluster>
						<name>TT</name>
						<description>TT</description>
						<addressOffset>512</addressOffset>
						<register>
							<name>TTTMCi</name>
							<description>TT Trigger Memory Configuration 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>TMSA</name>
									<description>Trigger Memory Start Address   TMSA. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Start address of Trigger Memory in Message RAM.</description>
									<lsb>2</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TME</name>
									<description>Trigger Memory Elements   TME. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set.</description>
									<lsb>16</lsb>
									<msb>22</msb>
									<access>read-write</access>
									<enumeratedValues>
										<enumeratedValue>
											<name>rest127</name>
											<description>64 Trigger Memory elements</description>
											<value>127</value>
										</enumeratedValue>
									</enumeratedValues>
								</field>
							</fields>
						</register>
						<register>
							<name>TTRMCi</name>
							<description>TT Reference Message Configuration 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>4</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>RID</name>
									<description>Reference Identifier   RID. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Identifier transmitted with reference message and used for reference        message filtering. Standard or extended reference identifier depending        on bit XTD. A standard identifier has to be written to ID 28 18 .</description>
									<lsb>0</lsb>
									<msb>28</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>XTD</name>
									<description>Extended Identifier   XTD. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set.</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>RMPS</name>
									<description>Reference Message Payload Select   RMPS. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Ignored in case of time slaves.</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TTOCFi</name>
							<description>TT Operation Configuration 0
 resetvalue={Application Reset:0x10000}</description>
							<addressOffset>8</addressOffset>
							<size>32</size>
							<resetValue>65536</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>OM</name>
									<description>Operation Mode   OM. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set.</description>
									<lsb>0</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>GEN</name>
									<description>Gap Enable   GEN. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set.</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TM</name>
									<description>Time Master   TM. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set.</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>LDSDL</name>
									<description>LD of Synchronization Deviation Limit   LDSDL. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. The Synchronization Deviation Limit SDL is configured by its dual        logarithm LDSDL with SDL   2  LDSDL  160    160 5  .        It should not exceed the clock tolerance given by the CAN bit timing        configuration. LD of Synchronization Deviation Limit  SDL   8804  32  8230 4096 </description>
									<lsb>5</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>IRTO</name>
									<description>Initial Reference Trigger Offset   IRTO. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Positive offset  range from 0 to 127</description>
									<lsb>8</lsb>
									<msb>14</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EECS</name>
									<description>Enable External Clock Synchronization   EECS. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. If enabled  TUR configuration  TURCF.NCL only  may be updated during        TTCAN operation.</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AWL</name>
									<description>Application Watchdog Limit   AWL. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. The application watchdog can be disabled by programming AWL to 0x00. Maximum time after which the application has to serve the application        watchdog. The application watchdog is incremented once each 256 NTUs.</description>
									<lsb>16</lsb>
									<msb>23</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EGTF</name>
									<description>Enable Global Time Filtering   EGTF. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set.</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ECC</name>
									<description>Enable Clock Calibration   ECC. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set.</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EVTP</name>
									<description>Event Trigger Polarity   EVTP. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set.</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TTMLMi</name>
							<description>TT Matrix Limits 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>12</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>CCM</name>
									<description>Cycle Count Max   CCM. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. ISO 11898 4  5.2.1 requires  that only the listed cycle count values          are configured. Other values are possible but may lead to inconsistent          matrix cycles.</description>
									<lsb>0</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CSS</name>
									<description>Cycle Start Synchronization   CSS. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Enables sync pulse output at start of cycle.</description>
									<lsb>6</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TXEW</name>
									<description>Tx Enable Window   TXEW. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Length of Tx enable window  1 16 NTU cycles</description>
									<lsb>8</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ENTT</name>
									<description>Expected Number of Tx Triggers   ENTT. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Expected number of Tx Triggers in one Matrix Cycle</description>
									<lsb>16</lsb>
									<msb>27</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TURCFi</name>
							<description>TUR Configuration 0
 resetvalue={Application Reset:0x10000000}</description>
							<addressOffset>16</addressOffset>
							<size>32</size>
							<resetValue>268435456</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>NCL</name>
									<description>Numerator Configuration Low   NCL. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Write access to the TUR Numerator Configuration Low is only possible        during configuration with TURCF.ELT     8216 0  8217  or if TTOCF.EECS  external        clock synchronization enabled  is set. When a new value for NCL is        written outside TT Configuration Mode  the new value takes effect when        TTOST.WECS is cleared to   8216 0  8217 . NCL is locked TTOST.WECS is   8216 1  8217 . If NC  160  lt   160 7  160 x  160 DC in TTCAN Level 1  then it is required that subsequent          time marks in the Trigger Memory must differ by at least 2 NTU.</description>
									<lsb>0</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>DC</name>
									<description>Denominator Configuration   DC. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set.</description>
									<lsb>16</lsb>
									<msb>29</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ELT</name>
									<description>Enable Local Time   ELT. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Local time is started by setting ELT. It remains active until ELT is          reset or until the next hardware reset. TURCF.DC is locked when          TURCF.ELT     8216 1  8217 . If ELT is written to   8216 0  8217   the readable value will          stay at   8216 1  8217  until the new value has been synchronized into the CAN          clock domain. During this time write access to the other bits of the          register remains locked.</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
