J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
						<register>
							<name>TTOCNi</name>
							<description>TT Operation Control 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>20</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>SGT</name>
									<description>Set Global time   SGT. Writing a   8216 1  8217  to SGT sets TTOST.WGDT if the node is the actual Time        Master. SGT is reset after one Host clock period. The global time preset        takes effect when the node transmits the next reference message with the        Master Ref Mark modified by the preset value written to TTGTP.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ECS</name>
									<description>External Clock Synchronization   ECS. Writing a   8216 1  8217  to ECS sets TTOST.WECS if the node is the actual Time        Master. ECS is reset after one Host clock period. The external clock        synchronization takes effect at the start of the next basic cycle.</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SWP</name>
									<description>Stop Watch Polarity   SWP</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SWS</name>
									<description>Stop Watch Source   SWS</description>
									<lsb>3</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>RTIE</name>
									<description>Register Time Mark Interrupt Pulse Enable   RTIE. Register time mark interrupts are configured by register TTTMK. A        register time mark interrupt pulse with the length of one TTCAN clock        period is generated when the time referenced by TTOCN.TMC  cycle  local         or global  equals TTTMK.TM  independent of the synchronization state.</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TMC</name>
									<description>Register Time Mark Compare   TMC. When changing the time mark reference  cycle  local  global time   it          is recommended to first write TMC     8220 00  8221   then reconfigure TTTMK  and          finally set TMC to the intended time reference.</description>
									<lsb>6</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TTIE</name>
									<description>Trigger Time Mark Interrupt Pulse Enable   TTIE. External time mark events are configured by trigger memory element TMEX.        A trigger time mark interrupt pulse is generated when the trigger memory        element becomes active  and the M CAN is in synchronization state In Schedule or In Gap.</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>GCS</name>
									<description>Gap Control Select   GCS</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>FGP</name>
									<description>Finish Gap   FGP. Set by the CPU  reset by each reference message</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TMG</name>
									<description>Time Mark Gap   TMG</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>NIG</name>
									<description>Next is Gap   NIG. This bit can only be set when the M CAN is the actual Time Master and when it is configured for external        event synchronized time triggered operation  TTOCF.GEN     8216 1  8217  </description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ESCN</name>
									<description>External Synchronization Control   ESCN. If enabled the M CAN synchronizes its cycle time phase to an external event signalled by a        rising edge at the event trigger.</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>LCKC</name>
									<description>TT Operation Control Register Locked   LCKC. Set by a write access to register TTOCN. Reset when the updated        configuration has been synchronized into the CAN clock domain.</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TTGTPi</name>
							<description>TT Global Time Preset 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>24</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>TP</name>
									<description>Time Preset   TP. CTP is write protected while TTOCN.ESCN or TTOST.SPL are set.</description>
									<lsb>0</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CTP</name>
									<description>Cycle Time Target Phase   CTP. CTP is write protected while TTOCN.ESCN or TTOST.SPL are set.</description>
									<lsb>16</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TTTMKi</name>
							<description>TT Time Mark 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>28</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>TM</name>
									<description>Time Mark   TM. When using byte access to register TTTMK it is recommended to first          disable the time mark compare function  TTOCN.TMC     8220 00  8221   to avoid          compares on inconsistent register values.</description>
									<lsb>0</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TICC</name>
									<description>Time Mark Cycle Code   TICC. Cycle count for which the time mark is valid.</description>
									<lsb>16</lsb>
									<msb>22</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>LCKM</name>
									<description>TT Time Mark Register Locked   LCKM. Always set by a write access to registers TTOCN. Set by write access to        register TTTMK when TTOCN.TMC   8800   quot 00  8221 . Reset        when the registers have been synchronized into the CAN clock domain.</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TTIRi</name>
							<description>TT Interrupt Register 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>32</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>SBC</name>
									<description>Start of Basic Cycle   SBC</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SMC</name>
									<description>Start of Matrix Cycle   SMC</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CSM</name>
									<description>Change of Synchronization Mode   CSM</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SOG</name>
									<description>Start of Gap   SOG</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>RTMI</name>
									<description>Register Time Mark Interrupt   RTMI. Set when time referenced by TTOCN.TMC         cycle  local  or global  equals TTTMK.TM         independent of the synchronization state.</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TTMI</name>
									<description>Trigger Time Mark Event Internal   TTMI. Internal time mark events are configured by trigger memory element TMIN.        Set when the trigger memory element becomes active  and the M CAN is in synchronization state In Gap or In Schedule.</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SWE</name>
									<description>Stop Watch Polarity   SWE</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>GTW</name>
									<description>Global Time Wrap   GTW</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>GTD</name>
									<description>Global Time Discontinuity   GTD</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>GTE</name>
									<description>Global Time Error   GTE. Synchronization deviation SD exceeds limit specified by TTOCF.LDSDL         TTCAN Level  160 0 2 only.</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TXU</name>
									<description>Tx Count Underflow   TXU</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TXO</name>
									<description>Tx Count Overflow   TXO</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SE1</name>
									<description>Scheduling Error 1   SE1</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SE2</name>
									<description>Scheduling Error 2   SE2</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ELC</name>
									<description>Error Level Changed   ELC. Not set when error level changed during initialization.</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>IWT</name>
									<description>Initialization Watch Trigger   IWT. The initialization is restarted by resetting IWT.</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>WT</name>
									<description>Watch Trigger   WT</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AW</name>
									<description>Application Watchdog   AW</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CER</name>
									<description>Configuration Error   CER. Trigger out of order.</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TTIEi</name>
							<description>TT Interrupt Enable 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>36</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>SBCE</name>
									<description>Start of Basic Cycle Interrupt Enable   SBCE</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SMCE</name>
									<description>Start of Matrix Cycle Interrupt Enable   SMCE</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CSME</name>
									<description>Change of Synchronization Mode Interrupt Enable   CSME</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SOGE</name>
									<description>Start of Gap Interrupt Enable   SOGE</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>RTMIE</name>
									<description>Register Time Mark Interrupt Enable   RTMIE</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TTMIE</name>
									<description>Trigger Time Mark Event Internal Interrupt Enable   TTMIE</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SWEE</name>
									<description>Stop Watch Polarity Interrupt Enable   SWEE</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>GTWE</name>
									<description>Global Time Wrap Interrupt Enable   GTWE</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>GTDE</name>
									<description>Global Time Discontinuity Interrupt Enable   GTDE</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>GTEE</name>
									<description>Global Time Error Interrupt Enable   GTEE</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TXUE</name>
									<description>Tx Count Underflow Interrupt Enable   TXUE</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TXOE</name>
									<description>Tx Count Overflow Interrupt Enable   TXOE</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SE1E</name>
									<description>Scheduling Error 1 Interrupt Enable   SE1E</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SE2E</name>
									<description>Scheduling Error 2 Interrupt Enable   SE2E</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ELCE</name>
									<description>Change Error Level Interrupt Enable   ELCE</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>IWTE</name>
									<description>Initialization Watch Trigger Interrupt Enable   IWTE</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>WTE</name>
									<description>Watch Trigger Interrupt Enable   WTE</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>AWE</name>
									<description>Application Watchdog Interrupt Enable   AWE</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CERE</name>
									<description>Configuration Error Interrupt Enable   CERE</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TTOSTi</name>
							<description>TT Operation Status 0
 resetvalue={Application Reset:0x20000080}</description>
							<addressOffset>44</addressOffset>
							<size>32</size>
							<resetValue>536871040</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>EL</name>
									<description>Error Level   EL</description>
									<lsb>0</lsb>
									<msb>1</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MS</name>
									<description>Master State   MS</description>
									<lsb>2</lsb>
									<msb>3</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>SYS</name>
									<description>Synchronization State   SYS</description>
									<lsb>4</lsb>
									<msb>5</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>QGTP</name>
									<description>Quality of Global Time Phase   QGTP. Only relevant in TTCAN Level  160 0 and Level  160 2  otherwise fixed to   8216 0  8217 .</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>QCS</name>
									<description>Quality of Clock Speed   QCS. Only relevant in TTCAN Level  160 0 and Level  160 2  otherwise fixed to   8216 1  8217 .</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>RTO</name>
									<description>Reference Trigger Offset   RTO. The Reference Trigger Offset value is a signed integer with a range from         127  0x81  to 127  0x7F . There is no notification when the lower limit        of  127 is reached. In case the M CAN becomes Time Master  MS 1 0      8220 11  8221    the reset of RTO is delayed due to        synchronization between Host and CAN clock domain. For time slaves the        value configured by TTOCF.IRTO is read. Actual Reference Trigger offset value</description>
									<lsb>8</lsb>
									<msb>15</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>WGTD</name>
									<description>Wait for Global Time Discontinuity   WGTD</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>GFI</name>
									<description>Gap Finished Indicator   GFI. Set when the CPU writes TTOCN.FGP  or by a time mark interrupt if        TMG  160    160   8216 1  8217   or via event trigger input if TTOCN.GCS  160    160   8216 1  8217 . Not set by        Ref Trigger Gap or when Gap is finished by another node sending a        reference message.</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TMP</name>
									<description>Time Master Priority   TMP</description>
									<lsb>24</lsb>
									<msb>26</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>GSI</name>
									<description>Gap Started Indicator   GSI</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>WFE</name>
									<description>Wait for Event   WFE</description>
									<lsb>28</lsb>
									<msb>28</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>AWE</name>
									<description>Application Watchdog Event   AWE. The application watchdog is served by reading TTOST. When the watchdog        is not served in time  bit AWE is set  all TTCAN communication is        stopped  and the M CAN is set into Bus Monitoring Mode.</description>
									<lsb>29</lsb>
									<msb>29</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>WECS</name>
									<description>Wait for External Clock Synchronization   WECS</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>SPL</name>
									<description>Schedule Phase Lock   SPL. The bit is valid only when external synchronization is enabled         TTOCN.ESCN     8216 1  8217  . In this case it signals that the difference between        cycle time configured by TTGTP.CTP and the cycle time at the rising edge        at the event trigger is less or equal 9 NTU.</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TURNAi</name>
							<description>TUR Numerator Actual 0
 resetvalue={Application Reset:0x10000}</description>
							<addressOffset>48</addressOffset>
							<size>32</size>
							<resetValue>65536</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>NAV</name>
									<description>Numerator Actual Value   NAV</description>
									<lsb>0</lsb>
									<msb>17</msb>
									<access>read-only</access>
									<enumeratedValues>
										<enumeratedValue>
											<name>rest262143</name>
											<description>Illegal value</description>
											<value>262143</value>
										</enumeratedValue>
									</enumeratedValues>
								</field>
							</fields>
						</register>
						<register>
							<name>TTLGTi</name>
							<description>TT Local   Global Time 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>52</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>LT</name>
									<description>Local Time   LT. Non fractional part of local time  incremented once each local NTU. Local time value of TTCAN node</description>
									<lsb>0</lsb>
									<msb>15</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>GT</name>
									<description>Global Time   GT. Non fractional part of the sum of the node  8217 s local time and its local        offset. Global time value of TTCAN network</description>
									<lsb>16</lsb>
									<msb>31</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TTCTCi</name>
							<description>TT Cycle Time   Count 0
 resetvalue={Application Reset:0x3F0000}</description>
							<addressOffset>56</addressOffset>
							<size>32</size>
							<resetValue>4128768</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>CT</name>
									<description>Cycle Time   CT. Non fractional part of the difference of the node  8217 s local time and        Ref Mark. Cycle time value of TTCAN Basic Cycle</description>
									<lsb>0</lsb>
									<msb>15</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CC</name>
									<description>Cycle Count   CC. Number of actual Basic Cycle in the System Matrix</description>
									<lsb>16</lsb>
									<msb>21</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
