J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>NPCRi</name>
						<description>Node 0 Port Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>64</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RXSEL</name>
								<description>Receive Select   RXSEL. RXSEL selects one out of 8 possible receive inputs. The CAN receive        signal is performed by the selected input.  see the device related        chapter for RXSEL </description>
								<lsb>0</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>LBM</name>
								<description>Loop Back Mode   LBM</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>LOUT</name>
								<description>Loop Back Mode Out   LOUT. This bit is not implemented in TC39x A step silicon. The loop back bus is switched to the external CAN bus of the node.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DELE</name>
								<description>Enable destructive read on ECR0.CEL   DELE. If this bit is set  the destructive read on ECRi.CEL and on the PSR        register takes place. Meaning  that with read access on ECRi  the CEL is        reset. The same is true for the PSR register  for the bits PXE  RFDF         RBRS  RESI  LEC and DLEC. After the destructive read it is advised to        reset the bit again.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CRELi</name>
						<description>Core Release Register 0
 resetvalue={Application Reset:0x32150320,Application Reset:0x32150323,Application Reset:0x32150320}</description>
						<addressOffset>256</addressOffset>
						<size>32</size>
						<resetValue>840237856</resetValue>
						<resetMask>4294967292</resetMask>
						<fields>
							<field>
								<name>DAY</name>
								<description>Time Stamp Day</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>MON</name>
								<description>Time Stamp Month</description>
								<lsb>8</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>YEAR</name>
								<description>Time Stamp Year</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SUBSTEP</name>
								<description>Sub step of Core Release   SUBSTEP. One digit  BCD coded.</description>
								<lsb>20</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>STEP</name>
								<description>Step of Core Release   STEP. One digit  BCD coded.</description>
								<lsb>24</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>REL</name>
								<description>Core Release   REL. One digit  BCD coded.</description>
								<lsb>28</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ENDNi</name>
						<description>Endian Register 0
 resetvalue={Application Reset:0x087654321}</description>
						<addressOffset>260</addressOffset>
						<size>32</size>
						<resetValue>2271560481</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ETV</name>
								<description>Endianness Test Value   ETV. The endianness test value is 0x87654321.</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DBTPi</name>
						<description>Data Bit Timing   Prescaler Register 0
 resetvalue={Application Reset:0x0A33}</description>
						<addressOffset>268</addressOffset>
						<size>32</size>
						<resetValue>2611</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DSJW</name>
								<description>Data  Re  Synchronization Jump Width   DSJW. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Valid values are 0 to 15. The actual interpretation by the hardware of        this value is such that one more than the value programmed here is used.</description>
								<lsb>0</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DTSEG2</name>
								<description>Data time segment after sample point   DTSEG2. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Valid values are 0 to 15. The actual interpretation by the hardware of        this value is such that one more than the programmed value is used.</description>
								<lsb>4</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DTSEG1</name>
								<description>Data time segment before sample point   DTSEG1. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Valid values are 0 to 31. The actual interpretation by the hardware of        this value is such that one more than the programmed value is used.</description>
								<lsb>8</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DBRP</name>
								<description>Data Baud Rate Prescaler   DBRP. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. The value by which the oscillator frequency is divided for generating        the bit time quanta. The bit time is built up from a multiple of this        quanta. Valid values for the Baud Rate Prescaler are   8201 0 to 31. The        actual interpretation by the hardware of this value is such that one        more than the value programmed here is used.</description>
								<lsb>16</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TDC</name>
								<description>Transmitter Delay Compensation   TDC. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TESTi</name>
						<description>Test Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>272</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967167</resetMask>
						<fields>
							<field>
								<name>LBCK</name>
								<description>Loop Back Mode   LBCK. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. This is the external loop back mode  visible on the outside.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TX</name>
								<description>Control of Transmit Pin   TX. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set.</description>
								<lsb>5</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RX</name>
								<description>Receive Pin   RX. Monitors the actual value of RX pin.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>RWDi</name>
						<description>RAM Watchdog 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>276</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>WDC</name>
								<description>Watchdog Configuration   WDC. This bitfield is CCE and INIT protected. Writes will only have effect  if both bits are set. Start value of the Message RAM Watchdog Counter. With the reset value of  00  the counter is disabled.</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WDV</name>
								<description>Watchdog Value   WDV. Actual Message RAM Watchdog Counter Value.</description>
								<lsb>8</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CCCRi</name>
						<description>CC Control Register 0
 resetvalue={Application Reset:0x1}</description>
						<addressOffset>280</addressOffset>
						<size>32</size>
						<resetValue>1</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>INIT</name>
								<description>Initialization   INIT. Due to the synchronization mechanism between the two clock domains           there may be a delay until the value written to INIT can be read back.          Therefore the programmer has to assure that the previous value written          to INIT has been accepted by reading INIT before setting INIT to a new          value.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CCE</name>
								<description>Configuration Change Enable   CCE</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ASM</name>
								<description>Restricted Operation Mode   ASM. Bit ASM can only be set by the Host when both CCE and INIT are set to          8216 1  8217 . In can also be set by the M CAN .        The bit can be reset by the Host at any time. For a description of the        Restricted Operation Mode see paragraph Restricted Operation Mode.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CSA</name>
								<description>Clock Stop Acknowledge   CSA</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CSR</name>
								<description>Clock Stop Request   CSR</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MON</name>
								<description>Bus Monitoring Mode   MON. Bit MON can only be set by the Host when both CCE and INIT are set to          8216 1  8217 . The bit can be reset by the Host at any time. The bus monitoring mode corresponds to the Analyzer Mode of the MultiCAN        module.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DAR</name>
								<description>Disable Automatic Retransmission   DAR. This bitfield is CCE and INIT protected. Writes will only have effect  if both bits are set.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TEST</name>
								<description>Test Mode Enable   TEST. The TEST register can only be set  if CCE  INIT and TEST are set. Writes to test will only have effect  if all three bits are set.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FDOE</name>
								<description>FD Operation Enable   FDOE. This bitfield is CCE and INIT protected. Writes will only have effect  if both bits are set.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BRSE</name>
								<description>Bit Rate Switch Enable   BRSE. This bitfield is CCE and INIT protected. Writes will only have effect  if both bits are set.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PXHD</name>
								<description>Protocol Exception Handling Disable   PXHD. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EFBI</name>
								<description>Edge Filtering during Bus Integration   EFBI. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TXP</name>
								<description>Transmit Pause   TXP. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. If this bit is set  the M CAN pauses for two CAN bit times before starting the next transmission after        itself has successfully transmitted a frame  see CROSSREFERENCE  .</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>NISO</name>
								<description>Non ISO Operation   NISO. If this bit is set  the M CAN uses the CAN FD frame format as specified        by the Bosch CAN FD Specification V1.0.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>NBTPi</name>
						<description>Nominal Bit Timing   Prescaler Register 0
 resetvalue={Application Reset:0x6000A03}</description>
						<addressOffset>284</addressOffset>
						<size>32</size>
						<resetValue>100665859</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>NTSEG2</name>
								<description>Nominal Time segment after sample point   NTSEG2. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Valid values are 1 to 127. The actual interpretation by the hardware of        this value is such that one more than the programmed value is used.</description>
								<lsb>0</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>NTSEG1</name>
								<description>Nominal Time segment before sample point   NTSEG1. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Valid values are 1 to 255. The actual interpretation by the hardware of        this value is such that one more than the programmed value is used.</description>
								<lsb>8</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>NBRP</name>
								<description>Baud Rate Prescaler   NBRP. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. The value by which the oscillator frequency is divided for generating        the bit time quanta. The bit time is built up from a multiple of this        quanta. Valid values for the Baud Rate Prescaler are 0 to 511. The        actual interpretation by the hardware of this value is such that one        more than the value programmed here is used.</description>
								<lsb>16</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>NSJW</name>
								<description> Re  Synchronization Jump Width   NSJW. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Valid values are 0 to 127. The actual interpretation by the hardware of        this value is such that one more than the value programmed here is used.</description>
								<lsb>25</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TSCCi</name>
						<description>Timestamp Counter Configuration 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>288</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TSS</name>
								<description>Time segment before sample point   TSS. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set.</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TCP</name>
								<description>Timestamp Counter Prescaler   TCP. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Configures the timestamp and timeout counters time unit in multiples of        CAN bit times    8201 1  8230 16  8201  . The actual interpretation by the hardware of        this value is such that one more than the value programmed here is used. With CAN FD an external counter is required for timestamp generation           TSS     8220 10  8221  </description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TSCVi</name>
						<description>Timestamp Counter Value 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>292</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TSC</name>
								<description>Timestamp Counter   TSC. The internal external Timestamp Counter value is captured on start of        frame  both Rx and Tx . When TSCC.TSS     8220 01  8221   the Timestamp Counter is        incremented in multiples of CAN bit times    8201 1  8230 16  8201   depending on the        configuration of TSCC.TCP. A wrap around sets interrupt flag IR.TSW. Write access resets the counter to zero. When TSCC.TSS  160    160   8220 10  8221   TSC reflects the external Timestamp Counter value.        A write access has no impact. A   8220 wrap around  8221  is a change of the Timestamp Counter value from          non zero to zero not caused by write access to TSCV.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TOCCi</name>
						<description>Timeout Counter Configuration 0
 resetvalue={Application Reset:0x0FFFF0000}</description>
						<addressOffset>296</addressOffset>
						<size>32</size>
						<resetValue>4294901760</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ETOC</name>
								<description>Enable Timeout Counter   ETOC. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. For use of timeout function with CAN FD see chapter Timeout Counter.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TOS</name>
								<description>Timeout Select   TOS. This bitfield is CCE and INIT protected. Writes will only have effect  if both bits are set. When operating in Continuous mode  a write to TOCV presets the counter to the value configured by TOCC.TOP and continues down counting. When the Timeout Counter is controlled by one of the FIFOs  an empty FIFO presets the counter to the value configured by TOCC.TOP. Down counting is started when the first FIFO element is stored.</description>
								<lsb>1</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TOP</name>
								<description>Timeout Period   TOP. This bitfield is CCE and INIT protected. Writes will only have effect  if both bits are set. Start value of the Timeout Counter  down counter . Configures the Timeout Period.</description>
								<lsb>16</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TOCVi</name>
						<description>Timeout Counter Value 0
 resetvalue={Application Reset:0x0FFFF}</description>
						<addressOffset>300</addressOffset>
						<size>32</size>
						<resetValue>65535</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TOC</name>
								<description>Timeout Counter   TOC. The Timeout Counter is decremented in multiples of CAN bit times    8201 1  8230 16  8201           depending on the configuration of TSCC.TCP. When decremented to zero         interrupt flag IR.TOO is set and the Timeout Counter is stopped. Start        and reset restart conditions are configured via TOCC.TOS. Any write access will lead to clearing of the counter.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ECRi</name>
						<description>Error Counter Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>320</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TEC</name>
								<description>Transmit Error Counter   TEC. Actual state of the Transmit Error Counter  values between 0 and 255 When CCCR.ASM is set  the CAN protocol controller does not increment          TEC and REC when a CAN protocol error is detected  but CEL is still          incremented.</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>REC</name>
								<description>Receive Error Counter   REC. Actual state of the Receive Error Counter  values between 0 and 127 When CCCR.ASM is set  the CAN protocol controller does not increment          TEC and REC when a CAN protocol error is detected  but CEL is still          incremented.</description>
								<lsb>8</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RP</name>
								<description>Receive Error Passive   RP</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CEL</name>
								<description>CAN Error Logging   CEL. The counter is incremented each time when a CAN protocol error causes        the Transmit Error Counter or the Receive Error Counter to be        incremented. It is reset by read access to CEL. The counter stops at        0xFF  the next increment of TEC or REC sets interrupt flag IR.ELO. The counter is reset on read  if the bit NPCRi.DELE is set for the node.</description>
								<lsb>16</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
