J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>NDAT2i</name>
						<description>New Data 2 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>412</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ND32</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND33</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND34</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND35</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND36</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND37</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND38</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND39</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND40</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND41</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND42</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND43</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND44</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND45</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND46</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND47</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND48</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND49</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND50</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND51</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND52</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND53</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND54</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND55</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND56</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND57</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND58</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND59</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND60</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND61</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND62</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ND63</name>
								<description>New Data in Rx Buffer 63   ND. The flag is set when the respective Rx Buffer has been updated from a        received frame. The flags remain set until the Host clears them. A flag        is cleared by writing a   8220 1  8221  to the corresponding bit position. Writing a          8220 0  8221  has no effect.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<cluster>
						<name>NT</name>
						<description>NT</description>
						<addressOffset>32</addressOffset>
						<register>
							<name>NTCCRi</name>
							<description>Node 0 Timer Clock Control Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>TPSC</name>
									<description>Timer Prescaler   TPSC. The duration of one timer clock is given by  TPSC  160    160 1  CAN bit times for        all NTCCRi.TRIGSRC settings.</description>
									<lsb>8</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>STRESET</name>
									<description>Stamping Reset   STRESET. This bit is not implemented in TC39x A step silicon. This bit gives the possibility to reset the time stamp for CAN FD messages.</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>STSTART</name>
									<description>Stamping Start   STSTART. This bit is not implemented in TC39x A step silicon. This bit starts the external timer used for CAN FD messages. The source and the prescaler are identical to the timers A B C.</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TRIGSRC</name>
									<description>Trigger Source   TRIGSRC. This bit selects the trigger source for the different modes in the node        timer.</description>
									<lsb>18</lsb>
									<msb>20</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>NTATTRi</name>
							<description>Node 0 Timer A Transmit Trigger Register
 resetvalue={Application Reset:0x10000}</description>
							<addressOffset>4</addressOffset>
							<size>32</size>
							<resetValue>65536</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>RELOAD</name>
									<description>Reload Value   RELOAD. This bit field contains the reload value for the timer. The timer will        restart when RELOAD is written.</description>
									<lsb>0</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TXMO</name>
									<description>Transmit Message Object   TXMO. This transmit trigger is fixed to transmit buffer 1</description>
									<lsb>16</lsb>
									<msb>23</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>STRT</name>
									<description>Timer Start   STRT. This bit field controls the operation of the timer.</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>NTBTTRi</name>
							<description>Node 0 Timer B Transmit Trigger Register
 resetvalue={Application Reset:0x20000}</description>
							<addressOffset>8</addressOffset>
							<size>32</size>
							<resetValue>131072</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>RELOAD</name>
									<description>Reload Value   RELOAD. This bit field contains the reload value for the timer. The timer will restart when RELOAD is written.</description>
									<lsb>0</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TXMO</name>
									<description>Transmit Message Object   TXMO. This transmit object is fixed to transmit buffer 2</description>
									<lsb>16</lsb>
									<msb>23</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>STRT</name>
									<description>Timer Start   STRT. This bit field controls the operation of the timer.</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>NTCTTRi</name>
							<description>Node 0 Timer C Transmit Trigger Register
 resetvalue={Application Reset:0x30000}</description>
							<addressOffset>12</addressOffset>
							<size>32</size>
							<resetValue>196608</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>RELOAD</name>
									<description>Reload Value   RELOAD. This bit field contains the reload value for the timer. The timer will        restart when RELOAD is written.</description>
									<lsb>0</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TXMO</name>
									<description>Transmit Message Object   TXMO. This transmit trigger is fixed to transmit buffer 3</description>
									<lsb>16</lsb>
									<msb>23</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>STRT</name>
									<description>Timer Start   STRT. This bit field controls the operation of the timer.</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>NTRTRi</name>
							<description>Node 0 Timer Receive Timeout Register
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>16</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>RELOAD</name>
									<description>Reload Value   RELOAD. This bit field contains the reload value for the timer. The timer will        start when RELOAD   8800  0 is written. After half the time of the RELOAD        value  the interrupt flags of the receive buffers will be cleared        automatically  to ensure  that no message receive will be missed.</description>
									<lsb>0</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TEIE</name>
									<description>Timer Event Interrupt Enable   TEIE. This bit enables the node timer event interrupt of CAN node i. Bit field GRINT2.RETI selects the interrupt output line which becomes        activated at this type of interrupt.</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TE</name>
									<description>Timer Event   TE. This flag is set on a node timer transition from 1 to 0 in Receive        Timeout Mode. This bit must be reset  i.e Write to   8216 0  8217   by software         writing a   8216 1  8217  has no effect. An interrupt request is generated if TEIE   1.</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
					</cluster>
