J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
						<register>
							<name>TXBTOi</name>
							<description>Tx Buffer Transmission Occurred 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>24</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>TO0</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO1</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO2</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO3</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO4</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO5</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO6</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO7</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO8</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO9</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO10</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO11</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO12</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO13</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO14</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO15</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO16</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO17</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO18</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO19</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO20</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO21</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO22</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO23</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO24</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO25</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO26</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO27</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO28</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>28</lsb>
									<msb>28</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO29</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>29</lsb>
									<msb>29</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO30</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TO31</name>
									<description>Transmission Occurred Tx Buffer 31   TO</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TXBCFi</name>
							<description>Tx Buffer Cancellation Finished 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>28</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>CF0</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF1</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF2</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF3</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF4</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF5</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF6</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF7</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF8</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF9</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF10</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF11</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF12</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF13</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF14</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF15</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF16</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF17</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF18</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF19</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF20</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF21</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF22</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF23</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF24</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF25</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF26</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF27</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF28</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>28</lsb>
									<msb>28</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF29</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>29</lsb>
									<msb>29</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF30</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CF31</name>
									<description>Cancellation Finished Tx Buffer 31   CF</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TXBTIEi</name>
							<description>Tx Buffer Transmission Interrupt Enable 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>32</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>TIE0</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE1</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE2</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE3</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE4</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE5</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE6</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE7</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE8</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE9</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE10</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE11</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE12</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE13</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE14</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE15</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE16</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE17</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE18</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE19</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE20</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE21</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE22</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE23</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE24</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE25</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE26</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE27</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE28</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>28</lsb>
									<msb>28</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE29</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>29</lsb>
									<msb>29</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE30</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TIE31</name>
									<description>Transmission Interrupt Enable Tx Buffer 31   TIE</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
