J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
						<register>
							<name>TXBCIEi</name>
							<description>Tx Buffer Cancellation Finished Interrupt Enable 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>36</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>CFIE0</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE1</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>1</lsb>
									<msb>1</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE2</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>2</lsb>
									<msb>2</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE3</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>3</lsb>
									<msb>3</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE4</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>4</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE5</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>5</lsb>
									<msb>5</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE6</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>6</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE7</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE8</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>8</lsb>
									<msb>8</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE9</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>9</lsb>
									<msb>9</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE10</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE11</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>11</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE12</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE13</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE14</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE15</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE16</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>16</lsb>
									<msb>16</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE17</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>17</lsb>
									<msb>17</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE18</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>18</lsb>
									<msb>18</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE19</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>19</lsb>
									<msb>19</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE20</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>20</lsb>
									<msb>20</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE21</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>21</lsb>
									<msb>21</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE22</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>22</lsb>
									<msb>22</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE23</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE24</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE25</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE26</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE27</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE28</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>28</lsb>
									<msb>28</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE29</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>29</lsb>
									<msb>29</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE30</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CFIE31</name>
									<description>Cancellation Finished Interrupt Enable Tx Buffer 31   CFIE</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TXEFCi</name>
							<description>Tx Event FIFO Configuration 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>48</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>EFSA</name>
									<description>Event FIFO Start Address   EFSA. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. Start address of Tx Event FIFO in Message RAM  32 bit word address .</description>
									<lsb>2</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>EFS</name>
									<description>Event FIFO Size   EFS. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set. The Tx Event FIFO elements are indexed from 0 to EFS   1</description>
									<lsb>16</lsb>
									<msb>21</msb>
									<access>read-write</access>
									<enumeratedValues>
										<enumeratedValue>
											<name>rest63</name>
											<description>32 Tx Event FIFO elements</description>
											<value>63</value>
										</enumeratedValue>
									</enumeratedValues>
								</field>
								<field>
									<name>EFWM</name>
									<description>Event FIFO Watermark   EFWM. This bitfield is CCE and INIT protected. Writes will only have effect         if both bits are set.</description>
									<lsb>24</lsb>
									<msb>29</msb>
									<access>read-write</access>
									<enumeratedValues>
										<enumeratedValue>
											<name>rest63</name>
											<description>Watermark interrupt disabled</description>
											<value>63</value>
										</enumeratedValue>
									</enumeratedValues>
								</field>
							</fields>
						</register>
						<register>
							<name>TXEFSi</name>
							<description>Tx Event FIFO Status 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>52</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>EFFL</name>
									<description>Event FIFO Fill Level   EFFL. Number of elements stored in Tx Event FIFO  range 0 to 32.</description>
									<lsb>0</lsb>
									<msb>5</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>EFGI</name>
									<description>Event FIFO Get Index   EFGI. Tx Event FIFO read index pointer  range 0 to 31.</description>
									<lsb>8</lsb>
									<msb>12</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>EFPI</name>
									<description>Event FIFO Put Index   EFPI. Tx Event FIFO write index pointer  range 0 to 31.</description>
									<lsb>16</lsb>
									<msb>20</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>EFF</name>
									<description>Event FIFO Full   EFF</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TEFL</name>
									<description>Tx Event FIFO Element Lost   TEFL. This bit is a copy of interrupt flag IR.TEFL. When IR.TEFL is reset  this bit is also reset.</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TXEFAi</name>
							<description>Tx Event FIFO Acknowledge 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>56</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>EFAI</name>
									<description>Event FIFO Acknowledge Index   EFAI. After the Host has read an element or a sequence of elements from the Tx        Event FIFO it has to write the index of the last element read from Tx        Event FIFO to EFAI. This will set the Tx Event FIFO Get Index TXEFS.EFGI        to EFAI  160    160 1 and update the FIFO 0 Fill Level TXEFS.EFFL.</description>
									<lsb>0</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
					</cluster>
				</cluster>
				<register>
					<name>CLC</name>
					<description>CAN Clock Control Register
 resetvalue={Application Reset:0x3}</description>
					<addressOffset>32768</addressOffset>
					<size>32</size>
					<resetValue>3</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit   DISR. Used for enable disable control of the module. The synchronous and        asynchronous clock is switched on off Note that no register access is        possible to any register while module is disabled. A disable request is        granted  if the M CAN clock is disabled  or all M CAN nodes acknowledge the disable request.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit   DISS. Bit indicates the current status of the module.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EDIS</name>
							<description>Sleep Mode Disable Control   EDIS. Used to control module s sleep mode.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Module Identification Register
 resetvalue={Application Reset:0x0B8C000}</description>
					<addressOffset>32776</addressOffset>
					<size>32</size>
					<resetValue>12107776</resetValue>
					<resetMask>4294967040</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision Number   MOD REV. MOD REV defines the revision number. The value of a module revision        starts with 01 H  first revision .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type   MOD TYPE</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number Value   MOD NUMBER. This bit field defines the MCMCAN module identification number 00B8 .</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCR</name>
					<description>Module Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>32816</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CLKSEL0</name>
							<description>Clock Select 0   CLKSEL0. This bitfield is MCR.CI and MCR.CCCE protected.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKSEL1</name>
							<description>Clock Select 1   CLKSEL1. This bitfield is MCR.CI and MCR.CCCE protected.</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKSEL2</name>
							<description>Clock Select 2   CLKSEL2. This bitfield is MCR.CI and MCR.CCCE protected.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKSEL3</name>
							<description>Clock Select 3   CLKSEL3. This bitfield is MCR.CI and MCR.CCCE protected.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RBUSY</name>
							<description>RAM BUSY   RBUSY. This bit is not implemented in TC39x A step silicon. This bit shows that the RAM Initialization is running. This bit is set back to 0b by hardware when the RAM intialization is completed.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RINIT</name>
							<description>RAM Init   RINIT. This bit is not implemented in TC39x A step silicon. This bit is MCR.CI and MCR.CCCE protected. This bit starts the initialization of the RAM block to all 0x0. The RAM initialization is started only when this bit is changed from 0b to 1b and also RBUSY is 0b.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CI</name>
							<description>Change Init   CI. Needs to be set to enable and disable clocks.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CCCE</name>
							<description>Clock and RAM Change Enable   CCCE. Needs to be set to enable and disable the clocks.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
