J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PSI5</name>
			<version>100</version>
			<description>PSI5</description>
			<baseAddress>4026552320</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>2816</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<cluster>
					<dim>2</dim>
					<dimIncrement>144</dimIncrement>
					<name>CH[%s]</name>
					<description>CH</description>
					<addressOffset>48</addressOffset>
					<register>
						<name>IOCRx</name>
						<description>Input and Output Control Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ALTI</name>
								<description>Alternate Input Select   ALTI. Selects the alternate input for channel x </description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DEPTH</name>
								<description>Digital Glitch Filter Depth   DEPTH. DEPTH determines the number of port input samples clocked with f PSI5        that are taken into account for the calculation of the floating average.        The higher DEPTH is chosen to be  the longer the glitches that are        suppressed and the longer the delay of the input signal introduced by        this filter.</description>
								<lsb>4</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OIE</name>
								<description>Output Inverter Enable Channel x   OIE. Selects the Pulse Polarity of the output of channel x</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IIE</name>
								<description>Input Inverter Enable Channel x   IIE. Selects the Pulse Polarity of the input of channel x</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>REG</name>
								<description>Rising Edge Glitch Flag for Channel x   REG. Shows the status of the glitch detection of channel x REG is cleared by setting CREG.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>FEG</name>
								<description>Falling Edge Glitch Flag for Channel x   FEG. Shows the status of the glitch detection of channel x FEG is cleared by setting CFEG.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CREG</name>
								<description>Clear Rising Edge Glitch Flag for Channel x   CREG. Clears the status flag REG CREG always read zero.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>CFEG</name>
								<description>Clear Falling Edge Glitch Flag for Channel x   CFEG. Clears the status flag FEG CFEG always read zero.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RXM</name>
								<description>Receive Monitor for Channel x   RXM. Shows the status of the receive signal of channel x after glitch        filtering and inverted as specified by IIE.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TXM</name>
								<description>Transmit Monitor for Channel x   TXM. Shows the status of the transmit signal of channel x inverted as        specified by OIE.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>RCRAx</name>
						<description>Receiver Control Register A 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>PDL0</name>
								<description>Payload Data Length   PDL5. PDL determines the number of data bits per frame that the PSI5 channel x        is setup for in slot y. PDL does not include the start bits and the        Parity CRC bits. PDL includes the Messaging bits  the Frame Control bits        and the Status bits.</description>
								<lsb>0</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PDL1</name>
								<description>Payload Data Length   PDL5. PDL determines the number of data bits per frame that the PSI5 channel x        is setup for in slot y. PDL does not include the start bits and the        Parity CRC bits. PDL includes the Messaging bits  the Frame Control bits        and the Status bits.</description>
								<lsb>5</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PDL2</name>
								<description>Payload Data Length   PDL5. PDL determines the number of data bits per frame that the PSI5 channel x        is setup for in slot y. PDL does not include the start bits and the        Parity CRC bits. PDL includes the Messaging bits  the Frame Control bits        and the Status bits.</description>
								<lsb>10</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PDL3</name>
								<description>Payload Data Length   PDL5. PDL determines the number of data bits per frame that the PSI5 channel x        is setup for in slot y. PDL does not include the start bits and the        Parity CRC bits. PDL includes the Messaging bits  the Frame Control bits        and the Status bits.</description>
								<lsb>15</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PDL4</name>
								<description>Payload Data Length   PDL5. PDL determines the number of data bits per frame that the PSI5 channel x        is setup for in slot y. PDL does not include the start bits and the        Parity CRC bits. PDL includes the Messaging bits  the Frame Control bits        and the Status bits.</description>
								<lsb>20</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PDL5</name>
								<description>Payload Data Length   PDL5. PDL determines the number of data bits per frame that the PSI5 channel x        is setup for in slot y. PDL does not include the start bits and the        Parity CRC bits. PDL includes the Messaging bits  the Frame Control bits        and the Status bits.</description>
								<lsb>25</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ASYN</name>
								<description>Asynchronous Mode   ASYN. If set  the watch dog timers for the PSI5 channel x  slot WDL1 .. 6 are          disabled If WDL0 is not cleared TEI is issued if the distance between two          frames is longer than specified in WDL0 Slot Counter SC is incremented with each received frame  works as          frame counter  with roll over after 6. No Sync Pulses generated  TX path is inactive Note that in Asynchronous Mode all slow channel data is still          collected in Slot 1  SDSx0 .</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AVBS</name>
								<description>Verbose Mode for Asynchronous Mode   AVBS. If set  and ASYN is set and WDL0 is  gt  0 an empty frame is stored in        RDRL Hx and the referring RDML H each time  the watch dog timer for the        PSI5 channel x without reception of a frame.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>RCRBx</name>
						<description>Receiver Control Register B 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>MSG0</name>
								<description>Messaging Bits   MSG5. If set  the 2 Messaging bits are configured for the PSI5 channel x in slot y. If set  Enhanced Serial Message processing on bits D 1 0  is activated.  18 frames  4 or 8 bit ID  12 or 16 bit data  6 bit CRC  If Messaging bits are transmitted they are always presented in RDRx independently from status of MSGy. I.e. RDRx always stores exactly the data that was received.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MSG1</name>
								<description>Messaging Bits   MSG5. If set  the 2 Messaging bits are configured for the PSI5 channel x in slot y. If set  Enhanced Serial Message processing on bits D 1 0  is activated.  18 frames  4 or 8 bit ID  12 or 16 bit data  6 bit CRC  If Messaging bits are transmitted they are always presented in RDRx independently from status of MSGy. I.e. RDRx always stores exactly the data that was received.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MSG2</name>
								<description>Messaging Bits   MSG5. If set  the 2 Messaging bits are configured for the PSI5 channel x in slot y. If set  Enhanced Serial Message processing on bits D 1 0  is activated.  18 frames  4 or 8 bit ID  12 or 16 bit data  6 bit CRC  If Messaging bits are transmitted they are always presented in RDRx independently from status of MSGy. I.e. RDRx always stores exactly the data that was received.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MSG3</name>
								<description>Messaging Bits   MSG5. If set  the 2 Messaging bits are configured for the PSI5 channel x in slot y. If set  Enhanced Serial Message processing on bits D 1 0  is activated.  18 frames  4 or 8 bit ID  12 or 16 bit data  6 bit CRC  If Messaging bits are transmitted they are always presented in RDRx independently from status of MSGy. I.e. RDRx always stores exactly the data that was received.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MSG4</name>
								<description>Messaging Bits   MSG5. If set  the 2 Messaging bits are configured for the PSI5 channel x in slot y. If set  Enhanced Serial Message processing on bits D 1 0  is activated.  18 frames  4 or 8 bit ID  12 or 16 bit data  6 bit CRC  If Messaging bits are transmitted they are always presented in RDRx independently from status of MSGy. I.e. RDRx always stores exactly the data that was received.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MSG5</name>
								<description>Messaging Bits   MSG5. If set  the 2 Messaging bits are configured for the PSI5 channel x in slot y. If set  Enhanced Serial Message processing on bits D 1 0  is activated.  18 frames  4 or 8 bit ID  12 or 16 bit data  6 bit CRC  If Messaging bits are transmitted they are always presented in RDRx independently from status of MSGy. I.e. RDRx always stores exactly the data that was received.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CRC0</name>
								<description>CRC or Parit5 Selection   CRC5. If set  a 3 bit CRC checksum is expected for the PSI5 channel x in slot y. Else  1 bit Parity is assumed.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CRC1</name>
								<description>CRC or Parit5 Selection   CRC5. If set  a 3 bit CRC checksum is expected for the PSI5 channel x in slot y. Else  1 bit Parity is assumed.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CRC2</name>
								<description>CRC or Parit5 Selection   CRC5. If set  a 3 bit CRC checksum is expected for the PSI5 channel x in slot y. Else  1 bit Parity is assumed.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CRC3</name>
								<description>CRC or Parit5 Selection   CRC5. If set  a 3 bit CRC checksum is expected for the PSI5 channel x in slot y. Else  1 bit Parity is assumed.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CRC4</name>
								<description>CRC or Parit5 Selection   CRC5. If set  a 3 bit CRC checksum is expected for the PSI5 channel x in slot y. Else  1 bit Parity is assumed.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CRC5</name>
								<description>CRC or Parit5 Selection   CRC5. If set  a 3 bit CRC checksum is expected for the PSI5 channel x in slot y. Else  1 bit Parity is assumed.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FEC0</name>
								<description>Frame Expectation Control   FEC5. If set  a frame is expected for the PSI5 channel x in slot y. A No Frame Received error interrupt NFI is issued each time  the watch dog timer for the PSI5 channel x  slot y expires without reception of a SOF or EOF.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FEC1</name>
								<description>Frame Expectation Control   FEC5. If set  a frame is expected for the PSI5 channel x in slot y. A No Frame Received error interrupt NFI is issued each time  the watch dog timer for the PSI5 channel x  slot y expires without reception of a SOF or EOF.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FEC2</name>
								<description>Frame Expectation Control   FEC5. If set  a frame is expected for the PSI5 channel x in slot y. A No Frame Received error interrupt NFI is issued each time  the watch dog timer for the PSI5 channel x  slot y expires without reception of a SOF or EOF.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FEC3</name>
								<description>Frame Expectation Control   FEC5. If set  a frame is expected for the PSI5 channel x in slot y. A No Frame Received error interrupt NFI is issued each time  the watch dog timer for the PSI5 channel x  slot y expires without reception of a SOF or EOF.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FEC4</name>
								<description>Frame Expectation Control   FEC5. If set  a frame is expected for the PSI5 channel x in slot y. A No Frame Received error interrupt NFI is issued each time  the watch dog timer for the PSI5 channel x  slot y expires without reception of a SOF or EOF.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FEC5</name>
								<description>Frame Expectation Control   FEC5. If set  a frame is expected for the PSI5 channel x in slot y. A No Frame Received error interrupt NFI is issued each time  the watch dog timer for the PSI5 channel x  slot y expires without reception of a SOF or EOF.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VBS0</name>
								<description>Verbose Mode   VBS5. If set  and a message is expected for the PSI5 channel x in slot y  FECy  an empty frame is stored in RDRL Hx and the referring RDML H each time  the watch dog timer for the PSI5 channel x  slot y expires without reception of a frame.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VBS1</name>
								<description>Verbose Mode   VBS5. If set  and a message is expected for the PSI5 channel x in slot y  FECy  an empty frame is stored in RDRL Hx and the referring RDML H each time  the watch dog timer for the PSI5 channel x  slot y expires without reception of a frame.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VBS2</name>
								<description>Verbose Mode   VBS5. If set  and a message is expected for the PSI5 channel x in slot y  FECy  an empty frame is stored in RDRL Hx and the referring RDML H each time  the watch dog timer for the PSI5 channel x  slot y expires without reception of a frame.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VBS3</name>
								<description>Verbose Mode   VBS5. If set  and a message is expected for the PSI5 channel x in slot y  FECy  an empty frame is stored in RDRL Hx and the referring RDML H each time  the watch dog timer for the PSI5 channel x  slot y expires without reception of a frame.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VBS4</name>
								<description>Verbose Mode   VBS5. If set  and a message is expected for the PSI5 channel x in slot y  FECy  an empty frame is stored in RDRL Hx and the referring RDML H each time  the watch dog timer for the PSI5 channel x  slot y expires without reception of a frame.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>VBS5</name>
								<description>Verbose Mode   VBS5. If set  and a message is expected for the PSI5 channel x in slot y  FECy  an empty frame is stored in RDRL Hx and the referring RDML H each time  the watch dog timer for the PSI5 channel x  slot y expires without reception of a frame.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>RCRCx</name>
						<description>Receiver Control Register C 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>12</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>BRS</name>
								<description>Bit Rate Select   BRS</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TSP</name>
								<description>Time Stamp Select for Pulses   TSP</description>
								<lsb>1</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TSF</name>
								<description>Time Stamp Select for Start of Frame  SOF    TSF</description>
								<lsb>3</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TSR</name>
								<description>Time Stamp Select for Receive Data Registers   TSR</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>7</dim>
						<dimIncrement>4</dimIncrement>
						<name>WDTxw[%s]</name>
						<description>Watch Dog Timer Register 00
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>16</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>WDL</name>
								<description>Watch Dog Timer Limit   WDL. for channel x limit w.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>RSRx</name>
						<description>Receive Status Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>44</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CRC</name>
								<description>CRC   CRC. of last frame. CRC0 is on bit position 0.</description>
								<lsb>0</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>MSG</name>
								<description>Messaging Bits   MSG. of last frame. MSG0 is on bit position 8.</description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>6</dim>
						<dimIncrement>4</dimIncrement>
						<name>SDSxz[%s]</name>
						<description>Serial Data and Status Register 00
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>48</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SD</name>
								<description>Serial Data   SD. of last serial data frame on channel x slot z. SD0 is on bit position 0.        If SDS.CON is not set  bits  15 12  are zero.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>MID</name>
								<description>Message ID   MID. of last serial data frame. ID0 is on bit position 16. If SDS.CON is set         bits  23 20  are zero.</description>
								<lsb>16</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SCRC</name>
								<description>SCRC   SCRC. CRC of last serial data frame. CRC0 is on position 24.</description>
								<lsb>24</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SCRI</name>
								<description>CRC of Serial Message failed Interrupt Flag.   SCRI. This bit is set if the CRC of the serial message fails. This includes a        check of the Messaging bit field for correct 0 values of bit 1 in frames        7  13 and 18. See INTSTATx.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CON</name>
								<description>Configuration bit   CON. of last serial frame.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>SPTSCx</name>
						<description>Start of Pulse Time Stamp Capture Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>72</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TS</name>
								<description>Time Stamp   TS. of the last sync pulse sent on channel x. The Time Stamp is taken at the        rising edge of the pulse.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
