J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>SFTSCx</name>
						<description>Start of Frame Time Stamp Capture Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>76</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TS</name>
								<description>Time Stamp   TS. of the last frame received on channel x. The Time Stamp is taken at the        rising edge of the first start bit S1 that was qualified by the receiver.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>RDRLx</name>
						<description>Receive Data Register Low 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>80</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CRCI</name>
								<description>CRC Error Flag   CRCI. This bit is set if the CRC or Parity check fails. Set as well if CRC can        not be calculated  PDL   0  CRC cut off by Manchester Error  too few        bits  BOT  Sync Pulse </description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CRC</name>
								<description>CRC   CRC. CRC parity bit of last PSI5 frame. CRC0 or Parity bit is on bit position        1. In case of NFI  this field is cleared.</description>
								<lsb>1</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RD</name>
								<description>RD   RD. Receive data of last PSI5 frame. D0 is on bit position 4. In case of        NFI  this field is cleared.</description>
								<lsb>4</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>RDRHx</name>
						<description>Receive Data Register High 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>84</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TS</name>
								<description>Time Stamp   TS. of the last received PSI5 frame. RCRC.TSR determines if SPTSCx or SFTSCx        is stored in RDRHx.  It can be selected if the time stamp of the last        sync pulse is stored or the time stamp for the start of frame .</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SC</name>
								<description>Slot Counter   SC. In Synchronous Mode  RCRAx.ASYN 0   Number of the slot the SOF of the        frame was received in. In Asynchronous Mode  RCRAx.ASYN 1   revolving        frame number between 1 and 6. Note        that in Asynchronous Mode all slow channel data is still collected in        Slot 1  SDSx0 .</description>
								<lsb>24</lsb>
								<msb>26</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TEI</name>
								<description>Time Slot Error Flag   TEI. In Synchronous Mode  RCRAx.ASYN   0   this bit is set if the SOF and the        EOF of a frame are received in different time slots. The slots are        constraint by the watch dog timer  see WDTxy . In Asynchronous Mode         RCRAx.ASYN   1   this bit is set if the distance between two frames is        longer than specified in WDL0.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>NBI</name>
								<description>Number of bits Error Flag   NBI. This bit is set if the last frame received less bits than expected but        no manchester coding error occurred until S1  S2  M0 and M1 where        received. Note that the frame after the error might be completely wrong.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>MEI</name>
								<description>Error in Message Bits Flag   MEI. This bit is set if a manchester error occurred in Bit M0 or M1.  Only if        configured in RCRBx.MSG  Note that the frame after the error might be completely wrong.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>NFI</name>
								<description>No Frame Received Flag   NFI. This bit is set when the NFI condition as described in the first paragraph of INTSTATA.NFI occurs. If only the two start bits are received and no further data  this   x201c SOF  x201d  is discarded completely and treated like no frame received as well. If RCRBx.VBS is set  an empty frame is stored anyhow and RDIx is issued as well. The content of RDRL Hx   RDML Hx is valid for SC and for this bit  NFI . Bit fields RD and CRC are cleared  all zero . If RCRC.VBSx is 0 then TS is cleared. If RCRC.VBSx is 1 then TS is set to either SPTSCx.TS or SFTSCx.TS depending on the value of RCRC.TSR.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RBI</name>
								<description>Receive Buffer Overflow Flag   RBI. This bit is set after a frame has been received while the old one was        not read from RDRHx. I.e. the kernel wants to set any of the two        interrupts RSI and RDI and finds any of these two interrupts already        set. The old data is overwritten by the new data.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>PGCx</name>
						<description>Pulse Generation Control Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>88</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>PLEN</name>
								<description>Pulse Length   PLEN. Defines the length of the pulse in TTS times  defined by FDRT . This is        the standard pulse width without data coding into the pulse width or for        coding a   8216 0  8217 .</description>
								<lsb>0</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DEL</name>
								<description>Delay Length   DEL. In case data is coded into the pulse length  this defines the ADDITONAL        length of the pulse in TTS times. The resulting sum length is the pulse        width for coding a   8216 1  8217  into the pulse width.</description>
								<lsb>8</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBS</name>
								<description>Time Base Select   TBS. This bit selects the clock source for CTVx</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ETB</name>
								<description>External Time Base Select   ETB. Selects the external clock line for counter CTVx.</description>
								<lsb>16</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PTE</name>
								<description>Periodic Trigger Enable   PTE. Periodic trigger is defined by CTVx. Should be 0 if ETE or BYP is set.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ETS</name>
								<description>External Trigger Select   ETS. Selects the external trigger line for pulse generation  e.g. angle        synchronous .</description>
								<lsb>20</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ETE</name>
								<description>External Trigger Enable   ETE.   8220 Angle sync. trigger  8221   external line is selected by ETS. Should be 0 if        PTE or BYP is set.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BYP</name>
								<description>Bypass Enable   BYP. An external signal  selected by ETS directly drives the output of        channel x. Should be 0 if PTE or ETE is set.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BOT</name>
								<description>Blank Out Time   BOT. BOT defines the length of the blank out time in TTS times  defined by        FDRT  starting from the end of a Sync Pulse. The receiver is always        switched off starting from the beginning of a Sync Pulse. BOT keeps the        receiver switched off additionally after the Sync Pulse. This suppresses        potential noise on the receive line after the pulse and thus eases the        design of the transceiver.</description>
								<lsb>25</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CTVx</name>
						<description>Channel Trigger Value Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>92</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CTV</name>
								<description>Channel Trigger Value CTV   CTV. Contains the compare value  exact match  of Channel Trigger CTC at which        a sync pulse is triggered for channel x and the counter CTC is cleared.        If cleared  CTC is stopped and no pulse is generated.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CTC</name>
								<description>Channel Trigger Counter   CTC. This bit field allows to read the current counter value of the reset        timer cell CTVx. If GCR.ETCx is cleared  CTC can be written.</description>
								<lsb>16</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>SCRx</name>
						<description>Send Control Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>96</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>PLL</name>
								<description>Pay Load Length of Registers SDRL H   PLL. If PLL  gt  31  SDRH needs to be written to trigger the HW for automatic        STA  BSC or CRC generation or just moving data to SSRL H. Else writing        to SDRL is sufficient. PLL needs to written before SDRL H is used for        proper operation. If insertion of STA  BSC and CRC results in more than        64 bits  the MSBs are truncated in SSR. Defines the length that is taken        into account </description>
								<lsb>0</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EPS</name>
								<description>Enhanced Protocol Selection   EPS</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BSC</name>
								<description>Bit Stuffing Control   BSC. Depending from bit EPS after 3 bits a   8216 1  8217  is inserted  V1.3  or after 6        bits a   8216 0  8217  is inserted  enhanced Power Train Mode  Note that this makes the frame longer.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SSL</name>
								<description>Pay Load Length of Registers SSRL H   SSL. If SSL  gt  31  SSRH needs to be written to trigger the HW for automatic        moving data to SORL H. Else writing to SSRL is sufficient. SSL needs to        be written before SSRL H is used for proper operation. Defines the        length that is taken into account. Start Sequence  BSC and CRC need to        be added to PLL by SW if SSL is calculated based on PLL.</description>
								<lsb>8</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FLUS</name>
								<description>Flush SSRH Lx   FLUS. Setting this bit stops the shifting process and flushes  clears  SSRH Lx        and TSF. TPIx is issued at the end of successful flushing. Reads always        as zero.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>FLUO</name>
								<description>Flush SORH Lx   FLUO. Setting this bit stops the sending process and flushes  clears  SORH Lx        and TOF. TSIx is issued at the end of successful flushing. Reads always        as zero.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>SOL</name>
								<description>Pay Load Length of Registers SORL H   SOL. If SOL  gt  31  SORH needs to be written to trigger the HW for automatic        moving data to the pulse generator. Else writing to SORL is sufficient.        SOL needs to written before SORL H is used for proper operation. Defines        the length that is taken into account. Start Sequence  CRC and Stuffing        needs to be added by SW to PLL if SOL is calculated based on PLL.</description>
								<lsb>16</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CRC</name>
								<description>CRC Generation Control   CRC</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>STA</name>
								<description>Start Sequence Generation Control   STA</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INH</name>
								<description>Inhibit Transfer   INH. This inhibits the automatic transfer from the shift registers SSRL H to        SORL H after the preparation of all automatic bit fields  STA  BSC         CRC . After a write access to SDRL Hx  the automatic preparation is done        by HW if selected. If automatic preparation of the start sequence is not        selected  data is moved by HW without change to SSRL H. When the HW is        done with the transfer to the internal shift registers  interrupt TPI is        activated  flag TSF is set and flag TPF is cleared automatically.        Depending on INH  GO must be set after TPI before transfer to SORL H        takes place  After the transfer to SORL H  TSI is activated  TOF is set        and and TSF is cleared automatically. . INH defines the start mode </description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>GO</name>
								<description>Release prepared Send data   GO. This is only relevant if INH is set It allows for manual control of the        transfer from SSRH L to SORL H. It is always read as zero and is        automatically cleared.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>TPF</name>
								<description>Transmit Preparation Flag   TPF. If set  preparation is in progress  start sequence and  or CRC and or        stuffing and or at least copying data from SDRL H. If set  write access        to SDRL H will not change any data and issue TPOI. It is cleared automatically after preparation is finished.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TSF</name>
								<description>Transmit Shift Flag   TSF. If set  data in SSRL H is waiting to be shifted to SORL H. This can be        caused by an automatic transfer from SDRL H or from a CPU write access        to SSRL H. If SSL  lt  32 it is sufficient to write SSRL. Else  only        writing SSRH will set TSF. If set  write access to SSRL H will not        change any data and issue TSOI. It is cleared automatically after data was shifted to SORL H or after        flushing the register by setting bit FLUS.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TOF</name>
								<description>Transmit Output Flag   TOF. If set  data in SORL H is waiting to be transmitted to the sensor. This        can be caused by an automatic transfer from SSRL H or from a CPU write        access to SORL H. If SOL  lt  32 it is sufficient to write SORL. Else  only        writing SDRH will set TSF. If set  write access to SORL H will not        change any data and issue TOOI. It is cleared automatically after data was transmitted to the sensor or        after flushing the register by setting bit FLUO.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TRQ</name>
								<description>Transfer Request in Progress   TRQ. While a transfer is being sent this bit is set. Write access is ignored.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
