J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>SORLx</name>
						<description>Send Output Register Low 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>116</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SD0</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD1</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD2</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD3</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD4</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD5</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD6</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD7</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD8</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD9</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD10</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD11</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD12</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD13</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD14</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD15</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD16</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD17</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD18</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD19</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD20</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD21</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD22</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD23</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD24</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD25</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD26</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD27</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD28</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD29</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD30</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD31</name>
								<description>SD31   SD31. Send data of next ECU to Sensor frame. The sequence is  STS  AD  SD  CRC. Depending on individual field length  the bit stream is continued in SORHx.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>SORHx</name>
						<description>Send Output Register High 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>120</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SD32</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD33</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD34</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD35</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD36</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD37</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD38</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD39</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD40</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD41</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD42</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD43</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD44</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD45</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD46</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD47</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD48</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD49</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD50</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD51</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD52</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD53</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD54</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD55</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD56</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD57</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD58</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD59</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD60</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD61</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD62</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SD63</name>
								<description>SD63   SD63. Continues the bit stream as described in SORLx.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<dim>4</dim>
					<dimIncrement>8</dimIncrement>
					<name>RDM[%s]</name>
					<description>RDM</description>
					<addressOffset>1536</addressOffset>
					<cluster>
						<dim>32</dim>
						<dimIncrement>8</dimIncrement>
						<name>RDMx[%s]</name>
						<description/>
						<addressOffset>0</addressOffset>
						<register>
							<name>RDMLxy</name>
							<description>Receive Data Memory Low 00
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>CRCI</name>
									<description>CRC Error Flag   CRCI. Copied from RDRLx at frame end.</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CRC</name>
									<description>CRC   CRC. Copied from RDRLx at frame end.</description>
									<lsb>1</lsb>
									<msb>3</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>RD</name>
									<description>RD   RD. Copied from RDRLx at frame end.</description>
									<lsb>4</lsb>
									<msb>31</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
						<register>
							<name>RDMHxy</name>
							<description>Receive Data Memory High 00
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>4</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>TS</name>
									<description>Time Stamp   TS. Copied from RDRHx at frame end.</description>
									<lsb>0</lsb>
									<msb>23</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>SC</name>
									<description>Slot Counter   SC. Copied from RDRHx at frame end.</description>
									<lsb>24</lsb>
									<msb>26</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>TEI</name>
									<description>Time Slot Error Flag   TEI. Copied from RDRHx at frame end.</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>NBI</name>
									<description>Number of bits Error Flag   NBI. Copied from RDRHx at frame end.</description>
									<lsb>28</lsb>
									<msb>28</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>MEI</name>
									<description>Error in Messaging Bits Flag   MEI. Copied from RDRHx at frame end.</description>
									<lsb>29</lsb>
									<msb>29</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>NFI</name>
									<description>No Frame Received Flag   NFI. Copied from RDRHx at frame end.</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>RMI</name>
									<description>Receive Memory Overflow Flag   RMI. Copied from INTSTATAx at frame end.</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
					</cluster>
				</cluster>
				<register>
					<name>CLC</name>
					<description>Clock Control Register
 resetvalue={Application Reset:0x3}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>3</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit   DISR. Used for enable disable control of the module.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit   DISS. Bit indicates the current status of the module.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EDIS</name>
							<description>External Sleep Mode Request Disable Bit   EDIS. Used to control module s sleep mode. If this bit is cleared the kernel clock f PSI5 is disabled during System Sleep Mode.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
