J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>ID</name>
					<description>Module Identification Register
 resetvalue={Application Reset:0x0C3C000}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>12828672</resetValue>
					<resetMask>4294967040</resetMask>
					<fields>
						<field>
							<name>MODREV</name>
							<description>Module Revision Number   MODREV. This bit field defines the module revision number. The value of a module revision starts with 01 H  first revision .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODTYPE</name>
							<description>Module Type   MODTYPE. This bit field defines the module as a 32 bit module  C0 H</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODNUM</name>
							<description>Module Number Value   MODNUM. This bit field defines the module identification number for the PSI5  00C3 H</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FDR</name>
					<description>PSI5 Fractional Divider Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>12</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>STEP</name>
							<description>Step Value   STEP. Reload or addition value for RESULT.</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DM</name>
							<description>Divider Mode   DM. DM selects normal or fractional divider mode.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RESULT</name>
							<description>Result Value   RESULT. Bit field for the addition result.</description>
							<lsb>16</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FDRL</name>
					<description>Fractional Divider Register for Lower Bit Rate
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>16</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>STEP</name>
							<description>Step Value   STEP. Reload or addition value for RESULT.</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DM</name>
							<description>Divider Mode   DM. DM selects normal or fractional divider mode.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RESULT</name>
							<description>Result Value   RESULT. Bit field for the addition result.</description>
							<lsb>16</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FDRH</name>
					<description>Fractional Divider Register for Higher Bit Rate
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>20</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>STEP</name>
							<description>Step Value   STEP. Reload or addition value for RESULT.</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DM</name>
							<description>Divider Mode   DM. DM selects normal or fractional divider mode.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RESULT</name>
							<description>Result Value   RESULT. Bit field for the addition result.</description>
							<lsb>16</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FDRT</name>
					<description>Fractional Divider Register for Time Stamp
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>24</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>STEP</name>
							<description>Step Value   STEP. Reload or addition value for RESULT.</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DM</name>
							<description>Divider Mode   DM. DM selects normal or fractional divider mode.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RESULT</name>
							<description>Result Value   RESULT. Bit field for the addition result.</description>
							<lsb>16</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ECS</name>
							<description>External Time Stamp Clear Source Select   ECS. Selects the external trigger line that clears the global time stamp        counters TSRA B C.CTS if this is enabled by ECEA ECEB ECEC. Channel must        be disabled if changed  GCR.CEN   0 .</description>
							<lsb>26</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ECEA</name>
							<description>External Time Stamp Clear Enable A   ECEA. Enables the external trigger line selected by ECS to clear the global time stamp counter TSRA.CTS on rising edge of the external trigger.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ECEB</name>
							<description>External Time Stamp Clear Enable B   ECEB. Enables the external trigger line selected by ECS to clear the global time stamp counter TSRB.CTS on rising edge of the external trigger.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ECEC</name>
							<description>External Time Stamp Clear Enable C   ECEC. Enables the external trigger line selected by ECS to clear the global time stamp counter TSRC.CTS on rising edge of the external trigger.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSRA</name>
					<description>Module Time Stamp Register A
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>28</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CTS</name>
							<description>Current Time Stamp for the Module   CTS. This bit field shows the current time stamp.</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ETB</name>
							<description>External Time Base Select   ETB. Selects the external clock line for counter CTS. Channel must be        disabled if changed  GCR.CEN   0 .</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TBS</name>
							<description>Time Base Select   TBS. This bit selects the clock source for CTS</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ACLR</name>
							<description>Clear All Current Time Stamp Counters   ACLR. If set  this bit clears TSRA B C.CTS. TSRA B C.CTS count on  starting from 0. This bit is automatically cleared by HW and will always be read as zero.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR</name>
							<description>Clear Current Time Stamp for the Module   CLR. If set  this bit clears CTS. CTS counts on  starting from 0. This bit is automatically cleared by HW and will always be read as zero.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSRB</name>
					<description>Time Stamp Register B
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>32</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CTS</name>
							<description>Current Time Stamp for the Module   CTS. This bit field shows the current time stamp.</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ETB</name>
							<description>External Time Base Select   ETB. Selects the external clock line for counter CTS. Channel must be        disabled if changed  GCR.CEN   0 .</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TBS</name>
							<description>Time Base Select   TBS. This bit selects the clock source for CTS</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ACLR</name>
							<description>Clear All Current Time Stamp Counters   ACLR. If set  this bit clears TSRA B C.CTS. TSRA B C.CTS count on  starting from 0. This bit is automatically cleared by HW and will always be read as zero.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR</name>
							<description>Clear Current Time Stamp for the Module   CLR. If set  this bit clears CTS. CTS counts on  starting from 0. This bit is automatically cleared by HW and will always be read as zero.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSRC</name>
					<description>Module Time Stamp Register C
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>36</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CTS</name>
							<description>Current Time Stamp for the Module   CTS. This bit field shows the current time stamp.</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ETB</name>
							<description>External Time Base Select   ETB. Selects the external clock line for counter CTS. Channel must be        disabled if changed  GCR.CEN   0 .</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TBS</name>
							<description>Time Base Select   TBS. This bit selects the clock source for CTS</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ACLR</name>
							<description>Clear All Current Time Stamp Counters   ACLR. If set  this bit clears TSRA B C.CTS. TSRA B C.CTS count on  starting from 0. This bit is automatically cleared by HW and will always be read as zero.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR</name>
							<description>Clear Current Time Stamp for the Module   CLR. If set  this bit clears CTS. CTS counts on  starting from 0. This bit is automatically cleared by HW and will always be read as zero.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GCR</name>
					<description>Global Control Register
 resetvalue={Application Reset:0x1F}</description>
					<addressOffset>44</addressOffset>
					<size>32</size>
					<resetValue>31</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CRCI</name>
							<description>CRCI   CRCI. is selected if bit is set.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NBI</name>
							<description>NBI   NBI. is selected if bit is set.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MEI</name>
							<description>MEI   MEI. is selected if bit is set.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NFI</name>
							<description>NFI   NFI. is selected if bit is set.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TEI</name>
							<description>TEI   TEI. is selected if bit is set.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC0</name>
							<description>Enable Channel Trigger Counter CTV4.CTC   ETC4. This bit enables CTVx.CTC. The bits ETC0 ..x can be set with one write access to synchronously start all counters. This is required for proper sync pulse staggering.  If set  CTCx counts on  starting from its current value. CTCx can be written only if ETCx is cleared  stopped . In the device only ETC0  4 are available. All other must be written with 0  and always read 0.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC1</name>
							<description>Enable Channel Trigger Counter CTV4.CTC   ETC4. This bit enables CTVx.CTC. The bits ETC0 ..x can be set with one write access to synchronously start all counters. This is required for proper sync pulse staggering.  If set  CTCx counts on  starting from its current value. CTCx can be written only if ETCx is cleared  stopped . In the device only ETC0  4 are available. All other must be written with 0  and always read 0.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC2</name>
							<description>Enable Channel Trigger Counter CTV4.CTC   ETC4. This bit enables CTVx.CTC. The bits ETC0 ..x can be set with one write access to synchronously start all counters. This is required for proper sync pulse staggering.  If set  CTCx counts on  starting from its current value. CTCx can be written only if ETCx is cleared  stopped . In the device only ETC0  4 are available. All other must be written with 0  and always read 0.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC3</name>
							<description>Enable Channel Trigger Counter CTV4.CTC   ETC4. This bit enables CTVx.CTC. The bits ETC0 ..x can be set with one write access to synchronously start all counters. This is required for proper sync pulse staggering.  If set  CTCx counts on  starting from its current value. CTCx can be written only if ETCx is cleared  stopped . In the device only ETC0  4 are available. All other must be written with 0  and always read 0.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC4</name>
							<description>Enable Channel Trigger Counter CTV4.CTC   ETC4. This bit enables CTVx.CTC. The bits ETC0 ..x can be set with one write access to synchronously start all counters. This is required for proper sync pulse staggering.  If set  CTCx counts on  starting from its current value. CTCx can be written only if ETCx is cleared  stopped . In the device only ETC0  4 are available. All other must be written with 0  and always read 0.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CEN0</name>
							<description>Enable Channel   CEN4. This bit enables PSI5 Channel x. If cleared  all internal state machines of the receiver and the sender are forced to default idle state while all registers can be read and written. Used for configuration of a channel. In the device only CEN0  4 are available. All other must be written with 0  and always read 0.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CEN1</name>
							<description>Enable Channel   CEN4. This bit enables PSI5 Channel x. If cleared  all internal state machines of the receiver and the sender are forced to default idle state while all registers can be read and written. Used for configuration of a channel. In the device only CEN0  4 are available. All other must be written with 0  and always read 0.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CEN2</name>
							<description>Enable Channel   CEN4. This bit enables PSI5 Channel x. If cleared  all internal state machines of the receiver and the sender are forced to default idle state while all registers can be read and written. Used for configuration of a channel. In the device only CEN0  4 are available. All other must be written with 0  and always read 0.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CEN3</name>
							<description>Enable Channel   CEN4. This bit enables PSI5 Channel x. If cleared  all internal state machines of the receiver and the sender are forced to default idle state while all registers can be read and written. Used for configuration of a channel. In the device only CEN0  4 are available. All other must be written with 0  and always read 0.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CEN4</name>
							<description>Enable Channel   CEN4. This bit enables PSI5 Channel x. If cleared  all internal state machines of the receiver and the sender are forced to default idle state while all registers can be read and written. Used for configuration of a channel. In the device only CEN0  4 are available. All other must be written with 0  and always read 0.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>INTOV</name>
					<description>Interrupt Overview Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>760</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RSI</name>
							<description>Interrupt Pending on any Node Pointer RSI   RSI. If any interrupt requested flag is set for any Node Pointer RSI in register INTSTATx AND the referring interrupt is enabled in INTENx  then INTOV.RSI is set. It is automatically reset if all flags in INTSTATx are cleared for which the referring interrupt is enabled in INTENx.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RDI</name>
							<description>Interrupt Pending on any Node Pointer RDI   RDI. If any interrupt requested flag is set for any Node Pointer RDI in register INTSTATx AND the referring interrupt is enabled in INTENx  then INTOV.RDI is set. It is automatically reset if all flags in INTSTATx are cleared for which the referring interrupt is enabled in INTENx.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RBI</name>
							<description>Interrupt Pending on any Node Pointer RBI   RBI. If any interrupt requested flag is set for any Node Pointer RBI in register INTSTATx AND the referring interrupt is enabled in INTENx  then INTOV.RBI is set. It is automatically reset if all flags in INTSTATx are cleared for which the referring interrupt is enabled in INTENx.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TDI</name>
							<description>Interrupt Pending on any Node Pointer TDI   TDI. If any interrupt requested flag is set for any Node Pointer TDI in register INTSTATx AND the referring interrupt is enabled in INTENx  then INTOV.TDI is set. It is automatically reset if all flags in INTSTATx are cleared for which the referring interrupt is enabled in INTENx.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TBI</name>
							<description>Interrupt Pending on any Node Pointer TBI   TBI. If any interrupt requested flag is set for any Node Pointer TBI in register INTSTATx AND the referring interrupt is enabled in INTENx  then INTOV.TBI is set. It is automatically reset if all flags in INTSTATx are cleared for which the referring interrupt is enabled in INTENx.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ERRI</name>
							<description>Interrupt Pending on any Node Pointer ERRI   ERRI. If any interrupt requested flag is set for any Node Pointer ERRI in register INTSTATx AND the referring interrupt is enabled in INTENx  then INTOV.ERRI is set. It is automatically reset if all flags in INTSTATx are cleared for which the referring interrupt is enabled in INTENx.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SDI</name>
							<description>Interrupt Pending on any Node Pointer SDI   SDI. If any interrupt requested flag is set for any Node Pointer SDI in register INTSTATx AND the referring interrupt is enabled in INTENx  then INTOV.SDI is set. It is automatically reset if all flags in INTSTATx are cleared for which the referring interrupt is enabled in INTENx.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FWI</name>
							<description>Interrupt Pending on any Node Pointer FWI   FWI. If any interrupt requested flag is set for any Node Pointer FWI in register INTSTATx AND the referring interrupt is enabled in INTENx  then INTOV.FWI is set. It is automatically reset if all flags in INTSTATx are cleared for which the referring interrupt is enabled in INTENx.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
