J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>INPx[%s]</name>
					<description>Interrupt Node Pointer Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>764</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RSI</name>
							<description>Interrupt Node Pointer for Interrupt RSI   RSI. This bit field defines the interrupt node  that is requested due to the        set condition for bit INTSTATAx.RSI  if enabled by bit INTENAx.RSI .</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RDI</name>
							<description>Interrupt Node Pointer for Interrupt RDI   RDI. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATAx.RDI  if enabled by bit INTENAx.RDI . For bit field definition  see RSI.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RBI</name>
							<description>Interrupt Node Pointer for Interrupt RBI   RBI. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATAx.RBI  if enabled by bit INTENAx.RBI . For bit field definition  see RSI.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TDI</name>
							<description>Interrupt Node Pointer for Interrupt TDI   TDI. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATAx.TPI  TSI  TOI  if enabled by bit INTENAx.TPI  TSI  TOI . For bit field definition  see RSI.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TBI</name>
							<description>Interrupt Node Pointer for Interrupt TBI   TBI. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATAx.TPOI  TSOI  TOOI  if enabled by bit INTENAx.TPOI  TSOI  TOOI . For bit field definition  see RSI.</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ERRI</name>
							<description>Interrupt Node Pointer for Interrupt ERRI   ERRI. This bit field defines the interrupt node  that is requested due to the set condition for bit TEI  NFI  NBI  MEI  CRCI  RUI  RMI  CRCIy  WSIy  SOIy  SCRIy. For bit field definition  see RSI.</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SDI</name>
							<description>Interrupt Node Pointer for Interrupt SDI   SDI. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATx.SDI  if enabled by bit INTENx.SDI . For bit field definition  see RSI.</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FWI</name>
							<description>Interrupt Node Pointer for FWI   FWI. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATx.FWI. For bit field definition  see RSI.</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>INTSTATAx[%s]</name>
					<description>Interrupt Status Register A 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>784</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RSI</name>
							<description>Receive Success Interrupt Request Flag   RSI. This bit is set at the successfully received end of a frame. It indicates that this frame is free of the errors NFI  TEI  NBI  MEI  CRCI if selected to be taken into account in register GCR. This bit can be cleared by bit INTCLRAx.RSI. This bit can be set by bit INTSETAx.RSI. This bit is set independently from INTENAx.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RDI</name>
							<description>Receive Data Interrupt Request Flag   RDI. RDI is activated when a received frame is moved to a Receive Data Register RDRL Hx. Both RDI and RSI will be issued together at correct reception. This bit can be cleared by bit INTCLRAx.RDI. This bit can be set by bit INTSETAx.RDI. This bit is set independently from INTENAx.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RBI</name>
							<description>Receive Buffer Overflow Interrupt Request Flag   RBI. This bit is set after a frame has been received while the old one was not read from RDRHx. I.e. the kernel wants to set any of the two interrupts RSI and RDI and finds any of these two interrupts already set. The old data is overwritten by the new data. Thus  RBI can be ignored if the receive memory is used. This bit is NOT cleared by reading RDRx. This bit can be cleared by bit INTCLRAx.RBI. This bit can be set by bit INTSETAx.RBI. This bit is set independently from INTENAx.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TEI</name>
							<description>Time Slot Error Interrupt Request Flag   TEI. In Synchronous Mode  RCRAx.ASYN   0   this bit is set if the SOF and the EOF of a frame are received in different time slots. The slots are constraint by the watch dog timer  see WDTxy . In Asynchronous Mode  RCRAx.ASYN   1   this bit is set if the distance between two frames is longer than specified in WDL0. This bit can be cleared by bit INTCLRAx.TEI. This bit can be set by bit INTSETAx.TEI. This bit is set independently from INTENAx.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>NBI</name>
							<description>Number of Bits Wrong Request Flag   NBI. This bit is set if the last frame received less bits than expected but no Manchester coding error occurred until S1  S2  M0 and M1 where received. I. e. fewer bits or Manchester error after M1 received. Note that the frame after the error might be completely wrong. The frame is no longer checked  from the Manchester error on  zeros are inserted and a start of frame is looked for  no occurrence of edges for at least one bit time followed by two zero bits. This bit can be cleared by bit INTCLRAx.NBI. This bit can be set by bit INTSETAx.NBI. This bit is set independently from INTENAx.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MEI</name>
							<description>Error in Message Bits Flag   MEI. This bit is set if a manchester error occurred in Bit M0 or M1.  Only if configured in RCRBx.MSG  Note that the frame after the error might be completely wrong. The frame is no longer checked  from the Manchester error on  zeros are inserted and a start of frame is looked for  no occurrence of edges for at least one bit time followed by two zero bits. This bit can be cleared by bit INTCLRAx.MEI. This bit can be set by bit INTSETAx.MEI. This bit is set independently from INTENAx.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CRCI</name>
							<description>CRC Error Request Flag   CRCI. This bit is set if the CRC fails. Set as well if CRC can not be calculated  PDL   0  CRC cut off by Manchester Error  too few bits  BOT  Sync Pulse  This bit can be cleared by bit INTCLRAx.CRCI. This bit can be set by bit INTSETAx.CRCI. This bit is set independently from INTENAx.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FWI</name>
							<description>FIFO Warning Level Request Flag   FWI. This bit is set after if the configured warning level of the FIFOx was reached.  See RFCx  This bit can be cleared by bit INTCLRAx.FWI. This bit can be set by bit INTSETAx.FWI. This bit is set independently from INTENAx.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RUI</name>
							<description>Receive Memory Underrun Interrupt Request Flag   RUI. This bit is set after a SPB master reads from FIFO while no new data was available.  See RFCx  This bit can be cleared by bit INTCLRAx.RUI. This bit can be set by bit INTSETAx.RUI. This bit is set independently from INTENAx.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RMI</name>
							<description>Receive Memory Overflow Flag   RMI. This bit is set after a frame has been received while RDIOVx.RDI RFCx.WRP  is set.  I.e. the kernel wants to set flag RDIxWRP and finds this flag already set. The old data is overwritten by the new data in the buffer memory. This bit can be cleared by bit INTCLRAx.RMIx. This bit can be set by bit INTSETAx.RMIx. This bit is set independently from INTENAx.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TPI</name>
							<description>Transfer Preparation Interrupt Request Flag   TPI. This bit is set after data to be transferred has been moved from SDRL H to SSRL H. Thus a new value can be written to SDRL Hx and the prepared data can be checked and modified by SW. This bit is automatically cleared by writing SDRx. This is an exception  It allows for DMA transfers without CPU activity. This bit can be cleared by bit INTCLRAx.TDI. This bit can be set by bit INTSETAx.TDI. This bit is set independently from INTENAx.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TPOI</name>
							<description>Transmit Preparation Overflow Interrupt Request Flag   TPOI. This bit is set after if SDRL H is written while TPF is set.  The old data is NOT overwritten. This bit can be cleared by bit INTCLRAx.TPOI. This bit can be set by bit INTSETAx.TPOI. This bit is set independently from INTENAx.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSI</name>
							<description>Transfer Shift Interrupt Request Flag   TSI. This bit is set after data to be transferred has been moved from SSRL H to SORL H. Thus a new value can be written to SSRL Hx. This bit is NOT cleared by writing SSRL Hx. This bit can be cleared by bit INTCLRAx.TSI. This bit can be set by bit INTSETAx.TSI. This bit is set independently from INTENAx.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSOI</name>
							<description>Transmit Shift Overflow Interrupt Request Flag   TSOI. This bit is set after if SSRL H is written while TSF is set.  The old data is NOT overwritten. This bit can be cleared by bit INTCLRAx.TSOI. This bit can be set by bit INTSETAx.TSOI. This bit is set independently from INTENAx.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TOI</name>
							<description>Transfer Output Interrupt Request Flag   TOI. This bit is set after last bit to be transferred has been moved from SORL H to the pulse generator. Thus a new value can be written to SORL Hx. This bit is NOT cleared by writing SORL Hx. This bit can be cleared by bit INTCLRAx.TOI. This bit can be set by bit INTSETAx.TOI. This bit is set independently from INTENAx.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TOOI</name>
							<description>Transmit Shift Overflow Interrupt Request Flag   TOOI. This bit is set after if SORL H is written while TOF is set.  The old data is NOT overwritten. This bit can be cleared by bit INTCLRAx.TOOI. This bit can be set by bit INTSETAx.TOOI. This bit is set independently from INTENAx.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>NFI</name>
							<description>No Frame Received Interrupt Flag   NFI. This bit is set at the end of a slot if a frame is expected in the slot and SOF was not received in the slot. A special case is where an SOF is received in slot 0. In this scenario  the NFI bit is only set at the end of slot 1 if a frame is expected in slot 1 and an EOF was not received in slot 1. If only the two start bits are received and no further data  this   x201c SOF  x201d  is discarded completely and treated like no frame received as well. If the   x201c SOF only frame  x201d  crosses the WDL  NFI occurs after WDL and EOF detection. If RCRBx.VBS is set  an empty frame is stored anyhow. In this case RDIx is issued as well. The only valid information is SC  TS  captured at the end of the slot  and this bit  NFI . This bit can be cleared by bit INTCLRAx.NFI. This bit can be set by bit INTSETAx.NFI. This bit is set independently from INTENAx.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
