J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>RDISETx[%s]</name>
					<description>RDI Overview Set Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1296</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RDI0</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI1</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI2</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI3</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI4</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI5</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI6</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI7</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI8</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI9</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI10</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI11</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI12</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI13</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI14</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI15</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI16</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI17</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI18</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI19</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI20</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI21</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI22</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI23</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI24</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI25</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI26</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI27</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI28</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI29</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI30</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI31</name>
							<description>Set RDI Flag of Buffer 31   RDI31. Setting this bit sets bit RDIOVx.RDIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>NFISETx[%s]</name>
					<description>NFI Overview Set Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1316</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>NFI0</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI1</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI2</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI3</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI4</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI5</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI6</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI7</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI8</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI9</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI10</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI11</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI12</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI13</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI14</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI15</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI16</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI17</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI18</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI19</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI20</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI21</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI22</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI23</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI24</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI25</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI26</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI27</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI28</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI29</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI30</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFI31</name>
							<description>Set NFI Flag of Buffer 31   NFI31. Setting this bit sets bit NFIOVx.NFIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
