J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>MEISETx[%s]</name>
					<description>MEI Overview Set Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1336</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MEI0</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI1</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI2</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI3</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI4</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI5</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI6</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI7</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI8</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI9</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI10</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI11</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI12</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI13</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI14</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI15</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI16</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI17</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI18</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI19</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI20</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI21</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI22</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI23</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI24</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI25</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI26</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI27</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI28</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI29</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI30</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MEI31</name>
							<description>Set MEI Flag of Buffer 31   MEI31. Setting this bit sets bit MEIOVx.MEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>RSICLRx[%s]</name>
					<description>RSI Overview Clear Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1356</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RSI0</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI1</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI2</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI3</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI4</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI5</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI6</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI7</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI8</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI9</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI10</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI11</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI12</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI13</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI14</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI15</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI16</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI17</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI18</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI19</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI20</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI21</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI22</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI23</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI24</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI25</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI26</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI27</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI28</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI29</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI30</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RSI31</name>
							<description>Clear RSI Flag of Buffer 31   RSI31. Setting this bit clears bit RSIOVx.RSIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
