J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>TEICLRx[%s]</name>
					<description>TEI Overview Clear Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1416</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TEI0</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI1</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI2</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI3</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI4</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI5</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI6</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI7</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI8</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI9</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI10</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI11</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI12</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI13</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI14</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI15</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI16</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI17</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI18</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI19</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI20</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI21</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI22</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI23</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI24</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI25</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI26</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI27</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI28</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI29</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI30</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI31</name>
							<description>Clear TEI Flag of Buffer 31   TEI31. Setting this bit clears bit TEIOVx.TEIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>CRCICLRx[%s]</name>
					<description>CRCI Overview Clear Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1436</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CRCI0</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI1</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI2</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI3</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI4</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI5</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI6</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI7</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI8</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI9</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI10</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI11</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI12</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI13</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI14</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI15</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI16</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI17</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI18</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI19</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI20</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI21</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI22</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI23</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI24</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI25</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI26</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI27</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI28</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI29</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI30</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI31</name>
							<description>Clear CRCI Flag of Buffer 31   CRCI31. Setting this bit clears bit CRCIOVx.CRCIy Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
