J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PSI5S</name>
			<version>100</version>
			<description>PSI5S</description>
			<baseAddress>4026560512</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>996</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CLC</name>
					<description>Clock Control Register
 resetvalue={Application Reset:0x3}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>3</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit   DISR. Used for enable disable control of the module. This bit disables the kernel clocks f PSI5 S and the ASC clock f ASC .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit   DISS. Bit indicates the current status of the module.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EDIS</name>
							<description>External Sleep Mode Request Disable Bit   EDIS. Used to control module s sleep mode. If this bit is cleared the kernel clocks f PSI5 S and the ASC clock f ASC are disabled during System Sleep Mode.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Module Identification Register
 resetvalue={Application Reset:0x0D3C000}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>13877248</resetValue>
					<resetMask>4294967040</resetMask>
					<fields>
						<field>
							<name>MODREV</name>
							<description>Module Revision Number   MODREV. This bit field defines the module revision number. The value of a module revision starts with 01 H  first revision .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODTYPE</name>
							<description>Module Type   MODTYPE. This bit field defines the module as a 32 bit module  C0 H</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODNUM</name>
							<description>Module Number Value   MODNUM. This bit field defines the module identification number for the PSI5 S  00D3 H</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FDR</name>
					<description>PSI5 S Fractional Divider Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>12</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>STEP</name>
							<description>Step Value   STEP. Reload or addition value for RESULT.</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DM</name>
							<description>Divider Mode   DM. DM selects normal or fractional divider mode.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RESULT</name>
							<description>Result Value   RESULT. Bit field for the addition result.</description>
							<lsb>16</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FDRT</name>
					<description>Fractional Divider Register for Time Stamp
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>16</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>STEP</name>
							<description>Step Value   STEP. Reload or addition value for RESULT.</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DM</name>
							<description>Divider Mode   DM. DM selects normal or fractional divider mode.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RESULT</name>
							<description>Result Value   RESULT. Bit field for the addition result.</description>
							<lsb>16</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ECS</name>
							<description>External Time Stamp Clear Source Select   ECS. Selects the external trigger line that clears the global Time Stamp        Counters TSCNTA B.CTS if this is enabled by ECEA ECEB.</description>
							<lsb>26</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ECEA</name>
							<description>External Time Stamp Clear Enable A   ECEA. Enables the external trigger line selected by ECS to clear the global Time Stamp Counter TSCNTA.CTS on rising edge of the external trigger.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ECEB</name>
							<description>External Time Stamp Clear Enable B   ECEB. Enables the external trigger line selected by ECS to clear the global Time Stamp Counter TSCNTB.CTS on rising edge of the external trigger.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSCNTA</name>
					<description>Time Stamp Count Register A
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>20</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CTS</name>
							<description>Current Time Stamp for the Module   CTS. This bit field shows the current time stamp.</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ETB</name>
							<description>External Time Base Select   ETB. Selects the external clock line for counter CTS if TBS is set.</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TBS</name>
							<description>Time Base Select   TBS. This bit selects the clock source for CTS</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TBEA</name>
							<description>Time Base Enable TSCNTA   TBEA. This bit starts stops TSCNTA.CTS</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TBEB</name>
							<description>Time Base Enable TSCNTB   TBEB. This bit starts stops TSCNTB.CTS</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLRA</name>
							<description>Clear Time Stamp Counter A   CLRA. This bit clears TSCNTA.CTS.  TSCNTA.CTS counts on  starting from 0.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLRB</name>
							<description>Clear Time Stamp Counter B   CLRB. This bit clears TSCNTB.CTS.  TSCNTB.CTS counts on  starting from 0.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSCNTB</name>
					<description>Time Stamp Count Register B
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>24</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CTS</name>
							<description>Current Time Stamp for the Module   CTS. This bit field shows the current time stamp.</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ETB</name>
							<description>External Time Base Select   ETB. Selects the external clock line for counter CTS.</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TBS</name>
							<description>Time Base Select   TBS. This bit selects the clock source for CTS</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GCR</name>
					<description>Global Control Register
 resetvalue={Application Reset:0x1F}</description>
					<addressOffset>28</addressOffset>
					<size>32</size>
					<resetValue>31</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CRCI</name>
							<description>CRCI   CRCI. is selected if bit is set.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>XCRCI</name>
							<description>XCRCI   XCRCI. is selected if bit is set.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TEI</name>
							<description>TEI   TEI. is selected if bit is set.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PE</name>
							<description>PE   PE. is selected if bit is set.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FE</name>
							<description>FE   FE. is selected if bit is set.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OE</name>
							<description>OE   OE. is selected if bit is set.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RBI</name>
							<description>RBI   RBI. is selected if bit is set.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HDI</name>
							<description>HDI   HDI. is selected if bit is set.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC0</name>
							<description>Enable Channel Trigger Counter CTV7.CTC   ETC7. This bit enables CTVx.CTC. The bits ETC0   8230  x can be set with one write        access to synchronously start all counters. This is required for proper        sync pulse staggering. If set  CTCx counts on  starting from its current        value. CTCx can be written only if ETCx is cleared  stopped .</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC1</name>
							<description>Enable Channel Trigger Counter CTV7.CTC   ETC7. This bit enables CTVx.CTC. The bits ETC0   8230  x can be set with one write        access to synchronously start all counters. This is required for proper        sync pulse staggering. If set  CTCx counts on  starting from its current        value. CTCx can be written only if ETCx is cleared  stopped .</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC2</name>
							<description>Enable Channel Trigger Counter CTV7.CTC   ETC7. This bit enables CTVx.CTC. The bits ETC0   8230  x can be set with one write        access to synchronously start all counters. This is required for proper        sync pulse staggering. If set  CTCx counts on  starting from its current        value. CTCx can be written only if ETCx is cleared  stopped .</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC3</name>
							<description>Enable Channel Trigger Counter CTV7.CTC   ETC7. This bit enables CTVx.CTC. The bits ETC0   8230  x can be set with one write        access to synchronously start all counters. This is required for proper        sync pulse staggering. If set  CTCx counts on  starting from its current        value. CTCx can be written only if ETCx is cleared  stopped .</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC4</name>
							<description>Enable Channel Trigger Counter CTV7.CTC   ETC7. This bit enables CTVx.CTC. The bits ETC0   8230  x can be set with one write        access to synchronously start all counters. This is required for proper        sync pulse staggering. If set  CTCx counts on  starting from its current        value. CTCx can be written only if ETCx is cleared  stopped .</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC5</name>
							<description>Enable Channel Trigger Counter CTV7.CTC   ETC7. This bit enables CTVx.CTC. The bits ETC0   8230  x can be set with one write        access to synchronously start all counters. This is required for proper        sync pulse staggering. If set  CTCx counts on  starting from its current        value. CTCx can be written only if ETCx is cleared  stopped .</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC6</name>
							<description>Enable Channel Trigger Counter CTV7.CTC   ETC7. This bit enables CTVx.CTC. The bits ETC0   8230  x can be set with one write        access to synchronously start all counters. This is required for proper        sync pulse staggering. If set  CTCx counts on  starting from its current        value. CTCx can be written only if ETCx is cleared  stopped .</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC7</name>
							<description>Enable Channel Trigger Counter CTV7.CTC   ETC7. This bit enables CTVx.CTC. The bits ETC0   8230  x can be set with one write        access to synchronously start all counters. This is required for proper        sync pulse staggering. If set  CTCx counts on  starting from its current        value. CTCx can be written only if ETCx is cleared  stopped .</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CEN0</name>
							<description>Enable Channel 7   CEN7. This bit enables PSI5 S Channel x. If cleared  all internal state        machines of the receiver and the sender are forced to default idle state        while all registers can be read and written. Used for configuration of a        channel. Frames received for a disabled channel are copied to ChID 0  FID 1 with        original IDs.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CEN1</name>
							<description>Enable Channel 7   CEN7. This bit enables PSI5 S Channel x. If cleared  all internal state        machines of the receiver and the sender are forced to default idle state        while all registers can be read and written. Used for configuration of a        channel. Frames received for a disabled channel are copied to ChID 0  FID 1 with        original IDs.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CEN2</name>
							<description>Enable Channel 7   CEN7. This bit enables PSI5 S Channel x. If cleared  all internal state        machines of the receiver and the sender are forced to default idle state        while all registers can be read and written. Used for configuration of a        channel. Frames received for a disabled channel are copied to ChID 0  FID 1 with        original IDs.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CEN3</name>
							<description>Enable Channel 7   CEN7. This bit enables PSI5 S Channel x. If cleared  all internal state        machines of the receiver and the sender are forced to default idle state        while all registers can be read and written. Used for configuration of a        channel. Frames received for a disabled channel are copied to ChID 0  FID 1 with        original IDs.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CEN4</name>
							<description>Enable Channel 7   CEN7. This bit enables PSI5 S Channel x. If cleared  all internal state        machines of the receiver and the sender are forced to default idle state        while all registers can be read and written. Used for configuration of a        channel. Frames received for a disabled channel are copied to ChID 0  FID 1 with        original IDs.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CEN5</name>
							<description>Enable Channel 7   CEN7. This bit enables PSI5 S Channel x. If cleared  all internal state        machines of the receiver and the sender are forced to default idle state        while all registers can be read and written. Used for configuration of a        channel. Frames received for a disabled channel are copied to ChID 0  FID 1 with        original IDs.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CEN6</name>
							<description>Enable Channel 7   CEN7. This bit enables PSI5 S Channel x. If cleared  all internal state        machines of the receiver and the sender are forced to default idle state        while all registers can be read and written. Used for configuration of a        channel. Frames received for a disabled channel are copied to ChID 0  FID 1 with        original IDs.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CEN7</name>
							<description>Enable Channel 7   CEN7. This bit enables PSI5 S Channel x. If cleared  all internal state        machines of the receiver and the sender are forced to default idle state        while all registers can be read and written. Used for configuration of a        channel. Frames received for a disabled channel are copied to ChID 0  FID 1 with        original IDs.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IDT</name>
							<description>Idle Time  GLOBAL VALUE FOR ALL CHANNELS    IDT. determines the number of stop bits in addition to the stop bit of the        last UART Frame that is required for SOF detection.  IDT 1  idle bit        times are allowed tolerated within one Packet Frame. Default is IDT   0         i.e. back to back transfer.</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ASC</name>
							<description>ASC only Mode   ASC. is selected if bit is set. The ASC registers are fully controllable by        SW via SPB. If cleared  the ASC is controlled by the message reassembly unit and the        message generation unit. RBUF and TBUF are no longer writable by SW and        interrupts are handled by the message reassembly block automatically.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NFC</name>
					<description>Number of Frames Control Register
 resetvalue={Application Reset:0x249249}</description>
					<addressOffset>32</addressOffset>
					<size>32</size>
					<resetValue>2396745</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>NF0</name>
							<description>Number of expected Frames on Channel 7   NF7</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NF1</name>
							<description>Number of expected Frames on Channel 7   NF7</description>
							<lsb>3</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NF2</name>
							<description>Number of expected Frames on Channel 7   NF7</description>
							<lsb>6</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NF3</name>
							<description>Number of expected Frames on Channel 7   NF7</description>
							<lsb>9</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NF4</name>
							<description>Number of expected Frames on Channel 7   NF7</description>
							<lsb>12</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NF5</name>
							<description>Number of expected Frames on Channel 7   NF7</description>
							<lsb>15</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NF6</name>
							<description>Number of expected Frames on Channel 7   NF7</description>
							<lsb>18</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NF7</name>
							<description>Number of expected Frames on Channel 7   NF7</description>
							<lsb>21</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
