J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>FCNT</name>
					<description>Frame Counter Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>36</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FC0</name>
							<description>Frame Counter for Channel 7   FC7. Contains the number of received frames on Channel  160 x. Copied to RDR.FID        if RCRAx.FIDS is set.</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FC1</name>
							<description>Frame Counter for Channel 7   FC7. Contains the number of received frames on Channel  160 x. Copied to RDR.FID        if RCRAx.FIDS is set.</description>
							<lsb>3</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FC2</name>
							<description>Frame Counter for Channel 7   FC7. Contains the number of received frames on Channel  160 x. Copied to RDR.FID        if RCRAx.FIDS is set.</description>
							<lsb>6</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FC3</name>
							<description>Frame Counter for Channel 7   FC7. Contains the number of received frames on Channel  160 x. Copied to RDR.FID        if RCRAx.FIDS is set.</description>
							<lsb>9</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FC4</name>
							<description>Frame Counter for Channel 7   FC7. Contains the number of received frames on Channel  160 x. Copied to RDR.FID        if RCRAx.FIDS is set.</description>
							<lsb>12</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FC5</name>
							<description>Frame Counter for Channel 7   FC7. Contains the number of received frames on Channel  160 x. Copied to RDR.FID        if RCRAx.FIDS is set.</description>
							<lsb>15</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FC6</name>
							<description>Frame Counter for Channel 7   FC7. Contains the number of received frames on Channel  160 x. Copied to RDR.FID        if RCRAx.FIDS is set.</description>
							<lsb>18</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FC7</name>
							<description>Frame Counter for Channel 7   FC7. Contains the number of received frames on Channel  160 x. Copied to RDR.FID        if RCRAx.FIDS is set.</description>
							<lsb>21</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>NFCLR0</name>
							<description>Clear Number of Frame Counter for Channel 7   NFCLR7. Clears the referring counter FCNT.FCx. Intended for use during recovery from TEI. If set while a frame is being received  this action results in FCx    1 . Thus FCx will never be  0  when RDI RSI signal a new receive frame. Use with care </description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFCLR1</name>
							<description>Clear Number of Frame Counter for Channel 7   NFCLR7. Clears the referring counter FCNT.FCx. Intended for use during recovery from TEI. If set while a frame is being received  this action results in FCx    1 . Thus FCx will never be  0  when RDI RSI signal a new receive frame. Use with care </description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFCLR2</name>
							<description>Clear Number of Frame Counter for Channel 7   NFCLR7. Clears the referring counter FCNT.FCx. Intended for use during recovery from TEI. If set while a frame is being received  this action results in FCx    1 . Thus FCx will never be  0  when RDI RSI signal a new receive frame. Use with care </description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFCLR3</name>
							<description>Clear Number of Frame Counter for Channel 7   NFCLR7. Clears the referring counter FCNT.FCx. Intended for use during recovery from TEI. If set while a frame is being received  this action results in FCx    1 . Thus FCx will never be  0  when RDI RSI signal a new receive frame. Use with care </description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFCLR4</name>
							<description>Clear Number of Frame Counter for Channel 7   NFCLR7. Clears the referring counter FCNT.FCx. Intended for use during recovery from TEI. If set while a frame is being received  this action results in FCx    1 . Thus FCx will never be  0  when RDI RSI signal a new receive frame. Use with care </description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFCLR5</name>
							<description>Clear Number of Frame Counter for Channel 7   NFCLR7. Clears the referring counter FCNT.FCx. Intended for use during recovery from TEI. If set while a frame is being received  this action results in FCx    1 . Thus FCx will never be  0  when RDI RSI signal a new receive frame. Use with care </description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFCLR6</name>
							<description>Clear Number of Frame Counter for Channel 7   NFCLR7. Clears the referring counter FCNT.FCx. Intended for use during recovery from TEI. If set while a frame is being received  this action results in FCx    1 . Thus FCx will never be  0  when RDI RSI signal a new receive frame. Use with care </description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NFCLR7</name>
							<description>Clear Number of Frame Counter for Channel 7   NFCLR7. Clears the referring counter FCNT.FCx. Intended for use during recovery from TEI. If set while a frame is being received  this action results in FCx    1 . Thus FCx will never be  0  when RDI RSI signal a new receive frame. Use with care </description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IOCR</name>
					<description>Input and Output Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>40</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ALTI</name>
							<description>Alternate Input Select   ALTI. Selects the alternate input for RX of the ASC </description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>4</dimIncrement>
					<name>RCRAx[%s]</name>
					<description>Receiver Control Register A0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>48</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CRC0</name>
							<description>CRC or Parit5 Selection   CRC5. If set  a 3 bit CRC checksum is expected for the PSI5 S channel x in slot y. Else  1 bit Parity is assumed. This bit field is looked up before potential modification of FID according to FIDS.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CRC1</name>
							<description>CRC or Parit5 Selection   CRC5. If set  a 3 bit CRC checksum is expected for the PSI5 S channel x in slot y. Else  1 bit Parity is assumed. This bit field is looked up before potential modification of FID according to FIDS.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CRC2</name>
							<description>CRC or Parit5 Selection   CRC5. If set  a 3 bit CRC checksum is expected for the PSI5 S channel x in slot y. Else  1 bit Parity is assumed. This bit field is looked up before potential modification of FID according to FIDS.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CRC3</name>
							<description>CRC or Parit5 Selection   CRC5. If set  a 3 bit CRC checksum is expected for the PSI5 S channel x in slot y. Else  1 bit Parity is assumed. This bit field is looked up before potential modification of FID according to FIDS.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CRC4</name>
							<description>CRC or Parit5 Selection   CRC5. If set  a 3 bit CRC checksum is expected for the PSI5 S channel x in slot y. Else  1 bit Parity is assumed. This bit field is looked up before potential modification of FID according to FIDS.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CRC5</name>
							<description>CRC or Parit5 Selection   CRC5. If set  a 3 bit CRC checksum is expected for the PSI5 S channel x in slot y. Else  1 bit Parity is assumed. This bit field is looked up before potential modification of FID according to FIDS.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSEN</name>
							<description>Time Stamp Enable   TSEN. Enables the time stamping for channel x</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSP</name>
							<description>Time Stamp Select   TSP. For non recoverable Packets  stored in ChID  0   FID  1  with original IDs   TSCNTA is captured in TSM and not in TSCR0  independent from TSP .</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSTS</name>
							<description>Time Stamp Trigger Select   TSTS</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FIDS</name>
							<description>Frame ID Select   FIDS</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WDMS</name>
							<description>Watch Dog Timer Mode Select   WDMS</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UFC0</name>
							<description>UART Frame Count per Packet Frame in Slot 5   UFC5. This bit field defines the number of UART Frames per Packet Frame that are expected for Slot y. This bit field is looked up before potential modification of FID according to FIDS.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UFC1</name>
							<description>UART Frame Count per Packet Frame in Slot 5   UFC5. This bit field defines the number of UART Frames per Packet Frame that are expected for Slot y. This bit field is looked up before potential modification of FID according to FIDS.</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UFC2</name>
							<description>UART Frame Count per Packet Frame in Slot 5   UFC5. This bit field defines the number of UART Frames per Packet Frame that are expected for Slot y. This bit field is looked up before potential modification of FID according to FIDS.</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UFC3</name>
							<description>UART Frame Count per Packet Frame in Slot 5   UFC5. This bit field defines the number of UART Frames per Packet Frame that are expected for Slot y. This bit field is looked up before potential modification of FID according to FIDS.</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UFC4</name>
							<description>UART Frame Count per Packet Frame in Slot 5   UFC5. This bit field defines the number of UART Frames per Packet Frame that are expected for Slot y. This bit field is looked up before potential modification of FID according to FIDS.</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UFC5</name>
							<description>UART Frame Count per Packet Frame in Slot 5   UFC5. This bit field defines the number of UART Frames per Packet Frame that are expected for Slot y. This bit field is looked up before potential modification of FID according to FIDS.</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>4</dimIncrement>
					<name>RCRBx[%s]</name>
					<description>Receiver Control Register B0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>80</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PDL0</name>
							<description>Payload Data Length   PDL5. PDL determines the number of bits in a Packet Frame frame for Slot y. It        also determines the position of the CRC Parity bit. E.g. 8 defines 8        data bits on position  7 0 . On bit position 8 the CRC Parity is        located. See CROSSREFERENCE .        If PDLy is cleared    8216 0  8217   no frame is expected for this slot. Packet        Frames received for a slot with PDL     8216 0  8217  are copied to ChID 0  FID 1        with original IDs without further processing. This bit field is looked        up before potential modification of FID according to RCRAx.FIDS</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDL1</name>
							<description>Payload Data Length   PDL5. PDL determines the number of bits in a Packet Frame frame for Slot y. It        also determines the position of the CRC Parity bit. E.g. 8 defines 8        data bits on position  7 0 . On bit position 8 the CRC Parity is        located. See CROSSREFERENCE .        If PDLy is cleared    8216 0  8217   no frame is expected for this slot. Packet        Frames received for a slot with PDL     8216 0  8217  are copied to ChID 0  FID 1        with original IDs without further processing. This bit field is looked        up before potential modification of FID according to RCRAx.FIDS</description>
							<lsb>5</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDL2</name>
							<description>Payload Data Length   PDL5. PDL determines the number of bits in a Packet Frame frame for Slot y. It        also determines the position of the CRC Parity bit. E.g. 8 defines 8        data bits on position  7 0 . On bit position 8 the CRC Parity is        located. See CROSSREFERENCE .        If PDLy is cleared    8216 0  8217   no frame is expected for this slot. Packet        Frames received for a slot with PDL     8216 0  8217  are copied to ChID 0  FID 1        with original IDs without further processing. This bit field is looked        up before potential modification of FID according to RCRAx.FIDS</description>
							<lsb>10</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDL3</name>
							<description>Payload Data Length   PDL5. PDL determines the number of bits in a Packet Frame frame for Slot y. It        also determines the position of the CRC Parity bit. E.g. 8 defines 8        data bits on position  7 0 . On bit position 8 the CRC Parity is        located. See CROSSREFERENCE .        If PDLy is cleared    8216 0  8217   no frame is expected for this slot. Packet        Frames received for a slot with PDL     8216 0  8217  are copied to ChID 0  FID 1        with original IDs without further processing. This bit field is looked        up before potential modification of FID according to RCRAx.FIDS</description>
							<lsb>15</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDL4</name>
							<description>Payload Data Length   PDL5. PDL determines the number of bits in a Packet Frame frame for Slot y. It        also determines the position of the CRC Parity bit. E.g. 8 defines 8        data bits on position  7 0 . On bit position 8 the CRC Parity is        located. See CROSSREFERENCE .        If PDLy is cleared    8216 0  8217   no frame is expected for this slot. Packet        Frames received for a slot with PDL     8216 0  8217  are copied to ChID 0  FID 1        with original IDs without further processing. This bit field is looked        up before potential modification of FID according to RCRAx.FIDS</description>
							<lsb>20</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDL5</name>
							<description>Payload Data Length   PDL5. PDL determines the number of bits in a Packet Frame frame for Slot y. It        also determines the position of the CRC Parity bit. E.g. 8 defines 8        data bits on position  7 0 . On bit position 8 the CRC Parity is        located. See CROSSREFERENCE .        If PDLy is cleared    8216 0  8217   no frame is expected for this slot. Packet        Frames received for a slot with PDL     8216 0  8217  are copied to ChID 0  FID 1        with original IDs without further processing. This bit field is looked        up before potential modification of FID according to RCRAx.FIDS</description>
							<lsb>25</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>4</dimIncrement>
					<name>WDTx[%s]</name>
					<description>Watch Dog Timer Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>112</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>WDL</name>
							<description>Watch Dog Timer Limit   WDL. for channel x. If no watch dog is needed  WDL is cleared  the internal watch dog timer is stopped and no check is performed. CENx must be clear for write access.</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>4</dimIncrement>
					<name>TSCRx[%s]</name>
					<description>Capture Register TSCR0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>144</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TS</name>
							<description>Time Stamp   TS. of the last sync pulse sent for channel x.</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
