J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>RDS</name>
					<description>Receive Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>176</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>XCRC0</name>
							<description>XCRC   XCRC5. CRC of last Packet Frame.  XCRC0 is on bit position 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>XCRC1</name>
							<description>XCRC   XCRC5. CRC of last Packet Frame.  XCRC0 is on bit position 0.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>XCRC2</name>
							<description>XCRC   XCRC5. CRC of last Packet Frame.  XCRC0 is on bit position 0.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>XCRC3</name>
							<description>XCRC   XCRC5. CRC of last Packet Frame.  XCRC0 is on bit position 0.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>XCRC4</name>
							<description>XCRC   XCRC5. CRC of last Packet Frame.  XCRC0 is on bit position 0.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>XCRC5</name>
							<description>XCRC   XCRC5. CRC of last Packet Frame.  XCRC0 is on bit position 0.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>XCRCI</name>
							<description>XCRC Error Flag   XCRCI. This bit is set if the CRC check on the enveloping Packet Frame fails including the case where XCRC check can not be performed  non recoverable frames  see CROSSREFERENCE .</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CRC0</name>
							<description>CRC   CRC2. of last frame. CRC0   Parity is on bit position 7. If Parity is used  CRC1 2 are always 0.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CRC1</name>
							<description>CRC   CRC2. of last frame. CRC0   Parity is on bit position 7. If Parity is used  CRC1 2 are always 0.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CRC2</name>
							<description>CRC   CRC2. of last frame. CRC0   Parity is on bit position 7. If Parity is used  CRC1 2 are always 0.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CRCI</name>
							<description>CRC Error Flag   CRCI. This bit is set if the CRC or Parity check on the transported PSI5 frame fails.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ERR0</name>
							<description>Error signalling Flag 0   ERR0. This bit represents the status of the error signalling flag Err0 in the enveloping Packet Frame.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ERR1</name>
							<description>Error signalling Flag 1   ERR1. This bit represents the status of the error signalling flag Err1 in the enveloping Packet Frame.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HDI</name>
							<description>Header Error Signalled Flag   HDI. This bit is set if at least one of the error signalling flags in the enveloping Packet Frame Err0 and Err1 is set.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PE</name>
							<description>ASC Parity Error Flag   PE. This bit is set if the error flag signalling a parity error was set during reception of one of the ASC Bytes transporting this PSI5 frame.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FE</name>
							<description>ASC Framing Error Flag   FE. This bit is set if the error flag signaling a framing error was set during reception of one of the ASC Bytes transporting this PSI5 frame.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OE</name>
							<description>ASC Overrun Error Flag   OE. This bit is set if the error flag signaling an overrun error was set during reception of one of the ASC Bytes transporting this PSI5 frame.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TEI</name>
							<description>Time Error Flag   TEI. This bit is set if the watch dog timer expired. Depending from RCRAx.WDMS either the distance between two RDIs is longer than specified in WDL or it expired without reception of CHCI in time. I.e. the time from issuing the sync pulse to reception of the last expected frame configured in NFC.NFx was too long. If WDMS is in synchronous mode  all frames after TEI have TEI set in RDS until either CHCI is issued or INSTATx.TEI is cleared by SW. RDS.TEI flag is independently from INTENx.TEI.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RBI</name>
							<description>Receive Buffer Overflow Flag   RBI. This bit is set after a frame has been received while the old one was not read from RDR. I.e. the kernel wants to set interrupt RDI and finds RDI already set. The old data is overwritten by the new data.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FID</name>
							<description>Frame ID  Frame Number    FID. See bit RCRAx.FIDS for actual content.</description>
							<lsb>19</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CID</name>
							<description>Channel ID  Channel Number    CID</description>
							<lsb>22</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AFC</name>
							<description>Actual UART Frame Count   AFC. This bit field shows the number of UART frames actually received. This is used to further analyze non recoverable frames by SW or during debugging.</description>
							<lsb>25</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PFC</name>
							<description>Packet Frame Count   PFC. For data consistency  RDR  RDS and TSM are tagged with a Packet Frame count value. For each channel there is a separate internal packet counter. This allows to read a triplet of RDR  RDS and TSM from the system memory without looking at interrupts. If the PFC is identical all three values belong together. Otherwise they need to be read again until PFC is identical.</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RDR</name>
					<description>Receive Data Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>180</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RD0</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD1</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD2</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD3</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD4</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD5</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD6</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD7</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD8</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD9</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD10</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD11</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD12</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD13</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD14</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD15</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD16</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD17</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD18</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD19</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD20</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD21</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD22</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD23</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD24</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD25</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD26</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD27</name>
							<description>PSI5 Receive Data   RD27. of last frame. D0 is on bit position 0.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PFC</name>
							<description>Packet Frame Count   PFC. For data consistency  RDR  RDS and TSM are tagged with a Packet Frame count value. For each channel there is a separate internal packet counter. This allows to read a triplet of RDR  RDS and TSM from the system memory without looking at interrupts. If the PFC is identical all three values belong together. Otherwise they need to be read again until PFC is identical.</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSM</name>
					<description>Time Stamp Mirror Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>184</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TS</name>
							<description>Time Stamp   TS. of the last sync pulse sent on channel x.</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PFC</name>
							<description>Packet Frame Count   PFC. For data consistency  RDR  RDS and TSM are tagged with a Packet Frame count value. For each channel there is a separate internal packet counter. This allows to read a triplet of RDR  RDS and TSM from the system memory without looking at interrupts. If the PFC is identical all three values belong together. Otherwise they need to be read again until PFC is identical.</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TAR</name>
					<description>Target Address Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>208</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TA</name>
							<description>Target Address   TA. Contains the upper 30 bit of the target address for the next DMA transfer. The 32 bit target address must be word aligned. Thus the 2 LSBs are fixed to 0. It is updated each time a new Packet Frame is received completely.</description>
							<lsb>2</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BAR</name>
					<description>Base Address Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>212</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>BA</name>
							<description>Base Address   BA. Contains the upper 30 bits of the base address for the DMA transfers. The 32 bit base address must be word aligned. Thus the 2 LSBs are fixed to 0.</description>
							<lsb>2</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>4</dimIncrement>
					<name>PGCx[%s]</name>
					<description>Pulse Generation Control Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>240</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TXCMD</name>
							<description>TX Command   TXCMD. Defines the value that is copied to the ASC FIFO for coding a  0 .</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ATXCMD</name>
							<description>Alternate TX Command   ATXCMD. Defines the value that is copied to the ASC FIFO for the alternate pulse width i.e. for coding a  1 .</description>
							<lsb>8</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TBS</name>
							<description>Time Base Select   TBS. This bit selects the clock source for CTVx</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB</name>
							<description>External Time Base Select   ETB. Selects the external clock line for counter CTVx.</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PTE</name>
							<description>Periodic Trigger Enable   PTE. Periodic trigger is defined by CTVx.  Should be 0 if ETE is set.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETS</name>
							<description>External Trigger Select   ETS. Selects the external trigger line for pulse generation  e.g. angle        synchronous .</description>
							<lsb>20</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETE</name>
							<description>External Trigger Enable   ETE.  Angle sync. trigger   external line is selected by ETS. Should be 0 if PTE is set.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>4</dimIncrement>
					<name>CTVx[%s]</name>
					<description>Channel Trigger Value Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>272</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CTV</name>
							<description>Channel Trigger Value CTV   CTV. Contains the compare value  exact match  of Channel Trigger CTC at which a sync pulse is triggered for channel x and the counter CTC is cleared.  If cleared  CTC is stopped and no pulse triggered.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTC</name>
							<description>Channel Trigger Counter   CTC. This bit field allows to read the current counter value of the reset timer cell CTVx. If GCR.ETCx is cleared  CTC can be written.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>4</dimIncrement>
					<name>SCRx[%s]</name>
					<description>Send Control Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>304</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PLL</name>
							<description>Pay Load Length of Registers SDRx   PLL. Defines the length that is taken into account. PLL needs to written before SDRx is used for proper operation.</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EPS</name>
							<description>Enhanced Protocol Selection   EPS. EPS 0  controls the Bit Format and MSB Fill bit.  0  Tooth Gap  MSB Fill 1   1  PWM  MSB Fill 0  EPS 1  controls the Frame Format   0  Frame Format 1   3   1  Frame Format 4 </description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BSC</name>
							<description>Bit Stuffing Control   BSC. Depending from bit EPS 1   after 3 bits a  1  is inserted  Frame Format 1  3  or  after 6 bits a  0  is inserted  Frame Format 4 </description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FLUS</name>
							<description>Flush SDRx   FLUS. Setting this bit  stops shifting out the data in SDRx  the start sequence or CRC if any and clears the referring FSMs and counters  if EPS 0  0 SDRx is flushed by setting all bits if EPS 0  1 SDRx is flushed by clearing all bits clears TPF TPIx is issued at the end of successful flushing. Reads always as zero.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRC</name>
							<description>CRC Generation Control   CRC</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STA</name>
							<description>Start Sequence Generation Control   STA</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TPF</name>
							<description>Transmit in Progress Flag   TPF. If set  data preparation and transmission is in progress   start sequence or CRC or stuffing bits or data from SDRx are being transferred. It is cleared automatically after preparation and transmitting is finished. It gets set by HW immediately with the write access to SDRx and cleared by HW when the last pulse request is issued to the message generator  usually a CRC bit from the CRC Generator  If set  write access to SDRx will not change any data and issue TPOI.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
