J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<dim>8</dim>
					<dimIncrement>4</dimIncrement>
					<name>SDRx[%s]</name>
					<description>Send Data Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>336</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SD0</name>
							<description>SD23   SD23. Send data of next ECU to Sensor frame. Each time a bit is shifted out  the whole content is shifted right by 1 position and the MSB is filled with  1  or  0  depending from EPS 0 . This allows to read back SDR and determine the status of the shift process by SW. The unused MSBs  bit position SCRx.PLL and higher  must be written with  0  if EPS 0  is set  PWM Method  and with  1  if EPS 0  is cleared  Tooth Gap Method . This is required  as the respective standard value is shifted into the register from MSB during shift out operation. SDRx will be filled with this value after shift out process.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD1</name>
							<description>SD23   SD23. Send data of next ECU to Sensor frame. Each time a bit is shifted out  the whole content is shifted right by 1 position and the MSB is filled with  1  or  0  depending from EPS 0 . This allows to read back SDR and determine the status of the shift process by SW. The unused MSBs  bit position SCRx.PLL and higher  must be written with  0  if EPS 0  is set  PWM Method  and with  1  if EPS 0  is cleared  Tooth Gap Method . This is required  as the respective standard value is shifted into the register from MSB during shift out operation. SDRx will be filled with this value after shift out process.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD2</name>
							<description>SD23   SD23. Send data of next ECU to Sensor frame. Each time a bit is shifted out  the whole content is shifted right by 1 position and the MSB is filled with  1  or  0  depending from EPS 0 . This allows to read back SDR and determine the status of the shift process by SW. The unused MSBs  bit position SCRx.PLL and higher  must be written with  0  if EPS 0  is set  PWM Method  and with  1  if EPS 0  is cleared  Tooth Gap Method . This is required  as the respective standard value is shifted into the register from MSB during shift out operation. SDRx will be filled with this value after shift out process.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD3</name>
							<description>SD23   SD23. Send data of next ECU to Sensor frame. Each time a bit is shifted out  the whole content is shifted right by 1 position and the MSB is filled with  1  or  0  depending from EPS 0 . This allows to read back SDR and determine the status of the shift process by SW. The unused MSBs  bit position SCRx.PLL and higher  must be written with  0  if EPS 0  is set  PWM Method  and with  1  if EPS 0  is cleared  Tooth Gap Method . This is required  as the respective standard value is shifted into the register from MSB during shift out operation. SDRx will be filled with this value after shift out process.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD4</name>
							<description>SD23   SD23. Send data of next ECU to Sensor frame. Each time a bit is shifted out  the whole content is shifted right by 1 position and the MSB is filled with  1  or  0  depending from EPS 0 . This allows to read back SDR and determine the status of the shift process by SW. The unused MSBs  bit position SCRx.PLL and higher  must be written with  0  if EPS 0  is set  PWM Method  and with  1  if EPS 0  is cleared  Tooth Gap Method . This is required  as the respective standard value is shifted into the register from MSB during shift out operation. SDRx will be filled with this value after shift out process.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD5</name>
							<description>SD23   SD23. Send data of next ECU to Sensor frame. Each time a bit is shifted out  the whole content is shifted right by 1 position and the MSB is filled with  1  or  0  depending from EPS 0 . This allows to read back SDR and determine the status of the shift process by SW. The unused MSBs  bit position SCRx.PLL and higher  must be written with  0  if EPS 0  is set  PWM Method  and with  1  if EPS 0  is cleared  Tooth Gap Method . This is required  as the respective standard value is shifted into the register from MSB during shift out operation. SDRx will be filled with this value after shift out process.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD6</name>
							<description>SD23   SD23. Send data of next ECU to Sensor frame. Each time a bit is shifted out  the whole content is shifted right by 1 position and the MSB is filled with  1  or  0  depending from EPS 0 . This allows to read back SDR and determine the status of the shift process by SW. The unused MSBs  bit position SCRx.PLL and higher  must be written with  0  if EPS 0  is set  PWM Method  and with  1  if EPS 0  is cleared  Tooth Gap Method . This is required  as the respective standard value is shifted into the register from MSB during shift out operation. SDRx will be filled with this value after shift out process.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD7</name>
							<description>SD23   SD23. Send data of next ECU to Sensor frame. Each time a bit is shifted out  the whole content is shifted right by 1 position and the MSB is filled with  1  or  0  depending from EPS 0 . This allows to read back SDR and determine the status of the shift process by SW. The unused MSBs  bit position SCRx.PLL and higher  must be written with  0  if EPS 0  is set  PWM Method  and with  1  if EPS 0  is cleared  Tooth Gap Method . This is required  as the respective standard value is shifted into the register from MSB during shift out operation. SDRx will be filled with this value after shift out process.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD8</name>
							<description>SD23   SD23. Send data of next ECU to Sensor frame. Each time a bit is shifted out  the whole content is shifted right by 1 position and the MSB is filled with  1  or  0  depending from EPS 0 . This allows to read back SDR and determine the status of the shift process by SW. The unused MSBs  bit position SCRx.PLL and higher  must be written with  0  if EPS 0  is set  PWM Method  and with  1  if EPS 0  is cleared  Tooth Gap Method . This is required  as the respective standard value is shifted into the register from MSB during shift out operation. SDRx will be filled with this value after shift out process.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD9</name>
							<description>SD23   SD23. Send data of next ECU to Sensor frame. Each time a bit is shifted out  the whole content is shifted right by 1 position and the MSB is filled with  1  or  0  depending from EPS 0 . This allows to read back SDR and determine the status of the shift process by SW. The unused MSBs  bit position SCRx.PLL and higher  must be written with  0  if EPS 0  is set  PWM Method  and with  1  if EPS 0  is cleared  Tooth Gap Method . This is required  as the respective standard value is shifted into the register from MSB during shift out operation. SDRx will be filled with this value after shift out process.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD10</name>
							<description>SD23   SD23. Send data of next ECU to Sensor frame. Each time a bit is shifted out  the whole content is shifted right by 1 position and the MSB is filled with  1  or  0  depending from EPS 0 . This allows to read back SDR and determine the status of the shift process by SW. The unused MSBs  bit position SCRx.PLL and higher  must be written with  0  if EPS 0  is set  PWM Method  and with  1  if EPS 0  is cleared  Tooth Gap Method . This is required  as the respective standard value is shifted into the register from MSB during shift out operation. SDRx will be filled with this value after shift out process.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD11</name>
							<description>SD23   SD23. Send data of next ECU to Sensor frame. Each time a bit is shifted out  the whole content is shifted right by 1 position and the MSB is filled with  1  or  0  depending from EPS 0 . This allows to read back SDR and determine the status of the shift process by SW. The unused MSBs  bit position SCRx.PLL and higher  must be written with  0  if EPS 0  is set  PWM Method  and with  1  if EPS 0  is cleared  Tooth Gap Method . This is required  as the respective standard value is shifted into the register from MSB during shift out operation. SDRx will be filled with this value after shift out process.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD12</name>
							<description>SD23   SD23. Send data of next ECU to Sensor frame. Each time a bit is shifted out  the whole content is shifted right by 1 position and the MSB is filled with  1  or  0  depending from EPS 0 . This allows to read back SDR and determine the status of the shift process by SW. The unused MSBs  bit position SCRx.PLL and higher  must be written with  0  if EPS 0  is set  PWM Method  and with  1  if EPS 0  is cleared  Tooth Gap Method . This is required  as the respective standard value is shifted into the register from MSB during shift out operation. SDRx will be filled with this value after shift out process.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD13</name>
							<description>SD23   SD23. Send data of next ECU to Sensor frame. Each time a bit is shifted out  the whole content is shifted right by 1 position and the MSB is filled with  1  or  0  depending from EPS 0 . This allows to read back SDR and determine the status of the shift process by SW. The unused MSBs  bit position SCRx.PLL and higher  must be written with  0  if EPS 0  is set  PWM Method  and with  1  if EPS 0  is cleared  Tooth Gap Method . This is required  as the respective standard value is shifted into the register from MSB during shift out operation. SDRx will be filled with this value after shift out process.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD14</name>
							<description>SD23   SD23. Send data of next ECU to Sensor frame. Each time a bit is shifted out  the whole content is shifted right by 1 position and the MSB is filled with  1  or  0  depending from EPS 0 . This allows to read back SDR and determine the status of the shift process by SW. The unused MSBs  bit position SCRx.PLL and higher  must be written with  0  if EPS 0  is set  PWM Method  and with  1  if EPS 0  is cleared  Tooth Gap Method . This is required  as the respective standard value is shifted into the register from MSB during shift out operation. SDRx will be filled with this value after shift out process.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD15</name>
							<description>SD23   SD23. Send data of next ECU to Sensor frame. Each time a bit is shifted out  the whole content is shifted right by 1 position and the MSB is filled with  1  or  0  depending from EPS 0 . This allows to read back SDR and determine the status of the shift process by SW. The unused MSBs  bit position SCRx.PLL and higher  must be written with  0  if EPS 0  is set  PWM Method  and with  1  if EPS 0  is cleared  Tooth Gap Method . This is required  as the respective standard value is shifted into the register from MSB during shift out operation. SDRx will be filled with this value after shift out process.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD16</name>
							<description>SD23   SD23. Send data of next ECU to Sensor frame. Each time a bit is shifted out  the whole content is shifted right by 1 position and the MSB is filled with  1  or  0  depending from EPS 0 . This allows to read back SDR and determine the status of the shift process by SW. The unused MSBs  bit position SCRx.PLL and higher  must be written with  0  if EPS 0  is set  PWM Method  and with  1  if EPS 0  is cleared  Tooth Gap Method . This is required  as the respective standard value is shifted into the register from MSB during shift out operation. SDRx will be filled with this value after shift out process.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD17</name>
							<description>SD23   SD23. Send data of next ECU to Sensor frame. Each time a bit is shifted out  the whole content is shifted right by 1 position and the MSB is filled with  1  or  0  depending from EPS 0 . This allows to read back SDR and determine the status of the shift process by SW. The unused MSBs  bit position SCRx.PLL and higher  must be written with  0  if EPS 0  is set  PWM Method  and with  1  if EPS 0  is cleared  Tooth Gap Method . This is required  as the respective standard value is shifted into the register from MSB during shift out operation. SDRx will be filled with this value after shift out process.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD18</name>
							<description>SD23   SD23. Send data of next ECU to Sensor frame. Each time a bit is shifted out  the whole content is shifted right by 1 position and the MSB is filled with  1  or  0  depending from EPS 0 . This allows to read back SDR and determine the status of the shift process by SW. The unused MSBs  bit position SCRx.PLL and higher  must be written with  0  if EPS 0  is set  PWM Method  and with  1  if EPS 0  is cleared  Tooth Gap Method . This is required  as the respective standard value is shifted into the register from MSB during shift out operation. SDRx will be filled with this value after shift out process.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD19</name>
							<description>SD23   SD23. Send data of next ECU to Sensor frame. Each time a bit is shifted out  the whole content is shifted right by 1 position and the MSB is filled with  1  or  0  depending from EPS 0 . This allows to read back SDR and determine the status of the shift process by SW. The unused MSBs  bit position SCRx.PLL and higher  must be written with  0  if EPS 0  is set  PWM Method  and with  1  if EPS 0  is cleared  Tooth Gap Method . This is required  as the respective standard value is shifted into the register from MSB during shift out operation. SDRx will be filled with this value after shift out process.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD20</name>
							<description>SD23   SD23. Send data of next ECU to Sensor frame. Each time a bit is shifted out  the whole content is shifted right by 1 position and the MSB is filled with  1  or  0  depending from EPS 0 . This allows to read back SDR and determine the status of the shift process by SW. The unused MSBs  bit position SCRx.PLL and higher  must be written with  0  if EPS 0  is set  PWM Method  and with  1  if EPS 0  is cleared  Tooth Gap Method . This is required  as the respective standard value is shifted into the register from MSB during shift out operation. SDRx will be filled with this value after shift out process.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD21</name>
							<description>SD23   SD23. Send data of next ECU to Sensor frame. Each time a bit is shifted out  the whole content is shifted right by 1 position and the MSB is filled with  1  or  0  depending from EPS 0 . This allows to read back SDR and determine the status of the shift process by SW. The unused MSBs  bit position SCRx.PLL and higher  must be written with  0  if EPS 0  is set  PWM Method  and with  1  if EPS 0  is cleared  Tooth Gap Method . This is required  as the respective standard value is shifted into the register from MSB during shift out operation. SDRx will be filled with this value after shift out process.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD22</name>
							<description>SD23   SD23. Send data of next ECU to Sensor frame. Each time a bit is shifted out  the whole content is shifted right by 1 position and the MSB is filled with  1  or  0  depending from EPS 0 . This allows to read back SDR and determine the status of the shift process by SW. The unused MSBs  bit position SCRx.PLL and higher  must be written with  0  if EPS 0  is set  PWM Method  and with  1  if EPS 0  is cleared  Tooth Gap Method . This is required  as the respective standard value is shifted into the register from MSB during shift out operation. SDRx will be filled with this value after shift out process.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD23</name>
							<description>SD23   SD23. Send data of next ECU to Sensor frame. Each time a bit is shifted out  the whole content is shifted right by 1 position and the MSB is filled with  1  or  0  depending from EPS 0 . This allows to read back SDR and determine the status of the shift process by SW. The unused MSBs  bit position SCRx.PLL and higher  must be written with  0  if EPS 0  is set  PWM Method  and with  1  if EPS 0  is cleared  Tooth Gap Method . This is required  as the respective standard value is shifted into the register from MSB during shift out operation. SDRx will be filled with this value after shift out process.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CDW</name>
					<description>CPU Direct Write Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>368</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SD0</name>
							<description>SD7   SD7. Send data of next ECU to Sensor frame.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD1</name>
							<description>SD7   SD7. Send data of next ECU to Sensor frame.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD2</name>
							<description>SD7   SD7. Send data of next ECU to Sensor frame.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD3</name>
							<description>SD7   SD7. Send data of next ECU to Sensor frame.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD4</name>
							<description>SD7   SD7. Send data of next ECU to Sensor frame.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD5</name>
							<description>SD7   SD7. Send data of next ECU to Sensor frame.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD6</name>
							<description>SD7   SD7. Send data of next ECU to Sensor frame.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SD7</name>
							<description>SD7   SD7. Send data of next ECU to Sensor frame.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSI</name>
							<description>Trigger Pulse Indicator   TSI. If this bit is set  a sync pulse is assumed and thus a time stamp is captured when the command leaves the FIFO and is written to ASC TX Register. Bits SD 7 5  select the channel for which the time stamp is captured. RCRAx.TSTS must be cleared. If set  the time stamp is captured on Packet Frame reception only.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
