J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>CON</name>
					<description>Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>528</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>M</name>
							<description>Mode Selection   M</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STP</name>
							<description>Number of Stop Bit Selection   STP</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REN</name>
							<description>Receiver Enable Control   REN. Bit is reset by hardware after reception of a Byte in Synchronous Mode.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PEN</name>
							<description>Parity Check Enable  asynchronous mode only    PEN</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>Framing Check Enable  asynchronous mode only    FEN</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OEN</name>
							<description>Overrun Check Enable   OEN</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PE</name>
							<description>ASC Parity Error Flag   PE. Set by hardware on a parity error  PEN   1 . Must be reset by software.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FE</name>
							<description>ASC Framing Error Flag   FE. Set by hardware on a framing error  FEN   1 . Must be reset by software.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OE</name>
							<description>ASC Overrun Error Flag   OE. Set by hardware on an overrun error  OEN   1 . Must be reset by software.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FDE</name>
							<description>Fractional Divider Enable   FDE. FDE is don t care and assumed  0  in Synchr. Mode.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ODD</name>
							<description>Parity Selection   ODD</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BRS</name>
							<description>Baud Rate Selection   BRS. BRS is don t care if FDE   1  fractional divider enabled  FDE is don t care and assumed  0  in Synchr. Mode.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LB</name>
							<description>Loop back Mode Enable   LB</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>R</name>
							<description>Baud Rate Generator Run Control   R. Register BG should only be written if R   0.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MTX</name>
							<description>Mode Selection TX direction   MTX. While bit field M controls the RX path  MTX controls the mode for the TX path.</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ODDTX</name>
							<description>Parity Selection TX direction   ODDTX. While bit field ODD controls the RX path  ODDTX controls the mode for the TX path.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BG</name>
					<description>Baud Rate Timer Reload Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>532</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>BR_VALUE</name>
							<description>Baud Rate Timer Reload Register Value   BR VALUE. Reading BR VALUE returns the 13 bit content of the baud rate timer. Writing BR VALUE loads the baud rate timer reload register. BG should only be written if CON.R   0.</description>
							<lsb>0</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FDV</name>
					<description>Fractional Divider Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>536</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FD_VALUE</name>
							<description>Fractional Divider Register Value   FD VALUE. FD VALUE contains the 11 bit value n of the fractional divider which determines the fractional divider ratio n 2048  n   0 2047 . With n   0  the fractional divider is switched off  divider ratio   1 .</description>
							<lsb>0</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FDO</name>
					<description>Fractional Divider for Output CLK Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>540</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>STEP</name>
							<description>Step Value   STEP. Reload or addition value for internal accumulator.</description>
							<lsb>0</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DM</name>
							<description>Divider Mode   DM. DM selects normal or fractional divider mode.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TBUF</name>
					<description>Transmit Buffer Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>544</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TD_VALUE</name>
							<description>Transmit Data Register Value   TD VALUE. TBUF contains the data to be transmitted in the asynchronous and synchronous operating modes of the ASC. Data transmission is double buffered  therefore  a new value can be written to TBUF before the transmission of the previous value is complete.</description>
							<lsb>0</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RBUF</name>
					<description>Receive Buffer Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>548</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RD_VALUE</name>
							<description>Receive Data Register Value   RD VALUE. RBUF contains the received data bits and  depending on the selected mode  the parity bit in the asynchronous and synchronous operating modes of the ASC. In Asynchronous Mode  with CON.M   011 B  7 bit data   parity   the received parity bit is written into RBUF.7. In Asynchronous Mode  with CON.M   111 B  8 bit data   parity   the received parity bit is written into RBUF.8.</description>
							<lsb>0</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WHBCON</name>
					<description>Write Hardware Bits Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>592</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CLRREN</name>
							<description>Clear Receiver Enable Bit   CLRREN. Bit is always read as 0.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SETREN</name>
							<description>Set Receiver Enable Bit   SETREN. Bit is always read as 0.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLRPE</name>
							<description>Clear Parity Error Flag   CLRPE. Bit is always read as 0.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLRFE</name>
							<description>Clear Framing Error Flag   CLRFE. Bit is always read as 0.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLROE</name>
							<description>Clear Overrun Error Flag   CLROE. Bit is always read as 0.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SETPE</name>
							<description>Set Parity Error Flag   SETPE. Bit is always read as 0.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SETFE</name>
							<description>Set Framing Error Flag   SETFE. Bit is always read as 0.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SETOE</name>
							<description>Set Overrun Error Flag   SETOE. Bit is always read as 0.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>4</dimIncrement>
					<name>INTSTATx[%s]</name>
					<description>Interrupt Status Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>608</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RSI</name>
							<description>Receive Success Interrupt Request Flag   RSI. This bit is set at the successfully received end of a frame. It indicates that this frame is free of the errors CRCI  XCRCI  TEI  PE  FE  OE  RBI  HDI if selected to be taken into account in register GCR. This bit can be cleared by bit INTCLRx.RSI. This bit can be set by bit INTSETx.RSI. This bit is set independently from INTENx.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RDI</name>
							<description>Receive Data Interrupt Request Flag   RDI. RDI is activated when a received frame is moved to a Receive Data Register RDR. Both RDI and RSI will be issued together at correct reception. This bit can be cleared by bit INTCLRx.RDI. This bit can be set by bit INTSETx.RDI. This bit is set independently from INTENx.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RBI</name>
							<description>Receive Buffer Overflow Interrupt Request Flag   RBI. This bit is set after a frame has been received while the old one was not read from RDR. I.e. the kernel wants to set interrupt RDI and finds this interrupt already set. The old data is overwritten by the new data. This bit is NOT cleared by reading RDR. This bit can be cleared by bit INTCLRx.RBI. This bit can be set by bit INTSETx.RBI. This bit is set independently from INTENx.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TEI</name>
							<description>Timing Error Interrupt Request Flag   TEI. This bit is set if the watch dog timer expired. Depending from RCRAx.WDMS either the distance between two RDIs is longer than specified in WDL or it expired without reception of CHCI in time. I.e. the time from issuing the sync pulse to reception of the last expected frame configured in NFC.NFx was too long. Note that the root cause might be a non recoverable frame  This bit can be cleared by bit INTCLRx.TEI. This bit can be set by bit INTSETx.TEI. This bit is set independently from INTENx.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CHCI</name>
							<description>Channel Completed Interrupt Request Flag   CHCI. This bit is set if FCNT.FCx equals NFC.NFx. This bit can be cleared by bit INTCLRx.CHCI. This bit can be set by bit INTSETx.CHCI. This bit is set independently from INTENx.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CRCI</name>
							<description>CRC Error Request Flag   CRCI. This bit is set if the CRC fails. This bit can be cleared by bit INTCLRx.CRCI. This bit can be set by bit INTSETx.CRCI. This bit is set independently from INTENx.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TPI</name>
							<description>Transfer Preparation Interrupt Request Flag   TPI. This bit is set after data to be transferred has been moved completely. Thus a new value can be written to SDRx. This bit can be cleared by bit INTCLRx.TPI. This bit can be set by bit INTSETx.TPI. This bit is set independently from INTENx.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TPOI</name>
							<description>Transmit Preparation Overflow Interrupt Request Flag   TPOI. This bit is set if SDR is written while TPF is set.  The old data is NOT overwritten. This bit can be cleared by bit INTCLRx.TPOI. This bit can be set by bit INTSETx.TPOI. This bit is set independently from INTENx.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HDI</name>
							<description>Header Error Signalled Flag   HDI. This bit is set if at least one of the error signalling flags in the enveloping Packet Frame Err0 and Err1 is set. Up</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>4</dimIncrement>
					<name>INTSETx[%s]</name>
					<description>Interrupt Set Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>640</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RSI</name>
							<description>Set Interrupt Request Flag RSI   RSI. Setting this bit set bit INTSTATx.RSI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI</name>
							<description>Set Interrupt Request Flag RDI   RDI. Setting this bit set bit INTSTATx.RDI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RBI</name>
							<description>Set Interrupt Request Flag RBI   RBI. Setting this bit set bit INTSTATx.RBI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI</name>
							<description>Set Interrupt Request Flag TEI   TEI. Setting this bit set bit INTSTATx.TEI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CHCI</name>
							<description>Set Interrupt Request Flag CHCI   CHCI. Setting this bit set bit INTSTATx.CHCI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI</name>
							<description>Set Interrupt Request Flag CRCI   CRCI. Setting this bit set bit INTSTATx.CRCI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TPI</name>
							<description>Set Interrupt Request Flag TPI   TPI. Setting this bit set bit INTSTATx.TPI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TPOI</name>
							<description>Set Interrupt Request Flag TPOI   TPOI. Setting this bit set bit INTSTATx.TPOI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>HDI</name>
							<description>Set Interrupt Request Flag HDI   HDI. Setting this bit set bit INTSTATx.HDI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>4</dimIncrement>
					<name>INTCLRx[%s]</name>
					<description>Interrupt Clear Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>672</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RSI</name>
							<description>Clear Interrupt Request Flag RSI   RSI. Setting this bit clears bit INTSTATx.RSI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RDI</name>
							<description>Clear Interrupt Request Flag RDI   RDI. Setting this bit clears bit INTSTATx.RDI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RBI</name>
							<description>Clear Interrupt Request Flag RBI   RBI. Setting this bit clears bit INTSTATx.RBI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TEI</name>
							<description>Clear Interrupt Request Flag TEI   TEI. Setting this bit clears bit INTSTATx.TEI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CHCI</name>
							<description>Clear Interrupt Request Flag CHCI   CHCI. Setting this bit clears bit INTSTATx.CHCI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRCI</name>
							<description>Clear Interrupt Request Flag CRCI   CRCI. Setting this bit clears bit INTSTATx.CRCI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TPI</name>
							<description>Clear Interrupt Request Flag TPI   TPI. Setting this bit clears bit INTSTATx.TPI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TPOI</name>
							<description>Clear Interrupt Request Flag TPOI   TPOI. Setting this bit clears bit INTSTATx.TPOI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>HDI</name>
							<description>Clear Interrupt Request Flag HDI   HDI. Setting this bit clears bit INTSTATx.HDI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>4</dimIncrement>
					<name>INTENx[%s]</name>
					<description>Interrupt Enable Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>704</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RSI</name>
							<description>Enable Interrupt Request RSI   RSI</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RDI</name>
							<description>Enable Interrupt Request RDI   RDI</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RBI</name>
							<description>Enable Interrupt Request RBI   RBI</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TEI</name>
							<description>Enable Interrupt Request TEI   TEI</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CHCI</name>
							<description>Enable Interrupt Request CHCI   CHCI</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CRCI</name>
							<description>Enable Interrupt Request CRCI   CRCI</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TPI</name>
							<description>Enable Interrupt Request TPI   TPI</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TPOI</name>
							<description>Enable Interrupt Request TPOI   TPOI</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HDI</name>
							<description>Enable Interrupt Request HDI   HDI</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
