J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<dim>8</dim>
					<dimIncrement>4</dimIncrement>
					<name>INPx[%s]</name>
					<description>Interrupt Node Pointer Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>736</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RSI</name>
							<description>Interrupt Node Pointer for Interrupt RSI   RSI. This bit field defines the interrupt node  that is requested due to the        set condition for bit INTSTATx.RSI  if enabled by bit INTENx.RSI .</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RDI</name>
							<description>Interrupt Node Pointer for Interrupt RDI   RDI. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATx.RDI  if enabled by bit INTENx.RDI . For bit field definition  see RSI.</description>
							<lsb>3</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RBI</name>
							<description>Interrupt Node Pointer for Interrupt RBI   RBI. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATx.RBI  if enabled by bit INTENx.RBI . For bit field definition  see RSI.</description>
							<lsb>6</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TEI</name>
							<description>Interrupt Node Pointer for Interrupt TEI   TEI. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATx.TEI  if enabled by bit INTENx.TEI . For bit field definition  see RSI.</description>
							<lsb>9</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CHCI</name>
							<description>Interrupt Node Pointer for Interrupt CHCI   CHCI. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATx.CHCI  if enabled by bit INTENx.CHCI . For bit field definition  see RSI.</description>
							<lsb>12</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CRCI</name>
							<description>Interrupt Node Pointer for Interrupt CRCI   CRCI. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATx.CRCI. For bit field definition  see RSI.</description>
							<lsb>15</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TPI</name>
							<description>Interrupt Node Pointer for Interrupt TOI   TPI. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATx.TPI  if enabled by bit INTENx.TPI . For bit field definition  see RSI.</description>
							<lsb>18</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TPOI</name>
							<description>Interrupt Node Pointer for TPOI   TPOI. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATx.TPOI. For bit field definition  see RSI.</description>
							<lsb>21</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HDI</name>
							<description>Interrupt Node Pointer for HDI   HDI. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATx.HDI. For bit field definition  see RSI.</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>INTOV</name>
					<description>Interrupt Overview Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>768</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RSI</name>
							<description>Interrupt Pending on Node Pointer RSI   RSI. If any interrupt requested flag is set for this Node Pointer in register  INTSTATx or INTSTATG  AND the referring interrupt is enabled in  INTENx or INTENG  then this bit is set. It is automatically reset if all flags in INTSTATx G are cleared for which the referring interrupt is enabled in INTENx G.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RDI</name>
							<description>Interrupt Pending on Node Pointer RDI   RDI. See details of INTOV.RSI.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RBI</name>
							<description>Interrupt Pending on Node Pointer RBI   RBI. See details of INTOV.RSI.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TEI</name>
							<description>Interrupt Pending on Node Pointer TEI   TEI. See details of INTOV.RSI.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CHCI</name>
							<description>Interrupt Pending on Node Pointer CHCI   CHCI. See details of INTOV.RSI.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CRCI</name>
							<description>Interrupt Pending on Node Pointer CRCI   CRCI. See details of INTOV.RSI.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TPI</name>
							<description>Interrupt Pending on Node Pointer TPI   TPI. See details of INTOV.RSI.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TPOI</name>
							<description>Interrupt Pending on Node Pointer TPOI   TPOI. See details of INTOV.RSI.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HDI</name>
							<description>Interrupt Pending on Node Pointer HDI   HDI. See details of INTOV.HDI.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TIR</name>
							<description>Interrupt Pending on Node Pointer TIR   TIR. If any interrupt requested flag is set for this Node Pointer in register INTSTATG AND the referring interrupt is enabled in INTENG then this bit is set. It is automatically reset if all flags in INTSTATG are cleared for which the referring interrupt is enabled in INTENG.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RIR</name>
							<description>Interrupt Pending on Node Pointer RIR   RIR. See details of INTOV.TIR.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EIR</name>
							<description>Interrupt Pending on Node Pointer EIR   EIR. See details of INTOV.TIR.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TBIR</name>
							<description>Interrupt Pending on Node Pointer TBIR   TBIR. See details of INTOV.TIR.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>XCRCI</name>
							<description>Interrupt Pending on Node Pointer XCRCI   XCRCI. See details of INTOV.TIR.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FOI</name>
							<description>Interrupt Pending on Node Pointer FOI   FOI. See details of INTOV.TIR.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>INTSTATG</name>
					<description>Interrupt Status Register Global
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>772</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TIR</name>
							<description>Transmit Interrupt Request Flag   TIR. This bit can be cleared by bit INTCLRG.TIR. This bit can be set by bit INTSETG.TIR. This bit is set independently from INTENG.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RIR</name>
							<description>Receive Interrupt Request Flag   RIR. This bit can be cleared by bit INTCLRG.RIR. This bit can be set by bit INTSETG.RIR. This bit is set independently from INTENG.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EIR</name>
							<description>Error Interrupt Request Flag   EIR. The cause of an error interrupt request EIR  framing  parity  overrun error  can be identified by the error status flags CON.FE  CON.PE  and CON.OE  This bit can be cleared by bit INTCLRG.EIR. This bit can be set by bit INTSETG.EIR. This bit is set independently from INTENG.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TBIR</name>
							<description>Transmit Buffer Interrupt Request Flag   TBIR. This bit can be cleared by bit INTCLRG.TBIR. This bit can be set by bit INTSETG.TBIR. This bit is set independently from INTENG.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>XCRCI</name>
							<description>XCRC Error Request Flag   XCRCI. This bit is set if the CRC check on the enveloping Packet Frame fails including the case where XCRC check can not be performed  non recoverable frames  see CROSSREFERENCE .The received data is not reliable and stored in ChID  0   FID  1  with original IDs. This bit can be cleared by bit INTCLRG.XCRCI. This bit can be set by bit INTSETG.XCRCI. This bit is set independently from INTENG.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FOI</name>
							<description>FIFO Error Request Flag   FOI. This bit is set if the Transmit FIFO of the message generation is overrun i.e. a transfer to the FIFO was generated by the message generation unit or by CDW  CPU direct write register  while the FIFO was already full. This bit can be cleared by bit INTCLRG.FOI. This bit can be set by bit INTSETG.FOI. This bit is set independently from INTENG.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>INTSETG</name>
					<description>Interrupt Set Register Global
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>776</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TIR</name>
							<description>Set Interrupt Request Flag TIR   TIR. Setting this bit set bit INTSTATG.TIR. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RIR</name>
							<description>Set Interrupt Request Flag RIR   RIR. Setting this bit set bit INTSTATG.RIR. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>EIR</name>
							<description>Set Interrupt Request Flag EIR   EIR. Setting this bit set bit INTSTATG.EIR. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TBIR</name>
							<description>Set Interrupt Request Flag TBIR   TBIR. Setting this bit set bit INTSTATG.TBIR. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>XCRCI</name>
							<description>Set Interrupt Request Flag XCRCI   XCRCI. Setting this bit set bit INTSTATG.XCRCI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FOI</name>
							<description>Set Interrupt Request Flag FOI   FOI. Setting this bit set bit INTSTATG.FOI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>INTCLRG</name>
					<description>Interrupt Clear Register Global
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>780</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TIR</name>
							<description>Clear Interrupt Request Flag TIR   TIR. Setting this bit clears bit INTSTATG.TIR. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RIR</name>
							<description>Clear Interrupt Request Flag RIR   RIR. Setting this bit clears bit INTSTATG.RIR. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>EIR</name>
							<description>Clear Interrupt Request Flag EIR   EIR. Setting this bit clears bit INTSTATG.EIR. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TBIR</name>
							<description>Clear Interrupt Request Flag TBIR   TBIR. Setting this bit clears bit INTSTATG.TBIR. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>XCRCI</name>
							<description>Clear Interrupt Request Flag XCRCI   XCRCI. Setting this bit clears bit INTSTATG.XCRCI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FOI</name>
							<description>Clear Interrupt Request Flag FOI   FOI. Setting this bit clears bit INTSTATG.FOI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>INTENG</name>
					<description>Interrupt Enable Register Global
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>784</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TIR</name>
							<description>Enable Interrupt Request TIR   TIR</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RIR</name>
							<description>Enable Interrupt Request RIR   RIR</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EIR</name>
							<description>Enable Interrupt Request EIR   EIR</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TBIR</name>
							<description>Enable Interrupt Request TBIR   TBIR</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>XCRCI</name>
							<description>Enable Interrupt Request XCRCI   XCRCI</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FOI</name>
							<description>Enable Interrupt Request FOI   FOI</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>INPG</name>
					<description>Interrupt Node Pointer Register Global
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>788</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TIR</name>
							<description>Interrupt Node Pointer for Interrupt TIR   TIR. This bit field defines the interrupt node  that is requested due to the        set condition for bit INTSTATG.TIR  if enabled by bit INTENG.TIR .</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RIR</name>
							<description>Interrupt Node Pointer for Interrupt RIR   RIR. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATG.RIR  if enabled by bit INTENG.RIR . For bit field definition  see TIR.</description>
							<lsb>3</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EIR</name>
							<description>Interrupt Node Pointer for Interrupt EIR   EIR. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATG.EIR  if enabled by bit INTENG.EIR . For bit field definition  see TIR.</description>
							<lsb>6</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TBIR</name>
							<description>Interrupt Node Pointer for Interrupt TBIR   TBIR. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATG.TBIR  if enabled by bit INTENG.TBIR . For bit field definition  see TIR.</description>
							<lsb>9</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>XCRCI</name>
							<description>Interrupt Node Pointer for Interrupt XCRCI   XCRCI. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATG.XCRCI  if enabled by bit INTENG.XCRCI . For bit field definition  see TIR.</description>
							<lsb>12</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FOI</name>
							<description>Interrupt Node Pointer for Interrupt FOI   FOI. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATG.FOI  if enabled by bit INTENG.FOI . For bit field definition  see TIR.</description>
							<lsb>15</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OCS</name>
					<description>OCDS Control and Status
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>972</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SUS</name>
							<description>OCDS Suspend Control   SUS. Controls the sensitivity to the suspend signal coming from the OCDS Trigger Switch  OTGS  Suspend disables the kernel clocks f PSI5 S and the ASC clock f ASC .</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SUS_P</name>
							<description>SUS Write Protection   SUS P. SUS is only written when SUS P is 1  otherwise unchanged. Read as 0.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SUSSTA</name>
							<description>Suspend State   SUSSTA</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
