J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>QSPI2</name>
			<version>100</version>
			<description>QSPI</description>
			<baseAddress>4026539520</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>256</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CLC</name>
					<description>Clock Control Register
 resetvalue={Application Reset:0x3}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>3</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit   DISR. Used for enable disable control of the module.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit   DISS. Bit indicates the current status of the module.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EDIS</name>
							<description>Sleep Mode Enable Control   EDIS. Used to enable the module  8217 s sleep mode.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PISEL</name>
					<description>Port Input Select Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MRIS</name>
							<description>Master Mode Receive Input Select. MRIS selects one out of eight MRST receive input lines  used in Master        Mode. Note that not all inputs are used in every device of the family.        Selecting an unused input returns a continuous low value. The following signal sources are available in this product  if supported        by the package  </description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SRIS</name>
							<description>Slave Mode Receive Input Select. SRIS selects one out of eight MTSR receive input lines  used in Slave        Mode. Note that not all inputs are used in every device of the family.        Selecting an unused input returns a continuous low value. The following signal sources are available in this product  if supported        by the package  </description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SCIS</name>
							<description>Slave Mode Clock Input Select. SCIS selects one out of eight module kernel SCLK input lines that is        used as clock input line in slave mode. Note that not all inputs are        used in every device of the family. Selecting an unused input returns a        continuous low value. The following signal sources are available in this product  if supported        by the package  </description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SLSIS</name>
							<description>Slave Mode Slave Select Input Selection. The SLSIS must be programmed properly before the slave mode is set with GLOBALCON.MODE and the module is set to RUN mode. The following signal sources are available in this product  if supported by the package  </description>
							<lsb>12</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Module Identification Register
 resetvalue={Application Reset:0x0C0C000}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>12632064</resetValue>
					<resetMask>4294967040</resetMask>
					<fields>
						<field>
							<name>MODREV</name>
							<description>Module Revision Number   MODREV. MODREV defines the module revision number. The value of a module        revision starts with 01 H  first        revision .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODTYPE</name>
							<description>Module Type   MODTYPE. This bit field is C0 H . It defines a        32 bit module.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODNUMBER</name>
							<description>Module Number Value   MODNUMBER. This bit field together with MODTYPE uniquely identifies a module.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GLOBALCON</name>
					<description>Global Configuration Register
 resetvalue={Application Reset:0x0F30FF}</description>
					<addressOffset>16</addressOffset>
					<size>32</size>
					<resetValue>995583</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TQ</name>
							<description>Global Time Quantum Length   TQ. Common n divider scaling the baud rates of all channels in direction of        higher or lower baud rates. Must not be changed during a running        transaction.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SI</name>
							<description>Status Injection   SI. Selects if the status register content injection into the RxFIFO is        enabled or disabled. The status injections  if enabled  is performed after each data block         depending on the BACON .DL        and BYTE setting.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EXPECT</name>
							<description>Time Out Value for the Expect Phase   EXPECT. expressed in T QSPI units</description>
							<lsb>10</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LB</name>
							<description>Loop Back Control   LB. Selects if the transmit output is internally connected to the receive        input for test purposes. For detailed description  see the Loop Back Mode section.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DEL0</name>
							<description>Delayed Mode for SLSO0   DEL0. Switches the delayed mode  external slave select expansion mode  on and        off</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STROBE</name>
							<description>Strobe Delay for SLSO0 in Delayed Mode   STROBE. Defines the length of the SLSO0 delay in T Q time units as defined for channel z   T Q units  selected by the current BACON .CS         if GLOBALCON .DEL0  160    160 1.</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SRF</name>
							<description>Stop on RxFIFO Full   SRF. If this bit is set  the data fetching out of the TxFIFO by the shift        register stops when the RxFIFO is full  in order to prevent RxFIFO        overflow. Master mode only.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STIP</name>
							<description>Slave Transmit Idle State Polarity   STIP. This bit determines the logic level of the Slave Mode transmit signal        MRST when the QSPI slave select input signals are inactive         PISEL.SLSIS  160   185   160 000 B  .</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN</name>
							<description>Enable Bit   EN. Used to request transition between PAUSE and RUN mode per software.        Cleared by hardware automatically at leaving the following states         disabled  suspend and sleep. In order to determine if the requested state has actually been reached         the STATUS .PHASE        bit field should be polled. See also Operation Modes.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MS</name>
							<description>Master Slave Mode   MS. Selects if the module operates in master or slave mode. This bit field must be configured before the first write to the TXFIFO.</description>
							<lsb>25</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AREN</name>
							<description>Automatic Reset Enable   AREN. Enables the reset of the GLOBALCON .EN        on baud rate and spike error in slave mode.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKSEL</name>
							<description>Clock Select   CLKSEL. Selects the clock source for the asynchronous block.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RESETS</name>
							<description>Bits for resetting sub modules per software   RESETS. Write to this bit field triggers a reset operation. The reset operation   cycle count depends on the Clock setup in the 2 Clock domains. The shortest time is 3 x T fast   3 x T slow. With the added margin the delay will be  10 times slowest clock between SPB and Kernel. The duration of reset operation depends on the used clock setups. It is 10 times of the slowest clock between SPB and Kernel. CLOCKSEL shall be enabled to use GLOBALCON.RESETS. After the Reset the CLOCKSEL will be also cleared in case of 10 11. For resetting the whole module kernel  use alternatively the registers KRST0   xa0    xa0  KRST1 reset mechanism.</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GLOBALCON1</name>
					<description>Global Configuration Register 1
 resetvalue={Application Reset:0x50000}</description>
					<addressOffset>20</addressOffset>
					<size>32</size>
					<resetValue>327680</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ERRORENS</name>
							<description>Error Enable Bits   ERRORENS. Bits for enabling interrupt on all available error types</description>
							<lsb>0</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXEN</name>
							<description>Tx Interrupt Event Enable   TXEN. Enables the Tx interrupt.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXEN</name>
							<description>RX Interrupt Event Enable   RXEN. Enables the Rx interrupt.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PT1EN</name>
							<description>Interrupt on PT1 Event Enable   PT1EN. Enables the PT interrupt on an PT1 event  as selected by the PT1 bit        field.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PT2EN</name>
							<description>Interrupt on PT2 Event Enable   PT2EN. Enables the PT interrupt on an PT2 event  as selected by the PT2 bit        field.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>USREN</name>
							<description>Interrupt on USR Event Enable   USREN. Enables the USR interrupt on an USR event  as selected by the PT1 bit        field. In Move Counter mode of operation  User Interrupt line is reused for          the IAL and IBL interrupts  which can be enabled by MCCON .IALEN          and MCCON .IBLEN.          Bit USREN does not influence these interrupts.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXFIFOINT</name>
							<description>Transmit FIFO Interrupt Threshold   TXFIFOINT. In Combined Mode  as long as the TXFIFO filling level is equal or less        than this threshold  than each move of data or configuration from the        TXFIFO triggers a transmit interrupt. In Batch Mode  interrupt is generated only at the moment of filling        level falling below the threshold level. In Single Mode  this bit field is don  8217 t care. Reset value of the level is 01 .</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXFIFOINT</name>
							<description>Receive FIFO Interrupt Threshold   RXFIFOINT. In Combined Mode  as long as the RXFIFO filling level is equal or        greater than this threshold  than each move of data or status  if        enabled  into the RXFIFO triggers a receive interrupt. In Batch mode  interrupt is generated only at the moment of filling        level exceeding this threshold level. In Single Mode  this bit field is don  8217 t care. Reset value of the level is 01 .</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PT1</name>
							<description>Phase Transition Event 1   PT1. Selects the first phase transition to trigger the PT interrupt.</description>
							<lsb>20</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PT2</name>
							<description>Phase Transition Event 2   PT2. Selects the second phase transition to trigger the PT2 interrupt. In Master Mode  the following events are available. In Slave Mode  only the SLSI signal  rising edge  triggers the interrupt for PT2. For this purpose  always use the setting 101  EOF . This interrupt is independent of the CS value.</description>
							<lsb>23</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXFM</name>
							<description>TXFIFO Mode   TXFM. Selects the TXFIFO mode.</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXFM</name>
							<description>RXFIFO Mode   RXFM. Selects the RXFIFO mode.</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BACON</name>
					<description>Basic Configuration Register
 resetvalue={Application Reset:0x0F871C71}</description>
					<addressOffset>24</addressOffset>
					<size>32</size>
					<resetValue>260512881</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LAST</name>
							<description>Last Word in a Frame   LAST. Defines if the following data word is last in the current frame or not</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPRE</name>
							<description>Prescaler for the Idle Delay   IPRE. Length in T PER units</description>
							<lsb>1</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IDLE</name>
							<description>Idle Delay Length   IDLE. Defines the length of both idle delays  IDLEA and IDLEB  in T PER units pre scaled with IPRE</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LPRE</name>
							<description>Prescaler for the Leading Delay   LPRE. Length in T PER units</description>
							<lsb>7</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LEAD</name>
							<description>Leading Delay Length   LEAD. Defines the length of the leading delay  in T PER units pre scaled with LPRE</description>
							<lsb>10</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TPRE</name>
							<description>Prescaler for the Trailing Delay   TPRE. Length in T PER units</description>
							<lsb>13</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRAIL</name>
							<description>Trailing Delay Length   TRAIL. Defines the length of the trailing delay  in T PER units pre scaled with TPRE</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PARTYP</name>
							<description>Parity Type   PARTYP. Valid for both receive and transmit direction</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>UINT</name>
							<description>User Interrupt at the PT1 Event in the Subsequent Frames   UINT. This bit is an enable signal for the PT1 event routed to the User        Interrupt Service Request. The interrupt signals are generated until        disabled with the next BACON.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MSB</name>
							<description>Shift MSB or LSB First   MSB. This bit sets the shift direction of the shift register. If the MSB        option is set  and the data is a block longer than 32 bits  the block        must be fed into the TXFIFO in reverse direction  from the end of the        block until its beginning.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>BYTE</name>
							<description>Byte   BYTE. Defines if data length is expressed in bits or bytes. In Slave Mode BYTE must be  0 .</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DL</name>
							<description>Data Length   DL. Defines the data length in bits or bytes of one data block  depending on        the setting of the bit field BYTE. For the maximum baud rate of 50  160 MBaud  the minimum data length possible        is four.</description>
							<lsb>23</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CS</name>
							<description>Channel Select   CS. Selects the channel to which the subsequent data entry belongs  channel          the SLSO signal to be activated and the corresponding ECON        configuration extension  This bit field selects one slave in a range of 0 to 15  by driving one        SLSO signal out of 16 available. In case of an external demux mode  this bit field appears on the lines        SLS01 to SLSO4 as it is  additionally inverted or not  as defined in the SSOC register.</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>4</dimIncrement>
					<name>ECONz[%s]</name>
					<description>Configuration Extension 0
 resetvalue={Application Reset:0x1450}</description>
					<addressOffset>32</addressOffset>
					<size>32</size>
					<resetValue>5200</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>Q</name>
							<description>Time Quantum   Q. Defines the time quantum length used by A  B  and C to define the baud        rate and duty cycle by. This prescaler cascades the prescaler        GLOBALCON.TQ.</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>A</name>
							<description>Bit Segment 1   A. Length expressed in time quantums of ECONz.Q.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>B</name>
							<description>Bit Segment 2   B. Length expressed in time quantums of ECONz.Q.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>C</name>
							<description>Bit Segment 3   C. Length expressed in time quantums of ECONz.Q.</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPH</name>
							<description>Clock Phase   CPH. Delay of one half SCLK clock cycle.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPOL</name>
							<description>Clock Polarity   CPOL. Idle level of the shift clock signal at the SCLK pin</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PAREN</name>
							<description>Enable Parity Check   PAREN. This bit field enables both the parity generation in transmit and parity        check in receive direction.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BE</name>
							<description>Permutate bytes to   from Big Endian   BE</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
