J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>STATUS</name>
					<description>Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>64</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ERRORFLAGS</name>
							<description>Sticky Flags Signalling Errors   ERRORFLAGS. Writing 1 sets the error Flag and triggers an error interrupt  if        enabled. Writing 0 has no effect.</description>
							<lsb>0</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXF</name>
							<description>Transmit Interrupt Request Flag   TXF. Flags an occurrence of a request to feed the TXFIFO  which is generated        when an element is fetched from the FIFO  and the FIFO filling level is        equal or less than the set threshold level. Writing 1 sets the flag and triggers an interrupt if GLOBALCON1 .TXEN  160    160 1. Writing 0 has no effect.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXF</name>
							<description>Receive Interrupt Request Flag   RXF. Flags an occurrence of a request to empty the RXFIFO  which is generated        when an element is written into the FIFO  and the FIFO filling level is        equal or greater than the set threshold level. Writing 1 sets the flag and triggers an interrupt if GLOBALCON1 .RXEN  160    160 1. Writing 0 has no effect.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PT1F</name>
							<description>Phase Transition 1 Flag   PT1F. Flags an occurrence of a PT1 event  as selected with the GLOBALCON1 .PT1         and triggers an interrupt if GLOBALCON1 .PT1EN  160    160 1. Writing 1 sets the flag and triggers an error interrupt. Writing 0 has no effect.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PT2F</name>
							<description>Phase Transition 2 Flag   PT2F. In master mode  flags an occurrence of a PT2 event  as selected with the GLOBALCON1 .PT2         and triggers an interrupt if GLOBALCON1 .PT2EN  160    160 1. In slave mode  set by the SLSI deactivated event. Writing 1 sets the flag and triggers an error interrupt. Writing 0 has no effect.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>USRF</name>
							<description>User Interrupt Request Flag   USRF. Flags an occurrence of an USR event. Writing 1 sets the flag and triggers an interrupt if GLOBALCON1 .USREN  160    160 1. Writing 0 has no effect.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXFIFOLEVEL</name>
							<description>TXFIFO Filling Level   TXFIFOLEVEL. Shows how many entries in the TXFIFO are waiting for transmission</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXFIFOLEVEL</name>
							<description>RXFIFO Filling Level   RXFIFOLEVEL. Shows how many entries in the RXFIFO are waiting for software to move        them to RAM</description>
							<lsb>19</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SLAVESEL</name>
							<description>Currently Active Slave Select Flag   SLAVESEL. Displays the currently active slave select.</description>
							<lsb>22</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RPV</name>
							<description>Received Parity Value   RPV. Displays the last received parity bit  if parity was enabled. Else if        the parity is disabled  reads 0.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TPV</name>
							<description>Transmitted Parity Value   TPV. Displays the last transmitted parity bit  if parity was enabled. Else 0.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PHASE</name>
							<description>Flags the ongoing phase   PHASE. Displays the current phase number. Relevant only in master mode. In        slave mode this bit field indicates always 0. Not 0 means busy.</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS1</name>
					<description>Status Register 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>68</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>BITCOUNT</name>
							<description>Number of bits shifted out   BITCOUNT. Supports up to 256 bits. A BITCOUNT value of greater than 0 indicates that a transmission is in progress. The value is not accurate  it may be lower than the number of bits shifted. After transmission of the last bit  BITCOUNT is set to zero.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>BRDEN</name>
							<description>Baud Rate Deviation Enable   BRDEN. Enables the signal path.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BRD</name>
							<description>Baud Rate Deviation Flag   BRD. Shows if baud rate deviation has been detected. Write of 1 sets the bit        and raises the event per software. Write of 0 has no effect.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SPDEN</name>
							<description>Spike Detection Enable   SPDEN. Enables the signal path.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SPD</name>
							<description>Spike Detection Flag   SPD. Shows if spike has been detected. Write of 1 sets the bit and raises the        event per software. Write of 0 has no effect.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SSOC</name>
					<description>Slave Select Output Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>72</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>AOL</name>
							<description>Active Output Level for the SLSO Outputs   AOL. The idle level is the inverted one.   8220 0  8221  at certain position means active low level for the corresponding        SLSO.   8220 1  8221  means active high.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OEN</name>
							<description>Enable Bits for the SLSO Outputs   OEN. In disabled state the SLSO output drives the idle level as defined by        the AOL bit field.   8220 0  8221  at certain position means that the corresponding SLSO is disabled.   8220 1  8221  means enabled.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FLAGSCLEAR</name>
					<description>Flags Clear Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>84</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ERRORCLEARS</name>
							<description>Write Only Bits for Clearing the Error Flags   ERRORCLEARS. Writing 1 clears the corresponding error flag in the ERORRFLAGS bit        field. Reading returns 0.</description>
							<lsb>0</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TXC</name>
							<description>Transmit Event Flag Clear   TXC. Write of 1 clears the STATUS .TXF        bit. Write of 0 has no effect. Read delivers 0.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RXC</name>
							<description>Receive Event Flag Clear   RXC. Write of 1 clears the STATUS .RXF        bit. Write of 0 has no effect. Read delivers 0.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PT1C</name>
							<description>PT1 Event Flag Clear   PT1C. Write of 1 clears the STATUS .PT1F        bit. Write of 0 has no effect. Read delivers 0.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PT2C</name>
							<description>PT2 Event Flag Clear   PT2C. Write of 1 clears the STATUS .PT2F        bit. Write of 0 has no effect. Read delivers 0.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>USRC</name>
							<description>User Event Flag Clear   USRC. Write of 1 clears the STATUS .USRF        bit. Write of 0 has no effect. Read delivers 0.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>XXLCON</name>
					<description>Extra Large Data Configuration Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>88</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>XDL</name>
							<description>Extended Data Length   XDL. Defines the length of the data block in bytes in range of 2 to 65536.        Overrides BACON .DL        when BACON .BYTE 1        and BACON .DL 0.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BYTECOUNT</name>
							<description>Extended Data Length   BYTECOUNT. In the XXL mode  shows the current state of the internal byte down        counter  bytes remaining to be sent . In short and long modes  the value        of this bit field is don  8217 t care.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MIXENTRY</name>
					<description>MIX ENTRY Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>92</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>E</name>
							<description>Entry Point to the TxFIFO   E</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BACONENTRY</name>
					<description>BACON ENTRY Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>96</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>E</name>
							<description>Entry Point to the TxFIFO   E</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>4</dimIncrement>
					<name>DATAENTRYx[%s]</name>
					<description>DATA ENTRY Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>100</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>E</name>
							<description>Entry Point to the TxFIFO   E</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXEXIT</name>
					<description>RX EXIT Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>144</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>E</name>
							<description>Read Point from the RxFIFO   E</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXEXITD</name>
					<description>RX EXIT Debug Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>148</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>E</name>
							<description>Read Point from the RxFIFO   E</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC</name>
					<description>Move Counter Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>164</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MCOUNT</name>
							<description>Move Count   MCOUNT. Defines the number of moves to be performed in short mode  in range of 1        to 8191.</description>
							<lsb>0</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CURRENT</name>
							<description>Current Status of the Move Counter   CURRENT. Shows the current status of the Move Counter  that is  how many data blocks are to be transmitted until the end of the frame.</description>
							<lsb>16</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCCON</name>
					<description>Move Counter control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>168</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TPRE2</name>
							<description>Prescaler for the Trailing Delay 2   TPRE2. Trailing delay injected in the configuration register for the last data        if T2EN is set. Length in units T PER</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TRAIL2</name>
							<description>Last Trailing Delay   TRAIL2. Trailing delay injected in the configuration register for the last data        if T2EN is set. Defines the length of the leading delay  in T PER units pre scaled with TPRE</description>
							<lsb>3</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IBLEN</name>
							<description>Interrupt Before Last Enable   IBLEN. Enable bit for this event.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IBLF</name>
							<description>Interrupt Before Last Flag   IBLF. Flag bit for this event.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IBLC</name>
							<description>Clear Bit for IBLF   IBLC. Writing 1 clears the IBLF. Writing 0 has no effect. Returns 0 on read.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>IBLS</name>
							<description>Set Bit for IBLF   IBLS. Writing 1 sets the IBLF and triggers an interrupt  if enabled . Writing        0 has no effect. Returns 0 on read.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>IALEN</name>
							<description>Interrupt After Last Enable   IALEN. Enable bit for this event.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IALF</name>
							<description>Interrupt After Last Flag   IALF. Flag bit for this event.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IALC</name>
							<description>Clear Bit for IALF   IALC. Writing 1 clears the IALF. Writing 0 has no effect. Returns 0 on read.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>IALS</name>
							<description>Set Bit for IALF   IALS. Writing 1 sets the IALF and triggers an interrupt  if enabled . Writing        0 has no effect. Returns 0 on read.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>T2EN</name>
							<description>TRAIL 2 Injection Enable   T2EN. This bit has to be configured before the transmission of the frame        starts. If set  a new value for the last trailing delay will be injected for the        last data block  as defined with the bit field TRAIL2. If not set  the TRAIL value from the latest BACON will be valid also as the last trailing delay.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MCEN</name>
							<description>Move Counter Enable   MCEN. Enables the Move Counter feature. If enabled  the MCOUNT value is taken        in consideration  otherwise the standard continuous mode is active.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OCS</name>
					<description>OCDS Control and Status
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>232</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SUS</name>
							<description>OCDS Suspend Control   SUS. Controls the sensitivity to the suspend signal coming from the OCDS        Trigger Switch  OTGS </description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SUS_P</name>
							<description>SUS Write Protection   SUS P. SUS is only written when SUS P is 1  otherwise unchanged. Read as 0.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SUSSTA</name>
							<description>Suspend State   SUSSTA</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRSTCLR</name>
					<description>Kernel Reset Status Clear Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>236</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CLR</name>
							<description>Kernel Reset Status Clear   CLR. Read always as 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRST1</name>
					<description>Kernel Reset Register 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>240</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>Kernel Reset   RST. This reset bit can be used to request for a kernel reset. The kernel        reset will be executed if the reset bits of both kernel reset registers        is set. The RST bit will be cleared  re set to   180 0  180   by the BPI FPI after the        kernel reset was executed.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRST0</name>
					<description>Kernel Reset Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>244</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>Kernel Reset   RST. This reset bit can be used to request for a kernel reset. The kernel        reset will be executed if the reset bits of both kernel registers are        set. The RST bit will be cleared  re set to   180 0  180   by the BPI FPI after the        kernel reset was executed.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RSTSTAT</name>
							<description>Kernel Reset Status   RSTSTAT. This bit indicates wether a kernel reset was executed or not. This bit        is set by the BPI FPI after the execution of a kernel reset in the same        clock cycle both reset bits. This bit can be cleared by writing with   180 1  180  to the CLR bit in the        related KRSTCLR register.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
