J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>SENT</name>
			<version>100</version>
			<description>SENT</description>
			<baseAddress>4026544128</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>2748</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<cluster>
					<dim>15</dim>
					<dimIncrement>64</dimIncrement>
					<name>CH[%s]</name>
					<description>CH</description>
					<addressOffset>256</addressOffset>
					<register>
						<name>CPDRx</name>
						<description>Channel Pre Divider Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>PDIV</name>
								<description>Divider Factor of Pre Divider for Channel x   PDIV. Divides f fracdiv by  PDIV   1  and delivers f pdiv x to the Channel Fractional Divider. RCR.CEN must be cleared before        changing CPDR.PDIV or CFDR.DIV.</description>
								<lsb>0</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CFDRx</name>
						<description>Channel Fractional Divider Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DIV</name>
								<description>Divider Value   DIV. Initial and reference divider value for the CFDR.  DIV must be programmed  gt  0. If cleared  DIV becomes 1.  If written  DIVM is updated automatically with the same value. This can be helpful to accelerate a return to normal. RCR.CEN must be cleared before changing CPDR.PDIV or CFDR.DIV. DIV must be set in the range of  2200  49100 .</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DIVM</name>
								<description>Measured Divider Value   DIVM. DIVM is automatically updated by HW to adjust the receiver frequency to the current sender frequency. This value is kept automatically in the range of 75  DIV  lt  DIVM  lt  125  DIV Write data is ignored.</description>
								<lsb>16</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>RCRx</name>
						<description>Receiver Control Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CEN</name>
								<description>Channel Enable   CEN. When CEN is set  the receiver of channel x is enabled. The internal receiver state machine can be initialized by switching the channel off and on. This does not change the current register content.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IEP</name>
								<description>Ignore End Pulse   IEP. When IEP is set  an end pulse is ignored. An end pulse can be generated in SPC mode or as pause pulse. For systems with an end pulse  during synchronize or re synchronize of reception  if calibration pulses are detected one immediately following the other  the first calibration pulse shall be ignored as it may be a pause pulse with duration matching the calibration pulse range.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ACE</name>
								<description>Alternative CRC Mode Enable   ACE. When ACE is set  the CRC is calculated in an alternative way for both  fast  signal  and slow  serial message  data path. If ESF is set  the standard 6 bit CRC is always used for the serial message and ACE is ignored.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SNI</name>
								<description>Status Nibble Included in CRC   SNI. When SNI is set  the status Nibble is included in  signal data  CRC.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SDP</name>
								<description>Serial Data Processing Mode   SDP. This bit switches automatic serial data processing on.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SCDIS</name>
								<description>CRC for Serial Data Disabled Mode   SCDIS. This bit selects the CRC disabled mode.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CDIS</name>
								<description>CRC Disabled Mode   CDIS. This bit selects the CRC disabled mode.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CFC</name>
								<description>Consecutive Frame Check   CFC. This bit determines the way the most recently received frame buffer is        indicated as valid. Note  If FDFL is set  CFC is ignored and the checks        described here are not executed.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FRL</name>
								<description>Frame Length   FRL. FRL determines the number of data nibbles per frame that the SENT channel x is setup for. Note that FRL does not include the        Synchronization   Calibration Pulse  the Status and Communication        nibble  the CRC nibble nor the additional zero length nibble that might        be introduced by use of SPC If more than 8 nibbles are configured  please note  In addition to the        receive success interrupt RSI at the successfully received end of a        frame  a receive data interrupt RDI is issued each time 8 nibbles have        been transferred to the Receive Data Register RDRx. At the end of a        frame  RDI is issued if RSI is issued. If an error occurred  RDI is not        set at the end of a frame. If no CRC has been received at the point in        time where RDI is issued  the receive data interrupt is no indication        whether or not the transfer was successful so far. A CRC Error Interrupt        is issued at the end of the frame if Automatic CRC check is enabled and        the CRC is wrong.</description>
								<lsb>8</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CRZ</name>
								<description>CRC with Zero Nibble for Serial Data   CRZ. This bit selects the CRC method. If CRZ is cleared  augmentation is        selected   i.e a ZERO NIBBLE is added at the end of CRC calculation         only in calculation  . E.g. as 7th nibble  in case of 6 data nibbles  The enhanced serial message  18 Frames  6 bit CRC  is not controlled by        CRZ but the 6 bit CRC is always augmented according to standard.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ESF</name>
								<description>Enhanced Serial Frame Mode   ESF. This bit selects the serial frame structure.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IDE</name>
								<description>Ignore Drift Error Mode   IDE. This bit selects if drift errors lead to frame rejection and if an interrupt  INTSTAT.FDI  is generated.  Used  if sensors are triggered by SPC. During a long pause period the accumulated drift could be more than 1.5625 . In this special case setting IDE is useful.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SUSEN</name>
								<description>Suspend Enable   SUSEN. This bit makes it possible to set the SENT channel into Suspend Mode via OCDS  on chip debug support   Bit SUSEN is reset via OCDS Reset.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FDFL</name>
								<description>Frequency Drift Check based on Frame Length   FDFL. This bit is used for frames with pause pulse only. If set the drift        error is not checked by HW. Instead  counter values DIVM and FRLEN are        provided to the SW for checking the frequency drift. IEP  Pause Pulse        expected  and IDE  no HW check of drift error  must always be set   1         together with FDFL. Note  If FDFL is set  RCR.CFC is ignored and the        checks described there are not executed.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>RSRx</name>
						<description>Receive Status Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>12</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CRC</name>
								<description>CRC   CRC. of last frame. CRC0 is on bit position 0.</description>
								<lsb>0</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CST</name>
								<description>Channel Status   CST. CST shows the current status of channel x.</description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SCN</name>
								<description>Status and Communication Nibble   SCN. of last frame. SCN0 is on bit position 8.</description>
								<lsb>8</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>FRLEN</name>
								<description>Frame Length including Pause Nibble   FRLEN. of last frame. Bit FRLEN0 is on bit position 16. FRLEN is a 16 bit        counter with saturation  stops at 0xFFFF   65.535  and is driven by f pdiv . This counter supports monitoring the following condition for messages        with pause pulse and fixed message length  Ratio of calibration pulse to        message length varies by  gt  1 64 or  lt   1 64 from one message to another.        FRLEN is valid after RSI. See chapter   8220 Support for Frequency Drift        Analysis in Frames with Pause Pulse  8221 . FRLEN        must not be clocked if IEP or IDE or FDFL is cleared.</description>
								<lsb>16</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>SDSx</name>
						<description>Serial Data and Status Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>16</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SD</name>
								<description>Serial Data   SD. of last serial data frame. SD0 is on bit position 0. Usually all 16 data bits are used. If RCR.ESF is cleared 8 bits of data are available and bits  15 8  are zero. If RCR.ESF is set and if SDS.CON is cleared 12 bits of data are available and bits  15 12  are zero.</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>MID</name>
								<description>Message ID   MID. of last serial data frame. ID0 is on bit position 16. If RCR.ESF is cleared  or if SDS.CON is set  bits  23 20  are zero.</description>
								<lsb>16</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SCRC</name>
								<description>SCRC   SCRC. CRC of last serial data frame. CRC0 is on position 24. If RCR.ESF is cleared  bits  29 28  are always zero.</description>
								<lsb>24</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CON</name>
								<description>Configuration bit   CON. of last serial frame.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>IOCRx</name>
						<description>Input and Output Control Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>20</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>268435455</resetMask>
						<fields>
							<field>
								<name>ALTI</name>
								<description>Alternate Input Select   ALTI. Selects the alternate input for channel y </description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DEPTH</name>
								<description>Digital Glitch Filter Depth   DEPTH. DEPTH determines the number of port input samples clocked with f pdiv that are taken into account for the calculation of the floating average.        The higher DEPTH is chosen to be  the longer the glitches that are        suppressed and the longer the delay of the input signal introduced by        this filter.</description>
								<lsb>4</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OIE</name>
								<description>Output Inverter Enable Channel x   OIE. Selects the Pulse Polarity of the output of channel x</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IIE</name>
								<description>Input Inverter Enable Channel x   IIE. Selects the Pulse Polarity of the input of channel x</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CEC</name>
								<description>Clear Edge Counter   CEC. If this bit is set  IOCR.EC is cleared.  Always reads back as  0 .</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>REG</name>
								<description>Rising Edge Glitch Flag for Channel x   REG. Shows the status of the glitch detection of channel x REG is cleared by setting CREG.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>FEG</name>
								<description>Falling Edge Glitch Flag for Channel x   FEG. Shows the status of the glitch detection of channel x FEG is cleared by setting CFEG.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CREG</name>
								<description>Clear Rising Edge Glitch Flag for Channel x   CREG. Clears the status flag REG CREG always read zero.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CFEG</name>
								<description>Clear Falling Edge Glitch Flag for Channel x   CFEG. Clears the status flag FEG CFEG always read zero.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ETS</name>
								<description>External Trigger Select   ETS. Selects the external trigger line if SCRx.TRIG is programmed to 11B. In        some products  not all inputs are connected. See CROSSREFERENCE .</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EC</name>
								<description>Edge Counter   EC. This bit field contains a counter with saturation  stops at 0xFF . It is incremented with any falling edge that appears on the input pin selected by IOCR.ALTI. Note that this holds true in all states  STOP  INITIALIZED  RUNNING  SYNCHRONIZED .  It is intended for debugging  in particular to find a bubbling idiot that sends before enabling the module.</description>
								<lsb>20</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CTR</name>
								<description>Clear Trigger Monitor Flag for Channel x   CTR. Clears the status flag TRM CTR always read zero. Reset value of CTR is 0.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRM</name>
								<description>Trigger Monitor Flag for Channel x   TRM. Shows the status of the trigger detection of channel x TRM is cleared by setting CTR. Reset value of TRM is 0.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RXM</name>
								<description>Receive Monitor for Channel x   RXM. Shows the status of the receive signal of channel x after glitch        filtering and inverted as specified by IIE. Reset value of RXM is X.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TXM</name>
								<description>Transmit Monitor for Channel x   TXM. Shows the status of the transmit signal of channel x inverted as        specified by OIE. Reset value of TXM is X.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>SCRx</name>
						<description>SPC Control Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>24</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>PLEN</name>
								<description>Pulse Length   PLEN. Defines the length of the pulse in tick times. The time base is the        measured tick time of the latest received frame if selected so by BASE.        In case this measured tick time was invalid or not already available        after enable of the channel  the nominal time base of the module is used.</description>
								<lsb>0</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRIG</name>
								<description>Trigger Source and Mode Selection   TRIG. Selects the Trigger Source and Mode. The internal sender state machine        can be initialized by switching the channel off  TRIG is cleared  and        on. This does not change the current register content.</description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DEL</name>
								<description>Delay Length   DEL. Selects how long the SPC pulse is delayed after the trigger condition.        The time base is the measured tick time of the latest received frame if        selected so by BASE. In case this measured tick time was invalid or not        already available after enable of the channel  the nominal time base of        the module is used.</description>
								<lsb>8</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BASE</name>
								<description>Time Base   BASE. Selects the Pulse Time Base</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TRQ</name>
								<description>Transfer Request in Progress   TRQ. While an SPC Pulse is being sent this bit is set. Write access is ignored.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
