J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>VIEWx</name>
						<description>Receive Data View Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>28</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RDNP0</name>
								<description>Receive Data Target Nibble Pointer 7   RDNP7. RDNPy points to the Nibble in Receive Data Register RDRx where the        nibble y from the received frame is sorted to. Nibble 0 is the first        data nibble in the frame. It gets moved to the position defined in        RDNP0. And on. RDNPy must be written before first frame reception. All RDNPy must have        different values.  Higher RDNPy overwrite lower RDNPy. </description>
								<lsb>0</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RDNP1</name>
								<description>Receive Data Target Nibble Pointer 7   RDNP7. RDNPy points to the Nibble in Receive Data Register RDRx where the        nibble y from the received frame is sorted to. Nibble 0 is the first        data nibble in the frame. It gets moved to the position defined in        RDNP0. And on. RDNPy must be written before first frame reception. All RDNPy must have        different values.  Higher RDNPy overwrite lower RDNPy. </description>
								<lsb>4</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RDNP2</name>
								<description>Receive Data Target Nibble Pointer 7   RDNP7. RDNPy points to the Nibble in Receive Data Register RDRx where the        nibble y from the received frame is sorted to. Nibble 0 is the first        data nibble in the frame. It gets moved to the position defined in        RDNP0. And on. RDNPy must be written before first frame reception. All RDNPy must have        different values.  Higher RDNPy overwrite lower RDNPy. </description>
								<lsb>8</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RDNP3</name>
								<description>Receive Data Target Nibble Pointer 7   RDNP7. RDNPy points to the Nibble in Receive Data Register RDRx where the        nibble y from the received frame is sorted to. Nibble 0 is the first        data nibble in the frame. It gets moved to the position defined in        RDNP0. And on. RDNPy must be written before first frame reception. All RDNPy must have        different values.  Higher RDNPy overwrite lower RDNPy. </description>
								<lsb>12</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RDNP4</name>
								<description>Receive Data Target Nibble Pointer 7   RDNP7. RDNPy points to the Nibble in Receive Data Register RDRx where the        nibble y from the received frame is sorted to. Nibble 0 is the first        data nibble in the frame. It gets moved to the position defined in        RDNP0. And on. RDNPy must be written before first frame reception. All RDNPy must have        different values.  Higher RDNPy overwrite lower RDNPy. </description>
								<lsb>16</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RDNP5</name>
								<description>Receive Data Target Nibble Pointer 7   RDNP7. RDNPy points to the Nibble in Receive Data Register RDRx where the        nibble y from the received frame is sorted to. Nibble 0 is the first        data nibble in the frame. It gets moved to the position defined in        RDNP0. And on. RDNPy must be written before first frame reception. All RDNPy must have        different values.  Higher RDNPy overwrite lower RDNPy. </description>
								<lsb>20</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RDNP6</name>
								<description>Receive Data Target Nibble Pointer 7   RDNP7. RDNPy points to the Nibble in Receive Data Register RDRx where the        nibble y from the received frame is sorted to. Nibble 0 is the first        data nibble in the frame. It gets moved to the position defined in        RDNP0. And on. RDNPy must be written before first frame reception. All RDNPy must have        different values.  Higher RDNPy overwrite lower RDNPy. </description>
								<lsb>24</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RDNP7</name>
								<description>Receive Data Target Nibble Pointer 7   RDNP7. RDNPy points to the Nibble in Receive Data Register RDRx where the        nibble y from the received frame is sorted to. Nibble 0 is the first        data nibble in the frame. It gets moved to the position defined in        RDNP0. And on. RDNPy must be written before first frame reception. All RDNPy must have        different values.  Higher RDNPy overwrite lower RDNPy. </description>
								<lsb>28</lsb>
								<msb>30</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>INTSTATx</name>
						<description>Interrupt Status Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>32</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RSI</name>
								<description>Receive Success Interrupt Request Flag   RSI. This bit is set at the successfully received end of a frame. Depending on bit RCRx.CDIS this indicates a successful check of the CRC. This bit can be cleared by bit INTCLRx.RSI. This bit can be set by bit INTSETx.RSI. This bit is set independently from INTENx.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RDI</name>
								<description>Receive Data Interrupt Request Flag   RDI. RDI is activated when a received frame is moved to a Receive Data        Register RDR. Both RDI and RSI will be issued together in normal use        cases where the frame size is not bigger than 8 nibbles and CRC is        correct or not checked  if RCRx.CDIS is cleared . For frames with more        than 8 nibbles RDI is issued after 8 nibbles. After the last nibbles of        the frame are received  a last RDI and an RSI are issued together. Note        that this is true independently from RCR.FDFL. This bit can be cleared by bit INTCLRx.RDI. This bit can be set by bit INTSETx.RDI. This bit is set independently from INTENx.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RBI</name>
								<description>Receive Buffer Overflow Interrupt Request Flag   RBI. This bit is set after a frame has been received while the old one was not read from RDRx. I.e. the kernel wants to set any of the two interrupts RSI and RDI and finds any of these two interrupts already set.The old data is overwritten by the new data. This bit is NOT cleared by reading RDRx. This bit can be cleared by bit INTCLRx.RBI. This bit can be set by bit INTSETx.RBI. This bit is set independently from INTENx.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TDI</name>
								<description>Transfer Data Interrupt Request Flag   TDI. This bit is set after the trigger condition was detected. Data to be transferred has been moved internally. Thus a new value can be written to SCRx. This can be used for back to back transfers. This bit is automatically cleared by writing SCRx. This bit can be cleared by bit INTCLRx.TDI. This bit can be set by bit INTSETx.TDI. This bit is set independently from INTENx.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TBI</name>
								<description>Transmit Buffer Underflow Interrupt Request Flag   TBI. This bit is set after data has been completely transferred  PLEN exceeded  and no new data was written to SCRx. This bit is NOT cleared by writing SCRx. This bit can be cleared by bit INTCLRx.TBI. This bit can be set by bit INTSETx.TBI. This bit is set independently from INTENx.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>FRI</name>
								<description>Frequency Range Interrupt Request Flag   FRI. This bit is set after a Synchronization   Calibration pulse was received that deviates more than     25  from the nominal value. The referring data is ignored. This bit can be cleared by bit INTCLRx.FRI. This bit can be set by bit INTSETx.FRI. This bit is set independently from INTENx.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>FDI</name>
								<description>Frequency Drift Interrupt Request Flag   FDI. This bit is set after a subsequent Synchronization   Calibration pulse was received that deviates more than 1.5625   1 64  from its predecessor.  See RCR.CFC  This bit can be cleared by bit INTCLRx.FDI. This bit can be set by bit INTSETx.FDI. This bit is set independently from INTENx.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>NNI</name>
								<description>Number of Nibbles Wrong Request Flag   NNI. This bit is set after more nibbles have been received than expected or a        Synchronization   Calibration Pulse is received too early thus too few        nibbles have been received. This bit can be cleared by bit INTCLRx.NNI. This bit can be set by bit INTSETx.NNI. This bit is set independently from INTENx.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>NVI</name>
								<description>Nibbles Value out of Range Request Flag   NVI. This bit is set after a too long or too short nibble pulse has been        received. I.e. value  lt  0 or value  gt  15. This bit can be cleared by bit INTCLRx.NVI. This bit can be set by bit INTSETx.NVI. This bit is set independently from INTENx.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CRCI</name>
								<description>CRC Error Request Flag   CRCI. This bit is set if the CRC fails. This bit can be cleared by bit INTCLRx.CRCI. This bit can be set by bit INTSETx.CRCI. This bit is set independently from INTENx.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>WSI</name>
								<description>Wrong Status and Communication Nibble Error Request Flag   WSI. In Short Serial Frame Mode  RCR.ESF is cleared   this bit is set if the        Status and Communication nibble shows a start bit in a frame other than        frame number n x 16. In Enhanced Serial Frame Mode this bit is without function. This bit can be cleared by bit INTCLRx.WSI. This bit can be set by bit INTSETx.WSI. This bit is set independently from INTENx.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SDI</name>
								<description>Serial Data Receive Interrupt Request Flag   SDI. This bit is set after all serial data bits have been received via the Status and Communication nibble. Depending on bit RCRx.SCDIS this indicates a successful check of the CRC. This bit can be cleared by bit INTCLRx.SDI. This bit can be set by bit INTSETx.SDI. This bit is set independently from INTENx.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SCRI</name>
								<description>Serial Data CRC Error Request Flag   SCRI. This bit is set if the CRC of the serial message fails. In Enhanced        Serial Message Format  this includes a check of the Serial Communication        Nibble for correct 0 values of bit 3 in frames 7  13 and 18. This bit can be cleared by bit INTCLRx.SCRI. This bit can be set by bit INTSETx.SCRI. This bit is set independently from INTENx.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>WDI</name>
								<description>Watch Dog Error Request Flag   WDI. This bit is set if the Watch Dog Timer of the channel x expires. This bit can be cleared by bit INTCLRx.WDI. This bit can be set by bit INTSETx.WDI. This bit is set independently from INTENx.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>INTSETx</name>
						<description>Interrupt Set Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>36</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RSI</name>
								<description>Set Interrupt Request Flag RSI   RSI. Setting this bit set bit INTSTATx.RSI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RDI</name>
								<description>Set Interrupt Request Flag RDI   RDI. Setting this bit set bit INTSTATx.RDI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RBI</name>
								<description>Set Interrupt Request Flag RBI   RBI. Setting this bit set bit INTSTATx.RBI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>TDI</name>
								<description>Set Interrupt Request Flag TDI   TDI. Setting this bit set bit INTSTATx.TDI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>TBI</name>
								<description>Set Interrupt Request Flag TBI   TBI. Setting this bit set bit INTSTATx.TBI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>FRI</name>
								<description>Set Interrupt Request Flag FRI   FRI. Setting this bit set bit INTSTATx.FRI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>FDI</name>
								<description>Set Interrupt Request Flag FDI   FDI. Setting this bit set bit INTSTATx.FDI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>NNI</name>
								<description>Set Interrupt Request Flag NNI   NNI. Setting this bit set bit INTSTATx.NNI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>NVI</name>
								<description>Set Interrupt Request Flag NVI   NVI. Setting this bit set bit INTSTATx.NVI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>CRCI</name>
								<description>Set Interrupt Request Flag CRCI   CRCI. Setting this bit set bit INTSTATx.CRCI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>WSI</name>
								<description>Set Interrupt Request Flag WSI   WSI. Setting this bit set bit INTSTATx.WSI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>SDI</name>
								<description>Set Interrupt Request Flag SDI   SDI. Setting this bit set bit INTSTATx.SDI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>SCRI</name>
								<description>Set Interrupt Request Flag SCRI   SCRI. Setting this bit set bit INTSTATx.SCRI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>WDI</name>
								<description>Set Interrupt Request Flag WDI   WDI. Setting this bit set bit INTSTATx.WDI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>write-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>INTCLRx</name>
						<description>Interrupt Clear Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>40</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RSI</name>
								<description>Clear Interrupt Request Flag RSI   RSI. Setting this bit clears bit INTSTATx.RSI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RDI</name>
								<description>Clear Interrupt Request Flag RDI   RDI. Setting this bit clears bit INTSTATx.RDI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RBI</name>
								<description>Clear Interrupt Request Flag RBI   RBI. Setting this bit clears bit INTSTATx.RBI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>TDI</name>
								<description>Clear Interrupt Request Flag TDI   TDI. Setting this bit clears bit INTSTATx.TDI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>TBI</name>
								<description>Clear Interrupt Request Flag TBI   TBI. Setting this bit clears bit INTSTATx.TBI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>FRI</name>
								<description>Clear Interrupt Request Flag FRI   FRI. Setting this bit clears bit INTSTATx.FRI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>FDI</name>
								<description>Clear Interrupt Request Flag FDI   FDI. Setting this bit clears bit INTSTATx.FDI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>NNI</name>
								<description>Clear Interrupt Request Flag NNI   NNI. Setting this bit clears bit INTSTATx.NNI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>NVI</name>
								<description>Clear Interrupt Request Flag NVI   NVI. Setting this bit clears bit INTSTATx.NVI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>CRCI</name>
								<description>Clear Interrupt Request Flag CRCI   CRCI. Setting this bit clears bit INTSTATx.CRCI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>WSI</name>
								<description>Clear Interrupt Request Flag WSI   WSI. Setting this bit clears bit INTSTATx.WSI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>SDI</name>
								<description>Clear Interrupt Request Flag SDI   SDI. Setting this bit clears bit INTSTATx.SDI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>SCRI</name>
								<description>Clear Interrupt Request Flag SCRI   SCRI. Setting this bit clears bit INTSTATx.SCRI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>WDI</name>
								<description>Clear Interrupt Request Flag WDI   WDI. Setting this bit clears bit INTSTATx.WDI. Clearing this bit has no effect. Reading this bit returns always zero.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>write-only</access>
							</field>
						</fields>
					</register>
