J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>INTENx</name>
						<description>Interrupt Enable Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>44</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RSI</name>
								<description>Enable Interrupt Request RSI   RSI</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RDI</name>
								<description>Enable Interrupt Request RDI   RDI</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RBI</name>
								<description>Enable Interrupt Request RBI   RBI</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TDI</name>
								<description>Enable Interrupt Request TDI   TDI</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBI</name>
								<description>Enable Interrupt Request TBI   TBI</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FRI</name>
								<description>Enable Interrupt Request FRI   FRI</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FDI</name>
								<description>Enable Interrupt Request FDI   FDI</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>NNI</name>
								<description>Enable Interrupt Request NNI   NNI</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>NVI</name>
								<description>Enable Interrupt Request NVI   NVI</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CRCI</name>
								<description>Enable Interrupt Request CRCI   CRCI</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WSI</name>
								<description>Enable Interrupt Request WSI   WSI</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SDI</name>
								<description>Enable Interrupt Request SDI   SDI</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SCRI</name>
								<description>Enable Interrupt Request SCRI   SCRI</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WDI</name>
								<description>Enable Interrupt Request WDI   WDI</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>INPx</name>
						<description>Interrupt Node Pointer Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>48</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RSI</name>
								<description>Interrupt Node Pointer for Interrupt RSI   RSI. This bit field defines the interrupt node  that is requested due to the        set condition for bit INTSTATx.RSI  if enabled by bit INTENx.RSI .</description>
								<lsb>0</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RDI</name>
								<description>Interrupt Node Pointer for Interrupt RDI   RDI. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATx.RDI  if enabled by bit INTENx.RDI . For bit field definition  see RSI.</description>
								<lsb>4</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RBI</name>
								<description>Interrupt Node Pointer for Interrupt RBI   RBI. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATx.RBI  if enabled by bit INTENx.RBI . For bit field definition  see RSI.</description>
								<lsb>8</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TDI</name>
								<description>Interrupt Node Pointer for Interrupt TDI   TDI. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATx.TDI  if enabled by bit INTENx.TDI . For bit field definition  see RSI.</description>
								<lsb>12</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TBI</name>
								<description>Interrupt Node Pointer for Interrupt TBI   TBI. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATx.TBI  if enabled by bit INTENx.TBI . For bit field definition  see RSI.</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ERRI</name>
								<description>Interrupt Node Pointer for Interrupt FRI  FDI  NNI  NVI  CRCI  WSI  SCRI   ERRI. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATx.FRI  if enabled by bit INTENx.FRI  or INTSTATx.FDI  if enabled by bit INTENx.FDI  or INTSTATx.NNI  if enabled by bit INTENx.NNI  or INTSTATx.NVI  if enabled by bit INTENx.NVI  or INTSTATx.CRCI  if enabled by bit INTENx.CRCI  or INTSTATx.WSI  if enabled by bit INTENx.WSI  or INTSTATx.SCRI  if enabled by bit INTENx.SCRI  For bit field definition  see RSI.</description>
								<lsb>20</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SDI</name>
								<description>Interrupt Node Pointer for Interrupt SDI   SDI. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATx.SDI  if enabled by bit INTENx.SDI . For bit field definition  see RSI.</description>
								<lsb>24</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WDI</name>
								<description>Interrupt Node Pointer for Interrupt WDI   WDI. This bit field defines the interrupt node  that is requested due to the set condition for bit INTSTATx.WDI  if enabled by bit INTENx.WDI . For bit field definition  see RSI.</description>
								<lsb>28</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>WDTx</name>
						<description>Watch Dog Timer Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>52</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>WDL</name>
								<description>Watch Dog Timer Limit   WDL. for channel x .</description>
								<lsb>0</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
				<register>
					<name>CLC</name>
					<description>Clock Control Register
 resetvalue={Application Reset:0x3}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>3</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit   DISR. Used for enable disable control of the module.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit   DISS. Bit indicates the current status of the module.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EDIS</name>
							<description>Sleep Mode Enable Control   EDIS. Used to control module  8217 s sleep mode.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Module Identification Register
 resetvalue={Application Reset:0x080C000}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>8437760</resetValue>
					<resetMask>4294967040</resetMask>
					<fields>
						<field>
							<name>MODREV</name>
							<description>Module Revision Number   MODREV. This bit field defines the module revision number. The value of a module        revision starts with 01 H  first        revision .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODTYPE</name>
							<description>Module Type   MODTYPE. This bit field defines the module as a 32 bit module  C0 H</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODNUM</name>
							<description>Module Number Value   MODNUM. This bit field defines the module identification number for the SENT          0080 H</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FDR</name>
					<description>SENT Fractional Divider Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>12</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>STEP</name>
							<description>Step Value   STEP. Reload or addition value for RESULT.</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DM</name>
							<description>Divider Mode   DM. DM selects normal or fractional divider mode.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RESULT</name>
							<description>Result Value   RESULT. Bit field for the addition result.</description>
							<lsb>16</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
