J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>INTOV</name>
					<description>Interrupt Overview Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>20</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>IPC0</name>
							<description>Interrupt Pending on Channel 24   IPC24. If any interrupt requested flag is set for channel y in register        INTSTATy AND the referring interrupt is enabled in INTENx then IPCy is        set. It is automatically reset if all flags in INTSTATy are cleared for        which the referring interrupt is enabled in INTENx. Not all IPC0 24 are available on all products  the number of Interrupt          Pending on Channel is equivalent to the SENT channels available  e.g 4          SENT channels has 4 Interrupt Pending IPC0 3 and vice versa.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC1</name>
							<description>Interrupt Pending on Channel 24   IPC24. If any interrupt requested flag is set for channel y in register        INTSTATy AND the referring interrupt is enabled in INTENx then IPCy is        set. It is automatically reset if all flags in INTSTATy are cleared for        which the referring interrupt is enabled in INTENx. Not all IPC0 24 are available on all products  the number of Interrupt          Pending on Channel is equivalent to the SENT channels available  e.g 4          SENT channels has 4 Interrupt Pending IPC0 3 and vice versa.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC2</name>
							<description>Interrupt Pending on Channel 24   IPC24. If any interrupt requested flag is set for channel y in register        INTSTATy AND the referring interrupt is enabled in INTENx then IPCy is        set. It is automatically reset if all flags in INTSTATy are cleared for        which the referring interrupt is enabled in INTENx. Not all IPC0 24 are available on all products  the number of Interrupt          Pending on Channel is equivalent to the SENT channels available  e.g 4          SENT channels has 4 Interrupt Pending IPC0 3 and vice versa.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC3</name>
							<description>Interrupt Pending on Channel 24   IPC24. If any interrupt requested flag is set for channel y in register        INTSTATy AND the referring interrupt is enabled in INTENx then IPCy is        set. It is automatically reset if all flags in INTSTATy are cleared for        which the referring interrupt is enabled in INTENx. Not all IPC0 24 are available on all products  the number of Interrupt          Pending on Channel is equivalent to the SENT channels available  e.g 4          SENT channels has 4 Interrupt Pending IPC0 3 and vice versa.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC4</name>
							<description>Interrupt Pending on Channel 24   IPC24. If any interrupt requested flag is set for channel y in register        INTSTATy AND the referring interrupt is enabled in INTENx then IPCy is        set. It is automatically reset if all flags in INTSTATy are cleared for        which the referring interrupt is enabled in INTENx. Not all IPC0 24 are available on all products  the number of Interrupt          Pending on Channel is equivalent to the SENT channels available  e.g 4          SENT channels has 4 Interrupt Pending IPC0 3 and vice versa.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC5</name>
							<description>Interrupt Pending on Channel 24   IPC24. If any interrupt requested flag is set for channel y in register        INTSTATy AND the referring interrupt is enabled in INTENx then IPCy is        set. It is automatically reset if all flags in INTSTATy are cleared for        which the referring interrupt is enabled in INTENx. Not all IPC0 24 are available on all products  the number of Interrupt          Pending on Channel is equivalent to the SENT channels available  e.g 4          SENT channels has 4 Interrupt Pending IPC0 3 and vice versa.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC6</name>
							<description>Interrupt Pending on Channel 24   IPC24. If any interrupt requested flag is set for channel y in register        INTSTATy AND the referring interrupt is enabled in INTENx then IPCy is        set. It is automatically reset if all flags in INTSTATy are cleared for        which the referring interrupt is enabled in INTENx. Not all IPC0 24 are available on all products  the number of Interrupt          Pending on Channel is equivalent to the SENT channels available  e.g 4          SENT channels has 4 Interrupt Pending IPC0 3 and vice versa.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC7</name>
							<description>Interrupt Pending on Channel 24   IPC24. If any interrupt requested flag is set for channel y in register        INTSTATy AND the referring interrupt is enabled in INTENx then IPCy is        set. It is automatically reset if all flags in INTSTATy are cleared for        which the referring interrupt is enabled in INTENx. Not all IPC0 24 are available on all products  the number of Interrupt          Pending on Channel is equivalent to the SENT channels available  e.g 4          SENT channels has 4 Interrupt Pending IPC0 3 and vice versa.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC8</name>
							<description>Interrupt Pending on Channel 24   IPC24. If any interrupt requested flag is set for channel y in register        INTSTATy AND the referring interrupt is enabled in INTENx then IPCy is        set. It is automatically reset if all flags in INTSTATy are cleared for        which the referring interrupt is enabled in INTENx. Not all IPC0 24 are available on all products  the number of Interrupt          Pending on Channel is equivalent to the SENT channels available  e.g 4          SENT channels has 4 Interrupt Pending IPC0 3 and vice versa.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC9</name>
							<description>Interrupt Pending on Channel 24   IPC24. If any interrupt requested flag is set for channel y in register        INTSTATy AND the referring interrupt is enabled in INTENx then IPCy is        set. It is automatically reset if all flags in INTSTATy are cleared for        which the referring interrupt is enabled in INTENx. Not all IPC0 24 are available on all products  the number of Interrupt          Pending on Channel is equivalent to the SENT channels available  e.g 4          SENT channels has 4 Interrupt Pending IPC0 3 and vice versa.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC10</name>
							<description>Interrupt Pending on Channel 24   IPC24. If any interrupt requested flag is set for channel y in register        INTSTATy AND the referring interrupt is enabled in INTENx then IPCy is        set. It is automatically reset if all flags in INTSTATy are cleared for        which the referring interrupt is enabled in INTENx. Not all IPC0 24 are available on all products  the number of Interrupt          Pending on Channel is equivalent to the SENT channels available  e.g 4          SENT channels has 4 Interrupt Pending IPC0 3 and vice versa.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC11</name>
							<description>Interrupt Pending on Channel 24   IPC24. If any interrupt requested flag is set for channel y in register        INTSTATy AND the referring interrupt is enabled in INTENx then IPCy is        set. It is automatically reset if all flags in INTSTATy are cleared for        which the referring interrupt is enabled in INTENx. Not all IPC0 24 are available on all products  the number of Interrupt          Pending on Channel is equivalent to the SENT channels available  e.g 4          SENT channels has 4 Interrupt Pending IPC0 3 and vice versa.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC12</name>
							<description>Interrupt Pending on Channel 24   IPC24. If any interrupt requested flag is set for channel y in register        INTSTATy AND the referring interrupt is enabled in INTENx then IPCy is        set. It is automatically reset if all flags in INTSTATy are cleared for        which the referring interrupt is enabled in INTENx. Not all IPC0 24 are available on all products  the number of Interrupt          Pending on Channel is equivalent to the SENT channels available  e.g 4          SENT channels has 4 Interrupt Pending IPC0 3 and vice versa.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC13</name>
							<description>Interrupt Pending on Channel 24   IPC24. If any interrupt requested flag is set for channel y in register        INTSTATy AND the referring interrupt is enabled in INTENx then IPCy is        set. It is automatically reset if all flags in INTSTATy are cleared for        which the referring interrupt is enabled in INTENx. Not all IPC0 24 are available on all products  the number of Interrupt          Pending on Channel is equivalent to the SENT channels available  e.g 4          SENT channels has 4 Interrupt Pending IPC0 3 and vice versa.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC14</name>
							<description>Interrupt Pending on Channel 24   IPC24. If any interrupt requested flag is set for channel y in register        INTSTATy AND the referring interrupt is enabled in INTENx then IPCy is        set. It is automatically reset if all flags in INTSTATy are cleared for        which the referring interrupt is enabled in INTENx. Not all IPC0 24 are available on all products  the number of Interrupt          Pending on Channel is equivalent to the SENT channels available  e.g 4          SENT channels has 4 Interrupt Pending IPC0 3 and vice versa.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC15</name>
							<description>Interrupt Pending on Channel 24   IPC24. If any interrupt requested flag is set for channel y in register        INTSTATy AND the referring interrupt is enabled in INTENx then IPCy is        set. It is automatically reset if all flags in INTSTATy are cleared for        which the referring interrupt is enabled in INTENx. Not all IPC0 24 are available on all products  the number of Interrupt          Pending on Channel is equivalent to the SENT channels available  e.g 4          SENT channels has 4 Interrupt Pending IPC0 3 and vice versa.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC16</name>
							<description>Interrupt Pending on Channel 24   IPC24. If any interrupt requested flag is set for channel y in register        INTSTATy AND the referring interrupt is enabled in INTENx then IPCy is        set. It is automatically reset if all flags in INTSTATy are cleared for        which the referring interrupt is enabled in INTENx. Not all IPC0 24 are available on all products  the number of Interrupt          Pending on Channel is equivalent to the SENT channels available  e.g 4          SENT channels has 4 Interrupt Pending IPC0 3 and vice versa.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC17</name>
							<description>Interrupt Pending on Channel 24   IPC24. If any interrupt requested flag is set for channel y in register        INTSTATy AND the referring interrupt is enabled in INTENx then IPCy is        set. It is automatically reset if all flags in INTSTATy are cleared for        which the referring interrupt is enabled in INTENx. Not all IPC0 24 are available on all products  the number of Interrupt          Pending on Channel is equivalent to the SENT channels available  e.g 4          SENT channels has 4 Interrupt Pending IPC0 3 and vice versa.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC18</name>
							<description>Interrupt Pending on Channel 24   IPC24. If any interrupt requested flag is set for channel y in register        INTSTATy AND the referring interrupt is enabled in INTENx then IPCy is        set. It is automatically reset if all flags in INTSTATy are cleared for        which the referring interrupt is enabled in INTENx. Not all IPC0 24 are available on all products  the number of Interrupt          Pending on Channel is equivalent to the SENT channels available  e.g 4          SENT channels has 4 Interrupt Pending IPC0 3 and vice versa.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC19</name>
							<description>Interrupt Pending on Channel 24   IPC24. If any interrupt requested flag is set for channel y in register        INTSTATy AND the referring interrupt is enabled in INTENx then IPCy is        set. It is automatically reset if all flags in INTSTATy are cleared for        which the referring interrupt is enabled in INTENx. Not all IPC0 24 are available on all products  the number of Interrupt          Pending on Channel is equivalent to the SENT channels available  e.g 4          SENT channels has 4 Interrupt Pending IPC0 3 and vice versa.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC20</name>
							<description>Interrupt Pending on Channel 24   IPC24. If any interrupt requested flag is set for channel y in register        INTSTATy AND the referring interrupt is enabled in INTENx then IPCy is        set. It is automatically reset if all flags in INTSTATy are cleared for        which the referring interrupt is enabled in INTENx. Not all IPC0 24 are available on all products  the number of Interrupt          Pending on Channel is equivalent to the SENT channels available  e.g 4          SENT channels has 4 Interrupt Pending IPC0 3 and vice versa.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC21</name>
							<description>Interrupt Pending on Channel 24   IPC24. If any interrupt requested flag is set for channel y in register        INTSTATy AND the referring interrupt is enabled in INTENx then IPCy is        set. It is automatically reset if all flags in INTSTATy are cleared for        which the referring interrupt is enabled in INTENx. Not all IPC0 24 are available on all products  the number of Interrupt          Pending on Channel is equivalent to the SENT channels available  e.g 4          SENT channels has 4 Interrupt Pending IPC0 3 and vice versa.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC22</name>
							<description>Interrupt Pending on Channel 24   IPC24. If any interrupt requested flag is set for channel y in register        INTSTATy AND the referring interrupt is enabled in INTENx then IPCy is        set. It is automatically reset if all flags in INTSTATy are cleared for        which the referring interrupt is enabled in INTENx. Not all IPC0 24 are available on all products  the number of Interrupt          Pending on Channel is equivalent to the SENT channels available  e.g 4          SENT channels has 4 Interrupt Pending IPC0 3 and vice versa.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC23</name>
							<description>Interrupt Pending on Channel 24   IPC24. If any interrupt requested flag is set for channel y in register        INTSTATy AND the referring interrupt is enabled in INTENx then IPCy is        set. It is automatically reset if all flags in INTSTATy are cleared for        which the referring interrupt is enabled in INTENx. Not all IPC0 24 are available on all products  the number of Interrupt          Pending on Channel is equivalent to the SENT channels available  e.g 4          SENT channels has 4 Interrupt Pending IPC0 3 and vice versa.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPC24</name>
							<description>Interrupt Pending on Channel 24   IPC24. If any interrupt requested flag is set for channel y in register        INTSTATy AND the referring interrupt is enabled in INTENx then IPCy is        set. It is automatically reset if all flags in INTSTATy are cleared for        which the referring interrupt is enabled in INTENx. Not all IPC0 24 are available on all products  the number of Interrupt          Pending on Channel is equivalent to the SENT channels available  e.g 4          SENT channels has 4 Interrupt Pending IPC0 3 and vice versa.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSR</name>
					<description>Module Time Stamp Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>24</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CTS</name>
							<description>Current Time Stamp for the Module   CTS. This bit field shows the current time stamp.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TPD</name>
					<description>Time Stamp Predivider Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>28</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TDIV</name>
							<description>Divider Factor of Pre Divider for TSR   TDIV. Divides f fracdiv by  TDIV   1  and drives TSR.</description>
							<lsb>0</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>15</dim>
					<dimIncrement>4</dimIncrement>
					<name>RDRx[%s]</name>
					<description>Receive Data Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>128</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RD0</name>
							<description>Receive Data Nibble 7   RD7. RDy shows the nibble from the received frame that is sorted to this        position. It can be selected by any of VIEWx.RDNPy  y  160    160 0 7 . By default        all nibbles are sorted to RD0 as the reset value of VIEW is        0x0000  160 0000H. I.e. at the end of frame reception RD0 contains the last        data nibble of the frame.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD1</name>
							<description>Receive Data Nibble 7   RD7. RDy shows the nibble from the received frame that is sorted to this        position. It can be selected by any of VIEWx.RDNPy  y  160    160 0 7 . By default        all nibbles are sorted to RD0 as the reset value of VIEW is        0x0000  160 0000H. I.e. at the end of frame reception RD0 contains the last        data nibble of the frame.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD2</name>
							<description>Receive Data Nibble 7   RD7. RDy shows the nibble from the received frame that is sorted to this        position. It can be selected by any of VIEWx.RDNPy  y  160    160 0 7 . By default        all nibbles are sorted to RD0 as the reset value of VIEW is        0x0000  160 0000H. I.e. at the end of frame reception RD0 contains the last        data nibble of the frame.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD3</name>
							<description>Receive Data Nibble 7   RD7. RDy shows the nibble from the received frame that is sorted to this        position. It can be selected by any of VIEWx.RDNPy  y  160    160 0 7 . By default        all nibbles are sorted to RD0 as the reset value of VIEW is        0x0000  160 0000H. I.e. at the end of frame reception RD0 contains the last        data nibble of the frame.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD4</name>
							<description>Receive Data Nibble 7   RD7. RDy shows the nibble from the received frame that is sorted to this        position. It can be selected by any of VIEWx.RDNPy  y  160    160 0 7 . By default        all nibbles are sorted to RD0 as the reset value of VIEW is        0x0000  160 0000H. I.e. at the end of frame reception RD0 contains the last        data nibble of the frame.</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD5</name>
							<description>Receive Data Nibble 7   RD7. RDy shows the nibble from the received frame that is sorted to this        position. It can be selected by any of VIEWx.RDNPy  y  160    160 0 7 . By default        all nibbles are sorted to RD0 as the reset value of VIEW is        0x0000  160 0000H. I.e. at the end of frame reception RD0 contains the last        data nibble of the frame.</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD6</name>
							<description>Receive Data Nibble 7   RD7. RDy shows the nibble from the received frame that is sorted to this        position. It can be selected by any of VIEWx.RDNPy  y  160    160 0 7 . By default        all nibbles are sorted to RD0 as the reset value of VIEW is        0x0000  160 0000H. I.e. at the end of frame reception RD0 contains the last        data nibble of the frame.</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD7</name>
							<description>Receive Data Nibble 7   RD7. RDy shows the nibble from the received frame that is sorted to this        position. It can be selected by any of VIEWx.RDNPy  y  160    160 0 7 . By default        all nibbles are sorted to RD0 as the reset value of VIEW is        0x0000  160 0000H. I.e. at the end of frame reception RD0 contains the last        data nibble of the frame.</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
