J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>HP_PROCONPi4</name>
						<description>PFLASH Bank 0 Protection Configuration 4
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
						<addressOffset>16</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>S128L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S129L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S130L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S131L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S132L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S133L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S134L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S135L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S136L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S137L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S138L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S139L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S140L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S141L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S142L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S143L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S144L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S145L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S146L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S147L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S148L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S149L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S150L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S151L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S152L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S153L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S154L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S155L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S156L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S157L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S158L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S159L</name>
								<description>PFLASH p Sector 159 Locked for Write Protection   S159L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>HP_PROCONPi5</name>
						<description>PFLASH Bank 0 Protection Configuration 5
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
						<addressOffset>20</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>S160L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S161L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S162L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S163L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S164L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S165L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S166L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S167L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S168L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S169L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S170L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S171L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S172L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S173L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S174L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S175L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S176L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S177L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S178L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S179L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S180L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S181L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S182L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S183L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S184L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S185L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S186L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S187L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S188L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S189L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S190L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S191L</name>
								<description>PFLASH p Sector 191 Locked for Write Protection   S191L. These bits indicate whether PFLASH sector x is write protected.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
