J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>HP_PROCONOTPi0</name>
						<description>PFLASH Bank 0 OTP Protection Configuration 0
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
						<addressOffset>64</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>S0ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S1ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S2ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S3ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S4ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S5ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S6ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S7ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S8ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S9ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S10ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S11ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S12ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S13ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S14ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S15ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S16ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S17ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S18ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S19ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S20ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S21ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S22ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S23ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S24ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S25ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S26ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S27ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S28ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S29ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S30ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S31ROM</name>
								<description>PFLASH p Sector 31 Locked for Forever   S31ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>HP_PROCONOTPi1</name>
						<description>PFLASH Bank 0 OTP Protection Configuration 1
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
						<addressOffset>68</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>S32ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S33ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S34ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S35ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S36ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S37ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S38ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S39ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S40ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S41ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S42ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S43ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S44ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S45ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S46ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S47ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S48ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S49ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S50ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S51ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S52ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S53ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S54ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S55ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S56ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S57ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S58ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S59ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S60ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S61ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S62ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S63ROM</name>
								<description>PFLASH p Sector 63 Locked for Forever   S63ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
