J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>HP_PROCONOTPi2</name>
						<description>PFLASH Bank 0 OTP Protection Configuration 2
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
						<addressOffset>72</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>S64ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S65ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S66ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S67ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S68ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S69ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S70ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S71ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S72ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S73ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S74ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S75ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S76ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S77ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S78ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S79ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S80ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S81ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S82ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S83ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S84ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S85ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S86ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S87ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S88ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S89ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S90ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S91ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S92ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S93ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S94ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S95ROM</name>
								<description>PFLASH p Sector 95 Locked for Forever   S95ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>HP_PROCONOTPi3</name>
						<description>PFLASH Bank 0 OTP Protection Configuration 3
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
						<addressOffset>76</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>S96ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S97ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S98ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S99ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S100ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S101ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S102ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S103ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S104ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S105ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S106ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S107ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S108ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S109ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S110ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S111ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S112ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S113ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S114ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S115ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S116ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S117ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S118ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S119ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S120ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S121ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S122ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S123ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S124ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S125ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S126ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S127ROM</name>
								<description>PFLASH p Sector 127 Locked for Forever   S127ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
