J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>HP_PROCONOTPi4</name>
						<description>PFLASH Bank 0 OTP Protection Configuration 4
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
						<addressOffset>80</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>S128ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S129ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S130ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S131ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S132ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S133ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S134ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S135ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S136ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S137ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S138ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S139ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S140ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S141ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S142ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S143ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S144ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S145ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S146ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S147ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S148ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S149ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S150ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S151ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S152ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S153ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S154ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S155ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S156ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S157ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S158ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S159ROM</name>
								<description>PFLASH p Sector 159 Locked for Forever   S159ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>HP_PROCONOTPi5</name>
						<description>PFLASH Bank 0 OTP Protection Configuration 5
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
						<addressOffset>84</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>S160ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S161ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S162ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S163ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S164ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S165ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S166ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S167ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S168ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S169ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S170ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S171ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S172ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S173ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S174ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S175ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S176ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S177ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S178ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S179ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S180ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S181ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S182ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S183ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S184ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S185ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S186ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S187ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S188ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S189ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S190ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S191ROM</name>
								<description>PFLASH p Sector 191 Locked for Forever   S191ROM. These bits indicate whether PFLASH p sector x is an OTP protected sector with read only functionality.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
