J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>HP_PROCONWOPi0</name>
						<description>PFLASH Bank 0 WOP Configuration 0
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
						<addressOffset>128</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>S0WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S1WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S2WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S3WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S4WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S5WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S6WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S7WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S8WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S9WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S10WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S11WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S12WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S13WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S14WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S15WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S16WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S17WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S18WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S19WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S20WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S21WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S22WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S23WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S24WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S25WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S26WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S27WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S28WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S29WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S30WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S31WOP</name>
								<description>PFLASH p Sector 31 Configured for Write Once Protection   S31WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>HP_PROCONWOPi1</name>
						<description>PFLASH Bank 0 WOP Configuration 1
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
						<addressOffset>132</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>S32WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S33WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S34WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S35WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S36WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S37WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S38WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S39WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S40WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S41WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S42WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S43WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S44WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S45WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S46WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S47WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S48WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S49WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S50WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S51WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S52WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S53WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S54WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S55WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S56WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S57WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S58WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S59WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S60WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S61WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S62WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S63WOP</name>
								<description>PFLASH p Sector 63 Configured for Write Once Protection   S63WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
