J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>HP_PROCONWOPi2</name>
						<description>PFLASH Bank 0 WOP Configuration 2
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
						<addressOffset>136</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>S64WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S65WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S66WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S67WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S68WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S69WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S70WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S71WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S72WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S73WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S74WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S75WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S76WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S77WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S78WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S79WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S80WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S81WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S82WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S83WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S84WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S85WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S86WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S87WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S88WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S89WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S90WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S91WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S92WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S93WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S94WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S95WOP</name>
								<description>PFLASH p Sector 95 Configured for Write Once Protection   S95WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>HP_PROCONWOPi3</name>
						<description>PFLASH Bank 0 WOP Configuration 3
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
						<addressOffset>140</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>S96WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S97WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S98WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S99WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S100WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S101WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S102WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S103WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S104WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S105WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S106WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S107WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S108WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S109WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S110WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S111WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S112WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S113WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S114WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S115WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S116WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S117WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S118WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S119WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S120WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S121WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S122WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S123WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S124WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S125WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S126WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S127WOP</name>
								<description>PFLASH p Sector 127 Configured for Write Once Protection   S127WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
