J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>HP_PROCONWOPi4</name>
						<description>PFLASH Bank 0 WOP Configuration 4
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
						<addressOffset>144</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>S128WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S129WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S130WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S131WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S132WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S133WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S134WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S135WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S136WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S137WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S138WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S139WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S140WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S141WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S142WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S143WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S144WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S145WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S146WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S147WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S148WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S149WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S150WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S151WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S152WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S153WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S154WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S155WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S156WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S157WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S158WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S159WOP</name>
								<description>PFLASH p Sector 159 Configured for Write Once Protection   S159WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>HP_PROCONWOPi5</name>
						<description>PFLASH Bank 0 WOP Configuration 5
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
						<addressOffset>148</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>S160WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S161WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S162WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S163WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S164WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S165WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S166WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S167WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S168WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S169WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S170WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S171WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S172WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S173WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S174WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S175WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S176WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S177WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S178WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S179WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S180WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S181WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S182WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S183WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S184WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S185WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S186WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S187WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S188WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S189WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S190WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S191WOP</name>
								<description>PFLASH p Sector 191 Configured for Write Once Protection   S191WOP. These bits indicate whether PFLASH p sector x is an WOP protected sector.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
