J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>HP_ECPRIOi0</name>
						<description>PFLASH Bank 0 Erase Counter Priority configuration 0
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
						<addressOffset>160</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>S0L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S1L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S2L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S3L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S4L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S5L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S6L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S7L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S8L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S9L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S10L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S11L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S12L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S13L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S14L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S15L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S16L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S17L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S18L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S19L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S20L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S21L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S22L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S23L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S24L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S25L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S26L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S27L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S28L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S29L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S30L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S31L</name>
								<description>PFLASH p Sector 31 Erase Counter priority   S31L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>HP_ECPRIOi1</name>
						<description>PFLASH Bank 0 Erase Counter Priority Configuration 1
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
						<addressOffset>164</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>S32L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S33L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S34L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S35L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S36L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S37L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S38L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S39L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S40L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S41L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S42L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S43L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S44L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S45L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S46L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S47L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S48L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S49L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S50L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S51L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S52L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S53L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S54L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S55L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S56L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S57L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S58L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S59L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S60L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S61L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S62L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S63L</name>
								<description>PFLASH p Sector 63 Erase Counter priority   S63L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
