J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>HP_ECPRIOi2</name>
						<description>PFLASH Bank 0 Erase Counter Priority Configuration 2
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
						<addressOffset>168</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>S64L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S65L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S66L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S67L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S68L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S69L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S70L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S71L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S72L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S73L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S74L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S75L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S76L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S77L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S78L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S79L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S80L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S81L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S82L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S83L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S84L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S85L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S86L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S87L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S88L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S89L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S90L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S91L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S92L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S93L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S94L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S95L</name>
								<description>PFLASH p Sector 95 Erase Counter priority   S95L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>HP_ECPRIOi3</name>
						<description>PFLASH Bank 0 Erase Counter Priority Configuration 3
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
						<addressOffset>172</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>S96L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S97L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S98L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S99L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S100L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S101L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S102L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S103L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S104L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S105L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S106L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S107L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S108L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S109L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S110L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S111L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S112L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S113L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S114L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S115L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S116L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S117L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S118L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S119L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S120L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S121L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S122L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S123L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S124L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S125L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S126L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>S127L</name>
								<description>PFLASH p Sector 127 Erase Counter priority   S127L. These bits indicate whether PFLASH sector x has high or low priority for        Erase Counter recording.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
