J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>HF_STATUS</name>
					<description>Flash Status Register
 resetvalue={Application Reset:0x0FF}</description>
					<addressOffset>16</addressOffset>
					<size>32</size>
					<resetValue>255</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>D0BUSY</name>
							<description>Data Flash Bank 0 Busy   D0BUSY. HW controlled status flag. Indication of busy state of DFLASH bank  160 0 because of active execution of        an operation  DF0 busy state is also indicated during Flash startup        after reset or in sleep mode  while in busy state the DF0 does not allow        read access.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>D1BUSY</name>
							<description>Data Flash Bank 1 Busy   D1BUSY. HW controlled status flag. Indication of busy state of DFLASH bank  160 1 because of active execution of        an operation  DF1 busy state is also indicated during Flash startup        after reset or in sleep mode  while in busy state the DF1 does not allow        read access. Bit is not set for program erase operations initiated by the HSM        interface.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P0BUSY</name>
							<description>Program Flash PF5BUSY   P5BUSY. HW controlled status flag. Indication of busy state of PFx because of active execution of an        operation  PFx busy state is also indicated during Flash startup after        reset or in sleep mode  while in busy state the PFx does not allow read        access.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P1BUSY</name>
							<description>Program Flash PF5BUSY   P5BUSY. HW controlled status flag. Indication of busy state of PFx because of active execution of an        operation  PFx busy state is also indicated during Flash startup after        reset or in sleep mode  while in busy state the PFx does not allow read        access.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DFPAGE</name>
							<description>Data Flash in Page Mode   DFPAGE. HW controlled status flag. Set with Enter Page Mode for DFLASH  cleared with Write Page command. This bit is not set by   8220 Enter Page Mode  8221  initiated by the HSM interface. Read accesses are allowed while in page mode.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PFPAGE</name>
							<description>Program Flash in Page Mode   PFPAGE. HW controlled status flag. Set with Enter Page Mode for Flash  cleared with Write Page command This bit is not set by   8220 Enter Page Mode  8221  initiated by the HSM interface. Read accesses are allowed while in page mode.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_CONTROL</name>
					<description>Flash Control Register
 resetvalue={Application Reset:0x320}</description>
					<addressOffset>20</addressOffset>
					<size>32</size>
					<resetValue>800</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FSIENPE</name>
							<description>Enable Program Erase   FSIENPE. The field prevents any Flash program or erase directly in the FSI. It is        set to   8220 Enabled  8221  by the SSW upon finishing the startup. Once in the   8220 enabled  8221  state this field cannot be changed.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled0</name>
									<description>00 Disabled Program Erase        are disabled in the FSI.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled1</name>
									<description>01 Enabled Program Erase        are enabled in the FSI.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disabled2</name>
									<description>10 Disabled Program Erase        are disabled in the FSI.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disabled3</name>
									<description>11 Disabled Program Erase        are disabled in the FSI.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WSERRINJ</name>
							<description>PFlash Wait State ECC error injection   WSERRINJ. Error injection into the ECC logic protecting PFlash Wait states.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DDFP</name>
							<description>Disable Read from PFLASH   DDFP. This bit enables disables the read access to PFLASH. DMU ramp up and SSW start up This bit is automatically set with reset and is cleared during startup         if no Read Protection installed  and during startup SSW in case of        internal start out of Flash. This is realized by allowing full write access with inactive startup        protection. User Software  Clearing PFLASH Read Protection Once set  DMU HF CONTROL .DDFP        can only be cleared when DMU HF PROTECT .PRODISP        or DMU HF PROTECT .PRODISP0 5        or not DMU HF PROCONPF .RPRO User Software  Setting PFLASH Read Protection Software must write DMU HF CONTROL .DDFP        to 1</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DDFD</name>
							<description>Disable Data Fetch from DF0 EEPROM   DDFD. This bit enables disables the data fetch from DF0 EEPROM. DMU ramp up and SSW start up This bit is automatically set with reset and is cleared during startup         if no Read Protection installed  and during startup  BROM SW  in case of        internal start out of Flash. This is realized by allowing full write access with inactive startup        protection. User Software  Clearing DF0 EEPROM Read Protection Once set  DMU HF CONTROL .DDFD        can only be cleared when DMU HF PROTECT .PRODISD        or not DMU HF PROCONDF .RPRO User Software  Setting DF0 EEPROM Read Protection Software must write DMU HF CONTROL .DDFD        to 1</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPROG</name>
							<description>Clear Programming State   CPROG</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CERASE</name>
							<description>Clear Erase State   CERASE</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_OPERATION</name>
					<description>Flash Operation Register
 resetvalue={System Reset:0x0}</description>
					<addressOffset>24</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PROG</name>
							<description>Programming State   PROG. HW controlled status flag. Set with last cycle of Write Page Burst and Replace Logical Sector        command sequences. If one BUSY flag is coincidently set  PROG indicates the type of busy        state. If OPER is coincidently set  PROG indicates the type of erroneous        operation. Otherwise  PROG indicates  that operation is still requested        or finished. May be also cleared by writing   8216 1  8217  to DMU HF CONTROL .CPROG. This bit is not set for by program operations initiated by the HSM        interface. Cleared with command   8220 Clear Status  8221 .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ERASE</name>
							<description>Erase State   ERASE. HW controlled status flag. Set with last cycle of Erase Verify command sequence. Indications are analogous to PROG flag. May be cleared by writing  1  to DMU HF CONTROL .CERASE. This bit is not set for by erase operations initiated by the HSM interface. Cleared with command  Clear Status .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_PROTECT</name>
					<description>Flash Protection Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>28</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PRODISP</name>
							<description>PFLASH Protection Disabled   PRODISP. The protection configured by UCB PFLASH ORIG and UCB PFLASH COPY was        successfully disabled by supplying the correct password to   8220 Disable        Protection  8221 . Cleared with command   8220 Resume Protection  8221 .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PRODISD</name>
							<description>DFLASH Protection Disabled   PRODISD. The protection configured by UCB DFLASH ORIG and UCB DFLASH COPY was        successfully disabled by supplying the correct password to   8220 Disable        Protection  8221 . Cleared with command   8220 Resume Protection  8221 .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PRODISDBG</name>
							<description>Debug Interface Password Protection Disabled   PRODISDBG. The password configured by UCB DBG ORIG and UCB DBG COPY was correctly        received with   8220 Disable Protection  8221 . When DMU SP PROCONHSMCFG.DESTDBG is   8220 destructive  8221  then only the SSW can        disable this protection. This means PRODISDBG is only set when the password matches and  DESTDBG            8220 non destructive  8221  or SCU STCON.STP   0 . Cleared with command   8220 Resume Protection  8221 .</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PRODISEC</name>
							<description>Erase Counter Priority Protection Disabled   PRODISEC. The protection configured by UCB ECPRIO ORIG and UCB ECPRIO COPY was        successfully disabled by supplying the correct password to   8220 Disable        Protection  8221 . Cleared with command  quot Resume Protection quot .</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PRODISBMHD</name>
							<description>BMHD Protection Disabled   PRODISBMHD. The protection configured by UCB BMHD0 ORIG and UCB BMHD0 COPY was        successfully disabled by supplying the correct password to   8220 Disable        Protection  8221 . Cleared with command  quot Resume Protection quot .</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PRODISSWAP</name>
							<description>UCB SWAP protection Disabled   PRODISSWAP. The protection configured by UCB SWAP ORIG and UCB SWAP COPY was        successfully disabled by supplying the correct password to   8220 Disable        Protection  8221 . Cleared with command  quot Resume Protection quot .</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PRODISP0</name>
							<description>Program Flash Protection Disable PRODISP5. The protection configured for PFx by UCB PFLASH ORIG and UCB PFLASH COPY        was successfully disabled by supplying the correct password to   8220 Disable        Protection  8221 . Cleared with command  quot Resume Protection quot .</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PRODISP1</name>
							<description>Program Flash Protection Disable PRODISP5. The protection configured for PFx by UCB PFLASH ORIG and UCB PFLASH COPY        was successfully disabled by supplying the correct password to   8220 Disable        Protection  8221 . Cleared with command  quot Resume Protection quot .</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SRT</name>
							<description>Secure Retest Password Protection Disabled   SRT. Cleared with command  Resume Protection .</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_CONFIRM0</name>
					<description>Flash Confirm Status Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>32</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PROINBMHD0O</name>
							<description>UCB BMHD0 ORIG Confirmation   PROINBMHD0O. This bit reflects the confirmed state of UCB BMHD0 ORIG.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINBMHD1O</name>
							<description>UCB BMHD1 ORIG Confirmation   PROINBMHD1O. This bit reflects the confirmed state of UCB BMHD1 ORIG.</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINBMHD2O</name>
							<description>UCB BMHD2 ORIG Confirmation   PROINBMHD2O. This bit reflects the confirmed state of UCB BMHD2 ORIG.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINBMHD3O</name>
							<description>UCB BMHD3 ORIG Confirmation   PROINBMHD3O. This bit reflects the confirmed state of UCB BMHD3 ORIG.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINSSW</name>
							<description>UCB SSW Confirmation   PROINSSW. This bit reflects the confirmed state of UCB SSW.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINUSER</name>
							<description>UCB USER Confirmation   PROINUSER. This bit reflects the confirmed state of UCB USER.</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINTEST</name>
							<description>UCB TEST Confirmation   PROINTEST. This bit reflects the confirmed state of UCB TEST.</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINHSMCFG</name>
							<description>UCB HSMCFG Confirmation   PROINHSMCFG. This bit reflects the confirmed state of UCB HSMCFG.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINBMHD0C</name>
							<description>UCB BMHD0 COPY Confirmation   PROINBMHD0C. This bit reflects the confirmed state of UCB BMHD0 COPY.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINBMHD1C</name>
							<description>UCB BMHD1 COPY Confirmation   PROINBMHD1C. This bit reflects the confirmed state of UCB BMHD1 COPY.</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINBMHD2C</name>
							<description>UCB BMHD2 COPY Confirmation   PROINBMHD2C. This bit reflects the confirmed state of UCB BMHD2 COPY.</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINBMHD3C</name>
							<description>UCB BMHD3 COPY Confirmation   PROINBMHD3C. This bit reflects the confirmed state of UCB BMHD3 COPY.</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINREDSEC</name>
							<description>UCB REDSEC Confirmation   PROINREDSEC. This bit reflects the confirmed state of UCB REDSEC</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINSRT</name>
							<description>UCB RETEST Confirmation   PROINSRT. This bit reflects the confirmed state of UCB RETEST.</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_CONFIRM1</name>
					<description>Flash Confirm Status Register 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>36</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PROINPO</name>
							<description>UCB PFLASH ORIG Confirmation   PROINPO. This bit reflects the confirmed state of UCB PFLASH ORIG.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINDO</name>
							<description>UCB DFLASH ORIG Confirmation   PROINDO. This bit reflects the confirmed state of UCB DFLASH ORIG.</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINDBGO</name>
							<description>UCB DBG ORIG Confirmation   PROINDBGO. This bit reflects the confirmed state of UCB DBG ORIG.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINHSMO</name>
							<description>UCB HSM ORIG Confirmation   PROINHSMO. This bit reflects the confirmed state of UCB HSM ORIG.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINHSMCOTP0O</name>
							<description>UCB HSMCOTP0 ORIG Protection   PROINHSMCOTP0O. This bit reflects the confirmed state of UCB HSMCOTP0 ORIG.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINHSMCOTP1O</name>
							<description>UCB HSMCOTP1 ORIG Protection   PROINHSMCOTP1O. This bit reflects the confirmed state of UCB HSMCOTP1 ORIG.</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINECO</name>
							<description>UCB ECPRIO ORIG Confirmation   PROINECO. This bit reflects the confirmed state of UCB ECPRIO ORIG.</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINPC</name>
							<description>UCB PFLASH COPY Confirmation   PROINPC. This bit reflects the confirmed state of UCB PFLASH COPY.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINDC</name>
							<description>UCB DFLASH COPY Confirmation   PROINDC. This bit reflects the confirmed state of UCB DFLASH COPY.</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINDBGC</name>
							<description>UCB DBG COPY Interface Confirmation   PROINDBGC. This bit reflects the confirmed state of UCB DBG COPY.</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINHSMC</name>
							<description>UCB HSM COPY Confirmation   PROINHSMC. This bit reflects the confirmed state of UCB HSM COPY.</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINHSMCOTP0C</name>
							<description>UCB HSMCOTP0 COPY Protection   PROINHSMCOTP0C. This bit reflects the confirmed state of UCB HSMCOTP0 COPY.</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINHSMCOTP1C</name>
							<description>UCB HSMCOTP1 COPY Protection   PROINHSMCOTP1C. This bit reflects the confirmed state of UCB HSMCOTP1 COPY.</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINECC</name>
							<description>UCB ECPRIO COPY Confirmation   PROINECC. This bit reflects the confirmed state of UCB ECPRIO COPY</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
