J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>HF_CONFIRM2</name>
					<description>Flash Confirm Status Register 2
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>40</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PROINOTP0O</name>
							<description>UCB OTP0 ORIG Confirmation   PROINOTP0O. This bit reflects the confirmed state of UCB OTP0 ORIG.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP1O</name>
							<description>UCB OTP1 ORIG Confirmation   PROINOTP1O. This bit reflects the confirmed state of UCB OTP1 ORIG.</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP2O</name>
							<description>UCB OTP2 ORIG Confirmation   PROINOTP2O. This bit reflects the confirmed state of UCB OTP2 ORIG.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP3O</name>
							<description>UCB OTP3 ORIG Confirmation   PROINOTP3O. This bit reflects the confirmed state of UCB OTP3 ORIG.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP4O</name>
							<description>UCB OTP4 ORIG Confirmation   PROINOTP4O. This bit reflects the confirmed state of UCB OTP4 ORIG.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP5O</name>
							<description>UCB OTP5 ORIG Confirmation   PROINOTP5O. This bit reflects the confirmed state of UCB OTP5 ORIG.</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP6O</name>
							<description>UCB OTP6 ORIG Confirmation   PROINOTP6O. This bit reflects the confirmed state of UCB OTP6 ORIG.</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP7O</name>
							<description>UCB OTP7 ORIG Confirmation   PROINOTP7O. This bit reflects the confirmed state of UCB OTP7 ORIG.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP0C</name>
							<description>UCB OTP0 COPY Confirmation   PROINOTP0C. This bit reflects the confirmed state of UCB OTP0 COPY.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP1C</name>
							<description>UCB OTP1 COPY Confirmation   PROINOTP1C. This bit reflects the confirmed state of UCB OTP1 COPY.</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP2C</name>
							<description>UCB OTP2 COPY Confirmation   PROINOTP2C. This bit reflects the confirmed state of UCB OTP2 COPY.</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP3C</name>
							<description>UCB OTP3 COPY Confirmation   PROINOTP3C. This bit reflects the confirmed state of UCB OTP3 COPY.</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP4C</name>
							<description>UCB OTP4 COPY Confirmation   PROINOTP4C. This bit reflects the confirmed state of UCB OTP4 COPY.</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP5C</name>
							<description>UCB OTP5 COPY Confirmation   PROINOTP5C. This bit reflects the confirmed state of UCB OTP5 COPY.</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP6C</name>
							<description>UCB OTP6 COPY Confirmation   PROINOTP6C. This bit reflects the confirmed state of UCB OTP6 COPY.</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP7C</name>
							<description>UCB OTP7 COPY Confirmation   PROINOTP7C. This bit reflects the confirmed state of UCB OTP7 COPY.</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_EER</name>
					<description>Enable Error Interrupt Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>48</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>OPERM</name>
							<description>Operation Error Interrupt Mask   OPERM</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SQERM</name>
							<description>Command Sequence Error Interrupt Mask   SQERM</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PROERM</name>
							<description>Protection Error Interrupt Mask   PROERM</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PVERM</name>
							<description>Program Verify Error Interrupt Mask   PVERM</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EVERM</name>
							<description>Erase Verify Error Interrupt Mask   EVERM</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EOBM</name>
							<description>End of Busy Interrupt Mask   EOBM</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_ERRSR</name>
					<description>Error Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>52</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>OPER</name>
							<description>Flash Operation Error   OPER. Cleared with system reset.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SQER</name>
							<description>Command Sequence Error   SQER. A sequence error is not indicated if the Reset to Read command aborts a command sequence. Cleared with application reset  commands  Reset to Read  and  Clear Status  or writing DMU HF CLRE .CSQER   1 .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PROER</name>
							<description>Protection Error   PROER. A Protection Error is reported e.g. because of a not allowed command  for example an Erase or Write Page command addressing a locked sector  or because of wrong password s  in a protected command sequence such as  Disable Read Protection . A Protection Error is also reported if the safety protection prevented a program erase operation in Flash. Cleared with application reset  with the command  Clear Status  or writing DMU HF CLRE .CPROER   1 .</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PVER</name>
							<description>Program Verify Error   PVER. A verify error was reported on completion of a Flash program operation  even when the operation was directly started in the FSI  Cleared with application reset  with the command   8220 Clear Status  8221  or          writing DMU HF CLRE .CPVER            1 .</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EVER</name>
							<description>Erase Verify Error   EVER. A verify error was reported on completion of a Flash erase operation  even when the operation was directly started in the FSI  . Cleared with application reset  with the command  Clear Status  or writing DMU HF CLRE .CEVER   1 .</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ADER</name>
							<description>SRI Bus Address ECC Error   ADER. This flag is set when the DMU detects an ECC error in the address phase        bus transaction on the SRI bus. Cleared with application reset or writing DMU HF CLRE .CADER            1 .</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ORIER</name>
							<description>Original Error   ORIER. If a UCB contains both ORIG and COPY confirmation codes and during        startup an ERRORED value or an uncorrectable ECC error is detected in        the ORIG confirmation code then the original error flag is set by        hardware. Cleared with application reset.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_CLRE</name>
					<description>Clear Error Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>56</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CSQER</name>
							<description>Clear Command Sequence Error   CSQER</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CPROER</name>
							<description>Clear Protection Error   CPROER</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CPVER</name>
							<description>Clear Program Verify Error   CPVER</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CEVER</name>
							<description>Clear Erase Verify Error   CEVER</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CADER</name>
							<description>Clear SRI Bus Address ECC Error   CADER</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_ECCR</name>
					<description>DF0 ECC Read Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>64</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RCODE</name>
							<description>Error Correction Read Code   RCODE. ECC checksum read during the last NVM read access.</description>
							<lsb>0</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_ECCS</name>
					<description>DF0 ECC Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>68</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ERR1</name>
							<description>Read Access Single Bit ECC Error   ERR1. The flag reports a single bit ECC failure during the last NVM read        access. Reset by hardware when DMU HF ECCC .CLR          is written to 11 .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ERR2</name>
							<description>Read Access Double Bit ECC Error   ERR2. The flag reports a double bit ECC failure during the last NVM read        access. Reset by hardware when DMU HF ECCC .CLR          is written to 11 .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ERR3</name>
							<description>Read Access Triple Bit ECC Error   ERR3. The flag reports a triple bit ECC failure during the last NVM read        access. Reset by hardware when DMU HF ECCC .CLR          is written to 11 .</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ERRM</name>
							<description>Read Access Multi bit ECC Error   ERRM. The flag reports multi bit ECC failure during the last NVM read access. Reset by hardware when DMU HF ECCC .CLR          is written to 11 .</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ERRANY</name>
							<description>Any Read Access ECC Error   ERRANY. The flag reports any ECC failure during the last NVM read access. Reset by hardware when DMU HF ECCC .CLR          is written to 11 .</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>BLANKA</name>
							<description>Read Access Blank Analog   BLANKA. The flag reports that all read data cells have sufficient high current  a program of new data without prior erase is possible. Under certain operation history  a valid complement data entry may also appear as blank. Data qualifiers like headers or footers  which are usually used in EEPROM emulation  can be used to distinguish expected valid data from unknown data fields. Only blank failures in Complement Sensing mode are reported in this flag and is intended for use only in this mode. Blank failures in Single Ended mode are also reported when in CFTM. Reset by hardware when DMU HF ECCC .CLR is written to 11 .</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AER1</name>
							<description>Accumulated Single Bit ECC Errors   AER1. The status flag accumulates single bit failures during NVM read operations. Reset by hardware when DMU HF ECCC .CLR is written to 11 .</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AER2</name>
							<description>Accumulated Double Bit ECC Errors   AER2. The status flag accumulates double bit failures during NVM read operations. Reset by hardware when DMU HF ECCC .CLR is written to 11 .</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AER3</name>
							<description>Accumulated Triple Bit ECC Errors   AER3. The status flag accumulates triple bit failures during NVM read operations. Reset by hardware when DMU HF ECCC .CLR is written to 11 .</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AERM</name>
							<description>Accumulated Multi bit ECC Errors   AERM. The status bit accumulates multi bit failures during NVM read accesses. Reset by hardware when DMU HF ECCC .CLR is written to 11 .</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AERANY</name>
							<description>Accumulated Any Read Access ECC Error   AERANY. The status bit accumulates ECC failures during NVM read accesses. Reset by hardware when DMU HF ECCC .CLR          is written to 11 .</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ABLANKA</name>
							<description>Accumulated Blank Analog   ABLANKA. The flag accumulates analog evaluated blank failures during NVM read accesses. It reports that all read data cells have sufficient high current  a program of new data without prior erase is possible. Under certain operation history  a valid complement data entry may also appear as blank. Data qualifiers like headers or footers  which are usually used in EEPROM emulation  can be used to distinguish expected valid data from unknown data fields. Only blank failures in Complement Sensing mode are reported in this flag and is intended for use only in this mode. Blank failures in Single Ended mode is also reported when in CFTM. Reset by hardware when DMU HF ECCC .CLR is written to 11 .</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_ECCC</name>
					<description>DF0 ECC Control Register
 resetvalue={Application Reset:0x0C0000000}</description>
					<addressOffset>72</addressOffset>
					<size>32</size>
					<resetValue>3221225472</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CLR</name>
							<description>Clear ECC status bits   CLR</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ECCCORDIS</name>
							<description>Host Command Interface ECC Correction Disable   ECCCORDIS</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enabled0</name>
									<description>00 Enabled ECC        correction is enabled for the DF0 read path and if DF1 is configured as        not HSM exclusive  then for the DF1 read path.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled1</name>
									<description>01 Enabled ECC        correction is enabled for the DF0 read path and if DF1 is        configured as not HSM exclusive  then for the DF1 read path.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled2</name>
									<description>10 Enabled ECC        correction is enabled for the DF0 read path and if DF1 is        configured as not HSM exclusive  then for the DF1 read path.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disabled3</name>
									<description>11 Disabled ECC        correction is disabled for the DF0 read path and if DF1 is configured as        not HSM exclusive  then for the DF1 read path.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRAPDIS</name>
							<description>Host Command Interface Uncorrectable ECC Bit Error Trap Disable   TRAPDIS. Includes CFS and UCB uncorrectable errors.</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_ECCW</name>
					<description>DF0 ECC Write Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>76</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>WCODE</name>
							<description>Error Correction Write Code   WCODE. 22 bit ECC code for the current 64 bit  for DFLASH  or 256 bit  for        PFLASH  write buffer to be written into the assembly buffer instead of a        generated ECC.</description>
							<lsb>0</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PECENCDIS</name>
							<description>PFLASH ECC Encoding Disable   PECENCDIS</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DECENCDIS</name>
							<description>DFLASH ECC Encoding Disable   DECENCDIS</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_CCONTROL</name>
					<description>Cranking Control Register
 resetvalue={System Reset:0x0}</description>
					<addressOffset>80</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CRANKING</name>
							<description>Cranking Mode Control   CRANKING. This bit field determins Cranking mode.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_PSTATUS</name>
					<description>Power Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>96</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SLEEP</name>
							<description>Sleep Mode   SLEEP</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IDLE</name>
							<description>Dynamic Idle   IDLE</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DEMAND</name>
							<description>Demand   DEMAND. For Cranking Mode  DMU HF PSTATUS .DEMAND   1</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_PCONTROL</name>
					<description>Power Control Register
 resetvalue={Application Reset:0x30000}</description>
					<addressOffset>100</addressOffset>
					<size>32</size>
					<resetValue>196608</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SLEEP</name>
							<description>Sleep Mode Control   SLEEP. This bit field determines the Sleep mode.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IDLE</name>
							<description>Dynamic Idle Enable   IDLE</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>DEMAND</name>
							<description>Demand Enable   DEMAND</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ESLDIS</name>
							<description>External Sleep Mode Request Disable   ESLDIS. Used for Sleep Mode control. The Sleep Mode request is generated by the SCU.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PR5V</name>
							<description>Programming Supply 5V   PR5V. Selects the supply for programming.</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>P3V0</name>
									<description>00 P3V The programming voltage is internally generated.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>P3V1</name>
									<description>01 P3V The programming voltage is internally generated.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>P3V2</name>
									<description>10 P3V The programming voltage is internally generated.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>P5V3</name>
									<description>11 P5V As programming voltage the external 5 V supply is used.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
