J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>HF_PWAIT</name>
					<description>PFLASH Wait Cycle Register
 resetvalue={System Reset:0x716040B}</description>
					<addressOffset>104</addressOffset>
					<size>32</size>
					<resetValue>118883339</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RFLASH</name>
							<description>Operation Mode   RFLASH. PFLASH Wait Cycles This bit field defines the number of SRI clock cycles for a PFLASH Bank read access.</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RECC</name>
							<description>Operation Mode   RECC. PFLASH Error Correction Cycles This bit field defines the number of SRI clock cycles for the PFLASH Bank ECC correction.</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CFLASH</name>
							<description>Cranking Mode   CFLASH. PFLASH Wait Cycles This bit field defines the number of SRI clock cycles for a PFLASH Bank read access.</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CECC</name>
							<description>Cranking Mode   CECC. PFLASH Error Correction Cycles This bit field defines the number of SRI clock cycles for the PFLASH Bank ECC correction.</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_DWAIT</name>
					<description>DFLASH Wait Cycle Register
 resetvalue={System Reset:0x4000B}</description>
					<addressOffset>108</addressOffset>
					<size>32</size>
					<resetValue>262155</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RFLASH</name>
							<description>Operation Mode   RFLASH. DFLASH Wait Cycles for Flash This bit field defines the number of FSI clock cycles for a DFLASH Bank        read access.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RECC</name>
							<description>Operation Mode   RECC. DFLASH Error Correction Cycles This bit field defines the number of FSI clock cycles for the DFLASH        Bank ECC correction.</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_PROCONUSR</name>
					<description>DF0 User Mode Control
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
					<addressOffset>116</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MODE</name>
							<description>DF0 User Mode Control   MODE. Configures the DF0 mode when the user has control.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_PROCONPF</name>
					<description>PFLASH Protection Configuration
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
					<addressOffset>128</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RPRO</name>
							<description>Read Protection Configuration   RPRO. This bit indicates whether read protection is configured for PFLASH sectors.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_PROCONTP</name>
					<description>Tuning Protection Configuration
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
					<addressOffset>132</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TP</name>
							<description>Tuning Protection   TP. This bit indicates whether tuning protection is installed or not.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>BML</name>
							<description>Boot Mode Lock   BML. Used by the SSW to restrict the boot mode selection.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SWAPEN</name>
							<description>Enable SOTA mode   SWAPEN. This field enables the entry into  Software update Over the Air SOTA  mode . In this mode  an alternate PFLASH address map can be selected. Please refer to the SOTA section of the Introduction chapter for more details.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled0</name>
									<description>00 Disabled SOTA        mode disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disabled1</name>
									<description>01 Disabled SOTA        mode disabled.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disabled2</name>
									<description>10 Disabled SOTA        mode disabled.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled3</name>
									<description>11 Enabled SOTA        mode enabled.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CPU0DDIS</name>
							<description>Disable direct LPB access. Disable direct LPB access by the CPU to the Local PFlash Bank  LPB .</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1DDIS</name>
							<description>Disable direct LPB access. Disable direct LPB access by the CPU to the Local PFlash Bank  LPB .</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_PROCONDF</name>
					<description>DFLASH Protection Configuration
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
					<addressOffset>136</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>L</name>
							<description>DF0 EEPROM Locked for Write Protection   L. This bit indicates whether the DFLASH sectors EEPROMx are write        protected.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HYSEN</name>
							<description>Hysteresis enable. When enabled by OSCCFG these fields are copied to SCU OSCCON.HYSEN</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HYSCTL</name>
							<description>Hysteresis Control. When enabled by OSCCFG these fields are copied to SCU OSCCON.HYSCTL</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AMPCTL</name>
							<description>Amplitude Control. When enabled by OSCCFG these fields are copied to SCU OSCCON.AMPCTL</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OSCCFG</name>
							<description>OSC Configuration by SSW   OSCCFG. This bit indicates whether the oscillator configuration  fields  CAPxEN         APREN  MODE  HYSEN  HYSCTL  AMPCTL  are installed by the SSW in        SCU OSCCON.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODE</name>
							<description>OSC Mode   MODE. When enabled by OSCCFG this field is copied to SCU OSCCON.MODE.</description>
							<lsb>9</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>APREN</name>
							<description>OSC Amplitude Regulation Enable   APREN. When enabled by OSCCFG this field is copied to SCU OSCCON.APREN.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CAP0EN</name>
							<description>OSC Capacitance 3 Enable  x 0 3    CAP3EN. When enabled by OSCCFG these fields are copied to SCU OSCCON.CAPxEN.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CAP1EN</name>
							<description>OSC Capacitance 3 Enable  x 0 3    CAP3EN. When enabled by OSCCFG these fields are copied to SCU OSCCON.CAPxEN.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CAP2EN</name>
							<description>OSC Capacitance 3 Enable  x 0 3    CAP3EN. When enabled by OSCCFG these fields are copied to SCU OSCCON.CAPxEN.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CAP3EN</name>
							<description>OSC Capacitance 3 Enable  x 0 3    CAP3EN. When enabled by OSCCFG these fields are copied to SCU OSCCON.CAPxEN.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ESR0CNT</name>
							<description>ESR0 Prolongation Counter   ESR0CNT. Used to configure the ESR0 delay. Evaluation by SSW.</description>
							<lsb>16</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RPRO</name>
							<description>Read Protection Configuration   RPRO. This bit indicates whether read protection is configured for DFLASH sectors.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_PROCONRAM</name>
					<description>RAM Configuration
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
					<addressOffset>140</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RAMIN</name>
							<description>RAM Initialization by SSW Control   RAMIN. These bits defined whether the RAMs selected by the field RAMINSEL are initialized. This field determines also if a RAM is initialized before MBIST access is granted. In all  Init    cases a RAM is initialized before MBIST access is enabled  in the  No Init  case a RAM is not erased. This is independent of the memory selection with RAMINSEL for initialization during startup  see MTU chapter .</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Init_All0</name>
									<description>00 Init All RAM initialization is performed after cold power on  reset and warm power on reset.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Init_Warm1</name>
									<description>01 Init Warm RAM initialization is performed after warm power on resets but not after cold power on reset  not recommended .</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Init_Cold2</name>
									<description>10 Init Cold RAM initialization is performed after cold power on reset.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>No_Init3</name>
									<description>11 No Init No RAM initialization is performed.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RAMINSEL</name>
							<description>RAM Initialization Selection   RAMINSEL. These bits select which memories are initialized when the RAM initialization is configured with RAMIN. See CROSSREFERENCE .</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LMUINSEL</name>
							<description>LMU Initialization Selection   LMUINSEL. These bits select which memories are initialized when the RAM initialization is configured with RAMIN. See CROSSREFERENCE .</description>
							<lsb>24</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_PROCONDBG</name>
					<description>Debug Interface Protection Configuration
 resetvalue={Application Reset:0x100,CFS Value:0x0}</description>
					<addressOffset>144</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967039</resetMask>
					<fields>
						<field>
							<name>OCDSDIS</name>
							<description>OCDS Disabled   OCDSDIS. This bit indicates whether the OCDS is configured as locked.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DBGIFLCK</name>
							<description>Debug Interface Locked   DBGIFLCK. This bit indicates whether the debug interface is configured as locked.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EDM</name>
							<description>Entered Debug Mode   EDM. This bit indicates whether the debug interface has been opened via Destructive Debug Entry. Consequently the CAN and FlexRay operation is made impossible </description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TIC</name>
							<description>Tool Interface Control   TIC. DAP over CAN Physical Layer  DXCPL . Others Reserved.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_SUSPEND</name>
					<description>Suspend Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>240</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>REQ</name>
							<description>Suspend Request   REQ</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLR</name>
							<description>Suspend Clear   CLR. Software write only active high clear of Suspend Error.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SPND</name>
							<description>Flash Operation Suspended   SPND. Suspension of a Flash program or erase operation.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ERR</name>
							<description>Suspend Error   ERR. Reset by hardware when DMU HF SUSPEND .CLR is written to 1 .</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_MARGIN</name>
					<description>Margin Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>244</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SELD0</name>
							<description>DF0 Margin Read Selection   SELD0. If a change between the standard and hard read margin setting is done           the system must wait a delay time t FL MarginDel until the next read is requested.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HMARGIN</name>
							<description>Hard Margin Selection   HMARGIN. Suboptimal 0 bits are read as 1s. Suboptimal 1 bits are read as 0s. The concrete margin values are restored from the configuration sector        and are determined by Infineon.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Tight00</name>
									<description>0 Tight0 Tight        margin for 0  low  level.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Tight11</name>
									<description>1 Tight1 Tight        margin for 1  high  level.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
