J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>HF_ACCEN0</name>
					<description>Access Enable Register 0
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
					<addressOffset>252</addressOffset>
					<size>32</size>
					<resetValue>4294967295</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EN0</name>
							<description>Access Enable for Master TAG ID 2   EN2. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN1</name>
							<description>Access Enable for Master TAG ID 2   EN2. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN2</name>
							<description>Access Enable for Master TAG ID 2   EN2. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN3</name>
							<description>Access Enable for Master TAG ID 3   EN3. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN4</name>
							<description>Access Enable for Master TAG ID 27   EN27. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN5</name>
							<description>Access Enable for Master TAG ID 27   EN27. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN6</name>
							<description>Access Enable for Master TAG ID 27   EN27. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN7</name>
							<description>Access Enable for Master TAG ID 27   EN27. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN8</name>
							<description>Access Enable for Master TAG ID 27   EN27. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN9</name>
							<description>Access Enable for Master TAG ID 27   EN27. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN10</name>
							<description>Access Enable for Master TAG ID 27   EN27. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN11</name>
							<description>Access Enable for Master TAG ID 27   EN27. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN12</name>
							<description>Access Enable for Master TAG ID 27   EN27. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN13</name>
							<description>Access Enable for Master TAG ID 27   EN27. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN14</name>
							<description>Access Enable for Master TAG ID 27   EN27. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN15</name>
							<description>Access Enable for Master TAG ID 27   EN27. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN16</name>
							<description>Access Enable for Master TAG ID 27   EN27. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN17</name>
							<description>Access Enable for Master TAG ID 27   EN27. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN18</name>
							<description>Access Enable for Master TAG ID 27   EN27. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN19</name>
							<description>Access Enable for Master TAG ID 27   EN27. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN20</name>
							<description>Access Enable for Master TAG ID 27   EN27. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN21</name>
							<description>Access Enable for Master TAG ID 27   EN27. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN22</name>
							<description>Access Enable for Master TAG ID 27   EN27. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN23</name>
							<description>Access Enable for Master TAG ID 27   EN27. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN24</name>
							<description>Access Enable for Master TAG ID 27   EN27. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN25</name>
							<description>Access Enable for Master TAG ID 27   EN27. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN26</name>
							<description>Access Enable for Master TAG ID 27   EN27. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN27</name>
							<description>Access Enable for Master TAG ID 27   EN27. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID y</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN28</name>
							<description>Access Enable for Master TAG ID 28   EN28. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID 28</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN29</name>
							<description>Access Enable for Master TAG ID 29   EN29. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID 29</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN30</name>
							<description>Access Enable for Master TAG ID 30   EN30. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID 30</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN31</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables read   write access to the module kernel addresses for transactions with the Master TAG ID 30</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SF_STATUS</name>
					<description>HSM Flash Status Register
 resetvalue={Application Reset:0x2}</description>
					<addressOffset>131088</addressOffset>
					<size>32</size>
					<resetValue>2</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>D1BUSY</name>
							<description>Data Flash Bank 1 Busy   D1BUSY. HW controlled status flag. Indication of busy state of DFLASH bank 1 because of active execution of an operation  DF1 busy state is also indicated during Flash startup after reset or in sleep mode  while in busy state the DF1 does not allow read access.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DFPAGE</name>
							<description>Data Flash in Page Mode   DFPAGE. HW controlled status flag. Set with Enter Page Mode for DFLASH  cleared with Write Page command. Read accesses are allowed while in page mode.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SF_CONTROL</name>
					<description>HSM Flash Configuration Register
 resetvalue={Application Reset:0x1}</description>
					<addressOffset>131092</addressOffset>
					<size>32</size>
					<resetValue>1</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LCKHSMUCB</name>
							<description>Lock Access to UCB HSMCFG   LCKHSMUCB. Trap door register. This field can only be written to the   x201c Locked  x201d  state. Other writes are ignored.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Locked0</name>
									<description>00 Locked Reads to UCB HSMCFG forbidden.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Unlocked1</name>
									<description>01 Unlocked Reads by HSM to UCB HSMCFG allowed.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Locked2</name>
									<description>10 Locked Reads to UCB HSMCFG forbidden.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Locked3</name>
									<description>11 Locked Reads to UCB HSMCFG forbidden.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CPROG</name>
							<description>Clear Programming State   CPROG</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CERASE</name>
							<description>Clear Erase State   CERASE</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SF_OPERATION</name>
					<description>HSM Flash Operation Register
 resetvalue={System Reset:0x0}</description>
					<addressOffset>131096</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PROG</name>
							<description>Programming State   PROG. HW controlled status flag. Set with last cycle of Write Page Burst command sequence. If one BUSY flag is coincidently set  PROG indicates the type of busy        state. If OPER is coincidently set  PROG indicates the type of erroneous        operation. Otherwise  PROG indicates  that operation is still requested        or finished. Can be also cleared by writing   8216 11  8217  to DMU SF CONTROL .CPROG. This bit is not set for by program operations initiated by the Host        interface. Cleared with command   8220 Clear Status  8221 .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ERASE</name>
							<description>Erase State   ERASE. HW controlled status flag. Set with last cycle of Erase Verify command sequence. Indications are analogous to PROG flag. Can be also cleared by writing   8216 11  8217  to DMU SF CONTROL .CERASE. This bit is not set for by erase operations initiated by the Host        interface. Cleared with command   8220 Clear Status  8221 .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SF_EER</name>
					<description>HSM Enable Error Interrupt Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>131120</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>OPERM</name>
							<description>Operation Error Interrupt Mask   OPERM</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SQERM</name>
							<description>Command Sequence Error Interrupt Mask   SQERM</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PVERM</name>
							<description>Program Verify Error Interrupt Mask   PVERM</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EVERM</name>
							<description>Erase Verify Error Interrupt Mask   EVERM</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EOBM</name>
							<description>End of Busy Interrupt Mask   EOBM</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SF_ERRSR</name>
					<description>HSM Error Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>131124</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>OPER</name>
							<description>Flash Operation Error   OPER. Cleared with system reset.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SQER</name>
							<description>Command Sequence Error   SQER. A sequence error is not indicated if the Reset to Read command aborts a command sequence. Cleared with application reset  commands  Reset to Read  and  Clear Status  or writing DMU SF CLRE .CSQER   1 .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PVER</name>
							<description>Program Verify Error   PVER. A verify error was reported on completion of a Flash program operation  even when the operation was directly started in the FSI  . Cleared with application reset  with the command  Clear Status  or writing DMU SF CLRE .CPVER   1 .</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EVER</name>
							<description>Erase Verify Error   EVER. A verify error was reported on completion of a Flash erase operation  even when the operation was directly started in the FSI  . Cleared with application reset  with the command  Clear Status  or writing DMU SF CLRE .CEVER   1 .</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SF_CLRE</name>
					<description>HSM Clear Error Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>131128</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CSQER</name>
							<description>Clear Command Sequence Error   CSQER</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CPVER</name>
							<description>Clear Program Verify Error   CPVER</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CEVER</name>
							<description>Clear Erase Verify Error   CEVER</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SF_ECCR</name>
					<description>HSM DF1 ECC Read Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>131136</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RCODE</name>
							<description>Error Correction Read Code   RCODE. ECC checksum read during the last NVM read access.</description>
							<lsb>0</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
