J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>SF_ECCS</name>
					<description>HSM DF1 ECC Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>131140</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ERR1</name>
							<description>Read Access Single Bit ECC Error   ERR1. The flag reports a single bit ECC failure during the last NVM read access. Reset by hardware when DMU SF ECCC .CLR is written to 11 .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ERR2</name>
							<description>Read Access Double Bit ECC Error   ERR2. The flag reports a double bit ECC failure during the last NVM read        access. Reset by hardware when DMU SF ECCC .CLR          is written to 11 .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ERR3</name>
							<description>Read Access Triple Bit ECC Error   ERR3. The flag reports a triple bit ECC failure during the last NVM read        access. Reset by hardware when DMU SF ECCC .CLR          is written to 11 .</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ERRM</name>
							<description>Read Access Multi bit ECC Error   ERRM. The flag reports multi bit ECC failure during the last NVM read access. Reset by hardware when DMU SF ECCC .CLR          is written to 11 .</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ERRANY</name>
							<description>Any Read Access ECC Error   ERRANY. The flag reports any ECC failure during the last NVM read access. Reset by hardware when DMU SF ECCC .CLR          is written to 11 .</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>BLANKA</name>
							<description>Read Access Blank Analog   BLANKA. The flag reports that all read data cells have sufficient high current  a program of new data without prior erase is possible. Under certain operation history  a valid complement data entry may also appear as blank. Data qualifiers like headers or footers  which are usually used in EEPROM emulation  can be used to distinguish expected valid data from unknown data fields. Only blank failures in Complement Sensing mode are reported in this flag and is intended for use only in this mode. Blank failures in Single Ended mode is also reported when in CFTM. Reset by hardware when DMU SF ECCC .CLR is written to 11 .</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AER1</name>
							<description>Accumulated Single Bit ECC Errors   AER1. The status flag accumulates single bit failures during NVM read        operations. Reset by hardware when DMU SF ECCC .CLR          is written to 11 .</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AER2</name>
							<description>Accumulated Double Bit ECC Errors   AER2. The status flag accumulates double bit failures during NVM read        operations. Reset by hardware when DMU SF ECCC .CLR          is written to 11 .</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AER3</name>
							<description>Accumulated Triple Bit ECC Errors   AER3. The status flag accumulates triple bit failures during NVM read operations. Reset by hardware when DMU SF ECCC .CLR is written to 11 .</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AERM</name>
							<description>Accumulated Multi bit ECC Errors   AERM. The status bit accumulates multi bit failures during NVM read accesses. Reset by hardware when DMU SF ECCC .CLR is written to 11 .</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AERANY</name>
							<description>Accumulated Any Read Access ECC Error   AERANY. The status bit accumulates ECC failures during NVM read accesses. Reset by hardware when DMU SF ECCC .CLR          is written to 11 .</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ABLANKA</name>
							<description>Accumulated Blank Analog   ABLANKA. The flag accumulates analog evaluated blank failures during NVM read accesses. It reports that all read data cells have sufficient high current  a program of new data without prior erase is possible. Under certain operation history  a valid complement data entry may also appear as blank. Data qualifiers like headers or footers  which are usually used in EEPROM emulation  can be used to distinguish expected valid data from unknown data fields. Only blank failures in Complement Sensing mode are reported in this flag and is intended for use only in this mode. Blank failures in Single Ended mode is also reported when in CFTM. Reset by hardware when DMU SF ECCC .CLR is written to 11 .</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SF_ECCC</name>
					<description>HSM DF1 ECC Control Register
 resetvalue={Application Reset:0x0C0000000}</description>
					<addressOffset>131144</addressOffset>
					<size>32</size>
					<resetValue>3221225472</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CLR</name>
							<description>Clear ECC status bits   CLR</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ECCCORDIS</name>
							<description>HSM Command Interface ECC Correction Disable   ECCCORDIS</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enabled0</name>
									<description>00 Enabled If        DF1 is configured as HSM exclusive  then  ECC correction for the DF1        read path is enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled1</name>
									<description>01 Enabled If        DF1 is configured as HSM exclusive  then  ECC correction for the DF1        read path is enabled.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled2</name>
									<description>10 Enabled If        DF1 is configured as HSM exclusive  then  ECC correction for the DF1        read path is enabled.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disabled3</name>
									<description>11 Disabled If        DF1 is configured as HSM exclusive  then  ECC correction for the DF1        read path is disabled.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRAPDIS</name>
							<description>HSM Command Interface Uncorrectable ECC Bit Error Trap Disable   TRAPDIS</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SF_ECCW</name>
					<description>HSM DF1 ECC Write Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>131148</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>WCODE</name>
							<description>Error Correction Write Code   WCODE. 22 bit ECC code for the current 64 bit  for DFLASH  or 256 bit  for        PFLASH  write buffer to be written into the assembly buffer instead of a        generated ECC.</description>
							<lsb>0</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ECCENCDIS</name>
							<description>ECC Encoding Disable   ECCENCDIS</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SF_PROCONUSR</name>
					<description>HSM DF1 User Mode Control
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
					<addressOffset>131188</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MODE</name>
							<description>DF1 User Mode Control   MODE. Configures the DF1 mode when the user has control.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SF_SUSPEND</name>
					<description>HSM Suspend Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>131304</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>REQ</name>
							<description>Suspend Request   REQ</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLR</name>
							<description>Suspend Clear   CLR. Software write only active high clear of Suspend Error.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SPND</name>
							<description>Flash Operation Suspended   SPND. Suspension of a Flash program or erase operation.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ERR</name>
							<description>Suspend Error   ERR. Reset by hardware when DMU SF SUSPEND .CLR is written to 1 .</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SF_MARGIN</name>
					<description>HSM DF1 Margin Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>131308</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SELD1</name>
							<description>DF1 Margin Read Selection   SELD1. If a change between the standard and hard read margin setting is done           the system must wait a delay time tFL MarginDel until the next read is          requested.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HMARGIN</name>
							<description>Hard Margin Selection   HMARGIN. Suboptimal 0 bits are read as 1s. Suboptimal 1 bits are read as 0s. The concrete margin values are restored from the configuration sector        and are determined by Infineon.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Tight00</name>
									<description>0 Tight0 Tight        margin for 0  low  level.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Tight11</name>
									<description>1 Tight1 Tight        margin for 1  high  level.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SP_PROCONHSMCFG</name>
					<description>HSM Protection Configuration
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
					<addressOffset>196608</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>HSMBOOTEN</name>
							<description>HSM Boot Enable   HSMBOOTEN</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SSWWAIT</name>
							<description>SSW Wait   SSWWAIT. Defines if the SSW waits for the HSM to release the jump of CPU0 to user code.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSMDX</name>
							<description>HSM Data Sectors Exclusive   HSMDX. This bit indicates whether the DFLASH1 logical sectors EEPROMx are configured as   x201c HSM exclusive  x201d .</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSMRAMKEEP</name>
							<description>HSM RAM Clear   HSMRAMKEEP</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSMENPINS</name>
							<description>Enable HSM Forcing of Pins HSM1 2   HSMENPINS. This bit indicates whether HSM may force the value of the pins HSM1 2  i.e. overrule the value driven by the application .</description>
							<lsb>7</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSMENRES</name>
							<description>Enable HSM Triggering Resets   HSMENRES. This bit indicates whether HSM may trigger application or system resets.</description>
							<lsb>9</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DESTDBG</name>
							<description>Destructive Debug Entry   DESTDBG. This field configures the destructive debug entry. Security  functionally not part of the HSM.</description>
							<lsb>11</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>BLKFLAN</name>
							<description>Block Flash Analysis   BLKFLAN. The commands   x201c Verify Erased Page  x201d     x201c Verify Erased WL  x201d     x201c Verify Erased Logical Sector Range  x201d   are blocked on the HSM code ranges. Security  functionally not part of the HSM. Also blocks User Margin Count  User Vth Count and User Content Count .</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SP_PROCONHSMCBS</name>
					<description>HSM Code Boot Sector
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
					<addressOffset>196612</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>BOOTSEL0</name>
							<description>Boot Sector Selection   BOOTSEL0. This field controls which of the HSM code sectors is searched for boot code. See CROSSREFERENCE .</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>BOOTSEL1</name>
							<description>Boot Sector Selection   BOOTSEL1. This field controls which of the HSM code sectors is searched for boot code. See CROSSREFERENCE .</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>BOOTSEL2</name>
							<description>Boot Sector Selection   BOOTSEL2. This field controls which of the HSM code sectors is searched for boot        code. See CROSSREFERENCE .</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>BOOTSEL3</name>
							<description>Boot Sector Selection   BOOTSEL3. This field controls which of the HSM code sectors is searched for boot code. See CROSSREFERENCE .</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
