J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>SP_PROCONHSMCX0</name>
					<description>HSM Code Exclusive Protection Configuration
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
					<addressOffset>196616</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>HSM0X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM1X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM2X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM3X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM4X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM5X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM6X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM7X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM8X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM9X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM10X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM11X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM12X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM13X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM14X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM15X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM16X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM17X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM18X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM19X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM20X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM21X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM22X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM23X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM24X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM25X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM26X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM27X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM28X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM29X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM30X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM31X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive   HSM31X. This bit indicates whether the PFLASH logical sector is   8220 HSM exclusive  8221 .</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SP_PROCONHSMCX1</name>
					<description>HSM Code Exclusive Protection Configuration
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
					<addressOffset>196620</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>HSM32X</name>
							<description>PFLASH Sector 39 HSM Code Exclusive   HSM39X. This bit indicates whether the PFLASH logical sector is  HSM exclusive .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM33X</name>
							<description>PFLASH Sector 39 HSM Code Exclusive   HSM39X. This bit indicates whether the PFLASH logical sector is  HSM exclusive .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM34X</name>
							<description>PFLASH Sector 39 HSM Code Exclusive   HSM39X. This bit indicates whether the PFLASH logical sector is  HSM exclusive .</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM35X</name>
							<description>PFLASH Sector 39 HSM Code Exclusive   HSM39X. This bit indicates whether the PFLASH logical sector is  HSM exclusive .</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM36X</name>
							<description>PFLASH Sector 39 HSM Code Exclusive   HSM39X. This bit indicates whether the PFLASH logical sector is  HSM exclusive .</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM37X</name>
							<description>PFLASH Sector 39 HSM Code Exclusive   HSM39X. This bit indicates whether the PFLASH logical sector is  HSM exclusive .</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM38X</name>
							<description>PFLASH Sector 39 HSM Code Exclusive   HSM39X. This bit indicates whether the PFLASH logical sector is  HSM exclusive .</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM39X</name>
							<description>PFLASH Sector 39 HSM Code Exclusive   HSM39X. This bit indicates whether the PFLASH logical sector is  HSM exclusive .</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SP_PROCONHSMCOTP0</name>
					<description>HSM Code OTP Protection Configuration
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
					<addressOffset>196624</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>HSM0ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM1ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM2ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM3ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM4ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM5ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM6ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM7ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM8ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM9ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM10ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM11ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM12ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM13ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM14ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM15ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM16ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM17ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM18ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM19ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM20ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM21ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM22ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM23ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM24ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM25ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM26ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM27ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM28ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM29ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM30ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM31ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever   HSM31ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
