J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>SP_PROCONHSMCOTP1</name>
					<description>HSM Code OTP Protection Configuration
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
					<addressOffset>196628</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>HSM32ROM</name>
							<description>PFLASH Sector 39 HSM Code Locked Forever   HSM39ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM33ROM</name>
							<description>PFLASH Sector 39 HSM Code Locked Forever   HSM39ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM34ROM</name>
							<description>PFLASH Sector 39 HSM Code Locked Forever   HSM39ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM35ROM</name>
							<description>PFLASH Sector 39 HSM Code Locked Forever   HSM39ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM36ROM</name>
							<description>PFLASH Sector 39 HSM Code Locked Forever   HSM39ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM37ROM</name>
							<description>PFLASH Sector 39 HSM Code Locked Forever   HSM39ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM38ROM</name>
							<description>PFLASH Sector 39 HSM Code Locked Forever   HSM39ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM39ROM</name>
							<description>PFLASH Sector 39 HSM Code Locked Forever   HSM39ROM. This bit indicates whether PFLASH sector is an HSM Code OTP protected sector with read only functionality.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SP_PROCONHSM</name>
					<description>HSM Interface Protection Configuration
 resetvalue={Application Reset:0x0,CFS Value:0x0}</description>
					<addressOffset>196672</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>HSMDBGDIS</name>
							<description>HSM Debug Disable   HSMDBGDIS. This bit indicates whether HSM debug is configured as   8220 disabled  8221 .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DBGIFLCK</name>
							<description>Debug Interface Locked   DBGIFLCK. This bit indicates whether the chip debug interface is configured as          8220 locked  8221 .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSTIFLCK</name>
							<description>Test Interface Locked   TSTIFLCK. This bit indicates whether the chip test interface is configured as  locked . TSTIFLCK is not used.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSMTSTDIS</name>
							<description>HSM Test Disable   HSMTSTDIS. This bit indicates whether the HSM test is configured as   8220 disabled  8221 . HSMTSTDIS is not used.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSMTRDIS</name>
							<description>HSM Trace Disable   HSMTRDIS. This bit field indicates whether the HSM tracing and capturing of        transactions for debug and in error cases via BCU is configured as          8220 disabled  8221 . In order to ensure that with UCB delivery state HSM tracing is fully          enabled the encoding for this bit field is inverted compared to the          corresponding HSM control registers.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>TRACEEN0</name>
									<description>00 TRACEEN Tracing enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TRACEDIS21</name>
									<description>01 TRACEDIS2 Tracing disabled.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TRACEDIS12</name>
									<description>10 TRACEDIS1 Tracing disabled.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TRACEDIS03</name>
									<description>11 TRACEDIS0 Tracing disabled.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HSMTRTYPE</name>
							<description>HSM Type of Trace   HSMTRTYPE. This bit field indicates which information can be captured by the BCU        for HSM transactions. In order to ensure that with UCB delivery state HSM tracing is fully          enabled the encoding for this bit field is inverted compared to the          corresponding HSM control registers.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>TRDATA0</name>
									<description>0 TRDATA Trace addresses and data.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TRADDR1</name>
									<description>1 TRADDR Trace addresses only.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
