J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<cluster>
					<dim>4</dim>
					<dimIncrement>16</dimIncrement>
					<name>CH[%s]</name>
					<description>CH</description>
					<addressOffset>512</addressOffset>
					<register>
						<name>LWSRx</name>
						<description>Latest Winning Service Request Register 0  related to ICU0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>PN</name>
								<description>Latest Winner Priority Number. This bit field shows the Priority Number of a pending service request        that won the last arbitration round. This bit field is only valid if        STAT is set to 1</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ECC</name>
								<description>Latest Winner ECC. This bit field shows the ECC field  SRN.ECC  that was transferred from        the last winning SRN to the ICU. This bit field is only valid if STAT is        set to 1. In the current implementation the ECC code is only used for error          detection. Detected errors are reported to the SMU but not corrected.</description>
								<lsb>10</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ID</name>
								<description>Latest Winner Index Number. This bit field shows the ID number of the last winning SRN. This bit        field is only valid if STAT is set to 1</description>
								<lsb>16</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>STAT</name>
								<description>LWSR Register Status. The STAT register indicates if the PN  ECC and ID bit fields are still        valid. They are still valid if the interrupt from the SRN identified by        ID is still pending. If the ICU does not have an winner because no        interrupt is pending or not yet arbitrated then it clears the STAT bit.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>LASRx</name>
						<description>Last Acknowledged Service Request Register 0  related to ICU0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>PN</name>
								<description>Last Acknowledged Service Request Priority Number. This bit field shows the Priority Number of the last acknowledged        service request</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ECC</name>
								<description>Last Acknowledged Interrupt ECC. This bit field shows the ECC value of the last acknowledged service        request  as send by the service provider with acknowledge In the current implementation the ECC code is only used for error          detection. Detected errors are reported to the SMU but not corrected.</description>
								<lsb>10</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ID</name>
								<description>Last Acknowledged Interrupt SRN ID. This bit field shows the ID number of the last acknowledged service        request  as sent by the service provider with acknowledge</description>
								<lsb>16</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ECRx</name>
						<description>Error Capture Register 0  related to ICU0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>PN</name>
								<description>Service Request Priority Number. This bit field shows the priority number of the last service request        where an error was detected. Bit field can be modified by writing to it.</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECC</name>
								<description>Service Request ECC. This bit field shows the ECC of the last service request where an error        was detected. Bit field can be modified by writing to it. This bit field can be modified by  Writing to SRC 23 16   byte write  Writing to SRC 31 16   16 bit write </description>
								<lsb>10</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ID</name>
								<description>Service Request Node ID. This bit field shows the ID of the last service request where an error        was detected. Bit field can be modified by writing to it</description>
								<lsb>16</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EOVCLR</name>
								<description>Error Overflow Bit. The EOVCLR bit is used to clear the EOV bit. The EOV bit must be cleared        togehter with the STAT bit.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>STATCLR</name>
								<description>Error Status Bit. The STATCLR bit is used to clear the STAT bit.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>EOV</name>
								<description>Error Overflow Bit. The bit is set if an ECC error was detected by the ICU while        ECR.STAT   180 1  180   Error Overflow situation .</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>STAT</name>
								<description>Error Status Bit. The Error Status Bit is set whenever an ECC was detected by the ICU.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
				</cluster>
				<register>
					<name>ID</name>
					<description>Module Identification Register
 resetvalue={Application Reset:0x0B9C000}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>12173312</resetValue>
					<resetMask>4294967040</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision Number. This bit field defines the module revision number. The value of a module        revision starts with 01  first revision .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type. The bit field is set to C0 which defines        the module as a 32 bit module.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number Value. This bit field defines a module identification number. The value for the        Interrupt Router module is 009Bh.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>4</dimIncrement>
					<name>SRB[%s]</name>
					<description>Service Request Broadcast Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>16</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TRIG0</name>
							<description>General Purpose Service Request Trigger 7. This bit is always read as 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TRIG1</name>
							<description>General Purpose Service Request Trigger 7. This bit is always read as 0.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TRIG2</name>
							<description>General Purpose Service Request Trigger 7. This bit is always read as 0.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TRIG3</name>
							<description>General Purpose Service Request Trigger 7. This bit is always read as 0.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TRIG4</name>
							<description>General Purpose Service Request Trigger 7. This bit is always read as 0.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TRIG5</name>
							<description>General Purpose Service Request Trigger 7. This bit is always read as 0.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TRIG6</name>
							<description>General Purpose Service Request Trigger 7. This bit is always read as 0.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TRIG7</name>
							<description>General Purpose Service Request Trigger 7. This bit is always read as 0.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OOBS</name>
					<description>OTGM OTGB0 1 Status
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>128</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>OTGB0</name>
							<description>Status of OTGB0</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OTGB1</name>
							<description>Status of OTGB1</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OSSIC</name>
					<description>OTGM SSI Control
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>132</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TGS</name>
							<description>Trigger Set for OTGB0 1</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TGB</name>
							<description>OTGB0 1 Bus Select</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OIXTS</name>
					<description>OTGM IRQ MUX Trigger Set Select
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>136</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TGS</name>
							<description>Trigger Set Select for OTGB0 1 Overlay</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OBS</name>
							<description>Overlay Byte Select</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OIXMS</name>
					<description>OTGM IRQ MUX Missed IRQ Select
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>140</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MIRQ</name>
							<description>SRN Index for Missed Interrupt Trigger</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OIXS0</name>
					<description>OTGM IRQ MUX Select 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>144</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>IRQ0</name>
							<description>SRN Index for Interrupt Trigger 0</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IRQ1</name>
							<description>SRN Index for Interrupt Trigger 1</description>
							<lsb>16</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OIXS1</name>
					<description>OTGM IRQ MUX Select 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>148</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>IRQ2</name>
							<description>SRN Index for Interrupt Trigger 2</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IRQ3</name>
							<description>SRN Index for Interrupt Trigger 3</description>
							<lsb>16</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OIT</name>
					<description>OTGM IRQ Trace
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>160</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TOS0</name>
							<description>Type of Service for Observation on OTGB0. Trigger Set TS16 SP Family concept encoding  compatible with SRC.TOS In products where the CPUx is not implemented  the related TOS          encoding will not be used and treated as RESERVED.</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OE0</name>
							<description>Output Enable for OTGB0</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS1</name>
							<description>Type of Service for Observation on OTGB1. Trigger Set TS16 SP Family concept encoding  compatible with SRC.TOS In products where the CPUx is not implemented  the related TOS          encoding will not be used and treated as RESERVED.</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OE1</name>
							<description>Output Enable for OTGB1</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OMISP</name>
					<description>OTGM MCDS I F Sensitivity Posedge
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>164</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>OTGB0</name>
							<description>Bitwise Posedge Sensitivity for OTGB0. If a bit is set an OTGB value will be written to MCDS on a rising edge        of the associated OTGB0 bit.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OTGB1</name>
							<description>Bitwise Posedge Sensitivity for OTGB1. If a bit is set an OTGB value will be written to MCDS on a rising edge        of the associated OTGB1 bit.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OMISN</name>
					<description>OTGM MCDS I F Sensitivity Negedge
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>168</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>OTGB0</name>
							<description>Bitwise Negedge Sensitivity for OTGB0. If a bit is set an OTGB value will be written to MCDS on a falling edge        of the associated OTGB0 bit.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OTGB1</name>
							<description>Bitwise Negedge Sensitivity for OTGB1. If a bit is set an OTGB value will be written to MCDS on a falling edge        of the associated OTGB1 bit.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
