J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
						<register>
							<name>ERAYxMBSC1</name>
							<description>E RAY 0 Message Buffer Status Changed 1 Service Request
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>28</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>SRPN</name>
									<description>Service Request Priority Number. The SRPN bit field defines the priority of a service request with        respect to service requests with to the same service provider  same        SRC.TOS configuration   00   gt  Service request is on lowest priority ... FF   gt  Service request is on highest priority For a CPU 01 is the lowest priority as 00 is never serviced. For a DMA 00 triggers channel 0. For DMA  SRPN must not be greater than the highest implemented DMA          channel number.</description>
									<lsb>0</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SRE</name>
									<description>Service Request Enable</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TOS</name>
									<description>Type of Service Control. The TOS bit field configuration maps a Service Request to an Interrupt Service Provider  In products where DMA or CPUx is not implemented  the related TOS encoding will not be used and treated as RESERVED. In products with less than 4 ISPs the effective size of the TOS bit field might be reduced to 1 or 2 bit.</description>
									<lsb>11</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ECC</name>
									<description>Error Correction Code. The ECC bit field will be updated by the SRN under the following        conditions  Write or Read Modify Write to SRC 31 0  Write to SRC 15 0   16 bit write  Write to SRC 15 8  or write to SRC 7 0   byte write  For more details pls. see CROSSREFERENCE . In the current implementation the ECC code is only used for error          detection. Detected errors are reported to the SMU but not corrected.</description>
									<lsb>16</lsb>
									<msb>20</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SRR</name>
									<description>Service Request Flag. The SRR bit shows the status of the Service Request.</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CLRR</name>
									<description>Request Clear Bit. The CLRR bit is required to reset SRR SRR .</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>SETR</name>
									<description>Request Set Bit. The SETR bit is required to set SRR SRR .</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>IOV</name>
									<description>Interrupt Trigger Overflow Bit. The IOV bit is set by HW if a new service request was triggered via        interrupt trigger or SETR SETR bit while the SRN has still an pending service request.</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>IOVCLR</name>
									<description>Interrupt Trigger Overflow Clear Bit. IOVCLR is required to reset IOV IOV .</description>
									<lsb>28</lsb>
									<msb>28</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>SWS</name>
									<description>SW Sticky Bit. The Software Sticky Bit is set when the SRR SRR bit has been set via the SETR SETR bit. This bit can be cleared by writing with 1 to SWSCLR SWSCLR . Writing to SWS has no effect.</description>
									<lsb>29</lsb>
									<msb>29</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>SWSCLR</name>
									<description>SW Sticky Clear Bit. SWSCLR is required to reset SWS SWS .</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>write-only</access>
								</field>
							</fields>
						</register>
						<register>
							<name>ERAYxOBUSY</name>
							<description>E RAY 0 Output Buffer Busy
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>32</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>SRPN</name>
									<description>Service Request Priority Number. The SRPN bit field defines the priority of a service request with        respect to service requests with to the same service provider  same        SRC.TOS configuration   00   gt  Service request is on lowest priority ... FF   gt  Service request is on highest priority For a CPU 01 is the lowest priority as 00 is never serviced. For a DMA 00 triggers channel 0. For DMA  SRPN must not be greater than the highest implemented DMA          channel number.</description>
									<lsb>0</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SRE</name>
									<description>Service Request Enable</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TOS</name>
									<description>Type of Service Control. The TOS bit field configuration maps a Service Request to an Interrupt Service Provider  In products where DMA or CPUx is not implemented  the related TOS encoding will not be used and treated as RESERVED. In products with less than 4 ISPs the effective size of the TOS bit field might be reduced to 1 or 2 bit.</description>
									<lsb>11</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ECC</name>
									<description>Error Correction Code. The ECC bit field will be updated by the SRN under the following        conditions  Write or Read Modify Write to SRC 31 0  Write to SRC 15 0   16 bit write  Write to SRC 15 8  or write to SRC 7 0   byte write  For more details pls. see CROSSREFERENCE . In the current implementation the ECC code is only used for error          detection. Detected errors are reported to the SMU but not corrected.</description>
									<lsb>16</lsb>
									<msb>20</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SRR</name>
									<description>Service Request Flag. The SRR bit shows the status of the Service Request.</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CLRR</name>
									<description>Request Clear Bit. The CLRR bit is required to reset SRR SRR .</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>SETR</name>
									<description>Request Set Bit. The SETR bit is required to set SRR SRR .</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>IOV</name>
									<description>Interrupt Trigger Overflow Bit. The IOV bit is set by HW if a new service request was triggered via        interrupt trigger or SETR SETR bit while the SRN has still an pending service request.</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>IOVCLR</name>
									<description>Interrupt Trigger Overflow Clear Bit. IOVCLR is required to reset IOV IOV .</description>
									<lsb>28</lsb>
									<msb>28</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>SWS</name>
									<description>SW Sticky Bit. The Software Sticky Bit is set when the SRR SRR bit has been set via the SETR SETR bit. This bit can be cleared by writing with 1 to SWSCLR SWSCLR . Writing to SWS has no effect.</description>
									<lsb>29</lsb>
									<msb>29</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>SWSCLR</name>
									<description>SW Sticky Clear Bit. SWSCLR is required to reset SWS SWS .</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>write-only</access>
								</field>
							</fields>
						</register>
						<register>
							<name>ERAYxIBUSY</name>
							<description>E RAY 0 Input Buffer Busy
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>36</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>SRPN</name>
									<description>Service Request Priority Number. The SRPN bit field defines the priority of a service request with        respect to service requests with to the same service provider  same        SRC.TOS configuration   00   gt  Service request is on lowest priority ... FF   gt  Service request is on highest priority For a CPU 01 is the lowest priority as 00 is never serviced. For a DMA 00 triggers channel 0. For DMA  SRPN must not be greater than the highest implemented DMA          channel number.</description>
									<lsb>0</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SRE</name>
									<description>Service Request Enable</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TOS</name>
									<description>Type of Service Control. The TOS bit field configuration maps a Service Request to an Interrupt Service Provider  In products where DMA or CPUx is not implemented  the related TOS encoding will not be used and treated as RESERVED. In products with less than 4 ISPs the effective size of the TOS bit field might be reduced to 1 or 2 bit.</description>
									<lsb>11</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ECC</name>
									<description>Error Correction Code. The ECC bit field will be updated by the SRN under the following        conditions  Write or Read Modify Write to SRC 31 0  Write to SRC 15 0   16 bit write  Write to SRC 15 8  or write to SRC 7 0   byte write  For more details pls. see CROSSREFERENCE . In the current implementation the ECC code is only used for error          detection. Detected errors are reported to the SMU but not corrected.</description>
									<lsb>16</lsb>
									<msb>20</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SRR</name>
									<description>Service Request Flag. The SRR bit shows the status of the Service Request.</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CLRR</name>
									<description>Request Clear Bit. The CLRR bit is required to reset SRR SRR .</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>SETR</name>
									<description>Request Set Bit. The SETR bit is required to set SRR SRR .</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>IOV</name>
									<description>Interrupt Trigger Overflow Bit. The IOV bit is set by HW if a new service request was triggered via        interrupt trigger or SETR SETR bit while the SRN has still an pending service request.</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>IOVCLR</name>
									<description>Interrupt Trigger Overflow Clear Bit. IOVCLR is required to reset IOV IOV .</description>
									<lsb>28</lsb>
									<msb>28</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>SWS</name>
									<description>SW Sticky Bit. The Software Sticky Bit is set when the SRR SRR bit has been set via the SETR SETR bit. This bit can be cleared by writing with 1 to SWSCLR SWSCLR . Writing to SWS has no effect.</description>
									<lsb>29</lsb>
									<msb>29</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>SWSCLR</name>
									<description>SW Sticky Clear Bit. SWSCLR is required to reset SWS SWS .</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>write-only</access>
								</field>
							</fields>
						</register>
					</cluster>
				</cluster>
				<cluster>
					<name>HSM</name>
					<description>HSM</description>
					<addressOffset>2160</addressOffset>
					<cluster>
						<dim>1</dim>
						<dimIncrement>4</dimIncrement>
						<name>HSM[%s]</name>
						<description>HSM</description>
						<headerStructName>HSM_HSM</headerStructName>
						<addressOffset>0</addressOffset>
						<register>
							<dim>2</dim>
							<dimIncrement>4</dimIncrement>
							<name>HSMy[%s]</name>
							<description>HSM Service Request 0
 resetvalue={Application Reset:0x0}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>SRPN</name>
									<description>Service Request Priority Number. The SRPN bit field defines the priority of a service request with        respect to service requests with to the same service provider  same        SRC.TOS configuration   00   gt  Service request is on lowest priority ... FF   gt  Service request is on highest priority For a CPU 01 is the lowest priority as 00 is never serviced. For a DMA 00 triggers channel 0. For DMA  SRPN must not be greater than the highest implemented DMA          channel number.</description>
									<lsb>0</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SRE</name>
									<description>Service Request Enable</description>
									<lsb>10</lsb>
									<msb>10</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>TOS</name>
									<description>Type of Service Control. The TOS bit field configuration maps a Service Request to an Interrupt Service Provider  In products where DMA or CPUx is not implemented  the related TOS encoding will not be used and treated as RESERVED. In products with less than 4 ISPs the effective size of the TOS bit field might be reduced to 1 or 2 bit.</description>
									<lsb>11</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ECC</name>
									<description>Error Correction Code. The ECC bit field will be updated by the SRN under the following        conditions  Write or Read Modify Write to SRC 31 0  Write to SRC 15 0   16 bit write  Write to SRC 15 8  or write to SRC 7 0   byte write  For more details pls. see CROSSREFERENCE . In the current implementation the ECC code is only used for error          detection. Detected errors are reported to the SMU but not corrected.</description>
									<lsb>16</lsb>
									<msb>20</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SRR</name>
									<description>Service Request Flag. The SRR bit shows the status of the Service Request.</description>
									<lsb>24</lsb>
									<msb>24</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>CLRR</name>
									<description>Request Clear Bit. The CLRR bit is required to reset SRR SRR .</description>
									<lsb>25</lsb>
									<msb>25</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>SETR</name>
									<description>Request Set Bit. The SETR bit is required to set SRR SRR .</description>
									<lsb>26</lsb>
									<msb>26</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>IOV</name>
									<description>Interrupt Trigger Overflow Bit. The IOV bit is set by HW if a new service request was triggered via        interrupt trigger or SETR SETR bit while the SRN has still an pending service request.</description>
									<lsb>27</lsb>
									<msb>27</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>IOVCLR</name>
									<description>Interrupt Trigger Overflow Clear Bit. IOVCLR is required to reset IOV IOV .</description>
									<lsb>28</lsb>
									<msb>28</msb>
									<access>write-only</access>
								</field>
								<field>
									<name>SWS</name>
									<description>SW Sticky Bit. The Software Sticky Bit is set when the SRR SRR bit has been set via the SETR SETR bit. This bit can be cleared by writing with 1 to SWSCLR SWSCLR . Writing to SWS has no effect.</description>
									<lsb>29</lsb>
									<msb>29</msb>
									<access>read-only</access>
								</field>
								<field>
									<name>SWSCLR</name>
									<description>SW Sticky Clear Bit. SWSCLR is required to reset SWS SWS .</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>write-only</access>
								</field>
							</fields>
						</register>
					</cluster>
				</cluster>
				<cluster>
					<name>SCU</name>
					<description>SCU</description>
					<headerStructName>SCU</headerStructName>
					<addressOffset>2176</addressOffset>
					<register>
						<dim>4</dim>
						<dimIncrement>4</dimIncrement>
						<name>SCUERUx[%s]</name>
						<description>SCU ERU Service Request 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SRPN</name>
								<description>Service Request Priority Number. The SRPN bit field defines the priority of a service request with        respect to service requests with to the same service provider  same        SRC.TOS configuration   00   gt  Service request is on lowest priority ... FF   gt  Service request is on highest priority For a CPU 01 is the lowest priority as 00 is never serviced. For a DMA 00 triggers channel 0. For DMA  SRPN must not be greater than the highest implemented DMA          channel number.</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SRE</name>
								<description>Service Request Enable</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TOS</name>
								<description>Type of Service Control. The TOS bit field configuration maps a Service Request to an Interrupt Service Provider  In products where DMA or CPUx is not implemented  the related TOS encoding will not be used and treated as RESERVED. In products with less than 4 ISPs the effective size of the TOS bit field might be reduced to 1 or 2 bit.</description>
								<lsb>11</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ECC</name>
								<description>Error Correction Code. The ECC bit field will be updated by the SRN under the following        conditions  Write or Read Modify Write to SRC 31 0  Write to SRC 15 0   16 bit write  Write to SRC 15 8  or write to SRC 7 0   byte write  For more details pls. see CROSSREFERENCE . In the current implementation the ECC code is only used for error          detection. Detected errors are reported to the SMU but not corrected.</description>
								<lsb>16</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SRR</name>
								<description>Service Request Flag. The SRR bit shows the status of the Service Request.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CLRR</name>
								<description>Request Clear Bit. The CLRR bit is required to reset SRR SRR .</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>SETR</name>
								<description>Request Set Bit. The SETR bit is required to set SRR SRR .</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>IOV</name>
								<description>Interrupt Trigger Overflow Bit. The IOV bit is set by HW if a new service request was triggered via        interrupt trigger or SETR SETR bit while the SRN has still an pending service request.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>IOVCLR</name>
								<description>Interrupt Trigger Overflow Clear Bit. IOVCLR is required to reset IOV IOV .</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>SWS</name>
								<description>SW Sticky Bit. The Software Sticky Bit is set when the SRR SRR bit has been set via the SETR SETR bit. This bit can be cleared by writing with 1 to SWSCLR SWSCLR . Writing to SWS has no effect.</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SWSCLR</name>
								<description>SW Sticky Clear Bit. SWSCLR is required to reset SWS SWS .</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>write-only</access>
							</field>
						</fields>
					</register>
				</cluster>
