J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<dim>10</dim>
					<dimIncrement>4</dimIncrement>
					<name>GTMMCSWw[%s]</name>
					<description>GTM Multi Channel Sequencer Service Request 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4048</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number. The SRPN bit field defines the priority of a service request with        respect to service requests with to the same service provider  same        SRC.TOS configuration   00   gt  Service request is on lowest priority ... FF   gt  Service request is on highest priority For a CPU 01 is the lowest priority as 00 is never serviced. For a DMA 00 triggers channel 0. For DMA  SRPN must not be greater than the highest implemented DMA          channel number.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control. The TOS bit field configuration maps a Service Request to an Interrupt Service Provider  In products where DMA or CPUx is not implemented  the related TOS encoding will not be used and treated as RESERVED. In products with less than 4 ISPs the effective size of the TOS bit field might be reduced to 1 or 2 bit.</description>
							<lsb>11</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code. The ECC bit field will be updated by the SRN under the following        conditions  Write or Read Modify Write to SRC 31 0  Write to SRC 15 0   16 bit write  Write to SRC 15 8  or write to SRC 7 0   byte write  For more details pls. see CROSSREFERENCE . In the current implementation the ECC code is only used for error          detection. Detected errors are reported to the SMU but not corrected.</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag. The SRR bit shows the status of the Service Request.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit. The CLRR bit is required to reset SRR SRR .</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit. The SETR bit is required to set SRR SRR .</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit. The IOV bit is set by HW if a new service request was triggered via        interrupt trigger or SETR SETR bit while the SRN has still an pending service request.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit. IOVCLR is required to reset IOV IOV .</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit. The Software Sticky Bit is set when the SRR SRR bit has been set via the SETR SETR bit. This bit can be cleared by writing with 1 to SWSCLR SWSCLR . Writing to SWS has no effect.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit. SWSCLR is required to reset SWS SWS .</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>ADMA0</name>
			<version>100</version>
			<description>ADMA</description>
			<baseAddress>4166026240</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>756</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CLC</name>
					<description>Clock Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit   DISR. Used for enable disable control of the module.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit   DISS. Bit indicates the current status of the module.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MODID</name>
					<description>Module Identification Register
 resetvalue={Application Reset:0x0D1C005}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>13746181</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision Number   MOD REV. This bit field defines the module revision number. The value of a module revision starts with 01H  first revision .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type   MOD TYPE. The bit field is set to C0H which defines the module as a 32 bit module.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number Value   MOD NUMBER. This bit field defines a module identification number. The value for the AMU is 00D1H.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRSR</name>
					<description>Error Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>12</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ME</name>
							<description>Memory Error   ME. This error flag is generated by the DMA move engine. An error has occurred while writing to the memory.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SE</name>
							<description>System Error   SE. This error flag is generated by the DMA move engine. An error has occurred while reading data from system memory</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SRI_ECC</name>
							<description>System Memory ECC Error   SRI ECC. This error flag is generated by the DMA move engine. An ECC error has been detected in data read from system memory.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SADR</name>
					<description>Source Address Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>16</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SADR</name>
							<description>Source Address Register  Pointer    SADR. This register contains the source address of the DMA transfer. This is the address from which the DMA engine reads data that is to be transferred. As the value contained by this register must be aligned to an 8 byte boundary  bits 2 to 0 must be written with 0 and will always read 0 . A value of 1 written to any of these bits will be ignored</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DADR</name>
					<description>Destination Address Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>20</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DADR</name>
							<description>Destination Address Register  Pointer    DADR. This register contains the destination address of the DMA transfer. This is the address to which the DMA engine writes that data it transfers. As the value contained by this register must be aligned to an 8 byte boundary  bits 2 to 0 must be written with 0 and will always read 0 . A value of 1 written to any of these bits will be ignored. As the destination address must always be within the AMU RAM  the high order bits not needed to access the AMU memory will cause a memory error if not set to the base address of the AMU RAM. e.g. for a 32 KiB AMU SRAM  bits 31 to 15 of the register are the base address and for a 64 KiB AMU SRAM bits 31 to 16 of the register are the base address.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CNT</name>
					<description>Counter Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>24</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>Byte Counter   CNT. This register contains the number of bytes that the DMA engine is about to transfer. As the value contained by this register must be multiples of 8  bits 2 to 0 must be written with 0 and will always read as 0 . A value of 1 written to any of these bits will be ignored. As the destination for a transfer must always be within the AMU RAM  the count cannot exceed the size of the RAM. Unneeded bits will be silently ignored. For a 32 KiBAMU SRAM  bits 31 to 16 of the register are unneeded and will be silently ignored when written to and will always read 0 . For a 64 KiB AMU SRAM  bits 31 to 17 are unneeded and will be silently ignored when written and will always read 0 .</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL</name>
					<description>Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>28</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EN</name>
							<description>Enable Bit   EN. Turns on   off the engine. Will be cleared when the transfer was stopped or finished. The flag is set while the transfer is running.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENCN</name>
							<description>Enable Condition Bit   ENCN. If the flag is 0  a change of EN bit is ignored.Read always as 0</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>READY</name>
							<description>Ready Flag   READY. This bit is set by hardware upon successful completion of the DMA transfer.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ERR</name>
							<description>Error Interrupt   ERR. This flag signifies that an error during the DMA transfer has occurred. An interrupt is raised.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ECC_STOP</name>
							<description>ECC Error Mode Bit   ECC STOP. When set to 1   a running DMA transfer will be stopped if an ECC error is detected in data read from system memory. When set to 0   the error will still be flagged but the DMA transaction will continue. This type of error is identified by the SRI ECC bit in the ERRSR register.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CHKEN</name>
							<description>Checksum Enable Mode Bit   CHKEN. When set to 1 a cumulative hash value computed from all the data transferred by the ADMA will be stored in the CHKSUM register.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CHKSUM</name>
					<description>Checksum Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>32</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CHKSUM</name>
							<description>DATA Checksum   CHKSUM. Hash value calculated from all data transferred by the ADMA since the register was last initialised.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRST0</name>
					<description>Kernel Reset Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>64</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>Kernel Reset   RST. This reset bit can be used to request for a kernel reset. The kernel reset will be executed if the reset bits of both kernel registers are set. The RST bit will be cleared  reset to 0   after the kernel reset is executed.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RSTSTAT</name>
							<description>Kernel Reset Status   RSTSTAT. This bit indicates whether a kernel reset was executed or not. This bit is set after the execution of a kernel reset in the same clock cycle both reset bits are cleared  ADMA KRST0.RST and ADMA KRST1.RST . This bit can be cleared by writing with  1  to the CLR bit in the related KRSTCLR register.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRST1</name>
					<description>Kernel Reset Register 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>68</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>Kernel Reset   RST. This reset bit can be used to request for a kernel reset. The kernel reset will be executed if the reset bits of both kernel reset registers is set. The RST bit will be cleared  re set to 0   after the kernel reset was executed.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRSTCLR</name>
					<description>Kernel Reset Status Clear Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>72</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CLR</name>
							<description>Kernel Reset Status Clear   CLR. Read always as 0 .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ODA</name>
					<description>OCDS Debug Access Register
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>76</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DDREN</name>
							<description>Destructive Debug Read Enable   DDREN. For details see CROSSREFERENCE .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DREN</name>
							<description>Destructive Read Enable   DREN. For details see CROSSREFERENCE .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OCS</name>
					<description>OCDS Control and Status Register
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>80</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SUS</name>
							<description>OCDS Suspend Control   SUS. Controls the sensitivity to the suspend signal coming from the OCDS Trigger Switch  OTGS </description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SUS_P</name>
							<description>SUS Write Protection   SUS P. SUS is only written when SUS P is 1  otherwise unchanged. Read as 0.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SUSSTA</name>
							<description>Suspend State   SUSSTA</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
