J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>AMU00</name>
			<version>100</version>
			<description>AMU</description>
			<baseAddress>4166025216</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>432</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CTRL1</name>
					<description>Control Register 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EXPFIX</name>
							<description>Exponent for Fixed Exponent Format   EXPFIX. This field stores the exponent to be used when V is stored in memory as a 16 bit  fixed point value. See the related VFRMT field.</description>
							<lsb>0</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VFRMT</name>
							<description>Parameter Matrix V Format   VFRMT. This field controls the storage format of parameter matrix V. It can have the following values </description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CFGSET</name>
							<description>Configuration Set   CFGSET. When set to 1   z is initialised to p 5 . When set to 0   z is not initialised and returns whatever value is present in the register from previous operations.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EER</name>
					<description>Error Enable Register
 resetvalue={Application Reset:0x40007F}</description>
					<addressOffset>4</addressOffset>
					<size>32</size>
					<resetValue>4194431</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>P7MAX</name>
							<description>Enable Interrupt on P7 Over Maximum Error   P7MAX. Enable interrupt on P7MAX error.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IINF</name>
							<description>Enable Interrupt on Input Infinity Error   IINF. Enable interrupt if input value is infinity</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INAN</name>
							<description>Enable Interrupt on Input NaN Error   INAN. Enable interrupt if input value is not a number  NaN </description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OOV</name>
							<description>Enable Interrupt on Output Overflow   OOV. Enable interrupt if output overflows.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ME</name>
							<description>Enable Interrupt on Memory Error   ME. Enable interrupt on memory error</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REGACC</name>
							<description>Enable Interrupt on Register Access during Computation Error   REGACC. This flag enables interrupt generation if registers are written during computation</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DENORM</name>
							<description>Enable Interrupt on Input Denormalised Number Error   DENORM. Enable interrupt if a 32 bit input value contains a denormalised number</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC_STOP</name>
							<description>Stop on ECC Error   ECC STOP. Enable the use of an ECC error detected during a read from a system        memory to stop the AMU and flag an interrupt</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DENEN</name>
							<description>Enable Stop on Input Denormalised Number Error.   DENEN. Stop execution if a 32 bit input value contains a denormalised number</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EECN</name>
							<description>Enable Stop Condition Bit   EECN. Must be written with 1 to allow the        state of bit 22 to be changed</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P10SINT</name>
					<description>Parameter p10 Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>NCROSSING</name>
							<description>Loop Counter Value to Raise Limit Interrupt   NCROSSING. AMU will raise the limit interrupt if p8 is equal to or greater than this value.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P6SINT</name>
					<description>Parameter p6 Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>12</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>NEND</name>
							<description>Max Iteration Counter for Outer Loop   NEND. This register contains the row dimension of matrix V. It is the maximum number of iterations of the outer loop of the algorithm.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P7SINT</name>
					<description>Parameter p7 Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>16</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>M</name>
							<description>Max Iteration Counter for Inner Loop   M. This register contains the column dimension of matrix V. It is the maximum number of iterations of the inner loop of the algorithm. Due to hardware constraints  this value cannot be larger than 32.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P8SINT</name>
					<description>Parameter p8 Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>20</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>NSTART</name>
							<description>Start Value for Outer Loop   NSTART. This register should be programmed with the start value for the outer loop of the algorithm. For instructions to use  please refer to the section about restarting AMU after an interrupted calculation.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P9DOUBLELOW32</name>
					<description>Parameter p9 Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>24</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>P9DOUBLE</name>
							<description>AMU Parameter p9 Register  Double    P9DOUBLE. This bit field holds the lower 32 bit of parameter p9 of the algorithm.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P9DOUBLEHIGH32</name>
					<description>Parameter p9 Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>28</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>P9DOUBLE</name>
							<description>AMU Parameter p9 Register  Double    P9DOUBLE. This bit field holds the higher 32 bit of parameter p9 of the algorithm.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VPFLOAT</name>
					<description>Coefficient Matrix V Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>32</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>VPFLOAT</name>
							<description>AMU V Parameter Register  Pointer to Float    VPFLOAT. This bit field holds the base address of the coefficient matrix V NxM </description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LPFLOAT</name>
					<description>Coefficient Array L Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>36</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LPFLOAT</name>
							<description>AMU Coefficient Array L  Pointer to Float    LPFLOAT. This bit field holds a pointer to the coefficient array L M  of the algorithm.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P1PFLOAT</name>
					<description>Parameter p1 Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>40</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>P1PFLOAT</name>
							<description>AMU P1 Parameter Register  Pointer to Float    P1PFLOAT. This bit field holds a pointer to the parameter array p1 M  of the algorithm.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P2PFLOAT</name>
					<description>Parameter p2 Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>44</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>P2PFLOAT</name>
							<description>AMU P2 Parameter Register  Pointer to Float    P2PFLOAT. This bit field holds a pointer to the parameter array p2  M  of the algorithm.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P3PFLOAT</name>
					<description>Parameter p3 Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>48</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>P3PFLOAT</name>
							<description>AMU P3 Parameter Register  Pointer to Float    P3PFLOAT. This bit field holds a pointer to the parameter array p3  N  of the algorithm.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P4FLOAT</name>
					<description>Parameter p4 Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>52</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>P4FLOAT</name>
							<description>AMU P4 Parameter Register  Float    P4FLOAT. This bit field holds the parameter p4 of the algorithm.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P5FLOAT</name>
					<description>Parameter p5 Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>56</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>P5FLOAT</name>
							<description>AMU P5 Parameter Register  Float    P5FLOAT. This bit field holds the parameter p5 of the algorithm.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UPFLOAT</name>
					<description>Input Vector u Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>60</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>UPFLOAT</name>
							<description>AMU Input Vector Register  Pointer to Float    UPFLOAT. This bit field holds a pointer to the input vector array u  M  of the algorithm.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OLCOMP</name>
					<description>Parameter p8 Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>64</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CP8H2N</name>
							<description>Trigger Value for switch from half to full speed   CP8H2N. This register should be programmed with the p8 value when the AMU should switch from running at half programmed speed to full programmed speed. For instructions to use  please refer to the section about current shaping.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CPHN2H</name>
							<description>Trigger Value for switch from full to half speed   CPHN2H. This register should be programmed with the p8 value when the AMU should switch from running at full programmed speed to half programmed speed. For instructions to use  please refer to the section about current shaping.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL0</name>
					<description>Control Register 0
 resetvalue={Application Reset:0x7000}</description>
					<addressOffset>68</addressOffset>
					<size>32</size>
					<resetValue>28672</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EN</name>
							<description>Enable Bit   EN. Write 1 to enable the algorithm. Write 0 to disable the algorithm. The flag will return a 1 if read while        the algorithm is running and 0 is the        algorithm is stopped or finished.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENCN</name>
							<description>Enable Condition Bit   ENCN. This bit must be written with 1 to        change the EN field. If 0 is written the        value written to the EN field is ignored. Always read as 0 .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>READY</name>
							<description>Ready Flag   READY. This bit is cleared by hardware when a computation starts and set by hardware upon successful completion of the computation.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SDOWN</name>
							<description>Slowdown Flag   SDOWN. The flags can be used to slow down the state machine which controls the algorithm.</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SDOWNCN</name>
							<description>Slowdown Condition Bit   SDOWNCN. This bit must be written with 1 to change the SDOWN field. If 0 is written the value written to the SDOWN field is ignored. Always read as 0 .</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LI</name>
							<description>Limit Interrupt   LI. This flag shows the state of the limit interrupt. This interrupt is raised when the AMU outer loop counter reaches the value provided in p10. Cleared by hardware when read or on the start of the next execution   0 to 1 transition on EN .</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ERR</name>
							<description>Error Interrupt   ERR. This flag signifies that an error during the computation has occurred. An interrupt is raised. Cleared by hardware when read or on the start of the next execution   0 to 1 transition on EN .</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LIM2RDY</name>
							<description>Limit to Ready Interrupt   LIM2RDY. If this flag is set  a limit interrupt is also signaled at the ready interrupt line.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RDY2LIM</name>
							<description>Ready to Limit Interrupt   RDY2LIM. If this flag is set  the ready interrupt is also signaled the limit interrupt line.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL</name>
							<description>Stop on Limit Interrupt   SL. If this flag is set  AMU stops on limit interrupt</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REGACCEN</name>
							<description>Allow Register Write when Active   REGACCEN. If this flag is set  writes to the P10SINT  P6SINT and OLCOMP registers when the AMU is active do not cause an error.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MAX</name>
							<description>Maximum Speed Control   MAX. The field is used to define the speed at which arithmetic operations complete. It can set the speed to between 1 clock cycle  when written with 0   and 8 clock cycles  when written with 7  .</description>
							<lsb>12</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MAXCN</name>
							<description>Maximum Speed Condition Bit   MAXCN. This bit must be written with 1 to change the MAX bits. If 0 is written the value written to the MAX bits is ignored. Always read as 0 .</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ID</name>
							<description>Identifier   ID. This field is freely readable and writable. Use to identify specific calculation.</description>
							<lsb>16</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IDCN</name>
							<description>Identifier Condition Bit   IDCN. This bit must be written with 1 to change the ID field. If 0 is written the value written to the ID field is ignored. Always read as 0 .</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CSH</name>
							<description>Current Shaping Enable   CSH. Write 1 to enable current shaping. See   8220 Current        Shaping  8221  on Page  160 14 for information.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CSHCN</name>
							<description>Current Shaping Enable Condition Bit   CSHCN. This bit must be written with 1 to change the CSH field. If 0 is written the value written to the CSH field is ignored. Always read as 0 .</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>HSPEED</name>
							<description>Half Speed   HSPEED. This bit will switch the AMU core to run at a speed equivalent to SDOWN 1 when written with 1 . No effect if SDOWN is already at maximum permissible value of 11 .</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HSPEEDCN</name>
							<description>Identifier Condition Bit   HSPEEDCN. This bit must be written with 1 to change the ID field. If 0 is written the value written to the HSPEED field is ignored. Always read as 0 .</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CSHS</name>
							<description>Current Shaping Status   CSHS</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ZDOUBLELOW32</name>
					<description>Return Value Register
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
					<addressOffset>128</addressOffset>
					<size>32</size>
					<resetValue>4294967295</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ZDOUBLE</name>
							<description>AMU Return value z Register  Double    ZDOUBLE. This bit field holds the lower 32 bit of return value z of the algorithm.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ZDOUBLEHIGH32</name>
					<description>Return Value Register
 resetvalue={Application Reset:0x7FFFFFFF}</description>
					<addressOffset>132</addressOffset>
					<size>32</size>
					<resetValue>2147483647</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ZDOUBLE</name>
							<description>AMU return value z Register  Double    ZDOUBLE. This bit field holds the higher 32 bit of return value  z of the algorithm.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ZFLOAT</name>
					<description>Return Value Register
 resetvalue={Application Reset:0x7FFFFFFF}</description>
					<addressOffset>136</addressOffset>
					<size>32</size>
					<resetValue>2147483647</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ZFLOAT</name>
							<description>AMU Result Register  Float    ZFLOAT. This bit field holds the return value   z   of the algorithm.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
