J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>CTRL0MIR</name>
					<description>Control Register 0 Mirror
 resetvalue={Application Reset:0x7000}</description>
					<addressOffset>140</addressOffset>
					<size>32</size>
					<resetValue>28672</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EN</name>
							<description>Enable Bit   EN. The flag is set if the module is running.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>READY</name>
							<description>Ready Flag   READY. This bit is set by hardware upon successful completion of the computation.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SDOWN</name>
							<description>Slowdown Flag   SDOWN. This flag reports the speed of the state machine which controls the algorithm.</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LI</name>
							<description>Limit Interrupt   LI. This flag controls the state of the limit interrupt. This interrupt is raised when the AMU outer loop counter reaches the value provided in p10.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ERR</name>
							<description>Error Interrupt   ERR. This flag signifies that an error during the computation has occurred. An interrupt is raised.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LIM2RDY</name>
							<description>Limit to Ready Interrupt   LIM2RDY. If this flag is set  a limit interrupt is also signaled at the ready interrupt line.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RDY2LIM</name>
							<description>Ready to Limit Interrupt   RDY2LIM. If this flag is set  the ready interrupt is also signaled the limit interrupt line.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SL</name>
							<description>Stop on Limit Interrupt   SL. If this flag is set  AMU stops on limit interrupt</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>REGACCEN</name>
							<description>Allow Register Write when Active   REGACCEN. If this flag is set  writes to the P10SINT  P6SINTand OLCOMP registers when the AMU is active do not cause an error.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MAX</name>
							<description>Maximum Speed Control   MAX. The field is used to report the speed at which arithmetic operations complete. The speed varies between 1 clock cycle  when 0   and 8 clock cycles  when 7  .</description>
							<lsb>12</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ID</name>
							<description>Identifier   ID. Used to identify a specific calculation.</description>
							<lsb>16</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CSH</name>
							<description>Current Shaping Enable   CSH. Write 1 to enable current shaping. See ok for information.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSPEED</name>
							<description>Half Speed   HSPEED. This bit will switch the AMU core to run at a speed equivalent to SDOWN 1 when written with 1 . No effect if SDOWN is already at maximum permissible value of 11 .</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CSHS</name>
							<description>Current Shaping Status   CSHS</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>YDOUBLELOW32</name>
					<description>Intermediate Result yRegister
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
					<addressOffset>144</addressOffset>
					<size>32</size>
					<resetValue>4294967295</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>YDOUBLE</name>
							<description>AMU v Result Register  Double    YDOUBLE. This bit field holds the lower 32 bit of intermediate value y of the algorithm.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>YDOUBLEHIGH32</name>
					<description>Intermediate Result yRegister
 resetvalue={Application Reset:0x7FFFFFFF}</description>
					<addressOffset>148</addressOffset>
					<size>32</size>
					<resetValue>2147483647</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>YDOUBLE</name>
							<description>AMU v Result Register  Double    YDOUBLE. This bit field holds the higher 32 bit of intermediate value yof the algorithm.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>YFLOAT</name>
					<description>Intermediate Result y Float Register
 resetvalue={Application Reset:0x7FFFFFFF}</description>
					<addressOffset>152</addressOffset>
					<size>32</size>
					<resetValue>2147483647</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>YFLOAT</name>
							<description>AMU v Result Register  Float    YFLOAT. This bit field holds the intermediate value v of the algorithm.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRSR</name>
					<description>Error Status Register
 resetvalue={Application Reset:0x0F00}</description>
					<addressOffset>156</addressOffset>
					<size>32</size>
					<resetValue>3840</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>P7MAX</name>
							<description>P7 Over Maximum Error   P7MAX. The value p7 is larger than supported by hardware. The maximum supported value is 32.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IINF</name>
							<description>Input Infinity Error   IINF. Input value is infinity</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>INAN</name>
							<description>Input NaN Error   INAN. Input value is not a number  NaN </description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OOV</name>
							<description>Output Overflow   OOV. An overflow occurred during computation. The output will be infinite or NaN.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ME</name>
							<description>Memory Error   ME. This error flag is generated by the DMA move engine. An error has        occurred while accessing the memory.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>REGACC</name>
							<description>Register Access during Computation Error   REGACC. This error occurs when the AMU parameter registers are being written while the computation is being performed using these parameters.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DENORM</name>
							<description>Input Denormalised Number Error   DENORM. A 32 bit input value contains a denormalised number</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ALGOPOS</name>
							<description>Algorithm Position   ALGOPOS. This bit field shows the state of the AMU state machine when the error occurs. This allows inferring the error cause. Coding see CROSSREFERENCE .</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MEU</name>
							<description>Uncorrectable Memory Error   MEU. A memory error has occurred which could not be corrected by the ECC logic</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SRI_ECC</name>
							<description>Uncorrectable Memory Error   SRI ECC. A memory error has occurred when accessing a system memory resource</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P8SINTMIR</name>
					<description>Interrupt Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>160</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>NSTART</name>
							<description>Start Value for Outer Loop   NSTART. Mirror of P8SINT field NSTART.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UCURRPFLOAT</name>
					<description>Current Input Vector Pointer Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>168</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>UPFLOAT</name>
							<description>AMU Input Vector Register  Pointer to Float    UPFLOAT. This bit field holds a pointer to the input vector array u  M  of the algorithm.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P1CURRPFLOAT</name>
					<description>Current Parameter p1 Pointer Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>172</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>P1PFLOAT</name>
							<description>AMU Input Vector Register  Pointer to Float    P1PFLOAT. This bit field holds a pointer to the input vector array p1  M  of the algorithm.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P2CURRPFLOAT</name>
					<description>Current Parameter p2 Pointer Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>176</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>P2PFLOAT</name>
							<description>AMU Input Vector Register  Pointer to Float    P2PFLOAT. This bit field holds a pointer to the input vector array p2  M  of the algorithm.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P3CURRPFLOAT</name>
					<description>Current Parameter p3 Pointer Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>180</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>P3PFLOAT</name>
							<description>AMU Input Vector Register  Pointer to Float    P3PFLOAT. This bit field holds a pointer to the input vector array p3  M  of the algorithm.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VCURRPFLOAT</name>
					<description>Current Coefficient Matrix V Pointer Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>184</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>VPFLOAT</name>
							<description>AMU V Coefficient Register  Pointer to Float    VPFLOAT. This bit field holds a pointer to the coefficient vector array V  N M  of the algorithm.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LCURRPFLOAT</name>
					<description>Current Coefficient Matrix L Pointer Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>188</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LPFLOAT</name>
							<description>AMU Coefficient Register  Pointer to Float    LPFLOAT. This bit field holds a pointer to the coefficient array L M  of the algorithm.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
