J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>DMA</name>
			<version>100</version>
			<description>DMA</description>
			<baseAddress>4026597376</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>12288</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<cluster>
					<dim>4</dim>
					<dimIncrement>8</dimIncrement>
					<name>ACCEN[%s]</name>
					<description>ACCEN</description>
					<addressOffset>64</addressOffset>
					<register>
						<name>ACCENr0</name>
						<description>RP 0 Access Enable Register 0
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>4294967295</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>EN0</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN1</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN2</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN3</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN4</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN5</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN6</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN7</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN8</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN9</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN10</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN11</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN12</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN13</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN14</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN15</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN16</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN17</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN18</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN19</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN20</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN21</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN22</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN23</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN24</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN25</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN26</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN27</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN28</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN29</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN30</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN31</name>
								<description>Access Enable for Master TAG ID q   ENq. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID q</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<dim>128</dim>
					<dimIncrement>32</dimIncrement>
					<name>CH[%s]</name>
					<description>CH</description>
					<addressOffset>8192</addressOffset>
					<register>
						<name>RDCRCRc</name>
						<description>DMARAM Channel 000 Read Data CRC Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RDCRC</name>
								<description>Read Data CRC   RDCRC. Checksum calculated for DMA read move data.</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>SDCRCRc</name>
						<description>DMARAM Channel 000 Source and Destination Address CRC Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SDCRC</name>
								<description>Source and Destination Address CRC   SDCRC. Checksum calculated for DMA move source and destination addresses.</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>SADRc</name>
						<description>DMARAM Channel 000 Source Address Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SADR</name>
								<description>Source Address   SADR. 32 bit source address.</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DADRc</name>
						<description>DMARAM Channel 000 Destination Address Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>12</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>DADR</name>
								<description>Destination Address   DADR. 32 bit destination address.</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ADICRc</name>
						<description>DMARAM Channel 000 Address and Interrupt Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>16</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SMF</name>
								<description>Source Address Modification Factor   SMF. DMA channel TCS 32 bit source address modification factor and the        channel data width CHDW determines an address offset value by which the        source address is modified after each DMA move. If SCBE   1 B and CBLS  160    160 0000 B then the        source address is not modified.</description>
								<lsb>0</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INCS</name>
								<description>Increment of Source Address   INCS. DMA channel TCS control bit to determine if the address offset selected        by SMF will be added to or subtracted from the source address after each        DMA move. If SCBE   1 B and CBLS  160    160 0000 B then the source address is not modified.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DMF</name>
								<description>Destination Address Modification Factor   DMF. DMA channel TCS 32 bit destination address modification factor and the        channel data width CHDW determines an address offset value by which the        destination address is modified after each DMA move. If DCBE   1 B and CBLD  160    160 0000 B then the        destination address is not modified.</description>
								<lsb>4</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INCD</name>
								<description>Increment of Destination Address   INCD. DMA channel TCS control bit to determine if the address offset selected        by DMF will be added to or subtracted from the destination address after        each DMA move. If DCBE   1 B and CBLD  160    160 0000 B the destination address is not modified.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CBLS</name>
								<description>Circular Buffer Length Source   CBLS. DMA channel TCS circular buffer source address update control bit        determines which part of the 32 bit source address register remains        unchanged and is not updated after a DMA move operation. CBLS determines the size of the circular source buffer.</description>
								<lsb>8</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CBLD</name>
								<description>Circular Buffer Length Destination   CBLD. DMA channel TCS circular buffer destination address update control bit        determines which part of the 32 bit destination address register remains        unchanged and is not updated after a DMA move operation. CBLD determines the size of the circular destination buffer.</description>
								<lsb>12</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SHCT</name>
								<description>Shadow Control   SHCT. DMA channel TCS shadow control determines the function of the shadow        address register.</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SCBE</name>
								<description>Source Circular Buffer Enable   SCBE. DMA channel TCS source circular buffer enable.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>DCBE</name>
								<description>Destination Circular Buffer Enable   DCBE. DMA channel TCS destination circular buffer enable.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>STAMP</name>
								<description>Time Stamp   STAMP. DMA channel TCS control bit to enable the appendage of a timestamp after        the end of the last DMA Move during a DMA transaction.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WRPSE</name>
								<description>Wrap Source Enable   WRPSE. DMA channel TCS source buffer interrupt trigger enable disable.</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>WRPDE</name>
								<description>Wrap Destination Enable   WRPDE. DMA channel TCS destination buffer interrupt trigger enable disable.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>INTCT</name>
								<description>Interrupt Control   INTCT. DMA channel TCS interrupt control. If DMA channel CHCFGR.PRSEL   1 B for          the next lower priority channel then the channel transfer trigger          interrupt is disabled.</description>
								<lsb>26</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>IRDV</name>
								<description>Interrupt Raise Detect Value   IRDV. DMA channel TCS interrupt threshold value defines the Threshold Limit of        CHSR.TCOUNT for which a channel interrupt trigger will be raised.</description>
								<lsb>28</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CHCFGRc</name>
						<description>DMARAM Channel 000 Configuration Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>20</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TREL</name>
								<description>Transfer Reload Value   TREL. DMA channel TCS transfer reload value to control the number of DMA        transfers in a DMA transaction. The 14 bit transfer count value is        loaded into ME CHSR.TCOUNT at the start of a DMA transaction  when        TSR.CH becomes set and CHSR.TCOUNT  160    160 0 . A write to CHCFGR.TREL during a        running DMA transaction has no influence on the running DMA transaction. If CHCFGR.TREL  160    160 0 or if CHCFGR.TREL  160    160 1 then ME CHSR.TCOUNT will be        loaded with 1 when a new DMA transaction is started  at least one DMA        transfer must be executed per DMA transaction .</description>
								<lsb>0</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BLKM</name>
								<description>Block Mode   BLKM. Defines the number of DMA moves executed during one DMA transfer.</description>
								<lsb>16</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RROAT</name>
								<description>Reset Request Only After Transaction   RROAT. DMA channel control bit to determine if the DMA request state flag  DMA        channel TSR.CH  is reset after each DMA transfer.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CHMODE</name>
								<description>Channel Operation Mode   CHMODE. DMA channel TCS control to determine TSR.HTRE reset condition.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
								<enumeratedValues>
									<enumeratedValue>
										<name>Single_Mode0</name>
										<description>0 Single Mode is        selected for DMA channel. After a DMA transaction  DMA channel is        disabled for further hardware requests  TSR.HTRE is reset by hardware         TSR.HTRE must be set again by software for starting a new transaction.</description>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>Continuous_Mode1</name>
										<description>1 Continuous Mode is        selected for DMA channel. After a DMA transaction  bit TSR.HTRE remains        set.</description>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>CHDW</name>
								<description>Channel Data Width   CHDW. DMA channel TCS data width for DMA read moves and DMA write moves.</description>
								<lsb>21</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PATSEL</name>
								<description>Pattern Select   PATSEL. DMA channel TCS bit field to select the pattern detection operation  see        Functional Description . If PATSEL 1 0  is not equal to 00 B then a ME pattern detection operation defined by the channel data width         CHDW  will be performed. PATSEL 2  selects the pattern read register.        If a pattern match is detected then a DMA channel interrupt shall be        triggered.</description>
								<lsb>24</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SWAP</name>
								<description>Swap Data CRC Byte Order   SWAP. DMA channel TCS swap data CRC byte order.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PRSEL</name>
								<description>Peripheral Request Select   PRSEL. DMA channel TCS control bit field to select the source of a DMA request.</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>SHADRc</name>
						<description>DMARAM Channel 000 Shadow Address Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>24</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SHADR</name>
								<description>Shadowed Address   SHADR. 32 bit shadow address.</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
