J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>CHCSRc</name>
						<description>DMARAM Channel 000 Control and Status Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>28</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TCOUNT</name>
								<description>Transfer Count   TCOUNT. DMA channel status transfer count updated after DMARAM write back.</description>
								<lsb>0</lsb>
								<msb>13</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>LXO</name>
								<description>Old Value of Pattern Detection   LXO. DMA channel status bit to store the result of a pattern detection        operation when 8 bit or 16 bit data width is selected.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>WRPS</name>
								<description>Wrap Source Buffer   WRPS. Status bit indicates that a DMA channel has reached a wrap source buffer        boundary. Bit is reset by software  DMA channel CHCSR.CWRP   1 B or DMA channel reset TSR.RST   1 B  .</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>WRPD</name>
								<description>Wrap Destination Buffer   WRPD. Status bit indicates that a DMA channel has reached a wrap destination        buffer boundary. Bit is reset by software  DMA channel CHCSR.CWRP   1 B or DMA channel reset TSR.RST   1 B  .</description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ICH</name>
								<description>Interrupt from Channel   ICH. As soon as ME CHSR.TCOUNT decrements  if ADICR.INTCT 0    0 and        CHSR.COUNT   IRDV then ME CHSR.ICH is set else ME CHSR.ICH is set for        each decrement of CSR.TCOUNT. Bit is reset by software  DMA channel        CHCSR.CICH   1 B or by a DMA channel reset TSR.RST   1 B  .</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>IPM</name>
								<description>Pattern Detection from Channel   IPM. Status bit indicates that a pattern match has been detected for the DMA        channel when pattern detection is enabled. This bit is reset by software         DMA channel CHCSR.CICH   1 B or DMA channel reset TSR.RST   1 B  .</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>BUFFER</name>
								<description>DMA Double Buffering Active Buffer   BUFFER. During a DMA double buffering operation  the status bit indicates which        buffer is read or filled.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>FROZEN</name>
								<description>DMA Double Buffering Frozen Buffer   FROZEN. If a DMA channel is configured for double buffering operation  the        FROZEN bit indicates that one of the buffers is frozen and available for        processing by a cyclic software task. FROZEN bit shall only be set by the DMA and shall only be cleared by          software.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SWB</name>
								<description>DMA Double Buffering Switch Buffer   SWB. When DMA double buffering is configured  the control bit is used to        re direct data from one buffer to the other buffer. If a DMALL  ACCLL  SAFLL or CONLL operation is configured then SWB          shall be 0 B .</description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>CWRP</name>
								<description>Clear Wrap Buffer Interrupt   CWRP. Software clear of the DMA channel source and destination wrap buffer        flags stored at CHCSR.WRPS and CHCSR.WRPD. If the DMA channel is active        in a ME then clear ME bit fields CHSR.WRPS and CHSR.WRPD. Reading this        bit returns a 0.</description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>CICH</name>
								<description>Clear Interrupt for DMA Channel   CICH. Software clear of the DMA channel flags stored at CHCSR.ICH and        CHCSR.IPM. If the DMA channel is active in a ME then clear ME bit fields        CHSR.ICH and CHSR.IPM. Reading this bit returns a 0.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>SIT</name>
								<description>Set Interrupt Trigger for DMA Channel   SIT. Reading this bit returns a 0. If a DMALL  ACCLL  SAFLL or CONLL operation is configured then SIT          must be 0 B .</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>SCH</name>
								<description>Set Transaction Request   SCH. Reading this bit returns a 0.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>write-only</access>
							</field>
						</fields>
					</register>
				</cluster>
				<register>
					<name>CLC</name>
					<description>DMA Clock Control Register
 resetvalue={Application Reset:0x08}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>8</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit   DISR. Used for enable disable control of the DMA</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit   DISS. Bit indicates the current status of the DMA</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EDIS</name>
							<description>Sleep Mode Enable Control   EDIS. Used for DMA sleep mode control.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>DMA Identification Register
 resetvalue={Application Reset:0x087C000}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>8896512</resetValue>
					<resetMask>4294967040</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision Number   MOD REV. This bit field defines the module revision number. See DMA Design Specification for MOD REV value.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type   MOD TYPE. The bit field is set to C0 H which        defines the module as a 32 bit module.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number Value   MOD NUMBER. This bit field defines a module identification number.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EER0</name>
					<description>ME 1 Enable Error Register
 resetvalue={Application Reset:0x4030000}</description>
					<addressOffset>288</addressOffset>
					<size>32</size>
					<resetValue>67305472</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ESER</name>
							<description>Enable ME Source Error   ESER. This bit enables the generation of a ME source error interrupt.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EDER</name>
							<description>Enable ME Destination Error   EDER. This bit enables the generation of a ME destination error interrupt.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ELER</name>
							<description>Enable ME DMA Linked List Error   ELER. This bit enables the generation of a ME DMA Linked List error interrupt.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRSR0</name>
					<description>ME 1 Error Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>292</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LEC</name>
							<description>ME Last Error Channel   LEC. This bit field indicates the DMA channel number of the last DMA channel        of ME generating an error i.e. RAM error DMA ERRSRm.RAMER  Safe Linked        List error DMA ERRSRm.SLLER  DMA Linked List error DMA ERRSRm.DLLER and        all on  160 chip  160 bus errors.</description>
							<lsb>0</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SER</name>
							<description>ME Source Error   SER. This bit is set whenever a ME error occurred during a source  read  move        of a DMA transfer  or a request could not been serviced due to the        access protection.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DER</name>
							<description>ME Destination Error   DER. This bit is set whenever a ME error occurred during a destination         write  move of a DMA transfer  or a request could not been serviced due        to the access protection.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SPBER</name>
							<description>ME SPB Bus Error   SPBER. This bit is set when a ME DMA Move that has been started by the DMA SPB        master interface leads to an error on the SPB  160 Bus.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SRIER</name>
							<description>ME SRI Bus Error   SRIER. This bit is set when a ME DMA Move that has been started by the DMA SRI        master interface leads to an error on the SRI  160 Bus.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RAMER</name>
							<description>ME RAM Error   RAMER. This bit is set whenever a ME error occurred during the loading of a TCS        from the DMARAM to the ME channel registers.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SLLER</name>
							<description>ME Safe Linked List Error   SLLER. This bit is set when a ME error occurred during the comparison of a        SDCRC checksums during a safe linked list.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DLLER</name>
							<description>ME DMA Linked List Error   DLLER. This bit is set when a ME error occurred during a DMALL  ACCLL  SAFLL or        CONLL operation when a new TCS is loaded from anywhere in memory to        overwrite the current TCS stored in the DMARAM.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CLRE0</name>
					<description>ME 1 Clear Error Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>296</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CSER</name>
							<description>Clear ME Source Error   CSER</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CDER</name>
							<description>Clear ME Destination Error   CDER</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CSPBER</name>
							<description>Clear SPB Error   CSPBER</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CSRIER</name>
							<description>Clear SRI Error   CSRIER</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRAMER</name>
							<description>Clear RAM Error   CRAMER</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CSLLER</name>
							<description>Clear SLL Error   CSLLER</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CDLLER</name>
							<description>Clear DLL Error   CDLLER</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME0SR</name>
					<description>ME 1 Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>304</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RS</name>
							<description>ME Read Status   RS</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>WS</name>
							<description>ME Write Status   WS</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH</name>
							<description>ME Active Channel   CH. Indicates the number of the DMA Channel currently processed by the ME.</description>
							<lsb>16</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME00R</name>
					<description>ME 1 Read Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>320</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RD00</name>
							<description>DMA Read Move Data Byte   RD00</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD01</name>
							<description>DMA Read Move Data Byte   RD01</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD02</name>
							<description>DMA Read Move Data Byte   RD02</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD03</name>
							<description>DMA Read Move Data Byte   RD03</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME01R</name>
					<description>ME 1 Read Register 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>324</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RD10</name>
							<description>DMA Read Move Data Byte   RD10</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD11</name>
							<description>DMA Read Move Data Byte   RD11</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD12</name>
							<description>DMA Read Move Data Byte   RD12</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD13</name>
							<description>DMA Read Move Data Byte   RD13</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME02R</name>
					<description>ME 1 Read Register 2
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>328</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RD20</name>
							<description>DMA Read Move Data Byte   RD20</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD21</name>
							<description>DMA Read Move Data Byte   RD21</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD22</name>
							<description>DMA Read Move Data Byte   RD22</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD23</name>
							<description>DMA Read Move Data Byte   RD23</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME03R</name>
					<description>ME 1 Read Register 3
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>332</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RD30</name>
							<description>DMA Read Move Data Byte   RD30</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD31</name>
							<description>DMA Read Move Data Byte   RD31</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD32</name>
							<description>DMA Read Move Data Byte   RD32</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD33</name>
							<description>DMA Read Move Data Byte   RD33</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME04R</name>
					<description>ME 1 Read Register 4
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>336</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RD40</name>
							<description>DMA Read Move Data Byte   RD40</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD41</name>
							<description>DMA Read Move Data Byte   RD41</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD42</name>
							<description>DMA Read Move Data Byte   RD42</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD43</name>
							<description>DMA Read Move Data Byte   RD43</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME05R</name>
					<description>ME 1 Read Register 5
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>340</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RD50</name>
							<description>DMA Read Move Data Byte   RD50</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD51</name>
							<description>DMA Read Move Data Byte   RD51</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD52</name>
							<description>DMA Read Move Data Byte   RD52</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD53</name>
							<description>DMA Read Move Data Byte   RD53</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME06R</name>
					<description>ME 1 Read Register 6
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>344</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RD60</name>
							<description>DMA Read Move Data Byte   RD60</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD61</name>
							<description>DMA Read Move Data Byte   RD61</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD62</name>
							<description>DMA Read Move Data Byte   RD62</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD63</name>
							<description>DMA Read Move Data Byte   RD63</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME07R</name>
					<description>ME 1 Read Register 7
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>348</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RD70</name>
							<description>DMA Read Move Data Byte   RD70</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD71</name>
							<description>DMA Read Move Data Byte   RD71</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD72</name>
							<description>DMA Read Move Data Byte   RD72</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD73</name>
							<description>DMA Read Move Data Byte   RD73</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME0RDCRC</name>
					<description>ME 1 Channel Read Data CRC Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>384</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RDCRC</name>
							<description>Read Data CRC   RDCRC. Active DMA channel read data CRC32 ethernet polynomial checksum.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
