J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>ME0SDCRC</name>
					<description>ME 1 Channel Source and Destination Address CRC Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>388</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SDCRC</name>
							<description>Source and Destination Address CRC   SDCRC. Active DMA channel source and destination address CRC32 ethernet polynomial checksum.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME0SADR</name>
					<description>ME 1 Channel Source Address Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>392</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SADR</name>
							<description>Source Address   SADR. Active DMA channel 32 bit source address used for DMA read moves.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME0DADR</name>
					<description>ME 1 Channel Destination Address Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>396</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DADR</name>
							<description>Destination Address   DADR. Active DMA channel 32 bit destination address used for DMA write moves.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME0ADICR</name>
					<description>ME 1 Channel Address and Interrupt Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>400</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SMF</name>
							<description>Source Address Modification Factor   SMF. Active DMA channel source address modification factor.</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>INCS</name>
							<description>Increment of Source Address   INCS. Active DMA channel increment of source address control.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DMF</name>
							<description>Destination Address Modification Factor   DMF. Active DMA channel destination address modification factor.</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>INCD</name>
							<description>Increment of Destination Address   INCD. Active DMA channel increment of destination address control.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CBLS</name>
							<description>Circular Buffer Length Source   CBLS. Active DMA channel circular source buffer control.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CBLD</name>
							<description>Circular Buffer Length Destination   CBLD. Active DMA channel circular destination buffer control.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SHCT</name>
							<description>Shadow Control   SHCT. Active DMA channel control of shadow address register function.</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SCBE</name>
							<description>Source Circular Buffer Enable   SCBE. Active DMA channel circular source buffer enable disable.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DCBE</name>
							<description>Destination Circular Buffer Enable   DCBE. Active DMA channel circular destination buffer enable disable.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>STAMP</name>
							<description>Time Stamp   STAMP. Active DMA channel control to enable the appendage of a timestamp after        the end of the last DMA Move during a DMA transaction.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>WRPSE</name>
							<description>Wrap Source Enable   WRPSE. Active DMA channel source buffer interrupt trigger enable disable.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>WRPDE</name>
							<description>Wrap Destination Enable   WRPDE. Active DMA channel destination buffer interrupt trigger enable disable.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>INTCT</name>
							<description>Interrupt Control   INTCT. Active DMA channel interrupt service request control.</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IRDV</name>
							<description>Interrupt Raise Detect Value   IRDV. Active DMA channel control of the Threshold Limit of of DMA channel        CHSR.TCOUNT for triggering a channel interrupt service request.</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME0CHCR</name>
					<description>ME 1 Channel Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>404</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TREL</name>
							<description>Transfer Reload Value   TREL. Active DMA channel Transfer Reload Value.</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>BLKM</name>
							<description>Block Mode   BLKM. Active DMA channel Block Mode.</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RROAT</name>
							<description>Reset Request Only After Transaction   RROAT. Active DMA channel Reset Request Only After Transaction.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CHMODE</name>
							<description>Channel Operation Mode   CHMODE. Active DMA channel Channel Operation Mode.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CHDW</name>
							<description>Channel Data Width   CHDW. Active DMA channel DMA move Channel Data Width.</description>
							<lsb>21</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PATSEL</name>
							<description>Pattern Select   PATSEL. Active DMA channel Pattern Select control.</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SWAP</name>
							<description>Swap Data CRC byte order   SWAP. Active DMA channel swap data CRC byte order.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PRSEL</name>
							<description>Peripheral Request Select   PRSEL. Active DMA channel Peripheral Request Select.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME0SHADR</name>
					<description>ME 1 Channel Shadow Address Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>408</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SHADR</name>
							<description>Shadowed Address   SHADR. This bit field holds the 32 bit shadow address of the active DMA        channel. The function of the shadow address is set by the shadow control        settings.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME0CHSR</name>
					<description>ME 1 Channel Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>412</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TCOUNT</name>
							<description>Transfer Count Status   TCOUNT. Active DMA channel count of the number of DMA transfers. TCOUNT is        loaded with the DMA channel value of CHCFGR.TREL when TSR.CH becomes set         and TCOUNT  160    160 0 . After each DMA transfer  TCOUNT is decremented by 1.</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LXO</name>
							<description>Old Value of Pattern Detection   LXO. Active DMA channel compare result of a pattern compare operation when        8 bit or 16 bit data width is selected.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>WRPS</name>
							<description>Wrap Source Buffer   WRPS. Active DMA channel Wrap Source Buffer status bit.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>WRPD</name>
							<description>Wrap Destination Buffer   WRPD. Active DMA channel Wrap Destination Buffer status bit.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ICH</name>
							<description>Interrupt from Channel   ICH. Active DMA channel detection of channel interrupt service request.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPM</name>
							<description>Pattern Detection from Channel   IPM. Active DMA channel detection of pattern match interrupt service request.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>BUFFER</name>
							<description>DMA Double Buffering Active Buffer   BUFFER. Active DMA channel DMA Double Buffering Active Buffer status bit.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FROZEN</name>
							<description>DMA Double Buffering Frozen Buffer   FROZEN. Active DMA channel DMA Double Buffering Frozen Buffer status bit.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EER1</name>
					<description>ME 1 Enable Error Register
 resetvalue={Application Reset:0x4030000}</description>
					<addressOffset>4384</addressOffset>
					<size>32</size>
					<resetValue>67305472</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ESER</name>
							<description>Enable ME Source Error   ESER. This bit enables the generation of a ME source error interrupt.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EDER</name>
							<description>Enable ME Destination Error   EDER. This bit enables the generation of a ME destination error interrupt.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ELER</name>
							<description>Enable ME DMA Linked List Error   ELER. This bit enables the generation of a ME DMA Linked List error interrupt.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRSR1</name>
					<description>ME 1 Error Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4388</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LEC</name>
							<description>ME Last Error Channel   LEC. This bit field indicates the DMA channel number of the last DMA channel        of ME generating an error i.e. RAM error DMA ERRSRm.RAMER  Safe Linked        List error DMA ERRSRm.SLLER  DMA Linked List error DMA ERRSRm.DLLER and        all on  160 chip  160 bus errors.</description>
							<lsb>0</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SER</name>
							<description>ME Source Error   SER. This bit is set whenever a ME error occurred during a source  read  move        of a DMA transfer  or a request could not been serviced due to the        access protection.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DER</name>
							<description>ME Destination Error   DER. This bit is set whenever a ME error occurred during a destination         write  move of a DMA transfer  or a request could not been serviced due        to the access protection.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SPBER</name>
							<description>ME SPB Bus Error   SPBER. This bit is set when a ME DMA Move that has been started by the DMA SPB        master interface leads to an error on the SPB  160 Bus.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SRIER</name>
							<description>ME SRI Bus Error   SRIER. This bit is set when a ME DMA Move that has been started by the DMA SRI        master interface leads to an error on the SRI  160 Bus.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RAMER</name>
							<description>ME RAM Error   RAMER. This bit is set whenever a ME error occurred during the loading of a TCS        from the DMARAM to the ME channel registers.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SLLER</name>
							<description>ME Safe Linked List Error   SLLER. This bit is set when a ME error occurred during the comparison of a        SDCRC checksums during a safe linked list.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DLLER</name>
							<description>ME DMA Linked List Error   DLLER. This bit is set when a ME error occurred during a DMALL  ACCLL  SAFLL or        CONLL operation when a new TCS is loaded from anywhere in memory to        overwrite the current TCS stored in the DMARAM.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CLRE1</name>
					<description>ME 1 Clear Error Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4392</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CSER</name>
							<description>Clear ME Source Error   CSER</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CDER</name>
							<description>Clear ME Destination Error   CDER</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CSPBER</name>
							<description>Clear SPB Error   CSPBER</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CSRIER</name>
							<description>Clear SRI Error   CSRIER</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CRAMER</name>
							<description>Clear RAM Error   CRAMER</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CSLLER</name>
							<description>Clear SLL Error   CSLLER</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CDLLER</name>
							<description>Clear DLL Error   CDLLER</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME1SR</name>
					<description>ME 1 Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4400</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RS</name>
							<description>ME Read Status   RS</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>WS</name>
							<description>ME Write Status   WS</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH</name>
							<description>ME Active Channel   CH. Indicates the number of the DMA Channel currently processed by the ME.</description>
							<lsb>16</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME10R</name>
					<description>ME 1 Read Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4416</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RD00</name>
							<description>DMA Read Move Data Byte   RD00</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD01</name>
							<description>DMA Read Move Data Byte   RD01</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD02</name>
							<description>DMA Read Move Data Byte   RD02</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD03</name>
							<description>DMA Read Move Data Byte   RD03</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME11R</name>
					<description>ME 1 Read Register 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4420</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RD10</name>
							<description>DMA Read Move Data Byte   RD10</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD11</name>
							<description>DMA Read Move Data Byte   RD11</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD12</name>
							<description>DMA Read Move Data Byte   RD12</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD13</name>
							<description>DMA Read Move Data Byte   RD13</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME12R</name>
					<description>ME 1 Read Register 2
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4424</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RD20</name>
							<description>DMA Read Move Data Byte   RD20</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD21</name>
							<description>DMA Read Move Data Byte   RD21</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD22</name>
							<description>DMA Read Move Data Byte   RD22</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD23</name>
							<description>DMA Read Move Data Byte   RD23</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME13R</name>
					<description>ME 1 Read Register 3
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4428</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RD30</name>
							<description>DMA Read Move Data Byte   RD30</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD31</name>
							<description>DMA Read Move Data Byte   RD31</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD32</name>
							<description>DMA Read Move Data Byte   RD32</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD33</name>
							<description>DMA Read Move Data Byte   RD33</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME14R</name>
					<description>ME 1 Read Register 4
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4432</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RD40</name>
							<description>DMA Read Move Data Byte   RD40</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD41</name>
							<description>DMA Read Move Data Byte   RD41</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD42</name>
							<description>DMA Read Move Data Byte   RD42</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD43</name>
							<description>DMA Read Move Data Byte   RD43</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
