J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>ME15R</name>
					<description>ME 1 Read Register 5
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4436</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RD50</name>
							<description>DMA Read Move Data Byte   RD50</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD51</name>
							<description>DMA Read Move Data Byte   RD51</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD52</name>
							<description>DMA Read Move Data Byte   RD52</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD53</name>
							<description>DMA Read Move Data Byte   RD53</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME16R</name>
					<description>ME 1 Read Register 6
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4440</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RD60</name>
							<description>DMA Read Move Data Byte   RD60</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD61</name>
							<description>DMA Read Move Data Byte   RD61</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD62</name>
							<description>DMA Read Move Data Byte   RD62</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD63</name>
							<description>DMA Read Move Data Byte   RD63</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME17R</name>
					<description>ME 1 Read Register 7
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4444</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RD70</name>
							<description>DMA Read Move Data Byte   RD70</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD71</name>
							<description>DMA Read Move Data Byte   RD71</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD72</name>
							<description>DMA Read Move Data Byte   RD72</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RD73</name>
							<description>DMA Read Move Data Byte   RD73</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME1RDCRC</name>
					<description>ME 1 Channel Read Data CRC Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4480</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RDCRC</name>
							<description>Read Data CRC   RDCRC. Active DMA channel read data CRC32 ethernet polynomial checksum.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME1SDCRC</name>
					<description>ME 1 Channel Source and Destination Address CRC Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4484</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SDCRC</name>
							<description>Source and Destination Address CRC   SDCRC. Active DMA channel source and destination address CRC32 ethernet polynomial checksum.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME1SADR</name>
					<description>ME 1 Channel Source Address Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4488</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SADR</name>
							<description>Source Address   SADR. Active DMA channel 32 bit source address used for DMA read moves.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME1DADR</name>
					<description>ME 1 Channel Destination Address Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4492</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DADR</name>
							<description>Destination Address   DADR. Active DMA channel 32 bit destination address used for DMA write moves.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME1ADICR</name>
					<description>ME 1 Channel Address and Interrupt Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4496</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SMF</name>
							<description>Source Address Modification Factor   SMF. Active DMA channel source address modification factor.</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>INCS</name>
							<description>Increment of Source Address   INCS. Active DMA channel increment of source address control.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DMF</name>
							<description>Destination Address Modification Factor   DMF. Active DMA channel destination address modification factor.</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>INCD</name>
							<description>Increment of Destination Address   INCD. Active DMA channel increment of destination address control.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CBLS</name>
							<description>Circular Buffer Length Source   CBLS. Active DMA channel circular source buffer control.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CBLD</name>
							<description>Circular Buffer Length Destination   CBLD. Active DMA channel circular destination buffer control.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SHCT</name>
							<description>Shadow Control   SHCT. Active DMA channel control of shadow address register function.</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SCBE</name>
							<description>Source Circular Buffer Enable   SCBE. Active DMA channel circular source buffer enable disable.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DCBE</name>
							<description>Destination Circular Buffer Enable   DCBE. Active DMA channel circular destination buffer enable disable.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>STAMP</name>
							<description>Time Stamp   STAMP. Active DMA channel control to enable the appendage of a timestamp after        the end of the last DMA Move during a DMA transaction.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>WRPSE</name>
							<description>Wrap Source Enable   WRPSE. Active DMA channel source buffer interrupt trigger enable disable.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>WRPDE</name>
							<description>Wrap Destination Enable   WRPDE. Active DMA channel destination buffer interrupt trigger enable disable.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>INTCT</name>
							<description>Interrupt Control   INTCT. Active DMA channel interrupt service request control.</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IRDV</name>
							<description>Interrupt Raise Detect Value   IRDV. Active DMA channel control of the Threshold Limit of of DMA channel        CHSR.TCOUNT for triggering a channel interrupt service request.</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME1CHCR</name>
					<description>ME 1 Channel Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4500</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TREL</name>
							<description>Transfer Reload Value   TREL. Active DMA channel Transfer Reload Value.</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>BLKM</name>
							<description>Block Mode   BLKM. Active DMA channel Block Mode.</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RROAT</name>
							<description>Reset Request Only After Transaction   RROAT. Active DMA channel Reset Request Only After Transaction.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CHMODE</name>
							<description>Channel Operation Mode   CHMODE. Active DMA channel Channel Operation Mode.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CHDW</name>
							<description>Channel Data Width   CHDW. Active DMA channel DMA move Channel Data Width.</description>
							<lsb>21</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PATSEL</name>
							<description>Pattern Select   PATSEL. Active DMA channel Pattern Select control.</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SWAP</name>
							<description>Swap Data CRC byte order   SWAP. Active DMA channel swap data CRC byte order.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PRSEL</name>
							<description>Peripheral Request Select   PRSEL. Active DMA channel Peripheral Request Select.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME1SHADR</name>
					<description>ME 1 Channel Shadow Address Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4504</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SHADR</name>
							<description>Shadowed Address   SHADR. This bit field holds the 32 bit shadow address of the active DMA        channel. The function of the shadow address is set by the shadow control        settings.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ME1CHSR</name>
					<description>ME 1 Channel Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4508</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TCOUNT</name>
							<description>Transfer Count Status   TCOUNT. Active DMA channel count of the number of DMA transfers. TCOUNT is        loaded with the DMA channel value of CHCFGR.TREL when TSR.CH becomes set         and TCOUNT  160    160 0 . After each DMA transfer  TCOUNT is decremented by 1.</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LXO</name>
							<description>Old Value of Pattern Detection   LXO. Active DMA channel compare result of a pattern compare operation when        8 bit or 16 bit data width is selected.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>WRPS</name>
							<description>Wrap Source Buffer   WRPS. Active DMA channel Wrap Source Buffer status bit.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>WRPD</name>
							<description>Wrap Destination Buffer   WRPD. Active DMA channel Wrap Destination Buffer status bit.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ICH</name>
							<description>Interrupt from Channel   ICH. Active DMA channel detection of channel interrupt service request.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IPM</name>
							<description>Pattern Detection from Channel   IPM. Active DMA channel detection of pattern match interrupt service request.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>BUFFER</name>
							<description>DMA Double Buffering Active Buffer   BUFFER. Active DMA channel DMA Double Buffering Active Buffer status bit.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FROZEN</name>
							<description>DMA Double Buffering Frozen Buffer   FROZEN. Active DMA channel DMA Double Buffering Frozen Buffer status bit.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OTSS</name>
					<description>DMA OCDS Trigger Set Select
 resetvalue={PowerOn Reset:0x0,Debug Reset:0x0}</description>
					<addressOffset>4608</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TGS</name>
							<description>Trigger Set for OTGB0 or OTGB1   TGS</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BS</name>
							<description>OTGB0 or OTGB1 Bus Select   BS</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRR0</name>
					<description>DMA Pattern Read Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4616</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PAT00</name>
							<description>Pattern Data Byte   PAT00</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PAT01</name>
							<description>Pattern Data Byte   PAT01</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PAT02</name>
							<description>Pattern Data Byte   PAT02</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PAT03</name>
							<description>Pattern Data Byte   PAT03</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRR1</name>
					<description>DMA Pattern Read Register 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4620</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PAT10</name>
							<description>Pattern Data Byte   PAT10</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PAT11</name>
							<description>Pattern Data Byte   PAT11</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PAT12</name>
							<description>Pattern Data Byte   PAT12</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PAT13</name>
							<description>Pattern Data Byte   PAT13</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TIME</name>
					<description>DMA Time Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4624</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>COUNT</name>
							<description>Timestamp Count   COUNT. The count value used during the appendage of DMA timestamps.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>4</dimIncrement>
					<name>MODEr[%s]</name>
					<description>RP 0 Mode Register
 resetvalue={Application Reset:0x1}</description>
					<addressOffset>4864</addressOffset>
					<size>32</size>
					<resetValue>1</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MODE</name>
							<description>Resource Partition Supervisor Mode   MODE</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>4</dimIncrement>
					<name>ERRINTRr[%s]</name>
					<description>RP 0 Error Interrupt Set Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4896</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SIT</name>
							<description>Set Error Interrupt Service Request   SIT. Reading this bit returns a 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>128</dim>
					<dimIncrement>4</dimIncrement>
					<name>HRRc[%s]</name>
					<description>DMA Channel 000 Resource Partition Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>6144</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition   HRP</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>128</dim>
					<dimIncrement>4</dimIncrement>
					<name>SUSENRc[%s]</name>
					<description>DMA Channel 000 Suspend Enable Register
 resetvalue={PowerOn Reset:0x0,Debug Reset:0x0}</description>
					<addressOffset>6656</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel   SUSEN. Enables the DMA channel suspend capability. Channel suspend mode shall        be terminated when SUSEN is written with 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>128</dim>
					<dimIncrement>4</dimIncrement>
					<name>SUSACRc[%s]</name>
					<description>DMA Channel 000 Suspend Acknowledge Register
 resetvalue={PowerOn Reset:0x0,Debug Reset:0x0}</description>
					<addressOffset>7168</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel   SUSAC. Status bit indicates whether or not a DMA channel is in channel suspend        state or in the frozen state.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
