J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<dim>128</dim>
					<dimIncrement>4</dimIncrement>
					<name>TSRc[%s]</name>
					<description>DMA Channel 000 Transaction State Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>7680</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>DMA Channel Reset   RST. The DMA channel reset bit is set by software  DMA channel TSR.RST   1         and cleared by hardware when the DMA channel has been reset.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HTRE</name>
							<description>DMA Channel Hardware Request Enable   HTRE    . See Functional Description for enable and disable. When a DMA channel          is configured for single mode  HTRE is reset when ME CHSR.TCOUNT is          decremented and ME CHSR.TCOUNT   0. When a DMA channel error is          reported or a pattern match is detected  DMA channel HTRE is reset.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRL</name>
							<description>DMA Channel Transaction Transfer Request Lost   TRL. This bit is reset by software clearing TRL  writing DMA channel TSR.CTL          1  or resetting the DMA channel  writing DMA channel TSR.RST  160    160 1 .</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH</name>
							<description>DMA Channel Transaction Request State   CH. CH is reset when a pattern match is detected.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ETRL</name>
							<description>Enable DMA Channel Transaction Transfer Request Lost Interrupt   ETRL. DMA channel control bit to enable the generation of an error interrupt        service request when DMA channel TSR.TRL is set.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTREQ</name>
							<description>DMA Channel Halt Request   HLTREQ. The DMA channel halt request bit is set by software  writing DMA channel        TSR.HLTREQ   1  and cleared by software  writing DMA channel TSR.HLTCLR          1 .</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTACK</name>
							<description>DMA Channel Halt Acknowledge   HLTACK</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ECH</name>
							<description>Enable DMA Channel Hardware Transaction Request   ECH. See Functional Description. Reading this bit returns a 0.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>DCH</name>
							<description>Disable DMA Channel Hardware Transaction Request   DCH. See Functional Description. Reading this bit returns a 0.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CTL</name>
							<description>Clear DMA Channel Transaction Transfer Request Lost   CTL. Software clear of the DMA channel TRL status flag. Reading this bit returns a 0.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>HLTCLR</name>
							<description>Clear DMA Channel Halt Request and Acknowledge   HLTCLR. Reading this bit returns a 0.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>CBS</name>
			<version>100</version>
			<description>CBS</description>
			<baseAddress>4026532864</baseAddress>
			<addressBlock>
				<offset>8</offset>
				<size>504</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<cluster>
					<dim>2</dim>
					<dimIncrement>8</dimIncrement>
					<name>TRTGB[%s]</name>
					<description>TRTGB</description>
					<addressOffset>224</addressOffset>
					<register>
						<name>TRTGBiL</name>
						<description>TG Routing for OTGBi Bits  7 0 
 resetvalue={Debug Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TG0</name>
								<description>OTGBi Bit 7 to Trigger Line Routing   TG7</description>
								<lsb>0</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TG1</name>
								<description>OTGBi Bit 7 to Trigger Line Routing   TG7</description>
								<lsb>4</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TG2</name>
								<description>OTGBi Bit 7 to Trigger Line Routing   TG7</description>
								<lsb>8</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TG3</name>
								<description>OTGBi Bit 7 to Trigger Line Routing   TG7</description>
								<lsb>12</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TG4</name>
								<description>OTGBi Bit 7 to Trigger Line Routing   TG7</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TG5</name>
								<description>OTGBi Bit 7 to Trigger Line Routing   TG7</description>
								<lsb>20</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TG6</name>
								<description>OTGBi Bit 7 to Trigger Line Routing   TG7</description>
								<lsb>24</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TG7</name>
								<description>OTGBi Bit 7 to Trigger Line Routing   TG7</description>
								<lsb>28</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TRTGBiH</name>
						<description>TG Routing for OTGBi Bits  15 8 
 resetvalue={Debug Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TG8</name>
								<description>OTGBi Bit 15 to Trigger Line Routing   TG15</description>
								<lsb>0</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TG9</name>
								<description>OTGBi Bit 15 to Trigger Line Routing   TG15</description>
								<lsb>4</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TG10</name>
								<description>OTGBi Bit 15 to Trigger Line Routing   TG15</description>
								<lsb>8</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TG11</name>
								<description>OTGBi Bit 15 to Trigger Line Routing   TG15</description>
								<lsb>12</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TG12</name>
								<description>OTGBi Bit 15 to Trigger Line Routing   TG15</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TG13</name>
								<description>OTGBi Bit 15 to Trigger Line Routing   TG15</description>
								<lsb>20</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TG14</name>
								<description>OTGBi Bit 15 to Trigger Line Routing   TG15</description>
								<lsb>24</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TG15</name>
								<description>OTGBi Bit 15 to Trigger Line Routing   TG15</description>
								<lsb>28</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
				<register>
					<name>JDPID</name>
					<description>Module Identification Register
 resetvalue={PowerOn Reset:0x6360,Application Reset:0x0,Debug Reset:0x0,IOClient Reset:0x0}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision   MOD REV. This bit field indicates the revision number of the module implementation. It is just CROSSREFERENCE  7 0 .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type   MOD TYPE</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number   MOD NUMBER</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OIFM</name>
					<description>OCDS Interface Mode Register
 resetvalue={PowerOn Reset:0x0,Application Reset:0x0,Debug Reset:0x0,IOClient Reset:0x0}</description>
					<addressOffset>12</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>DAPMODE</name>
							<description>DAPInterface Mode   DAPMODE. DAPMODE mainly determines the number of pins allocated for the DAP        Interface. The selected mode becomes active with the next received CROSSREFERENCE .        The minimum number of dedicated DAP pins is device specific. If two pins        are dedicated  no SPD  Single Pin DAP  mode is needed offered. Please        request DAP RST in parallel only if it is really needed and intended to force the        selected mode and cut by this an already established tool connection.        The underlying assumption is that the tool user is in control and the        device should not sabotage tool access.</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DAPRST</name>
							<description>DAPProtocol Clear   DAPRST. Synchronous clear for the DAP state machine. See CROSSREFERENCE . Once set this bit is cleared by the hardware as soon as the DAP module has processed the reset request. As this is done with the DAP0 clock the time it takes is not predictable.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>F_JTAG</name>
							<description>Forced JTAG Mode.  dap bypass o </description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>N_JTAG</name>
							<description>No Switch to JTAG.  jtag disable o </description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PADCTL</name>
							<description>Pad Control for Debug Interface Pins.  padctl o  Please consult the Data Sheet for the proper setting relative to the        data rate. Selection valid for DAP and DAPE pads.</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PADCTLI</name>
							<description>Pad input threshold control for Debug Interface Pins. DAP pins always use TTL levels. This bits allows to set correct TTL        levels even for 3.3V supply. Selection valid for DAP and DAPE pads.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TIPR</name>
					<description>TG Input Pins Routing
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>16</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PIN0</name>
							<description>Trigger Pin 7 to Trigger Line Routing</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN1</name>
							<description>Trigger Pin 7 to Trigger Line Routing</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN2</name>
							<description>Trigger Pin 7 to Trigger Line Routing</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN3</name>
							<description>Trigger Pin 7 to Trigger Line Routing</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN4</name>
							<description>Trigger Pin 7 to Trigger Line Routing</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN5</name>
							<description>Trigger Pin 7 to Trigger Line Routing</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN6</name>
							<description>Trigger Pin 7 to Trigger Line Routing</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN7</name>
							<description>Trigger Pin 7 to Trigger Line Routing</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TOPR</name>
					<description>TG Output Pins Routing
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>20</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PIN0</name>
							<description>Trigger Line to Trigger Pin 7 Routing</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN1</name>
							<description>Trigger Line to Trigger Pin 7 Routing</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN2</name>
							<description>Trigger Line to Trigger Pin 7 Routing</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN3</name>
							<description>Trigger Line to Trigger Pin 7 Routing</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN4</name>
							<description>Trigger Line to Trigger Pin 7 Routing</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN5</name>
							<description>Trigger Line to Trigger Pin 7 Routing</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN6</name>
							<description>Trigger Line to Trigger Pin 7 Routing</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN7</name>
							<description>Trigger Line to Trigger Pin 7 Routing</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TOPPS</name>
					<description>TG Output Pins Pulse Stretcher
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>24</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PIN0</name>
							<description>Pulse Stretch Control for Trigger Pin 7   PIN7</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN1</name>
							<description>Pulse Stretch Control for Trigger Pin 7   PIN7</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN2</name>
							<description>Pulse Stretch Control for Trigger Pin 7   PIN7</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN3</name>
							<description>Pulse Stretch Control for Trigger Pin 7   PIN7</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN4</name>
							<description>Pulse Stretch Control for Trigger Pin 7   PIN7</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN5</name>
							<description>Pulse Stretch Control for Trigger Pin 7   PIN7</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN6</name>
							<description>Pulse Stretch Control for Trigger Pin 7   PIN7</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN7</name>
							<description>Pulse Stretch Control for Trigger Pin 7   PIN7</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCIP</name>
					<description>TG Capture for TG Input Pins
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>28</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>P0</name>
							<description>Capture of Trigger Input Pin 7   P7</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P1</name>
							<description>Capture of Trigger Input Pin 7   P7</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P2</name>
							<description>Capture of Trigger Input Pin 7   P7</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P3</name>
							<description>Capture of Trigger Input Pin 7   P7</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P4</name>
							<description>Capture of Trigger Input Pin 7   P7</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P5</name>
							<description>Capture of Trigger Input Pin 7   P7</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P6</name>
							<description>Capture of Trigger Input Pin 7   P7</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>P7</name>
							<description>Capture of Trigger Input Pin 7   P7</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>6</dim>
					<dimIncrement>4</dimIncrement>
					<name>TRCx[%s]</name>
					<description>TG Routing for CPU0
 resetvalue={PowerOn Reset:0x0,Debug Reset:0x2,Debug Reset:0x0,Application Reset:0x0,IOClient Reset:0x0}</description>
					<addressOffset>32</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>HALT</name>
							<description>HALT to Trigger Line Routing   HALT</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BRKOUT</name>
							<description>BRKOUT to Trigger Line Routing   BRKOUT</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BT1</name>
							<description>BRKOUT to Trigger Line 1 Routing   BT1. This option is available independent of the routing with BRKOUT .        The use case is that BRKOUT is  in addition  a source for the suspend        generation with Trigger Line 1.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BRKIN</name>
							<description>Trigger Line to BRKIN Routing   BRKIN</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SUSIN</name>
							<description>Trigger Line to SUSIN Routing   SUSIN. Note  Use TL1ST in case of Trigger Line 1.</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRHSM</name>
					<description>TG Routing for HSMControl
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>56</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>HALT</name>
							<description>HALT to Trigger Line Routing   HALT</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BRKOUT</name>
							<description>BRKOUT to Trigger Line Routing   BRKOUT</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BT1</name>
							<description>BRKOUT to Trigger Line 1 Routing   BT1. BRKOUT signal is used in addition for suspend generation with Trigger Line 1.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BRKIN</name>
							<description>Trigger Line to BRKIN Routing   BRKIN</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SUSIN</name>
							<description>Trigger Line to SUSIN Routing   SUSIN. Note  Use TL1ST in case of Trigger Line 1.</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRMC</name>
					<description>TG Routing for MCDS Control
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>60</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>BRKOUT</name>
							<description>MCDS break out to Trigger Line Routing   BRKOUT</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SUSOUT</name>
							<description>MCDS suspend out to Trigger Line Routing   SUSOUT</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BRKIN</name>
							<description>Trigger Line to MCDS break in Routing   BRKIN</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
