J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>TLCCx[%s]</name>
					<description>TG Line Counter Control
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>64</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TGL</name>
							<description>Trigger Line to Counter Routing   TGL</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LE</name>
							<description>Level or Edge Counting   LE</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLR</name>
							<description>Clear and Enable Counter s    CLR. Clears the counter value and enables a stopped counter. Counter reset state is stopped.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>STOP</name>
							<description>Stop Counter s    STOP</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>TLCVx[%s]</name>
					<description>TG Line Counter Value
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>80</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CV</name>
							<description>Count Value   CV</description>
							<lsb>0</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SO</name>
							<description>Sticky Overflow Bit   SO. This bit is set by hardware when Count Value  30 0  is 0x7FFFFFFF. It is cleared by software like CV with TLCVx.CLR.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRSS</name>
					<description>TG Routing for Special Signals
 resetvalue={Debug Reset:0x0EF0000}</description>
					<addressOffset>96</addressOffset>
					<size>32</size>
					<resetValue>15663104</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TT</name>
							<description>Trigger Line to Cerberus  Triggered Transfer Routing   TT</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IFS</name>
							<description>Trigger Line to Fault and Stress Injection Routing   IFS. This bit field is not availavle in TC39x A Step.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SRC0</name>
							<description>Trigger Line to SRC1 Interrupt Routing   SRC1</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SRC1</name>
							<description>Trigger Line to SRC1 Interrupt Routing   SRC1</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>JTAGID</name>
					<description>JTAGDevice Identification Register
 resetvalue={PowerOn Reset:0x0,CFS Value:0x10207083,Application Reset:0x0,Debug Reset:0x0,IOClient Reset:0x0}</description>
					<addressOffset>100</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>JTAG_ID</name>
							<description>JTAGDevice ID   JTAG ID</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>COMDATA</name>
					<description>Communication Mode Data Register
 resetvalue={PowerOn Reset:0x0,Application Reset:0x0,Debug Reset:0x0,IOClient Reset:0x0}</description>
					<addressOffset>104</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description>Read Write Data   DATA. Data transferred by read write access executed by Cerberus in Communication mode.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IOSR</name>
					<description>IOClientStatus and Control Register
 resetvalue={PowerOn Reset:0x0,Application Reset:0x0,Debug Reset:0x0,IOClient Reset:0x0}</description>
					<addressOffset>108</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>CRSYNC</name>
							<description>Communication Mode Read Sync Flag   CRSYNC. Reflects the protocol state  namely whether the host is waiting for data to be sent. While INT MOD is de asserted this bit is set by reading the COMDATA register via the IO READ  WORD instruction. While INT MOD is asserted this bit is set by INTMOD . SET  CRS . It is cleared by writing to COMDATA through the bus slave interface or by CROSSREFERENCE . COM  RST The flag seen when INT MOD is asserted is not affected by CROSSREFERENCE . COM  RST . . Whenever this bit is set  independent of INT MOD   the OTGS is notified to optionally request an interrupt. This bit is not affected by changes of INT MOD itself.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CWSYNC</name>
							<description>Communication Mode Write Sync Flag   CWSYNC. Reflects the protocol state  namely whether the host has posted data to be fetched. While INT MOD is de asserted this bit is set by writing the COMDATA register via the IO WRI TE WORD instruction. While INT MOD is asserted this bit is set by INTMOD . SET  CWS . It is cleared by writing a  1  to CW  ACK or by CROSSREFERENCE . COM  RST 1  . Whenever this bit is set  independent of INT MOD   the OTGS is notified to optionally request an interrupt. This bit is not affected by changes of INT MOD itself.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CW_ACK</name>
							<description>Communication Mode Write Acknowledge   CW ACK. The on chip software uses this bit to clear CW SYNC after the data was taken from COMDATA . There is no automatic clear of CWS YNC as each read may potentially be cancelled by pipelining or bus re arbitration   speculative  reads .</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>COM_SYNC</name>
							<description>Communication Mode Synchronization Flag   COM SYNC. Can be used by the monitor program for higher level synchronization. While INT MOD is asserted this bit is set by INTMOD . SET  CS and cleared by INTMOD . CLR  CS . If INT MOD is de asserted this bit represents CROSSREFERENCE . COM  SYNC directly.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HOSTED</name>
							<description>Tool Interface in Use   HOSTED. This bit is active when the DAP interface has received a CROSSREFERENCE .</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CHANNEL</name>
							<description>Channel Indication   CHANNEL. These bits can be used by the tool software to facilitate multiple users of the tool interface in Communication Mode While INT MOD is asserted this represents INTMOD . CHAN NEL   CROSSREFERENCE . CHAN NEL otherwise.</description>
							<lsb>12</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TLS</name>
					<description>TG Line State
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>112</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TL1</name>
							<description>Current State of Trigger Line 7   TL7</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TL2</name>
							<description>Current State of Trigger Line 7   TL7</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TL3</name>
							<description>Current State of Trigger Line 7   TL7</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TL4</name>
							<description>Current State of Trigger Line 7   TL7</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TL5</name>
							<description>Current State of Trigger Line 7   TL7</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TL6</name>
							<description>Current State of Trigger Line 7   TL7</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TL7</name>
							<description>Current State of Trigger Line 7   TL7</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCTL</name>
					<description>TG Capture for TG Lines
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>116</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TL1</name>
							<description>Capture of Trigger Line 7   TL7</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TL2</name>
							<description>Capture of Trigger Line 7   TL7</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TL3</name>
							<description>Capture of Trigger Line 7   TL7</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TL4</name>
							<description>Capture of Trigger Line 7   TL7</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TL5</name>
							<description>Capture of Trigger Line 7   TL7</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TL6</name>
							<description>Capture of Trigger Line 7   TL7</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TL7</name>
							<description>Capture of Trigger Line 7   TL7</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OEC</name>
					<description>OCDS Enable Control Register
 resetvalue={PowerOn Reset:0x0,Application Reset:0x0,Debug Reset:0x0,IOClient Reset:0x0}</description>
					<addressOffset>120</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>PAT</name>
							<description>OCDS Enabling Pattern   PAT. The byte sequence described in CROSSREFERENCE must be written to this bit field sequentially to enable the OCDS subsystem.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>DS</name>
							<description>Disable OCDS   DS. This bit allows the on chip software to disable the OCDS subsystem at any time. This is also good practice to do at the end of any debug session. To enable OCDS again the tool needs to repeat writing the enabling sequence into P AT .</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OCO</name>
							<description>OCDS Clock Off   OCO. If OCDS is disabled again  the OCDS clock can be optional switched off as well for power saving reasons  e.g. for power measurements . The OCDS clock is automatically enabled with the OCDS. OSTATE . OCO shows the status. The OCDS clock can only be disabled  if OCDS was already disabled before by another OEC register write.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>IF_LCK_P</name>
							<description>IF LCK Write Protection   IF LCK P. Protect IF  LCK against unintended changes.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>IF_LCK</name>
							<description>Set Clear Interface Locked Indication   IF LCK. This bit is the only way to change the OSTATE . IF  LCK by software.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>AUT_OK_P</name>
							<description>AUT OK Write Protection   AUT OK P. Protect AUT  OK against unintended changes.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>AUT_OK</name>
							<description>Set Clear the Authorization OK Indication   AUT OK. This bit is the only way to change the OSTATE . AUT  OK by software.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
