J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>OCNTRL</name>
					<description>OSCU Control Register
 resetvalue={PowerOn Reset:0x0,Application Reset:0x0,Debug Reset:0x0,IOClient Reset:0x0}</description>
					<addressOffset>124</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>OC0_P</name>
							<description>OC5 Write Protection   OC5 P. Protect OSTATE .OCx against unintended changes.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OC1_P</name>
							<description>OC5 Write Protection   OC5 P. Protect OSTATE .OCx against unintended changes.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OC2_P</name>
							<description>OC5 Write Protection   OC5 P. Protect OSTATE .OCx against unintended changes.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OC3_P</name>
							<description>OC5 Write Protection   OC5 P. Protect OSTATE .OCx against unintended changes.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OC4_P</name>
							<description>OC5 Write Protection   OC5 P. Protect OSTATE .OCx against unintended changes.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OC5_P</name>
							<description>OC5 Write Protection   OC5 P. Protect OSTATE .OCx against unintended changes.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OC0</name>
							<description>Set Clear OCDS Control Bits Bus Domain   OC5. These bits allow to change the associated OSTATE .OCx bits by software. OSTATE .OC3 is also called OSTATE . ENIDIS  OEN protected . OSTATE .OC4 is also called OSTATE . EECTRC  OEN protected . OSTATE .OC5 is also called OSTATE . EECDIS  OEN protected .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OC1</name>
							<description>Set Clear OCDS Control Bits Bus Domain   OC5. These bits allow to change the associated OSTATE .OCx bits by software. OSTATE .OC3 is also called OSTATE . ENIDIS  OEN protected . OSTATE .OC4 is also called OSTATE . EECTRC  OEN protected . OSTATE .OC5 is also called OSTATE . EECDIS  OEN protected .</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OC2</name>
							<description>Set Clear OCDS Control Bits Bus Domain   OC5. These bits allow to change the associated OSTATE .OCx bits by software. OSTATE .OC3 is also called OSTATE . ENIDIS  OEN protected . OSTATE .OC4 is also called OSTATE . EECTRC  OEN protected . OSTATE .OC5 is also called OSTATE . EECDIS  OEN protected .</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OC3</name>
							<description>Set Clear OCDS Control Bits Bus Domain   OC5. These bits allow to change the associated OSTATE .OCx bits by software. OSTATE .OC3 is also called OSTATE . ENIDIS  OEN protected . OSTATE .OC4 is also called OSTATE . EECTRC  OEN protected . OSTATE .OC5 is also called OSTATE . EECDIS  OEN protected .</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OC4</name>
							<description>Set Clear OCDS Control Bits Bus Domain   OC5. These bits allow to change the associated OSTATE .OCx bits by software. OSTATE .OC3 is also called OSTATE . ENIDIS  OEN protected . OSTATE .OC4 is also called OSTATE . EECTRC  OEN protected . OSTATE .OC5 is also called OSTATE . EECDIS  OEN protected .</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OC5</name>
							<description>Set Clear OCDS Control Bits Bus Domain   OC5. These bits allow to change the associated OSTATE .OCx bits by software. OSTATE .OC3 is also called OSTATE . ENIDIS  OEN protected . OSTATE .OC4 is also called OSTATE . EECTRC  OEN protected . OSTATE .OC5 is also called OSTATE . EECDIS  OEN protected .</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>WDTSUS_P</name>
							<description>WDTSUS Write Protection   WDTSUS P. Protect OSTATE . W DTSUS against unintended changes.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>WDTSUS</name>
							<description>Set Clear Watchdog Timer Suspension Control   WDTSUS. This bit  OEN protected  is the only way to change the OSTATE . WD TSUS by software.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>STABLE_P</name>
							<description>STABLE Write Protection   STABLE P. Protect OSTATE . STA BLE against unintended changes.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>STABLE</name>
							<description>InitializeApplication ResetIndication   STABLE. This bit is the only way to change the OSTATE . STA BLE bit by software.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC0_P</name>
							<description>OJC7 Write Protection   OJC7 P. Protect OSTATE .OJCx against unintended changes.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC1_P</name>
							<description>OJC7 Write Protection   OJC7 P. Protect OSTATE .OJCx against unintended changes.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC2_P</name>
							<description>OJC7 Write Protection   OJC7 P. Protect OSTATE .OJCx against unintended changes.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC3_P</name>
							<description>OJC7 Write Protection   OJC7 P. Protect OSTATE .OJCx against unintended changes.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC4_P</name>
							<description>OJC7 Write Protection   OJC7 P. Protect OSTATE .OJCx against unintended changes.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC5_P</name>
							<description>OJC7 Write Protection   OJC7 P. Protect OSTATE .OJCx against unintended changes.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC6_P</name>
							<description>OJC7 Write Protection   OJC7 P. Protect OSTATE .OJCx against unintended changes.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC7_P</name>
							<description>OJC7 Write Protection   OJC7 P. Protect OSTATE .OJCx against unintended changes.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC0</name>
							<description>Set Clear OCDS Control Bits IOClient Domain   OJC7. These bits allow to change the associated OSTATE .OJCx bits by software. OSTATE .OJC0 is also called OSTATE . H ARR  OEN protected  . OSTATE .OJC4 is also called OSTATE . RSTCL0  OEN protected  . OSTATE .OJC5 is also called OSTATE . RSTCL1 . OSTATE .OJC7 is also called OSTATE . RSTCL3  OEN protected  . OSTATE .OJCx can also be set cleared by the IOClient via the CROSSREFERENCE register. The IOClient has the higher priority.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC1</name>
							<description>Set Clear OCDS Control Bits IOClient Domain   OJC7. These bits allow to change the associated OSTATE .OJCx bits by software. OSTATE .OJC0 is also called OSTATE . H ARR  OEN protected  . OSTATE .OJC4 is also called OSTATE . RSTCL0  OEN protected  . OSTATE .OJC5 is also called OSTATE . RSTCL1 . OSTATE .OJC7 is also called OSTATE . RSTCL3  OEN protected  . OSTATE .OJCx can also be set cleared by the IOClient via the CROSSREFERENCE register. The IOClient has the higher priority.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC2</name>
							<description>Set Clear OCDS Control Bits IOClient Domain   OJC7. These bits allow to change the associated OSTATE .OJCx bits by software. OSTATE .OJC0 is also called OSTATE . H ARR  OEN protected  . OSTATE .OJC4 is also called OSTATE . RSTCL0  OEN protected  . OSTATE .OJC5 is also called OSTATE . RSTCL1 . OSTATE .OJC7 is also called OSTATE . RSTCL3  OEN protected  . OSTATE .OJCx can also be set cleared by the IOClient via the CROSSREFERENCE register. The IOClient has the higher priority.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC3</name>
							<description>Set Clear OCDS Control Bits IOClient Domain   OJC7. These bits allow to change the associated OSTATE .OJCx bits by software. OSTATE .OJC0 is also called OSTATE . H ARR  OEN protected  . OSTATE .OJC4 is also called OSTATE . RSTCL0  OEN protected  . OSTATE .OJC5 is also called OSTATE . RSTCL1 . OSTATE .OJC7 is also called OSTATE . RSTCL3  OEN protected  . OSTATE .OJCx can also be set cleared by the IOClient via the CROSSREFERENCE register. The IOClient has the higher priority.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC4</name>
							<description>Set Clear OCDS Control Bits IOClient Domain   OJC7. These bits allow to change the associated OSTATE .OJCx bits by software. OSTATE .OJC0 is also called OSTATE . H ARR  OEN protected  . OSTATE .OJC4 is also called OSTATE . RSTCL0  OEN protected  . OSTATE .OJC5 is also called OSTATE . RSTCL1 . OSTATE .OJC7 is also called OSTATE . RSTCL3  OEN protected  . OSTATE .OJCx can also be set cleared by the IOClient via the CROSSREFERENCE register. The IOClient has the higher priority.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC5</name>
							<description>Set Clear OCDS Control Bits IOClient Domain   OJC7. These bits allow to change the associated OSTATE .OJCx bits by software. OSTATE .OJC0 is also called OSTATE . H ARR  OEN protected  . OSTATE .OJC4 is also called OSTATE . RSTCL0  OEN protected  . OSTATE .OJC5 is also called OSTATE . RSTCL1 . OSTATE .OJC7 is also called OSTATE . RSTCL3  OEN protected  . OSTATE .OJCx can also be set cleared by the IOClient via the CROSSREFERENCE register. The IOClient has the higher priority.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC6</name>
							<description>Set Clear OCDS Control Bits IOClient Domain   OJC7. These bits allow to change the associated OSTATE .OJCx bits by software. OSTATE .OJC0 is also called OSTATE . H ARR  OEN protected  . OSTATE .OJC4 is also called OSTATE . RSTCL0  OEN protected  . OSTATE .OJC5 is also called OSTATE . RSTCL1 . OSTATE .OJC7 is also called OSTATE . RSTCL3  OEN protected  . OSTATE .OJCx can also be set cleared by the IOClient via the CROSSREFERENCE register. The IOClient has the higher priority.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC7</name>
							<description>Set Clear OCDS Control Bits IOClient Domain   OJC7. These bits allow to change the associated OSTATE .OJCx bits by software. OSTATE .OJC0 is also called OSTATE . H ARR  OEN protected  . OSTATE .OJC4 is also called OSTATE . RSTCL0  OEN protected  . OSTATE .OJC5 is also called OSTATE . RSTCL1 . OSTATE .OJC7 is also called OSTATE . RSTCL3  OEN protected  . OSTATE .OJCx can also be set cleared by the IOClient via the CROSSREFERENCE register. The IOClient has the higher priority.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OSTATE</name>
					<description>OSCUStatus Register
 resetvalue={PowerOn Reset:0x10000,Application Reset:0x0,Debug Reset:0x0,IOClient Reset:0x0}</description>
					<addressOffset>128</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>OEN</name>
							<description>OCDS Enabled Flag   OEN. This bit enables the OCDS functionality of the complete device. Set and clear is done through the OEC register. This flag does not show any overruling by the HSM .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OC0</name>
							<description>OCDS Control Bits System Bus Domain   OC2. Are used for device specific OCDS configuration purposes. They can be set and cleared with the associated OCNTRL .OCx bits.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OC1</name>
							<description>OCDS Control Bits System Bus Domain   OC2. Are used for device specific OCDS configuration purposes. They can be set and cleared with the associated OCNTRL .OCx bits.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OC2</name>
							<description>OCDS Control Bits System Bus Domain   OC2. Are used for device specific OCDS configuration purposes. They can be set and cleared with the associated OCNTRL .OCx bits.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ENIDIS</name>
							<description>OCDS ENDINIT Protection Override   ENIDIS. To modify ENDINIT protected register bits via Cerberus it would be dangerous to tamper with the protection logic controlled by a watchdog timer. This control bit allows to overrule the SCU.  Can be set and cleared with OCNTRL .OC3 only.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EECTRC</name>
							<description>On Chip Trace Enable   EECTRC. The trace ports of all cores are normally turned off for security and power consumption reasons. Only if tracing is desired the ports are globally enabled with this control bit.  Can be set and cleared with OCNTRL .OC4 only. Specific enables for single trace interfaces will be added inside MCDS.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EECDIS</name>
							<description>Emulation Logic Disable   EECDIS. If the features of the EEC are not needed  the complete EEC can be switched off with this control bit.  Can be set and cleared with OCNTRL .OC5 only. Both tracing and calibration  overlay  require the EEC to be turned on.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>WDTSUS</name>
							<description>Control of Watchdog Timer  WDT  Suspension   WDTSUS. This bit determines the behavior of the watchdog timers when the system is running with OCDS enabled. Set and clear is done by OCNTRL . WD TSUS .</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HARR</name>
							<description>Halt after Reset Request   HARR. This bit tells the Startup Software to stop prior to entering the application code.  It can be set cleared with either OCNTRL .OJC0  via the Bus Slave Interface  or CROSSREFERENCE .OJC0  via the IOClient  . The IOClient however has the higher priority. The Kernel clock must be running to change this bit. A request from the IOClient however is stored until this is the case.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OJC1</name>
							<description>OCDS Control Bits IOClient Domain OJC1. Are used for device specific OCDS configuration purposes. As these bits can be set by the IOClient regardless of IF  LCK and O EN make sure not to create a security hole in usage. They can be set and cleared either with the associated OCNTRL .OJCx         via the system bus  or CROSSREFERENCE .OJCx        bits. The IOClient however has the higher priority. The Kernel clock must be running to change these bits. A request from          the IOClient however is stored until this is the case.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OJC2</name>
							<description>OCDS Control Bits IOClient Domain OJC2. Are used for device specific OCDS configuration purposes. As these bits can be set by the IOClient regardless of IF  LCK and O EN make sure not to create a security hole in usage. They can be set and cleared either with the associated OCNTRL .OJCx         via the system bus  or CROSSREFERENCE .OJCx        bits. The IOClient however has the higher priority. The Kernel clock must be running to change these bits. A request from          the IOClient however is stored until this is the case.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OJC3</name>
							<description>OCDS Control Bits IOClient Domain OJC3. Are used for device specific OCDS configuration purposes. As these bits can be set by the IOClient regardless of IF  LCK and O EN make sure not to create a security hole in usage. They can be set and cleared either with the associated OCNTRL .OJCx         via the system bus  or CROSSREFERENCE .OJCx        bits. The IOClient however has the higher priority. The Kernel clock must be running to change these bits. A request from          the IOClient however is stored until this is the case.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RSTCL0</name>
							<description>OCDS System Reset Request   RSTCL0. Can be set either with the associated OCNTRL .OJC4  via the system bus  or CROSSREFERENCE .OJC4 bits. The IOClient has the higher priority. The Kernel clock must be running to change this bit. A request from the IOClient however is stored until this is the case. This bit is automatically cleared by the next System Reset.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RSTCL1</name>
							<description>OCDS Debug Reset Request   RSTCL1. Can be set and cleared either with the associated OCNTRL .OJC5  via the system bus  or CROSSREFERENCE .OJC5 bits. The IOClient has the higher priority. The Kernel clock must be running to change this bit. A request from the IOClient however is stored until this is the case. If the last set operation was done via OCNTRL this bit is automatically cleared by the next Application Reset . The requested Debug Reset will not clear this request automatically  a second write to OCNTRL is required to terminate the Debug Reset .</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OJC6</name>
							<description>OCDS Control Bits IOClient Domain OJC6. Are used for device specific OCDS configuration purposes. As these bits can be set by the IOClient regardless of IF  LCK and O EN make sure not to create a security hole in usage. They can be set and cleared either with the associated OCNTRL .OJCx         via the system bus  or CROSSREFERENCE .OJCx        bits. The IOClient however has the higher priority. The Kernel clock must be running to change these bits. A request from          the IOClient however is stored until this is the case.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RSTCL3</name>
							<description>OCDS Application Reset Request   RSTCL3. Can be set and cleared either with the associated OCNTRL .OJC7  via the system bus  or CROSSREFERENCE .OJC7 bits. The IOClient has the higher priority. The Kernel clock must be running to change this bit. A request from the IOClient however is stored until this is the case. If the last set operation was done via OCNTRL this bit is automatically cleared by the next Application Reset .</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IF_LCK</name>
							<description>Interface Locked Indication   IF LCK. This bit is used by the software inside the device to control the access right of the IOClient. Set and clear is done through the OEC register. Overruling by HSM is not visible in this bit.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AUT_OK</name>
							<description>Authorization OK Indication   AUT OK. This bit is used by the software inside the device to store the higher        level   CROSSREFERENCE          access right status of the IOClient through Application        Reset s. It has no direct hardware effects. Set and clear is done through the OEC register.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>STABLE</name>
							<description>Application Reset Indication   STABLE. This bit is used by the tool to detect Application        Reset s. It has no direct hardware effects. Set and clear is done through the OCNTRL register.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OCO</name>
							<description>OCDS debug resource Clock On Indication   OCO. This bit is used by the tool to detect the status of the OCDS debug        resource clock on control register. Set and clear is done through the OEC . OCO register.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
