J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>INTMOD</name>
					<description>Internal Mode Status and Control Register
 resetvalue={PowerOn Reset:0x0,Application Reset:0x0,Debug Reset:0x0,IOClient Reset:0x0}</description>
					<addressOffset>132</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>SET_CRS</name>
							<description>Set Read Sync Flag   SET CRS. Used by the monitor program to set the Read Sync Flag in Internal Mode.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SET_CWS</name>
							<description>Set Write Sync Flag   SET CWS. Used by the monitor program to set the Write Sync Flag in Internal Mode.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SET_CS</name>
							<description>Set Communication Synchronization Flag   SET CS. Used by the monitor program to set the higher level Communication Mode sync bit in Internal Mode.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR_CS</name>
							<description>Clear Communication Synchronization Flag   CLR CS. Used by the monitor program to clear the higher level Communication Mode sync bit in Internal Mode.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CHANNEL_P</name>
							<description>CHANNEL Write Protection   CHANNEL P. Protect CHA NNEL against unintended changes.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CHANNEL</name>
							<description>Channel Indication   CHANNEL. These bits are just written into the IOSR . CHAN NEL bit field in Internal Mode when CHANNEL P is held  160   8217 1  8217  concurrently 1  . Upon reading the current setting of IOSR . CHAN NEL is returned. If INT MOD is de asserted this is the value present in CROSSREFERENCE . CHAN NEL</description>
							<lsb>5</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SET_INT_MOD</name>
							<description>Enter Internal Mode   SET INT MOD. This bit is the only way to enter Internal Mode.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SET_INT_TRC</name>
							<description>Enable Internally Controlled Triggered Transfer   SET INT TRC. See CROSSREFERENCE for a description of the Triggered Transfer modes.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR_INT_TRC</name>
							<description>Disable Internally Controlled Triggered Transfer   CLR INT TRC</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TRC_MOD_P</name>
							<description>TRC MOD Write Protection   TRC MOD P. Protect TRC MOD against unintended changes.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TRC_MOD</name>
							<description>Data Size Definition for Triggered Transfer   TRC MOD. The kind of bus access used during an Internally Controlled Triggered Transfer is defined by this bit field 1    If INT MOD is de asserted this bit field is set to 00 . This value will also be present whenever Internal Mode is entered.</description>
							<lsb>21</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INT_MOD</name>
							<description>Internal Mode Enabled Flag   INT MOD. This bit reflects whether the Internal Mode is currently active. Set by SET IN T MOD   Cleared by Application Reset   OCDS disable or any IOClient access</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>INT_TRC</name>
							<description>Internally Controlled Triggered Transfer Enable   INT TRC. This bit tells whether an Internally Controlled Triggered Transfer is currently enabled. Set by SET INT TRC  Cleared by CLR INT TRC. This bit is just CROSSREFERENCE . EX B US TRC if INT MOD is de asserted.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ICTSA</name>
					<description>Internally Controlled Trace Source Register
 resetvalue={PowerOn Reset:0x0,Application Reset:0x0,Debug Reset:0x0,IOClient Reset:0x0}</description>
					<addressOffset>136</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Source Address   ADDR. This address is used by Cerberus to read data  size depending on INTMOD . TRC  MOD          when a triggered transfer takes place in internal mode.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ICTTA</name>
					<description>Internally Controlled Trace Destination Register
 resetvalue={PowerOn Reset:0x10F068,Application Reset:0x10F068,Debug Reset:0x0,IOClient Reset:0x0}</description>
					<addressOffset>140</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Destination Address   ADDR. This address is used by Cerberus to write data  size depending on INTMOD . TRC  MOD   when a triggered transfer takes place in internal mode.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TLC</name>
					<description>TG Line Control
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>144</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TLSP1</name>
							<description>TG Line Signal Processing   TLSP7</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TLSP2</name>
							<description>TG Line Signal Processing   TLSP7</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TLSP3</name>
							<description>TG Line Signal Processing   TLSP7</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TLSP4</name>
							<description>TG Line Signal Processing   TLSP7</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TLSP5</name>
							<description>TG Line Signal Processing   TLSP7</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TLSP6</name>
							<description>TG Line Signal Processing   TLSP7</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TLSP7</name>
							<description>TG Line Signal Processing   TLSP7</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TL1ST</name>
					<description>TG Line 1 Suspend Targets
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>148</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>C0</name>
							<description>CPU5 as Suspend Target   C5</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>C1</name>
							<description>CPU5 as Suspend Target   C5</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>C2</name>
							<description>CPU5 as Suspend Target   C5</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>C3</name>
							<description>CPU5 as Suspend Target   C5</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>C4</name>
							<description>CPU5 as Suspend Target   C5</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>C5</name>
							<description>CPU5 as Suspend Target   C5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M0</name>
							<description>Master 0 as Suspend Target. Prepared for not yet known bus masters on future SoCs  which need        suspend control. Once used in the future the bit will get the name of        the master.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1</name>
							<description>Master 1 as Suspend Target. Prepared for not yet known bus masters on future SoCs  which need        suspend control. Once used in the future the bit will get the name of        the master.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2</name>
							<description>Master 2 as Suspend Target. Prepared for not yet known bus masters on future SoCs  which need        suspend control. Once used in the future the bit will get the name of        the master.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HSS1</name>
							<description>HSSL1 as Suspend Target   HSS1</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HSS0</name>
							<description>HSSL0 as Suspend Target   HSS0</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DMA</name>
							<description>DMA as Suspend Target   DMA</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DMA1</name>
							<description>DMA as Suspend Target   DMA1. Prepared Reserved for future use with DMA</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HSM</name>
							<description>HSM as Suspend Target   HSM</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TLCHE</name>
					<description>TG Line Capture and Hold Enable
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>152</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TL1</name>
							<description>Capture and Hold Enable for Trigger Line 3   TL3</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TL2</name>
							<description>Capture and Hold Enable for Trigger Line 3   TL3</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TL3</name>
							<description>Capture and Hold Enable for Trigger Line 3   TL3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TLCHS</name>
					<description>TG Line Capture and Hold Clear
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>156</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TL1</name>
							<description>Capture and Hold Clear for Trigger Line 3   TL3</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TL2</name>
							<description>Capture and Hold Clear for Trigger Line 3   TL3</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TL3</name>
							<description>Capture and Hold Clear for Trigger Line 3   TL3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRIGS</name>
					<description>Set Trigger to Host Register
 resetvalue={PowerOn Reset:0x0,Application Reset:0x0,Debug Reset:0x0,IOClient Reset:0x0}</description>
					<addressOffset>160</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>BITNUM</name>
							<description>Service Request Bit Number to Set   BITNUM. The bit TRGx y of register TRIGx is set  with  x   BITNUM div 16   and  y   BITNUM mod 16  . LOST SEQUENCE DEFINITION</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRIGC</name>
					<description>Clear Trigger to Host Register
 resetvalue={PowerOn Reset:0x0,Application Reset:0x0,Debug Reset:0x0,IOClient Reset:0x0}</description>
					<addressOffset>164</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>TRGx_0</name>
							<description>Request Bits of most important register TRIGx   TRGx 15. From all TRIGx registers with any TRG  bit set the TRIGx with the lowest x is cleared. If any bit s  are set concurrently these bits will not be cleared but end up in the set state.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_1</name>
							<description>Request Bits of most important register TRIGx   TRGx 15. From all TRIGx registers with any TRG  bit set the TRIGx with the lowest x is cleared. If any bit s  are set concurrently these bits will not be cleared but end up in the set state.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_2</name>
							<description>Request Bits of most important register TRIGx   TRGx 15. From all TRIGx registers with any TRG  bit set the TRIGx with the lowest x is cleared. If any bit s  are set concurrently these bits will not be cleared but end up in the set state.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_3</name>
							<description>Request Bits of most important register TRIGx   TRGx 15. From all TRIGx registers with any TRG  bit set the TRIGx with the lowest x is cleared. If any bit s  are set concurrently these bits will not be cleared but end up in the set state.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_4</name>
							<description>Request Bits of most important register TRIGx   TRGx 15. From all TRIGx registers with any TRG  bit set the TRIGx with the lowest x is cleared. If any bit s  are set concurrently these bits will not be cleared but end up in the set state.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_5</name>
							<description>Request Bits of most important register TRIGx   TRGx 15. From all TRIGx registers with any TRG  bit set the TRIGx with the lowest x is cleared. If any bit s  are set concurrently these bits will not be cleared but end up in the set state.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_6</name>
							<description>Request Bits of most important register TRIGx   TRGx 15. From all TRIGx registers with any TRG  bit set the TRIGx with the lowest x is cleared. If any bit s  are set concurrently these bits will not be cleared but end up in the set state.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_7</name>
							<description>Request Bits of most important register TRIGx   TRGx 15. From all TRIGx registers with any TRG  bit set the TRIGx with the lowest x is cleared. If any bit s  are set concurrently these bits will not be cleared but end up in the set state.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_8</name>
							<description>Request Bits of most important register TRIGx   TRGx 15. From all TRIGx registers with any TRG  bit set the TRIGx with the lowest x is cleared. If any bit s  are set concurrently these bits will not be cleared but end up in the set state.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_9</name>
							<description>Request Bits of most important register TRIGx   TRGx 15. From all TRIGx registers with any TRG  bit set the TRIGx with the lowest x is cleared. If any bit s  are set concurrently these bits will not be cleared but end up in the set state.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_10</name>
							<description>Request Bits of most important register TRIGx   TRGx 15. From all TRIGx registers with any TRG  bit set the TRIGx with the lowest x is cleared. If any bit s  are set concurrently these bits will not be cleared but end up in the set state.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_11</name>
							<description>Request Bits of most important register TRIGx   TRGx 15. From all TRIGx registers with any TRG  bit set the TRIGx with the lowest x is cleared. If any bit s  are set concurrently these bits will not be cleared but end up in the set state.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_12</name>
							<description>Request Bits of most important register TRIGx   TRGx 15. From all TRIGx registers with any TRG  bit set the TRIGx with the lowest x is cleared. If any bit s  are set concurrently these bits will not be cleared but end up in the set state.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_13</name>
							<description>Request Bits of most important register TRIGx   TRGx 15. From all TRIGx registers with any TRG  bit set the TRIGx with the lowest x is cleared. If any bit s  are set concurrently these bits will not be cleared but end up in the set state.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_14</name>
							<description>Request Bits of most important register TRIGx   TRGx 15. From all TRIGx registers with any TRG  bit set the TRIGx with the lowest x is cleared. If any bit s  are set concurrently these bits will not be cleared but end up in the set state.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_15</name>
							<description>Request Bits of most important register TRIGx   TRGx 15. From all TRIGx registers with any TRG  bit set the TRIGx with the lowest x is cleared. If any bit s  are set concurrently these bits will not be cleared but end up in the set state.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>x</name>
							<description>Index of most important register TRIGx   x. For TRIGx the highest x available x   5 .</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TLT</name>
					<description>TG Line Timer
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>168</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TGL</name>
							<description>Timer to Trigger Line Routing   TGL</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VTZ</name>
							<description>TG Line Value when Timer Value is Zero   VTZ</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RL</name>
							<description>Reload Timer   RL</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIM</name>
							<description>Timer Value   TIM. Timer value which is automatically decremented if not 0. The timer frequency is fixed to f SPB divided by 4.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TLTTH</name>
					<description>TG Lines for Trigger to Host
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>172</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TL1</name>
							<description>TG Line Enabling for Trigger to Host  TRIG    TL7</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TL2</name>
							<description>TG Line Enabling for Trigger to Host  TRIG    TL7</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TL3</name>
							<description>TG Line Enabling for Trigger to Host  TRIG    TL7</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TL4</name>
							<description>TG Line Enabling for Trigger to Host  TRIG    TL7</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TL5</name>
							<description>TG Line Enabling for Trigger to Host  TRIG    TL7</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TL6</name>
							<description>TG Line Enabling for Trigger to Host  TRIG    TL7</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TL7</name>
							<description>TG Line Enabling for Trigger to Host  TRIG    TL7</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
