J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>TCCB</name>
					<description>TG Capture for Cores   BRKOUT
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>176</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>C0</name>
							<description>Capture of BRKOUT Signal of CPU5   C5</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>C1</name>
							<description>Capture of BRKOUT Signal of CPU5   C5</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>C2</name>
							<description>Capture of BRKOUT Signal of CPU5   C5</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>C3</name>
							<description>Capture of BRKOUT Signal of CPU5   C5</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>C4</name>
							<description>Capture of BRKOUT Signal of CPU5   C5</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>C5</name>
							<description>Capture of BRKOUT Signal of CPU5   C5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM</name>
							<description>Capture of BRKOUT Signal ofHSM   HSM</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCCH</name>
					<description>TG Capture for Cores   HALT
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>180</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>C0</name>
							<description>Capture of HALT Signal of CPU5   C5</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>C1</name>
							<description>Capture of HALT Signal of CPU5   C5</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>C2</name>
							<description>Capture of HALT Signal of CPU5   C5</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>C3</name>
							<description>Capture of HALT Signal of CPU5   C5</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>C4</name>
							<description>Capture of HALT Signal of CPU5   C5</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>C5</name>
							<description>Capture of HALT Signal of CPU5   C5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM</name>
							<description>Capture of HALT Signal ofHSM   HSM</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCTGB</name>
					<description>TG Capture for OTGB0 1
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>184</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>OTGB0</name>
							<description>Capture Bits for OTGB0   OTGB0. If a bit is set  the associated OTGB0 signal was active high since last read.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OTGB1</name>
							<description>Capture Bits for OTGB1   OTGB1. If a bit is set  the associated OTGB1 signal was active high since last read.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCM</name>
					<description>TG Capture for MCDS
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>188</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>BRK</name>
							<description>Capture of MCDS break out   BRK</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SUS</name>
							<description>Capture of MCDS suspend out   SUS</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>T0</name>
							<description>Capture of MCDS trig out 3   T3</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>T1</name>
							<description>Capture of MCDS trig out 3   T3</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>T2</name>
							<description>Capture of MCDS trig out 3   T3</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>T3</name>
							<description>Capture of MCDS trig out 3   T3</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>6</dim>
					<dimIncrement>4</dimIncrement>
					<name>TRECx[%s]</name>
					<description>TG Routing Events of CPU0
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>192</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TR0EV</name>
							<description>TRxEVT to Trigger Line Routing TR0EV</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TR2EV</name>
							<description>TRxEVT to Trigger Line Routing TR2EV</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TR4EV</name>
							<description>TRxEVT to Trigger Line Routing TR4EV</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TR6EV</name>
							<description>TRxEVT to Trigger Line Routing TR6EV</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRMT</name>
					<description>TG Routing for MCDS Triggers
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>220</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TG0</name>
							<description>MCDS trig out 3 to Trigger Line Routing   TG3</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TG1</name>
							<description>MCDS trig out 3 to Trigger Line Routing   TG3</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TG2</name>
							<description>MCDS trig out 3 to Trigger Line Routing   TG3</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TG3</name>
							<description>MCDS trig out 3 to Trigger Line Routing   TG3</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFSA</name>
					<description>IFS Address Register
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>240</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address for FI SI Accesses   ADDR. In case of FI the lowest two bits address the byte within the 32  160 bit        word which is used for the RMW access. In case of SI the lowest two bits        are ignored.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFSC</name>
					<description>IFS Control Register
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>244</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>GO</name>
							<description>Injection Trigger   GO. This bit shall be gated by OCDS enable.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>OTGS</name>
							<description>Injection Trigger by OTGS   OTGS</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE</name>
							<description>Stress or Fault Injection Mode   MODE</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRIO</name>
							<description>Bus Master Priority   PRIO</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RSREP</name>
							<description>Read Stress Repetitions. The value 0 means just one SI read  the value 15 means 16 reads overall</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BM0</name>
							<description>Fault Injection Bit Manipulation   BM7. Controls the manipulation of bit x within the byte addressed by IFSA . The lowest two bits of IFSA determine the byte within the 32 bit word of the RMW operation. All other bytes of the word are unchanged.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BM1</name>
							<description>Fault Injection Bit Manipulation   BM7. Controls the manipulation of bit x within the byte addressed by IFSA . The lowest two bits of IFSA determine the byte within the 32 bit word of the RMW operation. All other bytes of the word are unchanged.</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BM2</name>
							<description>Fault Injection Bit Manipulation   BM7. Controls the manipulation of bit x within the byte addressed by IFSA . The lowest two bits of IFSA determine the byte within the 32 bit word of the RMW operation. All other bytes of the word are unchanged.</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BM3</name>
							<description>Fault Injection Bit Manipulation   BM7. Controls the manipulation of bit x within the byte addressed by IFSA . The lowest two bits of IFSA determine the byte within the 32 bit word of the RMW operation. All other bytes of the word are unchanged.</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BM4</name>
							<description>Fault Injection Bit Manipulation   BM7. Controls the manipulation of bit x within the byte addressed by IFSA . The lowest two bits of IFSA determine the byte within the 32 bit word of the RMW operation. All other bytes of the word are unchanged.</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BM5</name>
							<description>Fault Injection Bit Manipulation   BM7. Controls the manipulation of bit x within the byte addressed by IFSA . The lowest two bits of IFSA determine the byte within the 32 bit word of the RMW operation. All other bytes of the word are unchanged.</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BM6</name>
							<description>Fault Injection Bit Manipulation   BM7. Controls the manipulation of bit x within the byte addressed by IFSA . The lowest two bits of IFSA determine the byte within the 32 bit word of the RMW operation. All other bytes of the word are unchanged.</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BM7</name>
							<description>Fault Injection Bit Manipulation   BM7. Controls the manipulation of bit x within the byte addressed by IFSA . The lowest two bits of IFSA determine the byte within the 32 bit word of the RMW operation. All other bytes of the word are unchanged.</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
