J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<dim>6</dim>
					<dimIncrement>4</dimIncrement>
					<name>TRIGx[%s]</name>
					<description>Trigger to Host Register 0
 resetvalue={PowerOn Reset:0x0,Application Reset:0x0,Debug Reset:0x0,IOClient Reset:0x0}</description>
					<addressOffset>256</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>TRGx_0</name>
							<description>Service Request Bits   TRGx 15. Are used by the tool software running on the SoC to request specific services  e.g. upload measurement data block  from the host. The bit is set by writing the correct bit number into the TRIGS register. To set TRGx y the number  x  16  y  must be written to TRIGS . All request bits of a specific TRIGx are cleared only when from all TRIG  registers with any TRG  bit set TRIGx happens to have the lowest x and   either TRIGC is read   or the IO READ  TRIG instruction is executed. In case of concurrent set and clear the affected bit s  will remain set. Bit numbers higher than 95  highest TRIGx register  stuck  0 .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_1</name>
							<description>Service Request Bits   TRGx 15. Are used by the tool software running on the SoC to request specific services  e.g. upload measurement data block  from the host. The bit is set by writing the correct bit number into the TRIGS register. To set TRGx y the number  x  16  y  must be written to TRIGS . All request bits of a specific TRIGx are cleared only when from all TRIG  registers with any TRG  bit set TRIGx happens to have the lowest x and   either TRIGC is read   or the IO READ  TRIG instruction is executed. In case of concurrent set and clear the affected bit s  will remain set. Bit numbers higher than 95  highest TRIGx register  stuck  0 .</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_2</name>
							<description>Service Request Bits   TRGx 15. Are used by the tool software running on the SoC to request specific services  e.g. upload measurement data block  from the host. The bit is set by writing the correct bit number into the TRIGS register. To set TRGx y the number  x  16  y  must be written to TRIGS . All request bits of a specific TRIGx are cleared only when from all TRIG  registers with any TRG  bit set TRIGx happens to have the lowest x and   either TRIGC is read   or the IO READ  TRIG instruction is executed. In case of concurrent set and clear the affected bit s  will remain set. Bit numbers higher than 95  highest TRIGx register  stuck  0 .</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_3</name>
							<description>Service Request Bits   TRGx 15. Are used by the tool software running on the SoC to request specific services  e.g. upload measurement data block  from the host. The bit is set by writing the correct bit number into the TRIGS register. To set TRGx y the number  x  16  y  must be written to TRIGS . All request bits of a specific TRIGx are cleared only when from all TRIG  registers with any TRG  bit set TRIGx happens to have the lowest x and   either TRIGC is read   or the IO READ  TRIG instruction is executed. In case of concurrent set and clear the affected bit s  will remain set. Bit numbers higher than 95  highest TRIGx register  stuck  0 .</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_4</name>
							<description>Service Request Bits   TRGx 15. Are used by the tool software running on the SoC to request specific services  e.g. upload measurement data block  from the host. The bit is set by writing the correct bit number into the TRIGS register. To set TRGx y the number  x  16  y  must be written to TRIGS . All request bits of a specific TRIGx are cleared only when from all TRIG  registers with any TRG  bit set TRIGx happens to have the lowest x and   either TRIGC is read   or the IO READ  TRIG instruction is executed. In case of concurrent set and clear the affected bit s  will remain set. Bit numbers higher than 95  highest TRIGx register  stuck  0 .</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_5</name>
							<description>Service Request Bits   TRGx 15. Are used by the tool software running on the SoC to request specific services  e.g. upload measurement data block  from the host. The bit is set by writing the correct bit number into the TRIGS register. To set TRGx y the number  x  16  y  must be written to TRIGS . All request bits of a specific TRIGx are cleared only when from all TRIG  registers with any TRG  bit set TRIGx happens to have the lowest x and   either TRIGC is read   or the IO READ  TRIG instruction is executed. In case of concurrent set and clear the affected bit s  will remain set. Bit numbers higher than 95  highest TRIGx register  stuck  0 .</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_6</name>
							<description>Service Request Bits   TRGx 15. Are used by the tool software running on the SoC to request specific services  e.g. upload measurement data block  from the host. The bit is set by writing the correct bit number into the TRIGS register. To set TRGx y the number  x  16  y  must be written to TRIGS . All request bits of a specific TRIGx are cleared only when from all TRIG  registers with any TRG  bit set TRIGx happens to have the lowest x and   either TRIGC is read   or the IO READ  TRIG instruction is executed. In case of concurrent set and clear the affected bit s  will remain set. Bit numbers higher than 95  highest TRIGx register  stuck  0 .</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_7</name>
							<description>Service Request Bits   TRGx 15. Are used by the tool software running on the SoC to request specific services  e.g. upload measurement data block  from the host. The bit is set by writing the correct bit number into the TRIGS register. To set TRGx y the number  x  16  y  must be written to TRIGS . All request bits of a specific TRIGx are cleared only when from all TRIG  registers with any TRG  bit set TRIGx happens to have the lowest x and   either TRIGC is read   or the IO READ  TRIG instruction is executed. In case of concurrent set and clear the affected bit s  will remain set. Bit numbers higher than 95  highest TRIGx register  stuck  0 .</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_8</name>
							<description>Service Request Bits   TRGx 15. Are used by the tool software running on the SoC to request specific services  e.g. upload measurement data block  from the host. The bit is set by writing the correct bit number into the TRIGS register. To set TRGx y the number  x  16  y  must be written to TRIGS . All request bits of a specific TRIGx are cleared only when from all TRIG  registers with any TRG  bit set TRIGx happens to have the lowest x and   either TRIGC is read   or the IO READ  TRIG instruction is executed. In case of concurrent set and clear the affected bit s  will remain set. Bit numbers higher than 95  highest TRIGx register  stuck  0 .</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_9</name>
							<description>Service Request Bits   TRGx 15. Are used by the tool software running on the SoC to request specific services  e.g. upload measurement data block  from the host. The bit is set by writing the correct bit number into the TRIGS register. To set TRGx y the number  x  16  y  must be written to TRIGS . All request bits of a specific TRIGx are cleared only when from all TRIG  registers with any TRG  bit set TRIGx happens to have the lowest x and   either TRIGC is read   or the IO READ  TRIG instruction is executed. In case of concurrent set and clear the affected bit s  will remain set. Bit numbers higher than 95  highest TRIGx register  stuck  0 .</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_10</name>
							<description>Service Request Bits   TRGx 15. Are used by the tool software running on the SoC to request specific services  e.g. upload measurement data block  from the host. The bit is set by writing the correct bit number into the TRIGS register. To set TRGx y the number  x  16  y  must be written to TRIGS . All request bits of a specific TRIGx are cleared only when from all TRIG  registers with any TRG  bit set TRIGx happens to have the lowest x and   either TRIGC is read   or the IO READ  TRIG instruction is executed. In case of concurrent set and clear the affected bit s  will remain set. Bit numbers higher than 95  highest TRIGx register  stuck  0 .</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_11</name>
							<description>Service Request Bits   TRGx 15. Are used by the tool software running on the SoC to request specific services  e.g. upload measurement data block  from the host. The bit is set by writing the correct bit number into the TRIGS register. To set TRGx y the number  x  16  y  must be written to TRIGS . All request bits of a specific TRIGx are cleared only when from all TRIG  registers with any TRG  bit set TRIGx happens to have the lowest x and   either TRIGC is read   or the IO READ  TRIG instruction is executed. In case of concurrent set and clear the affected bit s  will remain set. Bit numbers higher than 95  highest TRIGx register  stuck  0 .</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_12</name>
							<description>Service Request Bits   TRGx 15. Are used by the tool software running on the SoC to request specific services  e.g. upload measurement data block  from the host. The bit is set by writing the correct bit number into the TRIGS register. To set TRGx y the number  x  16  y  must be written to TRIGS . All request bits of a specific TRIGx are cleared only when from all TRIG  registers with any TRG  bit set TRIGx happens to have the lowest x and   either TRIGC is read   or the IO READ  TRIG instruction is executed. In case of concurrent set and clear the affected bit s  will remain set. Bit numbers higher than 95  highest TRIGx register  stuck  0 .</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_13</name>
							<description>Service Request Bits   TRGx 15. Are used by the tool software running on the SoC to request specific services  e.g. upload measurement data block  from the host. The bit is set by writing the correct bit number into the TRIGS register. To set TRGx y the number  x  16  y  must be written to TRIGS . All request bits of a specific TRIGx are cleared only when from all TRIG  registers with any TRG  bit set TRIGx happens to have the lowest x and   either TRIGC is read   or the IO READ  TRIG instruction is executed. In case of concurrent set and clear the affected bit s  will remain set. Bit numbers higher than 95  highest TRIGx register  stuck  0 .</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_14</name>
							<description>Service Request Bits   TRGx 15. Are used by the tool software running on the SoC to request specific services  e.g. upload measurement data block  from the host. The bit is set by writing the correct bit number into the TRIGS register. To set TRGx y the number  x  16  y  must be written to TRIGS . All request bits of a specific TRIGx are cleared only when from all TRIG  registers with any TRG  bit set TRIGx happens to have the lowest x and   either TRIGC is read   or the IO READ  TRIG instruction is executed. In case of concurrent set and clear the affected bit s  will remain set. Bit numbers higher than 95  highest TRIGx register  stuck  0 .</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_15</name>
							<description>Service Request Bits   TRGx 15. Are used by the tool software running on the SoC to request specific services  e.g. upload measurement data block  from the host. The bit is set by writing the correct bit number into the TRIGS register. To set TRGx y the number  x  16  y  must be written to TRIGS . All request bits of a specific TRIGx are cleared only when from all TRIG  registers with any TRG  bit set TRIGx happens to have the lowest x and   either TRIGC is read   or the IO READ  TRIG instruction is executed. In case of concurrent set and clear the affected bit s  will remain set. Bit numbers higher than 95  highest TRIGx register  stuck  0 .</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>x</name>
							<description>TRIG register number   x</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ACCEN0</name>
					<description>Access Enable Register 0
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
					<addressOffset>508</addressOffset>
					<size>32</size>
					<resetValue>4294967295</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EN0</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN1</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN2</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN3</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN4</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN5</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN6</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN7</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN8</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN9</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN10</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN11</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN12</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN13</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN14</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN15</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN16</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN17</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN18</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN19</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN20</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN21</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN22</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN23</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN24</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN25</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN26</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN27</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN28</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN29</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN30</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN31</name>
							<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for transactions with the Master TAG ID n</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
