J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>DOM0</name>
			<version>100</version>
			<description>DOM</description>
			<baseAddress>4168089600</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>1276</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<cluster>
					<dim>16</dim>
					<dimIncrement>32</dimIncrement>
					<name>SCICTRL[%s]</name>
					<description>SCICTRL</description>
					<addressOffset>0</addressOffset>
					<register>
						<name>PECONx</name>
						<description>Protocol Error Control Register 0
 resetvalue={Application Reset:0x1}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>1</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>PEEN</name>
								<description>Protocol Error Enable   PEEN</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SETPE</name>
								<description>Set Protocol Error   SETPE. This allows SW to mimic a protocol error and present an indication        similar to a hardware detected error. After setting this bit  it is        automatically cleared by the hardware in the cycle after the write.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>PEACK</name>
								<description>Protocol Error Acknowledge   PEACK. Writing a one to this bit while it  x2019 s set has the following results  The error lock of the corresponding ERRADDRx and ERRx are released  and the registers will be updated for the next protocol error detected  see CROSSREFERENCE  . After setting this bit  it is automatically cleared by the hardware in the cycle after the write.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>PRIORITYx</name>
						<description>SCI0 Arbiter Priority Register
 resetvalue={Application Reset:0x70000}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>458752</resetValue>
						<resetMask>4294963200</resetMask>
						<fields>
							<field>
								<name>MCI0_P</name>
								<description>MCI11 Priority   MCI11 P</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MCI1_P</name>
								<description>MCI11 Priority   MCI11 P</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MCI2_P</name>
								<description>MCI11 Priority   MCI11 P</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MCI3_P</name>
								<description>MCI11 Priority   MCI11 P</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MCI4_P</name>
								<description>MCI11 Priority   MCI11 P</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MCI5_P</name>
								<description>MCI11 Priority   MCI11 P</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MCI6_P</name>
								<description>MCI11 Priority   MCI11 P</description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MCI7_P</name>
								<description>MCI11 Priority   MCI11 P</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MCI8_P</name>
								<description>MCI11 Priority   MCI11 P</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MCI9_P</name>
								<description>MCI11 Priority   MCI11 P</description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MCI10_P</name>
								<description>MCI11 Priority   MCI11 P</description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>MCI11_P</name>
								<description>MCI11 Priority   MCI11 P</description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>HPRS</name>
								<description>High Priority Round Share   HPRS. Number of transactions to give to the high priority round robin before a        transaction from low priority round  when request saturated . This        number may not be less than the number of high priority MCI programmed        via. MCIn P.</description>
								<lsb>16</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ERRADDRx</name>
						<description>SCI 0 Error Address Capture Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>16</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ADDR</name>
								<description>Transaction Address   ADDR. This bitfield contains the address of the erroneous transaction from the address phase</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ERRx</name>
						<description>SCI 0 Error Capture Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>24</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>RD_N</name>
								<description>Read Status   RD</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>WR_N</name>
								<description>Write Status   WR</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SVM</name>
								<description>Supervisor Mode Status   SVM</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>OPC</name>
								<description>Operation Code   OPC. This field contains the opcode of the erroneous transaction  see CROSSREFERENCE for details.</description>
								<lsb>4</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TR_ID</name>
								<description>Transaction ID   TR ID. This field contains the Master  8217 s transaction ID of the erroneous        transaction. The Transaction ID is built out of the Master  8217 s 6 bit        unique TAG ID  TR ID 5 0    and a 2 bit running number TR ID 7 6 .</description>
								<lsb>8</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ADDR_EDC</name>
								<description>Address Phase Error Detection Information   ADDR EDC. This field contains the Address Phase Error Detection Information of the        erroneous transaction.</description>
								<lsb>16</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>MCI_SBS</name>
								<description>MCI Sideband Signals  7 0    MCI SBS. This bit field contains the MCI Sideband Signals  7 0  that are related        to the transaction information captured. In the AURIX  8482  TC3xx family  the sideband signals are used by the DMA to provide information        about the DMA requestor of a DMA transaction  for the encoding see CROSSREFERENCE  .</description>
								<lsb>24</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
				</cluster>
				<register>
					<name>ID</name>
					<description>Identification Register
 resetvalue={Application Reset:0x4D000}</description>
					<addressOffset>1032</addressOffset>
					<size>32</size>
					<resetValue>315392</resetValue>
					<resetMask>4294967040</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision Number   MOD REV. This bit field defines the module revision number. The value of a module revision starts with 01H  first revision .</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type   MOD TYPE. The bit field is set to D0H which defines the module as a 32 bit module.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number Value   MOD NUMBER. This bit field defines a module identification number. The value for the  lt Default   Font gt SRI Fabric is 0004H.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PESTAT</name>
					<description>Protocol Error Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1040</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PESCI0</name>
							<description>Protocol Error status of SCI15   PESCI15. Writing 0 to the bit leaves the content unchanged  while writing 1 to        the bit clears it. In case the bit is simultaneously cleared via        software and set via hardware  the bit remains set and is not cleared.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI1</name>
							<description>Protocol Error status of SCI15   PESCI15. Writing 0 to the bit leaves the content unchanged  while writing 1 to        the bit clears it. In case the bit is simultaneously cleared via        software and set via hardware  the bit remains set and is not cleared.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI2</name>
							<description>Protocol Error status of SCI15   PESCI15. Writing 0 to the bit leaves the content unchanged  while writing 1 to        the bit clears it. In case the bit is simultaneously cleared via        software and set via hardware  the bit remains set and is not cleared.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI3</name>
							<description>Protocol Error status of SCI15   PESCI15. Writing 0 to the bit leaves the content unchanged  while writing 1 to        the bit clears it. In case the bit is simultaneously cleared via        software and set via hardware  the bit remains set and is not cleared.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI4</name>
							<description>Protocol Error status of SCI15   PESCI15. Writing 0 to the bit leaves the content unchanged  while writing 1 to        the bit clears it. In case the bit is simultaneously cleared via        software and set via hardware  the bit remains set and is not cleared.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI5</name>
							<description>Protocol Error status of SCI15   PESCI15. Writing 0 to the bit leaves the content unchanged  while writing 1 to        the bit clears it. In case the bit is simultaneously cleared via        software and set via hardware  the bit remains set and is not cleared.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI6</name>
							<description>Protocol Error status of SCI15   PESCI15. Writing 0 to the bit leaves the content unchanged  while writing 1 to        the bit clears it. In case the bit is simultaneously cleared via        software and set via hardware  the bit remains set and is not cleared.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI7</name>
							<description>Protocol Error status of SCI15   PESCI15. Writing 0 to the bit leaves the content unchanged  while writing 1 to        the bit clears it. In case the bit is simultaneously cleared via        software and set via hardware  the bit remains set and is not cleared.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI8</name>
							<description>Protocol Error status of SCI15   PESCI15. Writing 0 to the bit leaves the content unchanged  while writing 1 to        the bit clears it. In case the bit is simultaneously cleared via        software and set via hardware  the bit remains set and is not cleared.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI9</name>
							<description>Protocol Error status of SCI15   PESCI15. Writing 0 to the bit leaves the content unchanged  while writing 1 to        the bit clears it. In case the bit is simultaneously cleared via        software and set via hardware  the bit remains set and is not cleared.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI10</name>
							<description>Protocol Error status of SCI15   PESCI15. Writing 0 to the bit leaves the content unchanged  while writing 1 to        the bit clears it. In case the bit is simultaneously cleared via        software and set via hardware  the bit remains set and is not cleared.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI11</name>
							<description>Protocol Error status of SCI15   PESCI15. Writing 0 to the bit leaves the content unchanged  while writing 1 to        the bit clears it. In case the bit is simultaneously cleared via        software and set via hardware  the bit remains set and is not cleared.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI12</name>
							<description>Protocol Error status of SCI15   PESCI15. Writing 0 to the bit leaves the content unchanged  while writing 1 to        the bit clears it. In case the bit is simultaneously cleared via        software and set via hardware  the bit remains set and is not cleared.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI13</name>
							<description>Protocol Error status of SCI15   PESCI15. Writing 0 to the bit leaves the content unchanged  while writing 1 to        the bit clears it. In case the bit is simultaneously cleared via        software and set via hardware  the bit remains set and is not cleared.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI14</name>
							<description>Protocol Error status of SCI15   PESCI15. Writing 0 to the bit leaves the content unchanged  while writing 1 to        the bit clears it. In case the bit is simultaneously cleared via        software and set via hardware  the bit remains set and is not cleared.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI15</name>
							<description>Protocol Error status of SCI15   PESCI15. Writing 0 to the bit leaves the content unchanged  while writing 1 to        the bit clears it. In case the bit is simultaneously cleared via        software and set via hardware  the bit remains set and is not cleared.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
