J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>TIDSTAT</name>
					<description>Transaction ID Status Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>1048</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TIDSCI0</name>
							<description>Tra15saction ID Error from SCIn Status   TIDSCI15. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI1</name>
							<description>Tra15saction ID Error from SCIn Status   TIDSCI15. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI2</name>
							<description>Tra15saction ID Error from SCIn Status   TIDSCI15. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI3</name>
							<description>Tra15saction ID Error from SCIn Status   TIDSCI15. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI4</name>
							<description>Tra15saction ID Error from SCIn Status   TIDSCI15. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI5</name>
							<description>Tra15saction ID Error from SCIn Status   TIDSCI15. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI6</name>
							<description>Tra15saction ID Error from SCIn Status   TIDSCI15. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI7</name>
							<description>Tra15saction ID Error from SCIn Status   TIDSCI15. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI8</name>
							<description>Tra15saction ID Error from SCIn Status   TIDSCI15. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI9</name>
							<description>Tra15saction ID Error from SCIn Status   TIDSCI15. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI10</name>
							<description>Tra15saction ID Error from SCIn Status   TIDSCI15. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI11</name>
							<description>Tra15saction ID Error from SCIn Status   TIDSCI15. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI12</name>
							<description>Tra15saction ID Error from SCIn Status   TIDSCI15. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI13</name>
							<description>Tra15saction ID Error from SCIn Status   TIDSCI15. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI14</name>
							<description>Tra15saction ID Error from SCIn Status   TIDSCI15. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI15</name>
							<description>Tra15saction ID Error from SCIn Status   TIDSCI15. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDMCI0</name>
							<description>Tra11saction ID Error from MCIn Status   TIDMCI11. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDMCI1</name>
							<description>Tra11saction ID Error from MCIn Status   TIDMCI11. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDMCI2</name>
							<description>Tra11saction ID Error from MCIn Status   TIDMCI11. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDMCI3</name>
							<description>Tra11saction ID Error from MCIn Status   TIDMCI11. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDMCI4</name>
							<description>Tra11saction ID Error from MCIn Status   TIDMCI11. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDMCI5</name>
							<description>Tra11saction ID Error from MCIn Status   TIDMCI11. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDMCI6</name>
							<description>Tra11saction ID Error from MCIn Status   TIDMCI11. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDMCI7</name>
							<description>Tra11saction ID Error from MCIn Status   TIDMCI11. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDMCI8</name>
							<description>Tra11saction ID Error from MCIn Status   TIDMCI11. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDMCI9</name>
							<description>Tra11saction ID Error from MCIn Status   TIDMCI11. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDMCI10</name>
							<description>Tra11saction ID Error from MCIn Status   TIDMCI11. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDMCI11</name>
							<description>Tra11saction ID Error from MCIn Status   TIDMCI11. Writing 0 to the bit leaves the content unchanged. Writing 1 to the bit clears it. If the bit is simultaneously cleared via software and set due to a          hardware error  the bit remains set and is not cleared.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TIDEN</name>
					<description>Transaction ID Enable Register
 resetvalue={Application Reset:0x0FFF3FFF}</description>
					<addressOffset>1056</addressOffset>
					<size>32</size>
					<resetValue>268386303</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ENSCI0</name>
							<description>E15able Transaction ID Error from SCIn   ENSCI15</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSCI1</name>
							<description>E15able Transaction ID Error from SCIn   ENSCI15</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSCI2</name>
							<description>E15able Transaction ID Error from SCIn   ENSCI15</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSCI3</name>
							<description>E15able Transaction ID Error from SCIn   ENSCI15</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSCI4</name>
							<description>E15able Transaction ID Error from SCIn   ENSCI15</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSCI5</name>
							<description>E15able Transaction ID Error from SCIn   ENSCI15</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSCI6</name>
							<description>E15able Transaction ID Error from SCIn   ENSCI15</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSCI7</name>
							<description>E15able Transaction ID Error from SCIn   ENSCI15</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSCI8</name>
							<description>E15able Transaction ID Error from SCIn   ENSCI15</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSCI9</name>
							<description>E15able Transaction ID Error from SCIn   ENSCI15</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSCI10</name>
							<description>E15able Transaction ID Error from SCIn   ENSCI15</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSCI11</name>
							<description>E15able Transaction ID Error from SCIn   ENSCI15</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSCI12</name>
							<description>E15able Transaction ID Error from SCIn   ENSCI15</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSCI13</name>
							<description>E15able Transaction ID Error from SCIn   ENSCI15</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSCI14</name>
							<description>E15able Transaction ID Error from SCIn   ENSCI15</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSCI15</name>
							<description>E15able Transaction ID Error from SCIn   ENSCI15</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENMCI0</name>
							<description>E11able Transaction ID Error from MCIn   ENMCI11</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENMCI1</name>
							<description>E11able Transaction ID Error from MCIn   ENMCI11</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENMCI2</name>
							<description>E11able Transaction ID Error from MCIn   ENMCI11</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENMCI3</name>
							<description>E11able Transaction ID Error from MCIn   ENMCI11</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENMCI4</name>
							<description>E11able Transaction ID Error from MCIn   ENMCI11</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENMCI5</name>
							<description>E11able Transaction ID Error from MCIn   ENMCI11</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENMCI6</name>
							<description>E11able Transaction ID Error from MCIn   ENMCI11</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENMCI7</name>
							<description>E11able Transaction ID Error from MCIn   ENMCI11</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENMCI8</name>
							<description>E11able Transaction ID Error from MCIn   ENMCI11</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENMCI9</name>
							<description>E11able Transaction ID Error from MCIn   ENMCI11</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENMCI10</name>
							<description>E11able Transaction ID Error from MCIn   ENMCI11</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENMCI11</name>
							<description>E11able Transaction ID Error from MCIn   ENMCI11</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BRCON</name>
					<description>Domain 0 Bridge Control Register
 resetvalue={Application Reset:0x0,Application Reset:0x200,Application Reset:0x0}</description>
					<addressOffset>1072</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>OLDAEN</name>
							<description>Online Data Acquisition Enable   OLDAEN. This bit is used to control trap generated for write accesses to the        OLDA address range associated with this domain.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
