J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>MINIMCDS</name>
			<version>100</version>
			<description>MINIMCDS</description>
			<baseAddress>4218519552</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>12320</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<cluster>
					<name>MCX</name>
					<description>MCX</description>
					<addressOffset>2048</addressOffset>
					<register>
						<dim>16</dim>
						<dimIncrement>4</dimIncrement>
						<name>MCXEVTx[%s]</name>
						<description>Event Definition Register 0
 resetvalue={MCDS Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>EIQ0</name>
								<description>Event Input Qualifier   EIQ15. The value in this field determines how the trigger input  named in the row of CROSSREFERENCE with value x in the column corresponding to this event definition  is connected to the AND gate.</description>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EIQ1</name>
								<description>Event Input Qualifier   EIQ15. The value in this field determines how the trigger input  named in the row of CROSSREFERENCE with value x in the column corresponding to this event definition  is connected to the AND gate.</description>
								<lsb>2</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EIQ2</name>
								<description>Event Input Qualifier   EIQ15. The value in this field determines how the trigger input  named in the row of CROSSREFERENCE with value x in the column corresponding to this event definition  is connected to the AND gate.</description>
								<lsb>4</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EIQ3</name>
								<description>Event Input Qualifier   EIQ15. The value in this field determines how the trigger input  named in the row of CROSSREFERENCE with value x in the column corresponding to this event definition  is connected to the AND gate.</description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EIQ4</name>
								<description>Event Input Qualifier   EIQ15. The value in this field determines how the trigger input  named in the row of CROSSREFERENCE with value x in the column corresponding to this event definition  is connected to the AND gate.</description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EIQ5</name>
								<description>Event Input Qualifier   EIQ15. The value in this field determines how the trigger input  named in the row of CROSSREFERENCE with value x in the column corresponding to this event definition  is connected to the AND gate.</description>
								<lsb>10</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EIQ6</name>
								<description>Event Input Qualifier   EIQ15. The value in this field determines how the trigger input  named in the row of CROSSREFERENCE with value x in the column corresponding to this event definition  is connected to the AND gate.</description>
								<lsb>12</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EIQ7</name>
								<description>Event Input Qualifier   EIQ15. The value in this field determines how the trigger input  named in the row of CROSSREFERENCE with value x in the column corresponding to this event definition  is connected to the AND gate.</description>
								<lsb>14</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EIQ8</name>
								<description>Event Input Qualifier   EIQ15. The value in this field determines how the trigger input  named in the row of CROSSREFERENCE with value x in the column corresponding to this event definition  is connected to the AND gate.</description>
								<lsb>16</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EIQ9</name>
								<description>Event Input Qualifier   EIQ15. The value in this field determines how the trigger input  named in the row of CROSSREFERENCE with value x in the column corresponding to this event definition  is connected to the AND gate.</description>
								<lsb>18</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EIQ10</name>
								<description>Event Input Qualifier   EIQ15. The value in this field determines how the trigger input  named in the row of CROSSREFERENCE with value x in the column corresponding to this event definition  is connected to the AND gate.</description>
								<lsb>20</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EIQ11</name>
								<description>Event Input Qualifier   EIQ15. The value in this field determines how the trigger input  named in the row of CROSSREFERENCE with value x in the column corresponding to this event definition  is connected to the AND gate.</description>
								<lsb>22</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EIQ12</name>
								<description>Event Input Qualifier   EIQ15. The value in this field determines how the trigger input  named in the row of CROSSREFERENCE with value x in the column corresponding to this event definition  is connected to the AND gate.</description>
								<lsb>24</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EIQ13</name>
								<description>Event Input Qualifier   EIQ15. The value in this field determines how the trigger input  named in the row of CROSSREFERENCE with value x in the column corresponding to this event definition  is connected to the AND gate.</description>
								<lsb>26</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EIQ14</name>
								<description>Event Input Qualifier   EIQ15. The value in this field determines how the trigger input  named in the row of CROSSREFERENCE with value x in the column corresponding to this event definition  is connected to the AND gate.</description>
								<lsb>28</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EIQ15</name>
								<description>Event Input Qualifier   EIQ15. The value in this field determines how the trigger input  named in the row of CROSSREFERENCE with value x in the column corresponding to this event definition  is connected to the AND gate.</description>
								<lsb>30</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>42</dim>
						<dimIncrement>4</dimIncrement>
						<name>MCXACTx[%s]</name>
						<description>Action Definition Register 0
 resetvalue={MCDS Reset:0x0}</description>
						<addressOffset>128</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>AIS0</name>
								<description>Action Input Selector   AIS3. Index of the event to be processed. Encoding see CROSSREFERENCE .</description>
								<lsb>0</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AIS1</name>
								<description>Action Input Selector   AIS3. Index of the event to be processed. Encoding see CROSSREFERENCE .</description>
								<lsb>8</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AIS2</name>
								<description>Action Input Selector   AIS3. Index of the event to be processed. Encoding see CROSSREFERENCE .</description>
								<lsb>16</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AIS3</name>
								<description>Action Input Selector   AIS3. Index of the event to be processed. Encoding see CROSSREFERENCE .</description>
								<lsb>24</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AIQ0</name>
								<description>Action Input Qualifier   AIQ3. The value in this field determines how the input bit x is connected to the OR gate edge detection.</description>
								<lsb>5</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AIQ1</name>
								<description>Action Input Qualifier   AIQ3. The value in this field determines how the input bit x is connected to the OR gate edge detection.</description>
								<lsb>13</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AIQ2</name>
								<description>Action Input Qualifier   AIQ3. The value in this field determines how the input bit x is connected to the OR gate edge detection.</description>
								<lsb>21</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AIQ3</name>
								<description>Action Input Qualifier   AIQ3. The value in this field determines how the input bit x is connected to the OR gate edge detection.</description>
								<lsb>29</lsb>
								<msb>30</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>LV0</name>
								<description>Action Input Level Mode   LV3. This bit determines how the event selected by AISq and processed according to AIQq is evaluated. The action is active for one emulation clock cycle if LVq is programmed 0.</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>LV1</name>
								<description>Action Input Level Mode   LV3. This bit determines how the event selected by AISq and processed according to AIQq is evaluated. The action is active for one emulation clock cycle if LVq is programmed 0.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>LV2</name>
								<description>Action Input Level Mode   LV3. This bit determines how the event selected by AISq and processed according to AIQq is evaluated. The action is active for one emulation clock cycle if LVq is programmed 0.</description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>LV3</name>
								<description>Action Input Level Mode   LV3. This bit determines how the event selected by AISq and processed according to AIQq is evaluated. The action is active for one emulation clock cycle if LVq is programmed 0.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<cluster>
						<dim>8</dim>
						<dimIncrement>16</dimIncrement>
						<name>CNT[%s]</name>
						<description>CNT</description>
						<addressOffset>512</addressOffset>
						<register>
							<name>MCXCCLj</name>
							<description>Counter Control Register
 resetvalue={MCDS Reset:0x0}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>INC0</name>
									<description>Count Input Selector   INC1. Index of the event to be processed. Encoding see CROSSREFERENCE . Note that the value 0 in this field does select nothing.</description>
									<lsb>0</lsb>
									<msb>6</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>INC1</name>
									<description>Count Input Selector   INC1. Index of the event to be processed. Encoding see CROSSREFERENCE . Note that the value 0 in this field does select nothing.</description>
									<lsb>16</lsb>
									<msb>22</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ILV0</name>
									<description>Count Input Level Mode   ILV1. For a functional description of the counter see CROSSREFERENCE .</description>
									<lsb>7</lsb>
									<msb>7</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>ILV1</name>
									<description>Count Input Level Mode   ILV1. For a functional description of the counter see CROSSREFERENCE .</description>
									<lsb>23</lsb>
									<msb>23</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CLR0</name>
									<description>Clear Input Selector   CLR1. Index of the event to be processed. Encoding see CROSSREFERENCE . Note that the value 0 in this field does select nothing.</description>
									<lsb>8</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CLR1</name>
									<description>Clear Input Selector   CLR1. Index of the event to be processed. Encoding see CROSSREFERENCE . Note that the value 0 in this field does select nothing.</description>
									<lsb>24</lsb>
									<msb>29</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CLV0</name>
									<description>Clear Input Level Mode   CLV1. For a functional description of the counter see CROSSREFERENCE .</description>
									<lsb>15</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>CLV1</name>
									<description>Clear Input Level Mode   CLV1. For a functional description of the counter see CROSSREFERENCE .</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>MCXLMTj</name>
							<description>Counter Limit Register
 resetvalue={MCDS Reset:0x0}</description>
							<addressOffset>4</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>LIMIT</name>
									<description>Counter Limit   LIMIT. For a functional description of the counter see CROSSREFERENCE .</description>
									<lsb>0</lsb>
									<msb>15</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MOD0</name>
									<description>Modulo Count Control   MOD1. For a functional description of the counter see CROSSREFERENCE .</description>
									<lsb>30</lsb>
									<msb>30</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MOD1</name>
									<description>Modulo Count Control   MOD1. For a functional description of the counter see CROSSREFERENCE .</description>
									<lsb>31</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>MCXCNTj</name>
							<description>Current Count Register
 resetvalue={PowerOn Reset:0x0}</description>
							<addressOffset>8</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>COUNT</name>
									<description>Current Counter   COUNT. For a functional description of the counter see CROSSREFERENCE .</description>
									<lsb>0</lsb>
									<msb>15</msb>
									<access>read-only</access>
								</field>
							</fields>
						</register>
					</cluster>
				</cluster>
				<cluster>
					<name>TCX</name>
					<description>TCX</description>
					<addressOffset>8192</addressOffset>
					<register>
						<name>TCXDCSTS</name>
						<description>Debug Status Register
 resetvalue={PowerOn Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SUS</name>
								<description>Suspended Flag   SUS</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>IDLE</name>
								<description>Run Flag   IDLE</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>HALT</name>
								<description>Halted Flag   HALT. This is basically the DBGSR.HALT bit.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ISR</name>
								<description>Interrupt Service Flag   ISR. This bit indicated whether regular code or a trap interrupt handler is executed.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>HBRK</name>
								<description>Hardware Break Flag   HBRK. This bit reflects the reaction to a break request from a OTGS trigger line  filtered by the EXEVT register.</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>SBRK</name>
								<description>Software Break Flag   SBRK. This bit reflects the reaction to a DEBUG instruction  filtered by the SWEVT register.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>IEN</name>
								<description>Interrupt Enable Flag   IEN</description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>DBGEN</name>
								<description>Debug Enabled Flag   DBGEN</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>CLKDIV</name>
								<description>Current Clock Divider   CLKDIV. The SCU provides the clock for the TriCore as well as for MCDS. The current ration is reported here.</description>
								<lsb>9</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>NESTED_ISR</name>
								<description>Nested Interrupt Level   NESTED ISR. The nested interrupt level is exactly indicated for nesting levels 0          15. For nesting levels greater 15 the value shown is 0xF.</description>
								<lsb>11</lsb>
								<msb>14</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TCXCIP</name>
						<description>Current Instruction Pointer
 resetvalue={PowerOn Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>CURRENT</name>
								<description>Current Instruction Pointer   CURRENT. To help debugging  the last valid value is kept when the TriCore stops executing. The value 0000 0000 indicates that no valid IP was ever seen.</description>
								<lsb>1</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TCXCFT</name>
						<description>Compact Function Trace Register
 resetvalue={MCDS Reset:0x0}</description>
						<addressOffset>12</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>VSHRT_FCT</name>
								<description>Length of very short leaf function   VSHRT FCT. A TriCore 16 bit instruction corresponds to a value of 1  a 32 bit instruction to a value of 2.</description>
								<lsb>0</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SHRT_FCT</name>
								<description>Length of short leaf function   SHRT FCT. This value has to be greater than VSHRT FCT  if VSHRT FCT  lt  gt  0.</description>
								<lsb>16</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<cluster>
						<dim>2</dim>
						<dimIncrement>16</dimIncrement>
						<name>EA[%s]</name>
						<description>EA</description>
						<addressOffset>1024</addressOffset>
						<register>
							<name>TCXEABNDj</name>
							<description>Comparator Bound Register 0
 resetvalue={MCDS Reset:0x0}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>BOUND</name>
									<description>Address Comparator range lower bound   BOUND. For a functional description of the comparator see CROSSREFERENCE . When defining the comparators for the effective address keep in mind that many memory locations can be accessed under two different addresses  namely as cached or non cached memory range.</description>
									<lsb>0</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TCXEARNGj</name>
							<description>Comparator Range Register 0
 resetvalue={MCDS Reset:0x0FFFFFFFF}</description>
							<addressOffset>4</addressOffset>
							<size>32</size>
							<resetValue>4294967295</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>RANGE</name>
									<description>Address Comparator range size   RANGE. For a functional description of the comparator see CROSSREFERENCE .</description>
									<lsb>0</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
					</cluster>
					<cluster>
						<dim>2</dim>
						<dimIncrement>32</dimIncrement>
						<name>WD[%s]</name>
						<description>WD</description>
						<addressOffset>1152</addressOffset>
						<register>
							<name>TCXWDBNDj</name>
							<description>Comparator Bound Register 0
 resetvalue={MCDS Reset:0x0}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>BOUND</name>
									<description>Data Comparator range lower bound   BOUND. For a functional description of the comparator see CROSSREFERENCE .</description>
									<lsb>0</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TCXWDRNGj</name>
							<description>Comparator Range Register 0
 resetvalue={MCDS Reset:0x0}</description>
							<addressOffset>8</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>RANGE</name>
									<description>Data Comparator range size   RANGE. For a functional description of the comparator see CROSSREFERENCE .</description>
									<lsb>0</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
