J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
						<register>
							<name>TCXWDMSKj</name>
							<description>Comparator Mask Register 0
 resetvalue={MCDS Reset:0x0FFFFFFFF}</description>
							<addressOffset>16</addressOffset>
							<size>32</size>
							<resetValue>4294967295</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>MASK</name>
									<description>Data Comparator bit mask   MASK. For a functional description of the comparator see CROSSREFERENCE .</description>
									<lsb>0</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TCXWDSGNj</name>
							<description>Comparator Sign Register 0
 resetvalue={MCDS Reset:0x0}</description>
							<addressOffset>28</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>SIGN</name>
									<description>Bit number  1 31  of sign bit   SIGN. For a functional description of the comparator see CROSSREFERENCE .</description>
									<lsb>0</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
					</cluster>
					<cluster>
						<dim>2</dim>
						<dimIncrement>24</dimIncrement>
						<name>AC[%s]</name>
						<description>AC</description>
						<addressOffset>1280</addressOffset>
						<register>
							<name>TCXACBNDj</name>
							<description>Comparator Bound Register 0
 resetvalue={MCDS Reset:0x0}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>BOUND</name>
									<description>Mode Comparator range lower bound   BOUND. The bit string  consisting of SVM  bus master ID  sub channel and direction  masked by TCXACMSKx  is compared to this lower bound. For a functional description of the comparator see CROSSREFERENCE .</description>
									<lsb>0</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TCXACRNGj</name>
							<description>Comparator Range Register 0
 resetvalue={MCDS Reset:0x0}</description>
							<addressOffset>4</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>RANGE</name>
									<description>Mode Comparator range size   RANGE. For a functional description of the comparator see CROSSREFERENCE .</description>
									<lsb>0</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TCXACMSKj</name>
							<description>Comparator Mask Register 0
 resetvalue={MCDS Reset:0x7FFF}</description>
							<addressOffset>8</addressOffset>
							<size>32</size>
							<resetValue>32767</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>SVM</name>
									<description>Comparator bit mask for Supervisor Mode   SVM. For a functional description of the comparator see CROSSREFERENCE .</description>
									<lsb>0</lsb>
									<msb>0</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MASTER</name>
									<description>Comparator bit mask for Master ID   MASTER. The master ID from the bus  encoding see CROSSREFERENCE   is ANDed with this bit pattern and the result used as bit  4 1  for the comparison. For a functional description of the comparator see CROSSREFERENCE .</description>
									<lsb>1</lsb>
									<msb>4</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>SUBCHANNEL</name>
									<description>Comparator bit mask for Sub channel ID   SUBCHANNEL. The sub channel ID from the bus  encoding see CROSSREFERENCE          is ANDed with this bit pattern and the result used as bit  11 5  for the        comparison. For a functional description of the comparator see CROSSREFERENCE .</description>
									<lsb>5</lsb>
									<msb>11</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>WR</name>
									<description>Comparator bit mask for Direction Write   WR. For a functional description of the comparator see CROSSREFERENCE .</description>
									<lsb>12</lsb>
									<msb>12</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>RD</name>
									<description>Comparator bit mask for Direction Read   RD. For a functional description of the comparator see CROSSREFERENCE .</description>
									<lsb>13</lsb>
									<msb>13</msb>
									<access>read-write</access>
								</field>
								<field>
									<name>MSK</name>
									<description>Bit mask for Transaction Type   MSK. For a functional description of the comparator see CROSSREFERENCE . The MSK bits of a register group are ORed. Setting the bit in one of the registers  x 0 3  enables the bit mask functionality.</description>
									<lsb>14</lsb>
									<msb>14</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
					</cluster>
					<cluster>
						<dim>2</dim>
						<dimIncrement>16</dimIncrement>
						<name>IP[%s]</name>
						<description>IP</description>
						<addressOffset>4096</addressOffset>
						<register>
							<name>TCXIPBNDj</name>
							<description>Comparator Bound Register 0
 resetvalue={MCDS Reset:0x0}</description>
							<addressOffset>0</addressOffset>
							<size>32</size>
							<resetValue>0</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>BOUND</name>
									<description>IP Comparator range lower bound   BOUND. As TriCore instructions are sized in multiples of 16 bit the LSB is fixed to 0. For a functional description of the comparator see CROSSREFERENCE . When defining the comparators for the TriCore instruction pointer keep in mind that many memory locations can be accessed under two different addresses  namely as cached or non cached memory range.</description>
									<lsb>1</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
						<register>
							<name>TCXIPRNGj</name>
							<description>Comparator Range Register 0
 resetvalue={MCDS Reset:0x0FFFFFFFE}</description>
							<addressOffset>4</addressOffset>
							<size>32</size>
							<resetValue>4294967294</resetValue>
							<resetMask>4294967295</resetMask>
							<fields>
								<field>
									<name>RANGE</name>
									<description>IP Comparator range size   RANGE. As TriCore instructions are sized in multiples of 16 bit the LSB is fixed to 0. For a functional description of the comparator see CROSSREFERENCE .</description>
									<lsb>1</lsb>
									<msb>31</msb>
									<access>read-write</access>
								</field>
							</fields>
						</register>
					</cluster>
				</cluster>
				<register>
					<name>CLC</name>
					<description>Clock Control Register
 resetvalue={PowerOn Reset:0x3}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>3</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Disable Request Bit   DISR. This bit is used to request a change of the clocking state. Turn off requests are ignored while the Flush flag is not asserted.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Disable Status Bit   DISS. This bit field indicates the current clocking state.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OCS</name>
					<description>OCDS Control and Status
 resetvalue={MCDS Reset:0x0}</description>
					<addressOffset>4</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SUS</name>
							<description>OCDS Suspend Control   SUS. Controls the sensitivity to the suspend signal coming from the SCU before Power On Reset</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SUS_P</name>
							<description>SUS Write Protection   SUS P. SUS is only written when SUS P is 1  otherwise unchanged. Read as 0.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SUSSTA</name>
							<description>Suspend State inverted busy o    SUSSTA</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Module Identification Register
 resetvalue={PowerOn Reset:0x0D6C007,MCDS Reset:0x0,Debug Reset:0x0}</description>
					<addressOffset>8</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision   MOD REV. This bit field indicates the revision number of the module implementation.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type   MOD TYPE</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number   MOD NUMBER</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CT</name>
					<description>MCDS Control Register
 resetvalue={PowerOn Reset:0x0A0,MCDS Reset:0x0,Debug Reset:0x0}</description>
					<addressOffset>16</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>KOK</name>
							<description>Key OK Flag   KOK. This bit is always set for MINIMCDS .</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>KAV</name>
							<description>Key Available Flag   KAV. This bit is always set for MINIMCDS .</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EN</name>
							<description>MCDS Enable Flag   EN. This bit field indicates whether the MCDS is write enabled.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRE</name>
							<description>Clear MCDS Enable Flag   CLRE. This bit allows to reset the MCDS enable Flag by software and thus to write protect the MCDS address range.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SETE</name>
							<description>Set MCDS Enable Flag   SETE. This control bit is the only way to set the MCDS enable flag.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>BED</name>
							<description>Bus Error Disable Flag   BED. This bit field indicates whether writing to an SFR not implemented in        the MCDS address space is considered an error. In TC3xx the usage of this bit is obsolete for miniMCDS.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BED_P</name>
							<description>Bus Error Disable Protection   BED P. This bit determines whether BED is changed by a write to the CT register.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>IRA</name>
							<description>Invalid Read Access Flag   IRA. This bit field indicates whether any read access to the MCDS address range failed. This is not a bus error  the MCDS module just returns all zeros in this case.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRI</name>
							<description>Clear Invalid Access Bits   CLRI. This control bit is the only way the clear the error bits.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>IWA</name>
							<description>Invalid Write Access Flag   IWA. This bit field indicates whether any write access to the MCDS address range failed. The MCDS module ignores the data of erroneous writes.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RES</name>
							<description>MCDS ResetFlag   RES. This bit reflects the current value of the MCDS Reset request. Granting of the request will automatically clear this bit.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>MCDS ResetRequest Bit   SETR. This bit can be used to cause a MCDS Reset   affecting debug resources like the MCDS registers as specified in the Reset behavior tables.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MUX</name>
					<description>MCDS Signal Source Control
 resetvalue={PowerOn Reset:0x0}</description>
					<addressOffset>20</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TMUX0</name>
							<description>Trace Source Select 0   TMUX0. This bit field determines which trace source is seen by POBx. This bit field can only be changed  if TM0 P is written   x2018 1  x2019   xa0 simultaneously. Not all sources are available in all products of the family. Please refer to Platform Feature Overview table of the TC3xx documentation.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TM0_P</name>
							<description>Trace Source Select 3 Protection   TM3 P. This bit determines whether TMUXz is changed by a write to the MUX register. TM1 P  TM2 P  TM3 P are not relevant for miniMCDS.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TM1_P</name>
							<description>Trace Source Select 3 Protection   TM3 P. This bit determines whether TMUXz is changed by a write to the MUX register. TM1 P  TM2 P  TM3 P are not relevant for miniMCDS.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TM2_P</name>
							<description>Trace Source Select 3 Protection   TM3 P. This bit determines whether TMUXz is changed by a write to the MUX register. TM1 P  TM2 P  TM3 P are not relevant for miniMCDS.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TM3_P</name>
							<description>Trace Source Select 3 Protection   TM3 P. This bit determines whether TMUXz is changed by a write to the MUX register. TM1 P  TM2 P  TM3 P are not relevant for miniMCDS.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TMUX1</name>
							<description>Trace Source Select 1   TMUX1. Not relevant for miniMCDS.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TMUX2</name>
							<description>Trace Source Select 2   TMUX2. Not relevant for miniMCDS.</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TMUX3</name>
							<description>Trace Source Select 3   TMUX3. Not relevant for miniMCDS.</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MUX_TC_RC</name>
					<description>MCDS TC Signal Source Control
 resetvalue={PowerOn Reset:0x0}</description>
					<addressOffset>32</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TC_MUX0</name>
							<description>TC MUX Trace Source Select   TC MUX5. This bit field determines which trace source is selected. This bit field can only be changed  if TC TM P is written          8216 1  8217   160 simultaneously. Not all CPUs are available in all products of the family.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TC_MUX1</name>
							<description>TC MUX Trace Source Select   TC MUX5. This bit field determines which trace source is selected. This bit field can only be changed  if TC TM P is written          8216 1  8217   160 simultaneously. Not all CPUs are available in all products of the family.</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TC_MUX2</name>
							<description>TC MUX Trace Source Select   TC MUX5. This bit field determines which trace source is selected. This bit field can only be changed  if TC TM P is written          8216 1  8217   160 simultaneously. Not all CPUs are available in all products of the family.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TC_MUX3</name>
							<description>TC MUX Trace Source Select   TC MUX5. This bit field determines which trace source is selected. This bit field can only be changed  if TC TM P is written          8216 1  8217   160 simultaneously. Not all CPUs are available in all products of the family.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TC_MUX4</name>
							<description>TC MUX Trace Source Select   TC MUX5. This bit field determines which trace source is selected. This bit field can only be changed  if TC TM P is written          8216 1  8217   160 simultaneously. Not all CPUs are available in all products of the family.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TC_MUX5</name>
							<description>TC MUX Trace Source Select   TC MUX5. This bit field determines which trace source is selected. This bit field can only be changed  if TC TM P is written          8216 1  8217   160 simultaneously. Not all CPUs are available in all products of the family.</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TC_TM_P</name>
							<description>TC MUX Trace Source Select Protection   TC TM P. This bit determines whether TC MUXz is changed by a write to the MUX TC RC register.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RC</name>
							<description>Reference Clock Select   RC. This control bit determines which source is used as reference clock by        the TSU. This bit can only be changed  if RC P is written   8216 1  8217   160 simultaneously. The reference clock source is sampled with the emulation clock.          Therefore no reference clock faster than half the emulation clock must          be used.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RC_P</name>
							<description>Reference Clock Select Protection   RC P. This bit determines whether RC is changed by a write to the MUX TC RC register.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FIFONOW</name>
					<description>Trace Buffer Write Pointer
 resetvalue={PowerOn Reset:0x0}</description>
					<addressOffset>512</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>NOW</name>
							<description>Trace Buffer Current Write Pointer   NOW. This number is the current value of the DMC s internal write pointer. When tracing stops this register points to the buffer memory word containing the  lt end of trace gt  message. The relevant width of the field depends on the size of the buffer memory see CROSSREFERENCE</description>
							<lsb>5</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FIFOBOT</name>
					<description>Trace Buffer Bottom Register
 resetvalue={MCDS Reset:0x0}</description>
					<addressOffset>516</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>BOTTOM</name>
							<description>Trace Buffer lower Bound   BOTTOM. See CROSSREFERENCE for a functional description. The relevant width of the field depends on the size of the buffer memory see CROSSREFERENCE</description>
							<lsb>10</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FIFOPRE</name>
					<description>Trace Buffer PRE POST Register
 resetvalue={MCDS Reset:0x0}</description>
					<addressOffset>520</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PRE</name>
							<description>Trace Buffer Pre Trigger Area Size   PRE. See CROSSREFERENCE for a functional description. The relevant width of the field depends on the size of the buffer memory see CROSSREFERENCE</description>
							<lsb>5</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FIFOTOP</name>
					<description>Trace Buffer Top Register
 resetvalue={MCDS Reset:0x1FFF}</description>
					<addressOffset>524</addressOffset>
					<size>32</size>
					<resetValue>8191</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TOP</name>
							<description>Trace Buffer upper Bound   TOP. See CROSSREFERENCE for a functional description. The relevant width of the field depends on the size of the buffer memory see CROSSREFERENCE</description>
							<lsb>5</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
