J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>FIFOCTL</name>
					<description>Trace Buffer Control Register
 resetvalue={PowerOn Reset:0x2002}</description>
					<addressOffset>528</addressOffset>
					<size>32</size>
					<resetValue>8194</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TRG</name>
							<description>Trigger Received Flag   TRG. This bit indicated whether the trace recording is in the PRE or POST Trigger area. The switch is controlled by the trace done action of TQU MCX. The TRG flag is cleared by the next CLR bit.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FFE</name>
							<description>FIFO Feeder Empty   FFE. This bit indicates that all primary  secondary and DMC internal FIFOs have been emptied. After Power On Reset and MCDS Reset this bit will be set automatically as the FIFOs are flushed synchronously.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRDIS</name>
							<description>Trigger DisableFlag   TRDIS. This bit shows the current state of the Trigger Disable control signal. The Trigger Disable signal can be set by the TROFF bit. The Trigger Disable signal can be cleared by the TRON bit. This bit is automatically reset by MCDS Reset .</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRON</name>
							<description>ClearTrigger DisableFlag   TRON. This write only bit is used by the tool to globally enable all trigger pools of all TQUs.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TROFF</name>
							<description>SetTrigger DisableFlag   TROFF. This write only bit is the only way to set the Trigger Disable flag. It is used to mask  disable  all trigger pools of all TQUs.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FLSH</name>
							<description>FlushFlag   FLSH. This bit shows the current state of the Flush control signal. The Flush signal can be set by the SET bit and by the hardware  at end of trace . The Flush signal can only be cleared by the CLR bit. This bit is automatically set by MCDS Reset .</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CLR</name>
							<description>ClearFlushFlag   CLR. This write only bit is the only way to start trace recording.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SET</name>
							<description>SetFlushFlag   SET. This write only bit is the only way to set the Flush flag by software.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>FIFOWARNx[%s]</name>
					<description>Trace Buffer Comparator Register
 resetvalue={MCDS Reset:0x0}</description>
					<addressOffset>532</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>WARN</name>
							<description>Trace Buffer Warn Level   WARN. See CROSSREFERENCE for a functional description. The relevant width of the field depends on the size of the buffer memory see CROSSREFERENCE</description>
							<lsb>5</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN</name>
							<description>Enable Trigger Generation   EN</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FIFOOVRCNT</name>
					<description>FIFO Overflow Counter Register
 resetvalue={PowerOn Reset:0x0}</description>
					<addressOffset>540</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>COUNT</name>
							<description>FIFO Overflow Counter   COUNT. The counter increments in case an ERR message is written to one of the        Trace Unit FIFOs. In case multiple error messages are written the counter still        increments just by one.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CLR</name>
							<description>Clear counter   CLR</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSUREFCNT</name>
					<description>Clock Counter Register
 resetvalue={PowerOn Reset:0x0}</description>
					<addressOffset>1024</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>COUNT</name>
							<description>Current Count Value   COUNT. For a functional description of the counter see CROSSREFERENCE .</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSUPRSCL</name>
					<description>Clock Prescaler Register
 resetvalue={PowerOn Reset:0x0}</description>
					<addressOffset>1028</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RELOAD</name>
							<description>Prescaler Reload Value   RELOAD. For a functional description of the prescaler see CROSSREFERENCE .</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSUEMUCNT</name>
					<description>Clock Counter Register
 resetvalue={PowerOn Reset:0x0}</description>
					<addressOffset>1032</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>COUNT</name>
							<description>Current Count Value   COUNT. For a functional description of the counter see CROSSREFERENCE .</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
