J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>CPU0</name>
			<version>100</version>
			<description>CPU</description>
			<baseAddress>4169138176</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>131008</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<cluster>
					<dim>18</dim>
					<dimIncrement>8</dimIncrement>
					<name>DPR[%s]</name>
					<description>DPR</description>
					<addressOffset>114688</addressOffset>
					<register>
						<name>DPRy_L</name>
						<description>CPUx Data Protection Range 0  Lower Bound Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>LOWBND</name>
								<description>DPRy Lower Boundary Address   LOWBND</description>
								<lsb>3</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>DPRy_U</name>
						<description>CPUx Data Protection Range 0  Upper Bound Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>UPPBND</name>
								<description>DPRy Upper Boundary Address   UPPBND</description>
								<lsb>3</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<dim>10</dim>
					<dimIncrement>8</dimIncrement>
					<name>CPR[%s]</name>
					<description>CPR</description>
					<addressOffset>118784</addressOffset>
					<register>
						<name>CPRy_L</name>
						<description>CPUx Code Protection Range 0 Lower Bound Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>LOWBND</name>
								<description>CPRy Lower Boundary Address   LOWBND</description>
								<lsb>5</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CPRy_U</name>
						<description>CPUx Code Protection Range 0 Upper Bound Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>UPPBND</name>
								<description>CPR0 m Upper Boundary Address   UPPBND</description>
								<lsb>5</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<name>TPS</name>
					<description>TPS</description>
					<addressOffset>123904</addressOffset>
					<register>
						<name>CON</name>
						<description>CPUx Temporal Protection System Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TEXP0</name>
								<description>Timer0 Expired Flag   TEXP0. Set when the corresponding timer expires. Cleared on any write to the  TIMER0 register.</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TEXP1</name>
								<description>Timer1 Expired Flag   TEXP1. Set when the corresponding timer expires. Cleared on any write to the  TIMER1 register.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TEXP2</name>
								<description>Timer1 Expired Flag   TEXP2. Set when the corresponding timer expires. Cleared on any write to the  TIMER1 register.</description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TTRAP</name>
								<description>Temporal Protection Trap   TTRAP. If set  indicates that a TAE trap has been requested. Any subsequent TAE traps are disabled. A write clears the flag and re enables TAE traps.</description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<dim>3</dim>
						<dimIncrement>4</dimIncrement>
						<name>TIMER[%s]</name>
						<description>CPUx Temporal Protection System Timer Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>Timer</name>
								<description>Temporal Protection Timer   Timer. Writing zero de activates the Timer. Writing a non zero value starts the Timer. Any write clears the corresponding TPS CON.TEXP flag. Read returns the current Timer value.</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<name>TPS_EXTIM</name>
					<description>TPS EXTIM</description>
					<addressOffset>123968</addressOffset>
					<register>
						<name>ENTRY_LVAL</name>
						<description>CPUx Exception Entry Timer Load Value
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ENTRY_LVAL</name>
								<description>Exception Entry Timer Load value   ENTRY LVAL. Value loaded into the exception entry timer on detection of an enabled exception. Bits  3 0  are constrained to be 0</description>
								<lsb>4</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ENTRY_CVAL</name>
						<description>CPUx Exception Entry Timer Current Value
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ENTRY_CVAL</name>
								<description>Exception Entry Timer Current Value   ENTRY CVAL. Current value of the exception entry timer.</description>
								<lsb>0</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>EXIT_LVAL</name>
						<description>CPUx Exception Exit  Timer Load Value
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>EXIT_LVAL</name>
								<description>Exception Exit Timer Load value   EXIT LVAL. Value loaded into the exception exit timer on detection of an enabled exception. Bits  3 0  are constrained to be 0</description>
								<lsb>4</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>EXIT_CVAL</name>
						<description>CPUx Exception Exit Timer Current Value
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>12</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>EXIT_CVAL</name>
								<description>Exception Exit Timer Current Value   EXIT CVAL. Current value of the exception exit timer.</description>
								<lsb>0</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>CLASS_EN</name>
						<description>CPUx Exception Timer Class Enable Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>16</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>EXTIM_CLASS_EN</name>
								<description>Exception Timer Class Enables   EXTIM CLASS EN. Trap Class enables for exception timer.</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>STAT</name>
						<description>CPUx Exception Timer Status Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>20</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>EXIT_TIN</name>
								<description>Exception Exit Timer TIN   EXIT TIN. Exception Exit Timer TIN of triggering trap.</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EXIT_CLASS</name>
								<description>Exception Exit Timer Class   EXIT CLASS. Exception exit Timer Class of triggering trap.</description>
								<lsb>8</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EXIT_AT</name>
								<description>Exception Exit Timer Alarm Triggered   EXIT AT. Exception Exit Timer Alarm triggered sticky bit. Alarm triggered since last cleared.</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ENTRY_TIN</name>
								<description>Exception Entry Timer TIN   ENTRY TIN. Exception Entry Timer TIN of triggering trap.</description>
								<lsb>16</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENTRY_CLASS</name>
								<description>Exception Entry Timer Class   ENTRY CLASS. Exception Entry Timer Class of triggering trap.</description>
								<lsb>24</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ENTRY_AT</name>
								<description>Exception Entry Timer Alarm Triggered   ENTRY AT. Exception Entry Timer Alarm triggered sticky bit. Alarm triggered since last cleared.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>FCX</name>
						<description>CPUx Exception Timer FCX Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>24</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>EXIT_FCX</name>
								<description>Exception Exit Timer FCX   EXIT FCX. Exception Exit Timer FCX of triggering trap.</description>
								<lsb>0</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<name>FPU_TRAP</name>
					<description>FPU TRAP</description>
					<addressOffset>106496</addressOffset>
					<register>
						<name>CON</name>
						<description>CPUx Trap Control Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TST</name>
								<description>Trap Status   TST</description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>TCL</name>
								<description>Trap Clear   TCL. Read  always reads as 0.</description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>write-only</access>
							</field>
							<field>
								<name>RM</name>
								<description>Captured Rounding Mode   RM. The rounding mode of the captured instruction. Only valid when TST is asserted. Note that this is the rounding mode supplied to the FPU for the exceptional instruction. UPDFL instructions may cause a trap and change the rounding mode. In this case the RM bits capture the input rounding mode</description>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>FXE</name>
								<description>FX Trap Enable   FXE. When set  an instruction generating an FX exception will trigger a trap.</description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FUE</name>
								<description>FU Trap Enable   FUE. When set  an instruction generating an FU exception will trigger a trap.</description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FZE</name>
								<description>FZ Trap Enable   FZE. When set  an instruction generating an FZ exception will trigger a trap.</description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FVE</name>
								<description>FV Trap Enable   FVE. When set  an instruction generating an FV exception will trigger a trap.</description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FIE</name>
								<description>FI Trap Enable   FIE. When set  an instruction generating an FI exception will trigger a trap.</description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>FX</name>
								<description>Captured FX   FX. Asserted if the captured instruction asserted FX. Only valid when TST is asserted.</description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>FU</name>
								<description>Captured FU   FU. Asserted if the captured instruction asserted FU. Only valid when TST is asserted.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>FZ</name>
								<description>Captured FZ   FZ. Asserted if the captured instruction asserted FZ. Only valid when TST is asserted</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>FV</name>
								<description>Captured FV   FV. Asserted if the captured instruction asserted FV. Only valid when TST is asserted</description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>FI</name>
								<description>Captured FI   FI. Asserted if the captured instruction asserted FI. Only valid when TST is asserted</description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>PC</name>
						<description>CPUx Trapping Instruction Program Counter Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>PC</name>
								<description>Captured Program Counter   PC. The program counter  virtual address  of the captured instruction. Only valid when FPU TRAP CON.TST is asserted.</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>OPC</name>
						<description>CPUx Trapping Instruction Opcode Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>OPC</name>
								<description>Captured Opcode   OPC. The secondary opcode of the captured instruction. When FPU TRAP OPC.FMT 0 only bits  3 0  are defined. OPC is valid only when FPU TRAP CON.TST is asserted.</description>
								<lsb>0</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>FMT</name>
								<description>Captured Instruction Format   FMT. The format of the captured instruction s opcode. Only valid when FPU TRAP CON.TST is asserted.</description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>DREG</name>
								<description>Captured Destination Register   DREG. The destination register of the captured instruction. ... Only valid when FPU TRAP CON.TST is asserted.</description>
								<lsb>16</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>SRC1</name>
						<description>CPUx Trapping Instruction Operand Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>16</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SRC1</name>
								<description>Captured SRC1 Operand   SRC1. The SRC1 operand of the captured instruction. Only valid when FPU TRAP CON.TST is asserted.</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>SRC2</name>
						<description>CPUx Trapping Instruction Operand Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>20</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SRC2</name>
								<description>Captured SRC2 Operand   SRC2. The SRC2 operand of the captured instruction. Only valid when FPU TRAP CON.TST is asserted.</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>SRC3</name>
						<description>CPUx Trapping Instruction Operand Register
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>24</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>SRC3</name>
								<description>Captured SRC3 Operand   SRC3. The SRC3 operand of the captured instruction. Only valid when FPU TRAP CON.TST is asserted.</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<dim>8</dim>
					<dimIncrement>8</dimIncrement>
					<name>TR[%s]</name>
					<description>Trigger</description>
					<addressOffset>126976</addressOffset>
					<register>
						<name>TRiEVT</name>
						<description>CPUx Trigger Event 0
 resetvalue={Debug Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>EVTA</name>
								<description>Event Associated   EVTA. Specifies the Debug Action associated with the Debug Event </description>
								<lsb>0</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BBM</name>
								<description>Break Before Make  BBM  or Break After Make  BAM  Selection   BBM. Code triggers BBM or BAM selection. Data access and data code combination access triggers can only create BAM Debug Events. When these triggers occur  TRnEVT.BBM is ignored.</description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>BOD</name>
								<description>Breakout Disable   BOD</description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>SUSP</name>
								<description>CDC Suspend Out Signal State   SUSP. Value to be assigned to the CDC suspend out signal when the Debug Event is raised.</description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>CNT</name>
								<description>Counter   CNT. When this event occurs adjust the control of the performance counters in task mode as follows </description>
								<lsb>6</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>TYP</name>
								<description>Input Selection   TYP</description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>RNG</name>
								<description>Compare Type   RNG. Once an even numbered comparator has been set to range  the EVTR settings of its associated upper neighbour will be ignored.</description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ASI_EN</name>
								<description>Enable ASI Comparison   ASI EN</description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ASI</name>
								<description>Address Space Identifier   ASI. The ASI of the Debug Trigger process.</description>
								<lsb>16</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>AST</name>
								<description>Address Store   AST. Used in conjunction with TYP 0</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ALD</name>
								<description>Address Load   ALD. Used in conjunction with TYP 0</description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>TRiADR</name>
						<description>CPUx Trigger Address 0
 resetvalue={Debug Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ADDR</name>
								<description>Comparison Address   ADDR. For PC comparison  bit 0  is always zero.</description>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<dim>8</dim>
					<dimIncrement>16</dimIncrement>
					<name>RGN[%s]</name>
					<description>RGN</description>
					<addressOffset>57344</addressOffset>
					<register>
						<name>SPR_SPROT_RGNLAi</name>
						<description>CPUx Safety Protection SPR Region Lower Address Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ADDR</name>
								<description>Region Lower Address   ADDR. Bits 31 to 5 of the address which is the lower bound of the defined memory region</description>
								<lsb>5</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
