J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>FLASHCON0</name>
					<description>CPUx Flash Configuration Register 0
 resetvalue={Application Reset:0x3F3F3F3F,CFS Value:0x22212120}</description>
					<addressOffset>4352</addressOffset>
					<size>32</size>
					<resetValue>572596512</resetValue>
					<resetMask>3806454240</resetMask>
					<fields>
						<field>
							<name>TAG1</name>
							<description>Flash Prefetch Buffer 1 Configuration. FPB is assigned to on  xa0 chip  xa0 bus master with master tag id equal to TAG1.</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TAG2</name>
							<description>Flash Prefetch Buffer 2 Configuration. FPB is assigned to on  xa0 chip  xa0 bus master with master tag id equal to TAG2.</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TAG3</name>
							<description>Flash Prefetch Buffer 3 Configuration. FPB is assigned to on chip bus master with master tag id equal to TAG3.</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TAG4</name>
							<description>Flash Prefetch Buffer 4 Configuration. FPB is assigned to on chip bus master with master tag id equal to TAG4.</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FLASHCON1</name>
					<description>CPUx Flash Configuration Register 1
 resetvalue={Application Reset:0x2020000}</description>
					<addressOffset>4356</addressOffset>
					<size>32</size>
					<resetValue>33685504</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>STALL</name>
							<description>Stall Bus Request. This field must not be changed while any bank is busy. The results are        unpredictable. It is strongly recommended to configure this field once        and avoid changing it during operation. Reading a flash bank  erase counter  or status register  in Sleep Mode        must result in a bus error independent of this field  although it        reports   8220 busy  8221  .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Error0</name>
									<description>0 B Error Reading local PFlash bank  erase counter  or status registers  when DMU STATUS.PxBUSY is set  generates a bus error.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Stall1</name>
									<description>1 B Stall Reading local PFlash bank  erase counter  or status registers when DMU HF STATUS.PxBUSY is set delays the response by inserting additional wait cycles until PxBUSY is cleared.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MASKUECC</name>
							<description>Mask PFLASH Uncorrectable ECC Bit Error. No value other than 01 B or 10 B shall be programmed in the register bitfields. The system will behave as specified for 10 B if 00 B or 11 B is programmed.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FLASHCON2</name>
					<description>CPUx Flash Configuration Register 2
 resetvalue={Application Reset:0x0AA020A0A}</description>
					<addressOffset>4360</addressOffset>
					<size>32</size>
					<resetValue>2852260362</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RECDIS</name>
							<description>Address Buffer Recording Disable. The system will behave as specified for 10 B if 00 B or 11 B is programmed  and an alarm will be generated. SBAB         DBAB  MBAB and ZBAB alarms will not be generated if RECDIS is 01 B .</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ECCCORDIS</name>
							<description>ECC Correction Disable   ECCCORDIS. The system will behave as specified for 10 B if 00 B or 11 B is programmed  and an alarm will be generated on the        next read.</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HMARGIN</name>
							<description>Hard Margin Selection. This register setting is effective only if FLASHCON2.MSEL   01 B . The system will behave as specified for 10 B if 00 B or        11 B is programmed  and an alarm will be generated.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MSEL</name>
							<description>Margin Read Selection. The system will behave as specified for 10 B if 00 B or 11 B is programmed  and an alarm will be generated.</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ECCSCLR</name>
							<description>Clear ECC Status Register. The system will behave as specified for 10 B if 00 B or 11 B is programmed  and an alarm will be generated.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SBABCLR</name>
							<description>Clear SBAB Record Registers. The system will behave as specified for 10 B if 00 B or 11 B is programmed  and an alarm will be generated.</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>DBABCLR</name>
							<description>Clear DBAB Record Registers. The system will behave as specified for 10 B if 00 B or 11 B is programmed  and an alarm will be generated.</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MBABCLR</name>
							<description>Clear MBAB Record Registers. The system will behave as specified for 10 B if 00 B or 11 B is programmed  and an alarm will be generated.</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ZBABCLR</name>
							<description>Clear ZBAB Record Registers   ZBABCLR. The system will behave as specified for 10 B if 00 B or 11 B is programmed  and an alarm will be generated.</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FLASHCON3</name>
					<description>CPUx Flash Configuration Register 3
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4364</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ECCERRINJ</name>
							<description>ECC Error Injection . Setting this bit enforces an error in the ECC error correction        supervision circuit. This can be used to check the correct function of        this circuit.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EDCERRINJ</name>
							<description>EDC Error Injection. Setting this bit enforces an error in the EDC checker logic. This can be        used to check the correct function of this circuit.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SBABERRINJ</name>
							<description>Corrected Single Bits Address Buffer  SBAB  Error Injection. Error injection logic to check the correct function of the SMU alarm.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DBABERRINJ</name>
							<description>Corrected Double Bits Address Buffer  DBAB  Error Injection. Error injection logic to check the correct function of the SMU alarm.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MBABERRINJ</name>
							<description>Uncorrected Multi Bit Address Buffer  MBAB  Error Injection. Error injection logic to check the correct function of the SMU alarm.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ZBABERRINJ</name>
							<description>Uncorrected All Zeros Bits Address Buffer  ZBAB  Error Injection. Error injection logic to check the correct function of the SMU alarm.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SBERERRINJ</name>
							<description>Single Bit Error  SBER  Injection . Setting this bit generates SBER SMU alarm  and can be used to check the        correct function of this alarm.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DBERERRINJ</name>
							<description>Double Bit Error  DBER  Injection. Setting this bit generates DBER SMU alarm and can be used to check the        correct function of the DBER SMU alarm.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NVMCERRINJ</name>
							<description>NVM Configuration  NVMCER  Injection. Setting this bit enforces an error from the error detection logic        covering NVM configuration registers  and can be used to check the        correct function of the NVMCER SMU alarm.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FLCONERRINJ</name>
							<description>Flashcon Error  FLCONER  Injection. Setting this bit enforces an error from the error detection logic        covering FLASHCON complement pair register bits in the PFRWB  RECDIS         ECCCORDIS  HMARGIN  MSEL and all CLR bits   and can be used to check the        correct function of the FLCONER SMU alarm.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FLASHCON4</name>
					<description>CPUx Flash Configuration Register 4
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>4368</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DDIS</name>
							<description>Disable direct LPB access. Disable direct access by the CPU to the Local Pflash Bank  LPB .</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OSEL</name>
					<description>CPUx  Overlay Range Select Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>64256</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SHOVEN_x</name>
							<description>Shadow Overlay Enable   SHOVEN x . One enable bit is provided for each of the 32 overlay blocks.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
