J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PFI0</name>
			<version>100</version>
			<description>PFI</description>
			<baseAddress>2819096576</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>274532</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<cluster>
					<dim>17</dim>
					<dimIncrement>32</dimIncrement>
					<name>SBAB[%s]</name>
					<description>SBAB</description>
					<addressOffset>8192</addressOffset>
					<register>
						<name>SBABRECORDx</name>
						<description>SBAB Record 0
 resetvalue={System Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ADDR</name>
								<description>Address   ADDR. Captured local PFLASH bank address of the page with detected error.</description>
								<lsb>5</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ECMK</name>
								<description>Erase Counter Marker   ECMK. The captured address is from the Flash or Erase Counter.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RES</name>
								<description>Reserved   RES. Always read as 0  should be written with 0.</description>
								<lsb>28</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>VLD</name>
								<description>Valid   VLD</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<dim>2</dim>
					<dimIncrement>32</dimIncrement>
					<name>DBAB[%s]</name>
					<description>DBAB</description>
					<addressOffset>16384</addressOffset>
					<register>
						<name>DBABRECORDx</name>
						<description>DBAB Record 0
 resetvalue={System Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ADDR</name>
								<description>Address   ADDR. Captured address of local PFLASH bank with detected error.</description>
								<lsb>5</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ECMK</name>
								<description>Erase Counter Marker   ECMK. The captured address is from the Flash or Erase Counter.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RES</name>
								<description>Reserved   RES. Always read as 0  should be written with 0.</description>
								<lsb>28</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>VLD</name>
								<description>Valid   VLD</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<dim>1</dim>
					<dimIncrement>4</dimIncrement>
					<name>MBAB[%s]</name>
					<description>MBAB</description>
					<addressOffset>32768</addressOffset>
					<register>
						<name>MBABRECORDx</name>
						<description>MBAB Record 0
 resetvalue={System Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ADDR</name>
								<description>Address   ADDR. Captured address of local PFLASH bank with detected error.</description>
								<lsb>5</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ECMK</name>
								<description>Erase Counter Marker   ECMK. The captured address is from the Flash or Erase Counter.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RES</name>
								<description>Reserved   RES. Always read as 0  should be written with 0.</description>
								<lsb>28</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>VLD</name>
								<description>Valid   VLD</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<dim>4</dim>
					<dimIncrement>32</dimIncrement>
					<name>ZBAB[%s]</name>
					<description>ZBAB</description>
					<addressOffset>49152</addressOffset>
					<register>
						<name>ZBABRECORDx</name>
						<description>ZBAB Record 0
 resetvalue={System Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ADDR</name>
								<description>Address   ADDR. Captured address of local PFLASH bank with detected error.</description>
								<lsb>5</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ECMK</name>
								<description>Erase Counter Marker   ECMK. The captured address is from the Flash or Erase Counter.</description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>RES</name>
								<description>Reserved   RES. Always read as 0  should be written with 0.</description>
								<lsb>28</lsb>
								<msb>30</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>VLD</name>
								<description>Valid   VLD</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
				</cluster>
				<register>
					<name>ECCR</name>
					<description>ECC Read Register
 resetvalue={System Reset:0x0}</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RCODE</name>
							<description>Error Correction Read Code   RCODE. ECC code  read from the Flash read buffer with last data read operation.</description>
							<lsb>0</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ECCS</name>
					<description>ECC Status Register
 resetvalue={System Reset:0x0}</description>
					<addressOffset>32</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ERR1</name>
							<description>Read Access Single Bit ECC Error   ERR1. The flag reports a single bit ECC failure during the last NVM read access.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ERR2</name>
							<description>Read Access Double Bit ECC Error   ERR2. The flag reports a double bit ECC failure during the last NVM read access.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ERRM</name>
							<description>Read Access Multi bit ECC Error   ERRM. The flag reports multi bit ECC failure during the last NVM read access.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ERRA</name>
							<description>Read Access ECC Error Within the Address   ERRA. The flag reports an address error during the last NVM read access.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ALL0</name>
							<description>Read Access All Zeros   ALL0. The flag reports the All Zeros condition during the last NVM read access.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ALL1</name>
							<description>All Ones   ALL1. The flag reports the All Ones condition during the last NVM read access.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ERRANY</name>
							<description>Any Read Access ECC Error   ERRANY. The flag reports any ECC failure during the last NVM read access.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AER1</name>
							<description>Accumulated Single Bit ECC Errors   AER1. The flag accumulates single bit failures during NVM read operations.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AER2</name>
							<description>Accumulated Double Bit ECC Errors   AER2. The flag accumulates double bit failures during NVM read operations.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AERM</name>
							<description>Accumulated Multi bit ECC Errors   AERM. The flag accumulates multi bit failures during NVM read accesses.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ARRA</name>
							<description>Accumulated ECC Error Within the Address   ARRA. The flag accumulates an address errors during NVM read accesses.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AAL0</name>
							<description>Accumulated All Zeros   AAL0. The flag accumulates the All Zeros condition during NVM read accesses.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AAL1</name>
							<description>Accumulated All Ones   AAL1. The flag accumulates the All Ones condition during NVM read accesses.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AERANY</name>
							<description>Accumulated Any Read Access ECC Error   AERANY. The status bit accumulates ECC failures during NVM read accesses.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
