J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>SPR_SPROT_RGNUAi</name>
						<description>CPUx Safety Protection SPR Region Upper Address Register 0
 resetvalue={Application Reset:0x0FFFFFFE0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>4294967264</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>ADDR</name>
								<description>Region Upper Address   ADDR. Bits 31 to 5 of the address which is the upper bound of the defined memory region</description>
								<lsb>5</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>SPR_SPROT_RGNACCENAi_W</name>
						<description>CPUx Safety Protection SPR Region Write Access Enable Register A0
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>4294967295</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>EN0</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN1</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN2</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN3</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN4</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN5</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN6</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN7</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN8</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN9</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN10</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN11</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN12</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN13</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN14</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN15</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN16</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN17</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN18</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN19</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN20</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN21</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN22</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN23</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN24</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN25</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN26</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN27</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN28</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN29</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN30</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN31</name>
								<description>Access Enable for Master TAG ID 31   EN31. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>SPR_SPROT_RGNACCENBi_W</name>
						<description>CPUx Safety Protection SPR Region Write Access Enable Register B0
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
						<addressOffset>12</addressOffset>
						<size>32</size>
						<resetValue>4294967295</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>EN32</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN33</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN34</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN35</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN36</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN37</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN38</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN39</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN40</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN41</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>9</lsb>
								<msb>9</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN42</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>10</lsb>
								<msb>10</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN43</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>11</lsb>
								<msb>11</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN44</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>12</lsb>
								<msb>12</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN45</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>13</lsb>
								<msb>13</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN46</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>14</lsb>
								<msb>14</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN47</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>15</lsb>
								<msb>15</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN48</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>16</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN49</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN50</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>18</lsb>
								<msb>18</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN51</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN52</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN53</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>21</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN54</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>22</lsb>
								<msb>22</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN55</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>23</lsb>
								<msb>23</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN56</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>24</lsb>
								<msb>24</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN57</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>25</lsb>
								<msb>25</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN58</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>26</lsb>
								<msb>26</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN59</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>27</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN60</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN61</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN62</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>30</lsb>
								<msb>30</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>EN63</name>
								<description>Access Enable for Master TAG ID 63   EN63. This bit enables write access to the module kernel addresses for        transactions with the Master TAG ID n </description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
				</cluster>
				<cluster>
					<dim>32</dim>
					<dimIncrement>12</dimIncrement>
					<name>BLK[%s]</name>
					<description>BLK</description>
					<addressOffset>64272</addressOffset>
					<register>
						<name>RABRi</name>
						<description>CPUx Redirected Address Base Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>0</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>OBASE</name>
								<description>Overlay Block Base Address   OBASE. Bits 21..5 of the base address the overlay memory block in the overlay memory. If the corresponding bit in OMASK register is set to one  OBASE bit value is used in the redirection address. If the corresponding bit in OMASK register is set to zero  OBASE bit value is ignored.</description>
								<lsb>5</lsb>
								<msb>21</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OMEM</name>
								<description>Overlay Memory Select   OMEM. Selects overlay memory used for redirection.</description>
								<lsb>24</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>OVEN</name>
								<description>Overlay Enabled   OVEN. This bit controls whether the overlay function of overlay block x is enabled. This bit can also be changed when OVCCON.OVSTP or OVCCON.OVSTRT is set. See OVCCON register description.</description>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
