J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
					<register>
						<name>OTARi</name>
						<description>CPUx Overlay Target Address Register 0
 resetvalue={Application Reset:0x0}</description>
						<addressOffset>4</addressOffset>
						<size>32</size>
						<resetValue>0</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>TBASE</name>
								<description>Target Base   TBASE. This field holds the base address of the overlay memory block in the target memory. If the corresponding bit in OMASK register is set to one TBASE bit value is used in the address match. If the corresponding bit in OMASK register is set to zero TBASE bit value is ignored.</description>
								<lsb>5</lsb>
								<msb>27</msb>
								<access>read-write</access>
							</field>
						</fields>
					</register>
					<register>
						<name>OMASKi</name>
						<description>CPUx Overlay Mask Register 0
 resetvalue={Application Reset:0x0FFFFFE0}</description>
						<addressOffset>8</addressOffset>
						<size>32</size>
						<resetValue>268435424</resetValue>
						<resetMask>4294967295</resetMask>
						<fields>
							<field>
								<name>OMASK</name>
								<description>Overlay Address Mask   OMASK. This bitfield determines the overlay block size and the bits used for address comparison and translation.  ...   Zero  bits determine the corresponding address bits which are not used in the address comparison and thus determine the block size  corresponding final address bits are derived from the original data address.  One  bits determine the corresponding address bits which are used for the address comparison  corresponding final address bits are derived from RABRx register in case of address match.</description>
								<lsb>5</lsb>
								<msb>16</msb>
								<access>read-write</access>
							</field>
							<field>
								<name>ONE</name>
								<description>Fixed  1  Values   ONE. Corresponding address bits are participating in the address comparison. Corresponding final address bits are taken from RABRx.</description>
								<lsb>17</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
				</cluster>
				<register>
					<name>SMACON</name>
					<description>CPUx SIST Mode Access Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>102412</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>IODT</name>
							<description>In Order Data Transactions   IODT</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIEAR</name>
					<description>CPUx Data Integrity Error Address Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>102432</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TA</name>
							<description>Transaction Address   TA. Physical address being accessed by operation that encountered data integrity error.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIETR</name>
					<description>CPUx Data Integrity Error Trap Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>102436</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>IED</name>
							<description>Integrity Error Detected   IED</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IE_T</name>
							<description>Integrity Error   Tag Memory   IE T</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IE_C</name>
							<description>Integrity Error   Cache Memory   IE C</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IE_S</name>
							<description>Integrity Error   Scratchpad Memory   IE S</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IE_BI</name>
							<description>Integrity Error   Bus Interface   IE BI</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>E_INFO</name>
							<description>Error Information   E INFO. If IE BS   1  Bus Master Tag ID of requesting masterIf IE C   1  Cache way.</description>
							<lsb>5</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IE_UNC</name>
							<description>Dual Bit Error Detected   IE UNC</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IE_SP</name>
							<description>Safety Protection Error Detected   IE SP</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IE_BS</name>
							<description>Bus Slave Access Indicator   IE BS</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IE_DLMU</name>
							<description>Integrity Error   DLMU   IE DLMU</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IE_LPB</name>
							<description>Integrity Error   Local Pflash Bank   IE LPB</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IE_MTMV</name>
							<description>Memory Test Mode Violation detected   IE MTMV</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PIEAR</name>
					<description>CPUx Program Integrity Error Address Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>102928</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>TA</name>
							<description>Transaction Address   TA. Physical address being accessed by operation that encountered program integrity error.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PIETR</name>
					<description>CPUx Program Integrity Error Trap Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>102932</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>IED</name>
							<description>Integrity Error Detected   IED</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IE_T</name>
							<description>Integrity Error   TAG Memory   IE T</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IE_C</name>
							<description>Integrity Error   Cache Memory   IE C</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IE_S</name>
							<description>Integrity Error   Scratchpad Memory   IE S</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IE_BI</name>
							<description>Integrity Error   Bus Interface   IE BI</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>E_INFO</name>
							<description>Error Information   E INFO. If IE BS  1  Bus Master Tag ID of requesting masterIf IE C   1  Cache way.</description>
							<lsb>5</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IE_UNC</name>
							<description>Integrity Error   Uncorrectable Error Detected   IE UNC</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IE_SP</name>
							<description>Safety Protection Error Detected   IE SP</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IE_BS</name>
							<description>Bus Slave Access Indicator   IE BS</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IE_ADDR</name>
							<description>Address Phase error detected at SRI slave interface   IE ADDR</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IE_LPB</name>
							<description>Integrity Error   Local Pflash bank   IE LPB</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>IE_MTMV</name>
							<description>Memory Test Mode Violation detected   IE MTMV</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TASK_ASI</name>
					<description>CPUx Task Address Space Identifier Register
 resetvalue={Application Reset:0x1F}</description>
					<addressOffset>98308</addressOffset>
					<size>32</size>
					<resetValue>31</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ASI</name>
							<description>Address Space Identifier   ASI. The ASI register contains the Address Space Identifier of the current process.</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMA0</name>
					<description>CPUx Data Access CacheabilityRegister
 resetvalue={Application Reset:0x300}</description>
					<addressOffset>98560</addressOffset>
					<size>32</size>
					<resetValue>768</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DAC</name>
							<description>Data Access Cacheability Segments FHto 0H   DAC.  Note   segments F H  E H  D H and A H are constrained to be        non cacheable </description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMA1</name>
					<description>CPUx Code Access CacheabilityRegister
 resetvalue={Application Reset:0x300}</description>
					<addressOffset>98564</addressOffset>
					<size>32</size>
					<resetValue>768</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CAC</name>
							<description>Code Access Cacheability Segments FH 0H   CAC.  Note  Segments F H  E H  C H  A H are constrained to be non cacheable </description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMA2</name>
					<description>CPUx  Peripheral Space Identifier register
 resetvalue={Application Reset:0x0C000}</description>
					<addressOffset>98568</addressOffset>
					<size>32</size>
					<resetValue>49152</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PSI</name>
							<description>Peripheral Space Identifier Segments FH 0H   PSI</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>COMPAT</name>
					<description>CPUx Compatibility Control Register
 resetvalue={Application Reset:0x0FFFFFFFF}</description>
					<addressOffset>103424</addressOffset>
					<size>32</size>
					<resetValue>4294967295</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RM</name>
							<description>Rounding Mode Compatibility   RM</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SP</name>
							<description>SYSCON Safety Protection Mode Compatibility   SP</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PCXI</name>
					<description>CPUx Previous Context Information Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>130560</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PCXO</name>
							<description>Previous Context Pointer Offset Field   PCXO. The PCXO and PCXS fields form the pointer PCX  which points to the CSA of the previous context.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PCXS</name>
							<description>Previous Context Pointer Segment Address   PCXS. Contains the segment address portion of the PCX. This field is used in conjunction with the PCXO field.</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UL</name>
							<description>Upper or Lower Context Tag   UL. Identifies the type of context saved. If the type does not match the type expected when a context restore operation is performed  a trap is generated.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PIE</name>
							<description>Previous Interrupt Enable   PIE. Indicates the state of the interrupt enable bit  ICR.IE  for the interrupted task.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PCPN</name>
							<description>Previous CPU Priority Number   PCPN. Contains the priority level number of the interrupted task.</description>
							<lsb>22</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSW</name>
					<description>CPUx Program Status Word
 resetvalue={Application Reset:0x0B80}</description>
					<addressOffset>130564</addressOffset>
					<size>32</size>
					<resetValue>2944</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CDC</name>
							<description>Call Depth Counter   CDC. Consists of two variable width subfields. The first subfield consists of a string of zero or more initial 1 bits  terminated by the first 0 bit. The remaining bits form the second subfield  CDC.COUNT  which constitutes the Call Depth Count value. The count value is incremented on each Call and is decremented on a Return. 0cccccc B   6 bit counter  trap on overflow. 10ccccc B   5 bit counter  trap on overflow. 110cccc B   4 bit counter  trap on overflow. 1110ccc B   3 bit counter  trap on overflow. 11110cc B   2 bit counter  trap on overflow. 111110c B   1 bit counter  trap on overflow. 1111110 B   Trap every call  Call Trace mode . 1111111 B   Disable Call Depth Counting. When the call depth count  CDC.COUNT  overflows a trap  CDO  is generated. Setting the CDC to 1111110 B allows no bits for the counter and causes every call to be trapped. This is used for Call Depth Tracing. Setting the CDC to 1111111 B disables Call Depth Counting.</description>
							<lsb>0</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CDE</name>
							<description>Call Depth Count Enable   CDE. Enables call depth counting  provided that the PSW.CDC mask field is not all set to 1. If PSW.CDC   1111111 B   call depth counting is disabled regardless of the setting on the PSW.CDE bit.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GW</name>
							<description>Global Address Register Write Permission   GW. Determines whether the current execution thread has permission to modify the global address registers.Most tasks and ISRs use the global address registers as  read only  registers  pointing to the global literal pool and key data structures. However a task or ISR can be designated as the  owner  of a particular global address register  and is allowed to modify it. The system designer must determine which global address variables are used with sufficient frequency and or in sufficiently time critical code to justify allocation to a global address register. By compiler convention  global address register A 0  is reserved as the base register for short form loads and stores. Register A 1  is also reserved for compiler use.Registers A 8  and A 9  are not used by the compiler  and are available for holding critical system address variables.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IS</name>
							<description>Interrupt Stack Control   IS. Determines if the current execution thread is using the shared global  interrupt  stack or a user stack.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IO</name>
							<description>Access Privilege Level Control  I O Privilege    IO. Determines the access level to special function registers and peripheral devices.</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRS</name>
							<description>Protection Register Set   PRS. Selects the active Data and Code Memory Protection Register Set. The memory protection register values control load  store and instruction fetches within the current process. PRS values 111 and 110 are reserved</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>S</name>
							<description>Safe Task Identifier   S</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRS2</name>
							<description>Protection Register Set MSB   PRS2. Selects the active Data and Code Memory Protection Register Set. The memory protection register values control load  store and instruction fetches within the current process. PRS values 111 and 110 are reserved</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>USB</name>
							<description>User Status Bits   USB. The eight most significant bits of the PSW are designated as User Status Bits. These bits may be set or cleared as side effects of instruction execution. Refer to the TriCore Architecture manual for details.</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PC</name>
					<description>CPUx Program Counter
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>130568</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>PC</name>
							<description>Program Counter   PC</description>
							<lsb>1</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSCON</name>
					<description>CPUx System Configuration Register
 resetvalue={Application Reset:0x0,Application Reset:0x0}</description>
					<addressOffset>130580</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>FCDSF</name>
							<description>Free Context List Depleted Sticky Flag   FCDSF. This sticky bit indicates that a FCD  Free Context List Depleted  trap occurred since the bit was last cleared by software.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PROTEN</name>
							<description>Memory Protection Enable   PROTEN. Enables the memory protection system. Memory protection is controlled through the memory protection register        sets. Note  Initialize the protection register sets prior to setting        PROTEN to one.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TPROTEN</name>
							<description>Temporal Protection Enable   TPROTEN. Enable the Temporal Protection system.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IS</name>
							<description>Initial State Interrupt   IS. of PSW.S bit in interrupt handle</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TS</name>
							<description>Initial State Trap   TS. of PSW.S bit in trap handle</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ESDIS</name>
							<description>Emulator Space Disable. Disable the Emulator Space system</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>U1_IED</name>
							<description>User 1 Instruction execution disable   U1 IED. Disable the execution of User 1 mode instructions in User 1 IO mode. Disables User 1 ability to enable and  disable interrupts.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>U1_IOS</name>
							<description>User 1 Peripheral access as supervisor   U1 IOS. Allow User 1 mode tasks to access peripherals as if in Supervisor mode. Enables User 1 access to all  peripheral registers.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BHALT</name>
							<description>Boot Halt   BHALT</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CPU_ID</name>
					<description>CPUx Identification Register TC1.6.2P
 resetvalue={Application Reset:0x0C0C021}</description>
					<addressOffset>130584</addressOffset>
					<size>32</size>
					<resetValue>12632097</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Revision Number   MOD REV</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_32B</name>
							<description>32 Bit Module Enable   MOD 32B</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD</name>
							<description>Module Identification Number   MOD</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
