J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>CORE_ID</name>
					<description>CPUx Core Identification Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>130588</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967288</resetMask>
					<fields>
						<field>
							<name>CORE_ID</name>
							<description>Core Identification Number   CORE ID. The identification number of the core.</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BIV</name>
					<description>CPUx Base Interrupt Vector Table Pointer
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>130592</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>VSS</name>
							<description>Vector Spacing Select   VSS. 0  32 byte vector spacing. 1  8 Byte vector spacing.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BIV</name>
							<description>Base Address of Interrupt Vector Table   BIV. The address in the BIV register must be aligned to an even byte address  halfword address . Because of the simple ORing of the left shifted priority number and the contents of the BIV register  the alignment of the base address of the vector table must be to a power of two boundary  dependent on the number of interrupt entries used. For the full range of 256 interrupt entries an alignment to an 8 KByte boundary is required. If fewer sources are used  the alignment requirements are correspondingly relaxed.</description>
							<lsb>1</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BTV</name>
					<description>CPUx Base Trap Vector Table Pointer
 resetvalue={Application Reset:0x0A0000100}</description>
					<addressOffset>130596</addressOffset>
					<size>32</size>
					<resetValue>2684354816</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>BTV</name>
							<description>Base Address of Trap Vector Table   BTV. The address in the BTV register must be aligned to an even byte address  halfword address . Also  due to the simple ORing of the left shifted trap identification number and the contents of the BTV register  the alignment of the base address of the vector table must be to a power of two boundary. There are eight different trap classes  resulting in Trap Classes from 0 to 7. The contents of BTV should therefore be set to at least a 256 byte boundary  8 Trap Classes   8 word spacing .</description>
							<lsb>1</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ISP</name>
					<description>CPUx Interrupt Stack Pointer
 resetvalue={Application Reset:0x100}</description>
					<addressOffset>130600</addressOffset>
					<size>32</size>
					<resetValue>256</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ISP</name>
							<description>Interrupt Stack Pointer   ISP</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ICR</name>
					<description>CPUx Interrupt Control Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>130604</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CCPN</name>
							<description>Current CPU Priority Number   CCPN. The Current CPU Priority Number  CCPN  bit field indicates the current priority level of the CPU. It is automatically updated by hardware on entry or exit of Interrupt Service Routines  ISRs  and through the execution of a BISR instruction. CCPN can also be updated through an MTCR instruction.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IE</name>
							<description>Global Interrupt Enable Bit   IE. The interrupt enable bit globally enables the CPU service request system. Whether a service request is delivered to the CPU depends on the individual Service Request Enable Bits  SRE  in the SRNs  and the current state of the CPU. ICR.IE is automatically updated by hardware on entry and exit of an Interrupt Service Routine  ISR . ICR.IE is cleared to 0 when an interrupt is taken  and is restored to the previous value when the ISR executes an RFE instruction to terminate itself. ICR.IE can also be updated through the execution of the ENABLE  DISABLE  MTCR  and BISR instructions.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PIPN</name>
							<description>Pending Interrupt Priority Number   PIPN. A read only bit field that is updated by the ICU at the end of each interrupt arbitration process. It indicates the priority number of the pending service request. ICR.PIPN is set to 0 when no request is pending  and at the beginning of each new arbitration process. ...</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FCX</name>
					<description>CPUx Free CSA List Head Pointer
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>130616</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FCXO</name>
							<description>FCX Offset Address Field   FCXO. The FCXO and FCXS fields together form the FCX pointer  which points to the next available CSA.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FCXS</name>
							<description>FCX Segment Address Field   FCXS. Used in conjunction with the FCXO field.</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LCX</name>
					<description>CPUx Free CSA List Limit Pointer
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>130620</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>LCXO</name>
							<description>LCX Offset Field   LCXO. The LCXO and LCXS fields form the pointer LCX  which points to the last available CSA.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LCXS</name>
							<description>LCX Segment Address   LCXS. This field is used in conjunction with the LCXO field.</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CUS_ID</name>
					<description>CPUx Customer ID register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>130640</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967288</resetMask>
					<fields>
						<field>
							<name>CID</name>
							<description>Customer ID   CID. See CROSSREFERENCE for the relation between CUS ID and CORE ID for each derivative</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>16</dim>
					<dimIncrement>4</dimIncrement>
					<name>Dy[%s]</name>
					<description>CPUx Data General Purpose Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>130816</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description>Data Register   DATA. General purpose registers</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>16</dim>
					<dimIncrement>4</dimIncrement>
					<name>Ay[%s]</name>
					<description>CPUx Address General Purpose Register 0
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>130944</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address Register   ADDR. General purpose registers</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CPXE_0</name>
					<description>CPUx Code Protection Execute Enable Register Set 3
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>122880</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>XE_n</name>
							<description>Execute Enable Range select   XE n </description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CPXE_1</name>
					<description>CPUx Code Protection Execute Enable Register Set 3
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>122884</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>XE_n</name>
							<description>Execute Enable Range select   XE n </description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CPXE_2</name>
					<description>CPUx Code Protection Execute Enable Register Set 3
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>122888</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>XE_n</name>
							<description>Execute Enable Range select   XE n </description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CPXE_3</name>
					<description>CPUx Code Protection Execute Enable Register Set 3
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>122892</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>XE_n</name>
							<description>Execute Enable Range select   XE n </description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DPRE_0</name>
					<description>CPUx Data Protection Read Enable Register Set 3
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>122896</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RE_n</name>
							<description>Read Enable Range Select   RE n </description>
							<lsb>0</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DPRE_1</name>
					<description>CPUx Data Protection Read Enable Register Set 3
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>122900</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RE_n</name>
							<description>Read Enable Range Select   RE n </description>
							<lsb>0</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DPRE_2</name>
					<description>CPUx Data Protection Read Enable Register Set 3
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>122904</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RE_n</name>
							<description>Read Enable Range Select   RE n </description>
							<lsb>0</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DPRE_3</name>
					<description>CPUx Data Protection Read Enable Register Set 3
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>122908</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RE_n</name>
							<description>Read Enable Range Select   RE n </description>
							<lsb>0</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DPWE_0</name>
					<description>CPUx Data Protection Write Enable Register Set 3
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>122912</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>WE_n</name>
							<description>Write Enable Range Select   WE n </description>
							<lsb>0</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DPWE_1</name>
					<description>CPUx Data Protection Write Enable Register Set 3
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>122916</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>WE_n</name>
							<description>Write Enable Range Select   WE n </description>
							<lsb>0</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DPWE_2</name>
					<description>CPUx Data Protection Write Enable Register Set 3
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>122920</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>WE_n</name>
							<description>Write Enable Range Select   WE n </description>
							<lsb>0</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DPWE_3</name>
					<description>CPUx Data Protection Write Enable Register Set 3
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>122924</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>WE_n</name>
							<description>Write Enable Range Select   WE n </description>
							<lsb>0</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CPXE_4</name>
					<description>CPUx Code Protection Execute Enable Register Set 5
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>122944</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>XE_n</name>
							<description>Execute Enable Range select   XE n </description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CPXE_5</name>
					<description>CPUx Code Protection Execute Enable Register Set 5
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>122948</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>XE_n</name>
							<description>Execute Enable Range select   XE n </description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DPRE_4</name>
					<description>CPUx Data Protection Read Enable Register Set 5
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>122960</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RE_n</name>
							<description>Read Enable Range Select   RE n </description>
							<lsb>0</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DPRE_5</name>
					<description>CPUx Data Protection Read Enable Register Set 5
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>122964</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>RE_n</name>
							<description>Read Enable Range Select   RE n </description>
							<lsb>0</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DPWE_4</name>
					<description>CPUx Data Protection Write Enable Register Set 5
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>122976</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>WE_n</name>
							<description>Write Enable Range Select   WE n </description>
							<lsb>0</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DPWE_5</name>
					<description>CPUx Data Protection Write Enable Register Set 5
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>122980</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>WE_n</name>
							<description>Write Enable Range Select   WE n </description>
							<lsb>0</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCTRL</name>
					<description>CPUx Counter Control
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>130048</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CM</name>
							<description>Counter Mode   CM</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CE</name>
							<description>Count Enable   CE</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M1</name>
							<description>M1CNT Configuration   M1</description>
							<lsb>2</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M2</name>
							<description>M2CNT Configuration   M2</description>
							<lsb>5</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>M3</name>
							<description>M3CNT Configuration   M3</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCNT</name>
					<description>CPUx CPU Clock Cycle Count
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>130052</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CountValue</name>
							<description>Count Value   CountValue. Current Count of the CPU Clock Cycles.</description>
							<lsb>0</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SOvf</name>
							<description>Sticky Overflow Bit   SOvf. This bit is set by hardware when count value  30 0    31 h7FFF FFFF. It can only be cleared by software.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ICNT</name>
					<description>CPUx Instruction Count
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>130056</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CountValue</name>
							<description>Count Value   CountValue. Count of the Instructions Executed.</description>
							<lsb>0</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SOvf</name>
							<description>Sticky Overflow Bit   SOvf. This bit is set by hardware when count value  30 0    31 h7FFF FFFF. It can only be cleared by software.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>M1CNT</name>
					<description>CPUx Multi Count Register 1
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>130060</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CountValue</name>
							<description>Count Value   CountValue. Count of the Selected Event.</description>
							<lsb>0</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SOvf</name>
							<description>Sticky Overflow Bit   SOvf. This bit is set by hardware when count value  30 0    31 h7FFF FFFF. It can only be cleared by software.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>M2CNT</name>
					<description>CPUx Multi Count Register 2
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>130064</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CountValue</name>
							<description>Count Value   CountValue. Count of the Selected Event.</description>
							<lsb>0</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SOvf</name>
							<description>Sticky Overflow Bit   SOvf. This bit is set by hardware when count value  30 0    31 h7FFF FFFF. It can only be cleared by software.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>M3CNT</name>
					<description>CPUx Multi Count Register 3
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>130068</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>CountValue</name>
							<description>Count Value   CountValue. Count of the Selected Event.</description>
							<lsb>0</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SOvf</name>
							<description>Sticky Overflow Bit   SOvf. This bit is set by hardware when count value  30 0    31 h7FFF FFFF. It can only be cleared by software.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
