J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
				<register>
					<name>DBGSR</name>
					<description>CPUx Debug Status Register
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>130304</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DE</name>
							<description>Debug Enable   DE. Determines whether the CDC is enabled or not.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HALT</name>
							<description>CPU Halt Request   Status Field   HALT. HALT can be set or cleared by software. HALT 0  is the actual Halt bit. HALT 1  is a mask bit to specify whether or not HALT 0  is to be updated on a software write. HALT 1  is always read as 0. HALT 1  must be set to 1 in order to update HALT 0  by software  R  read  W  write .</description>
							<lsb>1</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SIH</name>
							<description>Suspend in Halt   SIH. State of the Suspend In signal.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SUSP</name>
							<description>Current State of the Core Suspend Out Signal   SUSP</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PREVSUSP</name>
							<description>Previous State of Core Suspend Out Signal   PREVSUSP. Updated when a Debug Event causes a hardware update of DBGSR.SUSP. This field is not updated for writes to DBGSR.SUSP.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PEVT</name>
							<description>Posted Event   PEVT</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EVTSRC</name>
							<description>Event Source   EVTSRC. ... Other   Reserved.</description>
							<lsb>8</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EXEVT</name>
					<description>CPUx External Event Register
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>130312</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EVTA</name>
							<description>Event Associated   EVTA. Specifies the Debug Action associated with the Debug Event </description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BBM</name>
							<description>Break Before Make  BBM  or Break After Make  BAM  Selection   BBM</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BOD</name>
							<description>Breakout Disable   BOD</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SUSP</name>
							<description>CDC Suspend Out Signal State   SUSP. Value to be assigned to the CDC suspend out signal when the Debug Event is raised.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CNT</name>
							<description>Counter   CNT. When this event occurs adjust the control of the performance counters in task mode as follows </description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CREVT</name>
					<description>CPUx Core Register Access Event
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>130316</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EVTA</name>
							<description>Event Associated   EVTA. Debug Action associated with the Debug Event </description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BBM</name>
							<description>Break Before Make  BBM  or Break After Make  BAM  Selection   BBM</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BOD</name>
							<description>Breakout Disable   BOD</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SUSP</name>
							<description>CDC Suspend Out Signal State   SUSP. Value to be assigned to the CDC suspend out signal when the Debug Event is raised.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CNT</name>
							<description>Counter   CNT. When this event occurs adjust the control of the performance counters in task mode as follows </description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWEVT</name>
					<description>CPUx Software Debug Event
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>130320</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>EVTA</name>
							<description>Event Associated   EVTA. Debug Action associated with the Debug Event </description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BBM</name>
							<description>Break Before Make  BBM  or Break After Make  BAM  Selection   BBM</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BOD</name>
							<description>Breakout Disable   BOD</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SUSP</name>
							<description>CDC Suspend Out Signal State   SUSP. Value to be assigned to the CDC suspend out signal when the event is raised.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CNT</name>
							<description>Counter   CNT. When this event occurs adjust the control of the performance counters in task mode as follows </description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRIG_ACC</name>
					<description>CPUx TriggerAddressx
 resetvalue={Debug Reset:0x0}</description>
					<addressOffset>130352</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>T0</name>
							<description>Trigger 0   T0. active since last cleared</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>T1</name>
							<description>Trigger 1   T1. active since last cleared</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>T2</name>
							<description>Trigger 2   T2. active since last cleared</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>T3</name>
							<description>Trigger 3   T3. active since last cleared</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>T4</name>
							<description>Trigger 4   T4. active since last cleared</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>T5</name>
							<description>Trigger 5   T5. active since last cleared</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>T6</name>
							<description>Trigger 6   T6. active since last cleared</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>T7</name>
							<description>Trigger 7   T7. active since last cleared</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMS</name>
					<description>CPUx Debug Monitor Start Address
 resetvalue={Debug Reset:0x0A0000A00}</description>
					<addressOffset>130368</addressOffset>
					<size>32</size>
					<resetValue>2684357120</resetValue>
					<resetMask>4294966847</resetMask>
					<fields>
						<field>
							<name>DMSValue</name>
							<description>Debug Monitor Start Address   DMSValue. The address at which monitor code execution begins when a breakpoint trap is taken.</description>
							<lsb>1</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DCX</name>
					<description>CPUx Debug Context Save Area Pointer
 resetvalue={Debug Reset:0x0A0000200}</description>
					<addressOffset>130372</addressOffset>
					<size>32</size>
					<resetValue>2684355072</resetValue>
					<resetMask>4294966847</resetMask>
					<fields>
						<field>
							<name>DCXValue</name>
							<description>Debug Context Save Area Pointer   DCXValue. Address where the debug context is stored following a breakpoint trap.</description>
							<lsb>6</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DBGTCR</name>
					<description>CPUx Debug Trap Control Register
 resetvalue={Application Reset:0x1}</description>
					<addressOffset>130376</addressOffset>
					<size>32</size>
					<resetValue>1</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DTA</name>
							<description>Debug Trap Active Bit   DTA. A breakpoint trap may only be taken in the condition DTA    0. Taking a breakpoint trap sets the DTA bit to one. Further breakpoint traps are therefore disabled until such time as the breakpoint trap handler clears the DTA bit or until the breakpoint trap handler terminates with a RFM.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SEGEN</name>
					<description>CPUx SRI Error Generation Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>69680</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ADFLIP</name>
							<description>Address ECC Bit Flip   ADFLIP. SRI address ECC Bits to be flipped on the next read or write transaction from the DMI when enabled by AE.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ADTYPE</name>
							<description>Type of error   ADTYPE</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE</name>
							<description>Activate Error Enable   AE. Enabled the selective inverting of SRI ECC packet bits defined by ADFLIP. This bit will be cleared by hardware after the next SRI read or write transaction from the DMI.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DCON2</name>
					<description>CPUx Data Control Register 2
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>102400</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>DCACHE_SZE</name>
							<description>Data Cache Size   DCACHE SZE. In KBytes</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DSCRATCH_SZE</name>
							<description>Data Scratch Size   DSCRATCH SZE. In KBytes</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DSTR</name>
					<description>CPUx Data Synchronous Trap Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>102416</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SRE</name>
							<description>Scratch Range Error   SRE. A scratch Range Error occurs whenever an access to the data scratch is outside the range of the SRAM.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GAE</name>
							<description>Global Address Error   GAE. Load or store to local code scratch address outside of the lower 1MByte.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LBE</name>
							<description>Load Bus Error   LBE. A Load Bus Error will be set whenever the SRI flags an error due a load from external memory.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DRE</name>
							<description>Local DLMU Range Error   DRE. A DLMU Range Error occurs whenever an access to the local DLMU region is outside the physically implemented memory.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CRE</name>
							<description>Cache Refill Error   CRE. A Cache Refill Error will be set whenever the SRI flags an error due a cache refill from external memory.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DTME</name>
							<description>DTAG MSIST Error   DTME. Access to memory mapped DTAG range outside of physically implemented memory.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LOE</name>
							<description>Load Overlay Error   LOE. Load to invalid overlay address.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SDE</name>
							<description>Segment Difference Error   SDE. Load or store access where base address is in different segment to access address.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SCE</name>
							<description>Segment Crossing Error   SCE. Load or store access across segment boundary.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CAC</name>
							<description>CSFR Access Error   CAC. Load or store to local CSFR space.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MPE</name>
							<description>Memory Protection Error   MPE. Data access violating memory protection.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLE</name>
							<description>Context Location Error   CLE. Context operation to invalid location.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ALN</name>
							<description>Alignment Error   ALN. Data access causing alignment error.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DATR</name>
					<description>CPUx Data Asynchronous Trap Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>102424</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>SBE</name>
							<description>Store Bus Error   SBE</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CWE</name>
							<description>Cache Writeback Error   CWE</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CFE</name>
							<description>Cache Flush Error   CFE</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SOE</name>
							<description>Store Overlay Error   SOE</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DEADD</name>
					<description>CPUx Data Error Address Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>102428</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>ERROR_ADDRESS</name>
							<description>Error Address   ERROR ADDRESS</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DCON0</name>
					<description>CPUx Data Memory Control Register
 resetvalue={Application Reset:0x2}</description>
					<addressOffset>102464</addressOffset>
					<size>32</size>
					<resetValue>2</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>DCBYP</name>
							<description>Data Cache Bypass   DCBYP</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSTR</name>
					<description>CPUx Program Synchronous Trap Register
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>102912</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>FRE</name>
							<description>Fetch Range Error   FRE. A Fetch Range Error occurs whenever an access to the Program Scratch is outside the range of the SRAM.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FBE</name>
							<description>Fetch Bus Error   FBE. A Fetch bus error will be set whenever the SRI flags an error due a fetch from external memory. This will be set for both direct fetches from the bus and for cache refills.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FPE</name>
							<description>Fetch Peripheral Error   FPE. A Fetch peripheral error will be flagged whenever a fetch is attempted to peripheral space.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FME</name>
							<description>Fetch MSIST Error   FME. During SIST mode  a fetch from the PTAG will cause a PSE trap to occur.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PCON1</name>
					<description>CPUx Program Control 1
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>102916</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PCINV</name>
							<description>Program Cache Invalidate   PCINV</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PBINV</name>
							<description>Program Buffer Invalidate   PBINV. Write Operation  This field returns 0 when read.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PCON2</name>
					<description>CPUx Program Control 2
 resetvalue={Application Reset:0x0}</description>
					<addressOffset>102920</addressOffset>
					<size>32</size>
					<resetValue>0</resetValue>
					<resetMask>0</resetMask>
					<fields>
						<field>
							<name>PCACHE_SZE</name>
							<description>Program Cache Size  ICACHE  in KBytes   PCACHE SZE. In KBytes</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PSCRATCH_SZE</name>
							<description>Program Scratch Size in KBytes   PSCRATCH SZE. In KBytes</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PCON0</name>
					<description>CPUx Program Control 0
 resetvalue={Application Reset:0x2}</description>
					<addressOffset>102924</addressOffset>
					<size>32</size>
					<resetValue>2</resetValue>
					<resetMask>4294967295</resetMask>
					<fields>
						<field>
							<name>PCBYP</name>
							<description>Program Cache Bypass   PCBYP</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
