J3FF-J4N/tc375-freertos/tc37x-pac_official/TC37XPD.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>FSI</name>
			<version>100</version>
			<description>FSI</description>
			<baseAddress>4160946176</baseAddress>
			<addressBlock>
				<offset>4</offset>
				<size>4</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>COMM_1</name>
					<description>Communication Register 1
 resetvalue={System Reset:0x0}</description>
					<addressOffset>4</addressOffset>
					<size>8</size>
					<resetValue>0</resetValue>
					<resetMask>255</resetMask>
					<fields>
						<field>
							<name>COMM1</name>
							<description>FSI Communication 1   COMM1. This register can be written by FSI and DMU and is used to give        status handshake information between FSI and DMU.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>COMM_2</name>
					<description>Communication Register 2
 resetvalue={System Reset:0x0}</description>
					<addressOffset>5</addressOffset>
					<size>8</size>
					<resetValue>0</resetValue>
					<resetMask>255</resetMask>
					<fields>
						<field>
							<name>COMM2</name>
							<description>FSI Communication 2   COMM2. This register can be written by FSI and DMU and is used to give status handshake information between FSI and DMU.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HSMCOMM_1</name>
					<description>HSM Communication Register 1
 resetvalue={System Reset:0x0}</description>
					<addressOffset>6</addressOffset>
					<size>8</size>
					<resetValue>0</resetValue>
					<resetMask>255</resetMask>
					<fields>
						<field>
							<name>HSMCOMM1</name>
							<description>HSM FSI Communication 1   HSMCOMM1. This register can be written by FSI and DMU and is used to give status handshake information between FSI and DMU.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HSMCOMM_2</name>
					<description>HSM Communication Register 2
 resetvalue={System Reset:0x0}</description>
					<addressOffset>7</addressOffset>
					<size>8</size>
					<resetValue>0</resetValue>
					<resetMask>255</resetMask>
					<fields>
						<field>
							<name>HSMCOMM2</name>
							<description>HSM FSI Communication 2   HSMCOMM2. This register can be written by FSI and DMU and is used to give status handshake information between FSI and DMU.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
	</peripherals>
</device>